{
  "id": "15e3e61d301c",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 98,
  "content": "has made a decision that the utility value of the money she will receive exceeds the value she would get from continuing to own the asset, so each participant has made an assessment of value that might be unique to his or her particular situation at that point in time. Rather than an agreement, each and every trade that oc- curs in the market represents a disagreement over the value of the money and the assets being exchanged. 399 149 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp01 JWBT634-Grimes May 11, 2012 8:31 Printer: Hamilton Printing 400 APPENDIX A: TRADING PRIMER THE SPREAD We often hear language like “The stock of company XYZ is at $50,” but even here we have an issue, for there is rarely only one price to consider; usually there are at least three. In active, liquid markets, there is a bid price at which buyers are willing to buy an asset, an offer (or ask, from asking price ) at which sellers are offering to sell, and usually a last print (or simply, last) price where a trade was made. In a typical market, bids will be lined up below the market (more buyers are willing to buy at lower prices), and offers will be stacked at higher prices. The inside market refers to the highest bid price and the lowest offer, representing the best available price at any time, and the distance between those two prices is often referred to as the spread. In the hypothetical case of XYZ that just traded at $50, we might ﬁnd that the best available bid is $49.95 and the lowest offered price is $50.05. A trader would verbalize this situation as “49.95 bid, offered at 50.05,” which is usually shortened in practice to “49.95 at 50.05.” If the trader is reasonably sure the person he is speaking to knows the approximate price, he may drop the handle (the whole number) part of the price and just give the decimal pricing. As prices change rapidly, this can lead to a dialogue like “95 at 05 [meaning .95 and .05], at 7, at 9, 98 bid, now at 06.” Though the last trade may have been at $50, there is a reasonable chance that we could not execute at that price in this situation with the market “95 at 05.” In fact, it is even possible that the last print was 50.00, and now the market may have moved to 50.50 at 50.60. A buyer, in this case, has little hope of executing at any price under 50.50; the spread is often a better reﬂection of actual value than the last print. Some traders glean a lot of information from the spread. For instance, the size of the spread is often a measure of the uncertainty in the market; when prices are changing rapidly, market participants often react by widening the spread. Buyers are not aggres- sive in paying high prices because they know the market could move against them in the next instant, so bids tend to drop lower. At the same time, sellers also react by lift- ing their offers to higher prices. There is other information in the spread: how rapidly it moves, exactly how it moves (do sellers lift offers higher or do buyers aggressively bid higher?), how much size is displayed, and many other subtleties. If this seems like a lot of time spent on something very basic, you’re right; it is, and it is also very important. The spread represents a very real cost of trading. Imagine that a buyer pays the offer, and then immediately realizes he has made a mistake and wants to get out of the trade. This can be done only by turning around and selling to the buyers on the bid, so the spread is a source of risk and a cost of trading in every transaction. It is also usually the best estimation of the actual market value of an asset. In the case of a very active stock that prints a trade every few seconds, the inside market is rarely very far from the last print, so the last trade is a very good approximation of value. (This kind of stock will usually tend to have a relatively tight spread as well.) However, there are some instruments that may go days without trading (some stocks, options, distant months of futures contracts, for instance). In these cases, the last 150 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp01 JWBT634-Grimes May 11, 2012 8:31 Printer: Hamilton Printing Appendix A: Trading Primer 401 price may be completely irrelevant because it happened so long ago that the market has moved. To further complicate matters, very inactive, illiquid instruments will often have extremely wide spreads. If stock XYZ last printed 50.00 three weeks ago, but is now bid at 30.00 and offered at 49.00, what is it actually worth? Researchers studying price patterns need to be careful because printed price records in illiquid markets can be very mislead- ing. As an interesting aside, a major factor in the 2007–2008 ﬁnancial crisis was the impor- tance of many ﬁnancial instruments representing very signiﬁcant ﬁnancial commitments that did not have liquid markets. Spreads were wide, or in some cases, nonexistent, so it was impossible to derive a market value for many of these assets. In the absence of a",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.710694"
}