{
  "id": "6d6c0449e354",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 34,
  "content": "hiding the price bars and randomly drawing lines on the chart without regard to prices or market struc- ture. (This was done on a live video available at http://adamhgrimes.com/blog/2011/12/04/ randomsrlevels/) You can, and should, reproduce this experiment yourself. This is an ex- periential process—you must actually do this yourself, ideally several times. You may be very surprised to see that many of the standard patterns around support and resistance 115.00 114.50 114.00 113.50 113.00 A 112.50 112.00 111.50 111.00 110.50 110.00 14:00 15:00 11/12 10:00 11:00 12:00 13:00 14:00 49 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing On Trading Ranges 101 FIGURE 4.4 Clear Resistance Is Tested Multiple Times, Breaks (A), and Then Holds Cleanly as Support When Retested (B) occur around these random levels in just the same way. Almost any random line drawn in the market will function as believable support or resistance. Create Your Own Support and Resistance Levels 1. Take a price chart of any market and hide the bars. Depending on your charting pack- age, there are many ways to do this, but the easiest is probably to set the color of the bars the same as the background of the chart. 2. Draw random lines on the chart. They may slant as trend lines, be horizontal, or even be curves. When you draw them, you will be drawing on a blank chart space, so many of the lines will not touch prices. This is ﬁne—they are random lines, after all. 3. Restore the price bars and then look at each point where price touches your random lines. Imagine that these are important levels, generated by whatever process you use to ﬁnd your support and resistance levels. (Continued ) P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing On Trading Ranges 103 Potential Support ?? FIGURE 4.5 If Reward Is Much Greater Than Risk, Is It Always a Good Idea to Buy Here? reward/risk ratio will also shift, again resulting in an expected value of zero. There is no possible way to proﬁt in a random walk market— this is absolutely axiomatic . If it is not intuitive, you must work with these concepts until it is; without that understanding, it is very difﬁcult to trade proﬁtably. So there is no escaping this truth—if you are buying in front of support or shorting in front of resistance, you must have an edge beyond just having a much larger proﬁt target than stop loss. You must have a reason for expecting nonrandom price action off the level. Clean or Sloppy Tests Support and resistance often do not hold perfectly clean tests. Allowing for these sloppy tests may sometimes lure us into seeing levels where none actually exist, but they actually are a reality of market action. There is no perfect solution here, but one thing to consider is the past history of price action around a level. If it has been violated many times with sloppy tests, it is reasonable to assume that future tests will also be sloppy. Figure 4.6 shows examples of several sloppy support tests in Netﬂix, Inc. (Nasdaq: NFLX) on a daily chart. Just by looking at the chart, you can see this stock has not held clean levels in the past, so it would be unrealistic to expect it to start doing so in the future. However, even if a market does tend to hold levels cleanly, this does not mean that these levels are easy to trade. It might seem as though a good plan would be to get a position as close to a level as possible, and to stop out a tick on the other side of the level. In many cases, the catalyst for an up move may be a drop of clean support, which will generate volatile selling as stop orders are triggered, followed by strong buying that pushes the market back above the level. (Obviously, the reverse applies for resistance.) The market essentially knows where stop orders are likely to cluster, and those stops will often be targeted. Figure 4.7 shows some examples of very clean support and resistance on an intraday chart of Freeport-McMoRan Copper & Gold Inc. (NYSE: FCX). (Note that the lines have been offset from prices to highlight the clean tests.) Though the eye is drawn to these clean levels, notice that this same chart has other points with sloppier tests of levels. BIDU - 3 min Baidu Inc 11:00 12:00 13:00 14:00 15:00 8/30 10:00 11:00 , , , , \\ \\ , , , , , , , ----------- ----- ---- ---- ---------------------- ---,;--------- \\ \\ ◄ 50 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing 104 MARKET STRUCTURE FIGURE 4.6 Sloppy Tests of Support in NFLX FIGURE 4.7 Clean Support and Resistance in FCX NFLX - Doily Netnix Inc Oct Nov Dec '11 Feb FCX- 5 min Freeport-McMoRan Copper&Gold B II\\ ~ 1J11lllif\\H . ( ,,• lfl[·\\ I / .., 140.0() 130.0() 57.0() 5680 5660 5640 5620 I --- -l · r,,11 -- rrrll-- I ' ' - MOO lqw!!!l l,11 , 1111 --i' ¼W 1111~ 55 • 5 o 13:00 14:00 15:00 2/7 10:00 11:00 12:00 13:00 51 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "risk_management"
  ],
  "created_at": "2026-02-05T00:37:53.700610"
}