{
  "id": "1a5481e0f8b5",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 27,
  "content": "in terms of a normal distribution, how do we feed this distribution into a theoretical pricing model? Since all normal distributions can be described by a mean and the standard deviation, in some way we must feed these two numbers into our pricing model. When we enter the present price of an underlying instrument we are actually entering the mean of a normal distribution curve. An important assumption in the Black-Scholes Model is that, in the long run, a trade in the underlying instrument will just break even. It will neither make money nor lose money. Given this assumption, the mean of the normal distribution curve assumed in the model must be the price at which a trade in the underlying instrument, either a purchase ora sale, would just break even. What is that price? The answer depends on the type of underlying instrument. Suppose a trader purchases a futures contract at 100 and holds the position for three months. Where does the price of the futures contract have to be at the end of three months for the trader to break even? Since futures contracts entail no carrying costs, nor do they pay dividends, the break even price three months from now is exactly the original trade price of 100. Now suppose that a trader purchases a $100 stock and holds it for three months. Where does the stock price have to be at the end of the holding period for the trader to break even? Since the purchase of stock requires immediate payment, the break even price will have to include the cost of carrying a $100 debit for three months. If interest rates are 8% annually the carrying cost on $100 for three months is “2 x 8% x $100 = $2. Therefore, the stock price must be $102 at the end of three months for the trade to break even. If the stock will pay a dividend of $1 during the holding period, then the stock price need only be $101 for the trade to break even. Note that this is exactly how we calculated the forward price of a contract in Chapter 3. And indeed this is exactly the type of calculation built into the various forms of the Black-Scholes Model. When we enter an underlying price into the Black-Scholes model, based on the type of underlying instrument, interest rates, and dividends, the model calculates the forward price of the underlying instrument at expiration and makes this price the mean of a normal distribution curve. VOLATILITY AS A STANDARD DEVIATION In addition to the mean, we also need a standard deviation to fully describe a normal distribution curve. This is entered in the form ofa volatility. With some slight modifica- tions, which we will discuss shortly, we can define the volatility number associated with an underlying instrument as a one standard deviation price change, in percent, at the end of a one-year period. For example, suppose that an underlying futures contract is currently trading at 100 and has a volatility of 20%. Since this represents a one standard deviation price change, one year from now we expect the same futures contract to be trading between 80 and 120 (100 + 20%) approximately 68% of the time, between 60 and 140 (100 + (2 x 20%)) Volatility 61 approximately 95% of the time, and between 40 and 160 (100 + (3 x 20%)) approxi. mately 99.7% of the time. If the underlying contract is a stock currently trading at $100, then the 20% volatility will have to be based on the forward price of the stock at the end of one year. If interest rates are 8% and the stock pays no dividends, the one-year forward price will be $108. Now a one standard deviation price change is 20% x $108 = $21.60. So one year from now we would expect the same stock to be trading between $86.40 and $129.60 ($108 + $21.60) approximately 68% of the time, between $64.80 and $151.30 ($108 + (2 x $21.60)) approximately 95% of the time, and between $43.20 and $172.90 ($108 + (3 x $21.60)) approximately 99.7% of the time. Suppose we come back at the end of one year and find our futures contract, which we thought had a volatility of 20%, trading at 35. Does this mean our volatility of 20% was wrong? A price change of more than three standard deviations may be unlikely, but one shouldn’t confuse unlikely and impossible. Flipping a perfectly balanced coin 15 times may result in 15 heads, even though the odds against it are more than 32,000 to 1. If 20% was the right volatility, the odds of the futures price going from 100 to 35 one year later is more than 1,500 to 1. But one chance in 1,500 is not impossible, and perhaps this was the one time in 1,500 when the price would indeed end up at 35. Of course, it is also possible that we had the wrong volatility. But we wouldn’t know this without looking at price changes of the futures contract over many years so that we have a representative price distribution. LOGNORMAL DISTRIBUTIONS Is it reasonable to assume that the prices of an underlying instrument are normally distributed? Beyond the question of the exact distribution of prices in the real world, the normal distribution assumption has one serious flaw. A normal distribution curve is symmetrical. Under a normal distribution assumption, for every possible upward move in the price of an underlying instrument there must be the possibility of a downward Move of equal magnitude. If we allow for the possibility of a $50 instrument rising $75 to $125, we must also allow for the possibility of the instrument dropping $75 to a price of -$25. Since it is impossible for traditional stocks and commodities to take on negative prices, the normal distribution assumption is clearly flawed. What can we do about this? Up to now we have defined volatility in terms of",
  "word_count": 1000,
  "topics": [
    "options",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.426397"
}