{
  "id": "daf8847bdf57",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 113,
  "content": "CAPUAUUIL Will LUIUIe Uldli ULIDCL LID GLIUULIL LIC VV Ik Mot Wy oCiiuig UIC PUL below parity. Conditions for Early Exercise If given the chance, there are clearly reasons why a trader might want to exercise an American option early. In the case of futures options, when the option is subject to stock-type settlement, the trader is trying to capture the interest on the option’s intrinsic value. In the case of stock option calls, he is trying to capture the dividend which the stock pays. In the case of stock option puts, he is trying to capture the interest on the proceeds from the sale of the stock at the exercise price. From the foregoing discussion we can infer two conditions which are necessary before a trader considers exercising an option early to capture this additional profit: 1. The option must be trading at parity. 2. The option must have a delta close to 100. If the option is trading at more than parity, the trader will always do better selling the option and taking a position in the underlying market himself. Determining whether an option is trading at parity is simply a matter of finding out what the market in that option is. In the great majority of cases, if an option is deeply enough in-the-money to be an early exercise candidate, the bid/ask spread is probably so wide that for practical purposes the option is trading at parity. Early Exercise of American Options 247 Why should the delta be close to 100? If we exercise an option early, we are trading in the option for a position in the underlying contract. We therefore want to be reasonably certain that the option and the underlying contract have the same charac- teristics. In other words, we want to be certain that the option has no additional insurance value left, so that when we exercise the option we are not throwing away this insurance value. For example, suppose there is an 80 call available with the underlying contract trading at 100. If we want to take a long position we can purchase either the 80 call or the underlying contract. If we feel there is no chance that the market can fall below 80 prior to expiration, there is no difference between holding the 80 call or holding the underlying contract. But suppose we feel that there is some chance that the market could fall below 80. In that case we will prefer to hold the 80 call. If the market were to fall below 80, holding the call would limit our potential loss to the option’s premium. If, however, we hold a long underlying position and the market drops below 80, our potential loss is unlimited. Recall that one interpretation of the delta is the probability that the option will finish in-the-money. A delta close to 100 means that the underlying market has almost no chance of going through the exercise price, and the option therefore has almost no chance of going out-of-the-money. What degree of certainty justifies early exercise? With a delta of 100 one certainly would consider early exercise. What about 99? 96? 90? With a delta above 95, many traders will at least consider early exercise. How much interest will be earned, or what dividend will be collected, through early exercise? With a delta of 95 or lower, the risk is probably too great to consider early exercise. There is at least a 5% chance that the underlying market will go through the exercise price. If that happens, a trader will regret having exercised an option early, regardless of the additional benefits to be gained through early exercise. By ensuring that the delta is close to 100, we are also ensuring that we do not throw away any insurance value that the option might still retain. As an option goes more deeply into-the-money, its time value (insurance value) begins to disappear. With a delta of 100, in theory the option has no time value left. However, as the delta declines, the time value increases. If the delta were significantly less than 100, the option would still retain a significant amount of time value. If we were to exercise such an option, we would be throwing away this insurance value. Since the desirability of early exercise is dependent, at least in part, on the option’s delta, the accuracy of the delta is important. But there are many factors which affect the delta, and we might incorrectly assess any one of these factors. If we feel that the correct volatility is 15%, an option might have a delta of 98. But if we decide to raise our volatility to 17%, the delta of the option will decline. Under the new conditions its delta might only be 93. At a 15% volatility a trader might consider early exercise, while at a 17% volatility he might not. For this reason, options in low-volatility markets are exercised early much more often than options in high-volatility markets. 248 Chapter 12 In the same way, an option with three months remaining to expiration might have a delta of 92, and would therefore not be an early exercise candidate. But if two months pass, and the price of the underlying contract is unchanged, the delta will rise, and the new delta might be 99. With three months remaining the option was not an early exercise candidate, but with one month remaining the option might be early exercise candidate. Of course, we ought to ask why we were considering early exercise in the first place. In many cases, we exercise to earn interest over the life of the option. We can earn more interest over three months than over one month, so from this point of view a three-month option is more likely to be an early exercise candidate than a one-month option. We can see that many factors affect the desirability of early exercise, and these factors can pull in different directions, with some factors",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.439601"
}