{
  "id": "848c30244992",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 99,
  "content": "XYZ last printed 50.00 three weeks ago, but is now bid at 30.00 and offered at 49.00, what is it actually worth? Researchers studying price patterns need to be careful because printed price records in illiquid markets can be very mislead- ing. As an interesting aside, a major factor in the 2007–2008 ﬁnancial crisis was the impor- tance of many ﬁnancial instruments representing very signiﬁcant ﬁnancial commitments that did not have liquid markets. Spreads were wide, or in some cases, nonexistent, so it was impossible to derive a market value for many of these assets. In the absence of a market price, traders resorted to building complex models with many moving parts (if that sounds a lot like guessing, you’re not wrong), and many of these models gave very misleading values for these instruments. This complete breakdown in understanding the value and risk of these instruments was one of the major contributors to the crisis. Liquidity is a misused and often imprecisely deﬁned term, but it usually means the availability of willing buyers and sellers. Liquid instruments tend to have tighter spreads and deeper books, meaning that there are many buyers and sellers at price levels beyond the inside market. Going back to XYZ, which is now 49.95 at 50.05, we might ﬁnd there are 1,000 shares on the bid at 49.95, and many thousands at 49.94, 49.93, and so on for many pennies below the market. Imagine a very large sell order comes into the market. These buyers would easily be able to absorb that order, meaning that XYZ would trade on the bid at 49.95, then maybe 49.94 and 49.93—all in all, very little price change. However, imagine a second scenario where there are again 1,000 shares on the bid at 49.95, but now a few hundred at 49.91, a few more at 49.87, and so on. If a large sell order hits this market, it will “clear the bids” and the price will drop much lower. Market makers are a speciﬁc group of traders whose job is basically to provide liq- uidity. A market maker will usually have both a bid and an offer in the market, though they are free to adjust those levels as needed. For instance, if market makers are getting hit on the bid so that they are accumulating large long positions, they may choose to still bid for the stock, but to drop their bid to lower levels. If they keep their offer price on the inside market (meaning that they adjust their offer so that it is the lowest offer), eventually they will be able to sell some of their inventory, and in this way manage their exposure. Floor traders in open-outcry markets were the original market markers. Early electronic markets had designated market makers, but this role has now passed to many ﬁrms who run computer programs (algos) that function as market makers. Market makers incur signiﬁcant risks at times because they will always be on the wrong side of big moves driven by informed traders. If a group of traders comes into the market with many buy orders, the market maker will be forced to short to take the other side of that trade. In extreme cases (e.g., the crash of 1987), market makers could be forced out of business by adverse price moves. Market makers are typically offered various incentives to compensate them for these risks; otherwise, no one would take this job! (As of this writing, in 2011, liquidity rebates, which pay the ﬁrm a very small fee for executing via limit orders, are one of the primary forms of compensation for most traders functioning as market makers.) 151 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp01 JWBT634-Grimes May 11, 2012 8:31 Printer: Hamilton Printing 402 APPENDIX A: TRADING PRIMER TWO TYPES OF ORDERS Traders wishing to buy this market have, broadly speaking, two options. A buyer who is not really in any hurry might focus on getting the best (lowest) price he can get, so he can bid for the stock. (In this case, bid is used as a verb meaning “to place an order lower than current prices.”) Consider the case of XYZ with the market bid at 49.95 and offered at 50.05; a buyer could join the bid and put his order at 49.95. Of course, the buyer can also place orders lower, but they will be ﬁlled only if the market moves down to the level where he is bidding. If the buyer is feeling a little more urgency, he can step in front of the bid and put his order at 49.96 or 49.97. Note that in this case, the inside market would now be 49.97 (still offered at 50.05). This is a natural force that tends to compress spreads as buyers bid slightly higher and sellers offer lower in competition for ﬁlls, and is one of the main reasons why active, liquid markets tend to have tight spreads. However, if the buyer is really motivated and must have stock XYZ now, he may choose to pay the offer (other common language is take the offer , and the reverse is to hit the bid). Though much simpliﬁed, these are the two options available to traders and they correspond to the two most commonly used order types. Limit orders are orders where buyers try to buy at a cheaper price than the offer and sellers offer to sell at prices above the bid. A trader wanting to buy XYZ with a limit order might say, “Bid for it” or “Join the bid,” as in “We’re in no hurry here—just bid for it.” A seller might say, “Okay, ﬁne, offer it",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.710837"
}