{
  "id": "51f84d231884",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 21,
  "content": "aggressively higher. The end result will be deeper pullbacks, perhaps with a more complex structure. So far, all of the pullbacks examined have been simple pullbacks or consolidations, meaning that they are composed of one contratrend movement. The trend leg ends, the pullback begins, and, at the bottom of the pullback, buyers push the market to new highs. It is not always this simple. Another common pattern is the complex pullback, which is a standard pullback followed by a failed attempt to resume the original trend. When this attempt fails and rolls over, the pullback puts in a second leg against the larger trend. A complex pullback is actually a complete trend leg (impulse, pullback, impulse) structure on the lower time frame, and we also commonly refer to them as two-legged pullbacks. Figure 3.11 shows a schematic example of simple and complex pullbacks. Commit these patterns to memory; they are the fundamental patterns of with-trend trading. It is important to understand these complex pullbacks for several reasons. First, they are common. Trend traders will make the bulk of their proﬁts in trends that extend for several legs, and pullbacks in trends tend to alternate between simple and complex. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 62 MARKET STRUCTURE Simple Consolidation Complex Consolidation FIGURE 3.11 Simple and Complex Pullbacks (This rule of alternation , which describes this alternation between simple and complex pullbacks, is one of the useful rules from Elliott wave theory.) For instance, it is ex- tremely unusual to ﬁnd a trend that has ﬁve large trend legs interrupted by four simple pullbacks; far more common would be ﬁve large trend legs interrupted by two simple and two complex pullbacks. Traders cannot negotiate the market structure of extended trends successfully without a good understanding of complex pullbacks. Another reason to understand these patterns is that many traders will execute a plan that is some vari- ation of entering into a pullback and exiting if the pullback continues to move against them. Complex pullbacks will stop these traders out of their positions as the pullback makes new countertrend extremes on the second leg. Any successful trend trading strat- egy has to account for the possibility of complex pullbacks. With this in mind, return to Figure 3.10 and examine the third pullback in the sequence, which is a good example of a complex pullback in a real market situation. Measured Move Objective This combination of impulse/retracement/impulse pattern leads to a three-legged struc- ture that should be considered the standard trend structure. A rough proﬁt target for the follow-through leg, the trend leg following the pullback, is the so-called measured move objective (MMO), which assumes that the CD leg in Figure 3.12 will approximately equal the length of the AB leg. Treat this relationship as a rough guideline; all proportions and ratios work in mar- kets simply because they express the magnitude of ﬂuctuations that are normal for any particular market. For instance, if a stock has been ﬂuctuating intraday in swings of 0.40 on average, it would not be realistic to expect a 4.00 proﬁt on a single swing. Conversely, looking for a proﬁt of 0.04 in that same stock would probably be too conservative, and it might be difﬁcult to justify the necessary risk for such a small target. Certainly, there are SNX-Da ily S&P 500 Index Jul Nov I II 11 11\\I 1,120.00 !' I~ __ h-'-k·J 1,100.00 , , • , ~ ~..-- •1 ,080.00 1,060.00 Dec 1,040.00 1,020.00 1,000.00 980.00 960.00 940.00 920.00 900.00 880.00 30.00 15.00 0.00 25 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 63 A B C D FIGURE 3.12 Measured Move Objective: Add Distance AB to Point C to Predict Approximate Location of D examples where markets reach this measured move objective exactly, but it is best to be prepared to be ﬂexible: If the swing seems to be falling short, perhaps be willing to take a slightly smaller proﬁt. If the market is driving into the measured move objective with good momentum, it may often be possible to take proﬁt beyond the level. Do not expect markets to precisely conform to any set of ratios and relationships. Another way to use a measured move objective is as a potential entry spot. A com- mon area where this may occur is in a complex pullback, when it makes sense to look for the second leg of the pullback to terminate in the area of the measured move objective. Last, remember that this measured move objective, if used as a price target, provides a target for only a single swing. It is entirely possible to establish a position in a trend and hold it through multiple pullbacks and multiple trend leg extensions, in which case the measured move is valid only for each of the individual swings. Three Pushes The parabolic expansion into climax pattern is a dramatic but rare pattern. There are a number of other more common and subtle patterns that can also indicate climax. One of the most important of these is three pushes , which appears on a price chart as three drives to a new high or low after a somewhat extended trend. The pushes are usually symmetrical in time (meaning that they are more or less evenly spaced horizontally on the chart) and in price. In the best examples, the third push breaks a trend line drawn across pushes one and two, indicating a short-term climax on a lower time frame. The three pushes that make up this pattern are also usually spaced more closely than most of the other highs",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.698341"
}