{
  "id": "722268d9d78b",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 126,
  "content": "a trader since it will occur in the future. Nevertheless, if a trader wants to use a theoretical pricing model, he will be required to make some prediction about the volatility of the underlying contract over the life of the option. Making an intelligent volatility forecast can be a difficult and frustrating exercise, especially for a new option trader. The forecasting of directional price movements through technical analysis is a commonly studied area in trading, and there are many sources to which a trader can turn for information on this subject. Unfortunately, volatility is a much newer concept, and there is relatively little to guide a trader. In spite of this difficulty, an option trader must make some effort to come up with a reasonable volatility input if he is going to rely on a theoretical pricing model to make intelligent trading decisions. SOME VOLATILITY CHARACTERISTICS The first step in making a sensible volatility forecast is to understand some of the basic characteristics of volatility. First, let’s compare two graphs. Figure 14-1 shows Deutsche- mark prices from 1982 to 1991. Figure 14-2 shows the 50-day volatility of Deutsche- marks over the same period. Are there any generalizations one can make from these graphs? Obviously both prices and volatility sometimes rise and sometimes fall. But unlike the prices of an underlying instrument, which appear to move freely in either direction, there seems to be an equilibrium number to which the volatility always returns. Over a period of three years, from early 1985 to late 1987, the price of Deutschemarks rose from a low of 29 to a high of 63. While prices fluctuated after 1987, they never reached the lows of the early 1980s. Someday, economic forces may cause Deutschemarks to rise or fall dramatically, never again returning to prices in the 50s or 60s. In other words, prices of an underlying contract are open-ended. There is no reason Why they have to return to some previous level. Such does not appear to be the case with volatility. The 50-day volatility of Deutschemarks over the 10-year period in question fluctuated from a low of 5% to a high of 20%. Yet no matter how much it fluctuated, at some point volatility always Teversed itself and retraced almost all of its previous rise or fall. Indeed, we might try to find an equilibrium volatility such that there are equal fluctuations above and below this 273 274 L661 ; 0661 , 6861 _ 8861 ; 2861 ; 9861 ; S861 veél e86l cB6l 1 1. 1 SZ Wa Jed sjuag OL L661L—-Z86L SOD YABWIOYOS)}NEG :}-pL oni Volatility Revisited 275 number. In the case of Deutschemarks, this equilibrium volatility seems to be about 11% to 12%. Volatility may rise well above 12%, or fall well below 11%, but eventually it always seems to return to this area. If we were to generalize about volatility characteristics from the Deutschemark volatility in Figure 14-2, we might surmise that an underlying contract is likely to have a typical long-term average, or mean volatility. Moreover, the volatility of the underlying contract appears to be mean reverting. When volatility rises above the mean, one can be fairly certain that it will eventually fall back to its mean; when volatility falls below the mean, one can be fairly certain that it will eventually rise to its mean. There is a constant gyration back and forth through this mean. This mean reverting characteristic of volatility can also be seen in Figure 14-3, which shows the distribution of Deutschemark volatility from 1982 to 1991. Beginning at the extreme left on the x-axis (the amount of time remaining to expiration), we can see that over any two-week period during the 10 years in question, there was a 20% chance that volatility would be either less than 6.0% or greater than 17.3% (the 10th and 90th percentiles}. There was a 50% chance that volatility would be either Jess than 7.6% or greater than 13.0% (the 25th and 75th percentiles}. The mean volatility for any two week period was 9.7%. Moving to the extreme right on the x-axis, we can see that over any 50 week period there was a 20% chance that volatility would be either less than 9.8% or greater than 14%. There was a 50% chance that volatility would be either less than 10.6% and greater than 12.7%. The mean volatility for any 50-week period was about 11.5%. Figure 14-3 has an easily identifiable structure. As one moves further out in time the percentile lines tend to converge towards the mean, and the mean becomes stable. This reinforces the assumption that volatility is indeed mean reverting. This type of volatility graph, sometimes referred to as a volatility cone, is an effective method of presenting the volatility characteristics of an underlying instrument.! What else can we say about volatility? Looking at the more detailed Deutschemark volatility chart in Figure 14-4, we might surmise that volatility has some trending characteristics. From July 1989 through June 1990 there was a downward trend in volatility. From July 1990 to April 1991 there was an upward trend. And from April 1991 to October 1991 there was again a downward trend. Moreover, within these major trends there were minor trends as volatility rose and fell for short periods of time. In this respect volatility charts seem to display some of the same characteristics as price charts, and it would not be unreasonable to apply some of the same principles used in technical analysis to volatility analysis. It is important to remember, however, that while price changes and volatility are related, they are not the same thing. If a trader tries to apply exactly the same rules of technical analysis to volatility analysis, he is likely to find that in some cases the rules have no relevance, and that in other cases the rules must be modified to take into account the unique characteristics of volatility. Since the author 1. For a mare detailed discussion of volatility cones, see:",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.441620"
}