{
  "id": "bee4cee69443",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 140,
  "content": "can change accordingly. In a buy program (buy the stocks, sell the futures), any increase in dividends will help the position, and any decrease will hurt. In a sell program (sell the stocks, buy the futures), the effect is just the opposite. In a broadly based index consisting of hundreds of stocks it is unlikely that a change in the dividend policy of any one company, or even several companies, will have a significant impact on the profitability of a program trade. But in a narrowly based index consisting of only a few stocks, a change in the expected dividend payout of even one firm can alter the potential profitability of the trade. In sucha case, the trader must carefully consider beforehand the possibility of a dividend change in the companies making up the index. Stock Index Futures and Options 313 INDEX OPTIONS There are really two types of stock index options, those where the underlying is a stock index futures contract, and those where the underlying is the index itself. Although they are alike in many respects, they also have unique characteristics which set them apart from each other. For this reason, we will look at each market separately. Options on Stock Index Futures Since an option on a stock index futures contract is often evaluated in the same way as a traditional futures option, a trader in such a market has all the usual problems which go with futures option evaluation. He must pick a suitable pricing model, determine the correct inputs into the model, choose appropriate strategies, and consider the risks that go with these strategies. Since exercise or assignment of a futures option contract will result in the trader taking a long or short position in the stock index futures contract, the trader might logically use the current futures price as the underlying price input into his theoretical pricing model. But a futures option trader is often faced with a new problem. Should he also use the current price of the futures contract as his price input if the futures contract is clearly mispriced and trading at other than fair value? For example, if a stock index futures contract is trading at 424.00 but an option trader believes that the fair value is 425.00, which value should the trader feed into his theoretical pricing model? If the trader really believes that the futures contract ought to be trading at 425.00, and also believes that all the assumptions upon which the theoretical pricing model is based are valid, then he might very well choose to use 425.00 as the underlying price in his model. He can then take option positions, whether outright or spread positions, by purchasing options which he believes are underpriced and selling those which he believes are overpriced. Notice, however, that with the futures contract trading at 424.00, he cannot use 425.00 as his price input and still use the futures contract to hedge his option position. If he were to do so, whatever positive theoretical edge he achieved because of his option trades would automatically be offset by the negative theoretical edge resulting from his futures trades. This becomes obvious when we recall the basic synthetic relationship for futures options from Chapter 11: call price — put price = futures price — exercise price If the trader believes the underlying futures contract ought to be trading at 425.00, then he also believes that the 425 call and the 425 put ought to be trading at an identical Price. The difference between the presumed futures price and the exercise price is zero, so the difference between the call price and put price ought to also be zero. But with the underlying futures market actually trading at 424.00, the call price will be approxi- mately 1.00 less than the put price. If the 425 call is trading for 8.50 and the 425 put is trading for 9.50, the call will appear too cheap to the trader and the put will appear too expensive. Unfortunately, if the trader buys the call for 8.50 and sells the put for 9.50, he has no way to lock in his presumed profit of 1.00. If he attempts to complete the reverse conversion (buy the call, sell the put, sell the underlying), he will have to 314 Chapter 15 do so by selling the futures contract at 424.00. What he makes on the options he will give back on the futures contract. If a trader simply wants to execute volatility or directional spreads based on a presumed underlying price of 425.00, then it might very well make sense to use that price as the input into the theoretical pricing model. But professional option traders rely heavily on arbitrage relationships for many of their trading strategies. If a price other than the actual underlying price is used, these arbitrage relationships will no longer be valid. Because the choice of underlying price may vary from trader to trader, many on-line option evaluation services give traders the choice of using either the actual futures price or the theoretical futures price as the basis for theoretical evaluation. Although the ultimate decision about the underlying price is the trader’s, in a stock index futures option market a trader should be very careful about using an underlying futures price different from the quoted price. As we have already seen, the theoretical value of a stock index futures contract depends on information which may not be readily available to the trader. If he is wrong about the price at which the index is actually trading because the individual stock prices do not reflect the true market, his theoretical evaluation of the futures contract will be incorrect. Most traders have learned through experience that the apparent mispricing of a stock index futures contract is often illusory, or at least smaller than it appears. Options on a Cash Index The exercise or assignment of a stock option requires the buyer or seller to take delivery or make delivery of",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.443864"
}