{
  "id": "45f29fdce546",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 139,
  "content": "the stocks in the index are trading? Perhaps trading in some of the stocks has been halted due to pending news. Or perhaps the last sale for one or more of the stocks took place at a price outside the current market for the stock. The last sale in a stock may have been at 381/4, but if the market in the stock is falling very quickly, the offered price for the stock may be 37%. The index value is based on the last sale price of 38/4, but the actual price is at least as low as 37%4, and possibly even lower. If a trader hopes to profit from a mispriced futures contract he must know the true market for all the stocks which underlie that contract. Assuming the trader can execute all purchases and sales at theoretically profitable prices, is there anything which could go wrong with a program trade consisting of stocks against stock index futures? Suppose a trader buys an underpriced futures contract and simultaneously sells the underlying stocks. If the index starts to fall, and the futures contract follows, the trader will show a profit on his stock trades and a loss on his futures trade, and presumably these two components will offset each other. Unfortunately, the stock trades, being subject to stock-type settlement, only result in a paper profit, while the futures trade, being subject to futures-type settlement, results in a cash loss. If the index drops far enough, and the trader must borrow cash to meet the variation requirements for the futures contract, the interest cost may be so great that the arbitrage which initially appeared profitable actually turns into a loss. This is similar to the settlement risk for a conversion or reversal in the futures option market described in Chapter 11. From this, we can see that a program trade always wants the market to move in the direction of the futures contract so that cash will flow into the trader’s account. This will increase the trader’s potential profit, since he will be able to earn interest on this cash over the life of the futures contract. In this respect, we can apply the concept of the delta to futures contracts in much the same way we do to an option contract. The delta is the rate at which a contract will change its theoretical value with respect to Movement in the underlying contract. For example, assume that a stock index is quoted at 300.00. If there are three months to expiration, with interest rates at 8%, and an expected dividend payout of 4.50, the fair value of a futures contract is approximately: 300.00 + (300.00 x 3/12 x .08)} - 4.50 = 301.50 Suppose the index immediately rises 10% to 330.00. The new fair value of the futures contract is: 312 Chapter 15 330.00 + (330.00 x 3/12 x .08) - 4.50 = 332.10 The index rose 30.00 while the futures contract rose 30.60. The delta of the futures contract is therefore 102, since 30.60/30.00 = 1.02. The futures contract is changing its value at 102% the rate of the underlying index. If we assume that the dividend payout remains constant, the delta of a futures contract is simply a function of interest rates. The extra two deltas associated with the futures contract results from an interest rate of 8% and a time to expiration of three months, since 3/12 x .08 = .02. As the amount of time to expiration changes, or as interest rates change, the delta of the futures contract will also change. We can now express in delta terms the amount by which a program trade is unbalanced. If a trader buys 50 futures contracts, each with a delta of 102, and sells an appropriate amount of the underlying stocks, his delta total position is (50 x 102) - (50 x 100) = +100 He is long as if he had purchased stock outright corresponding to one index contract. If he wants to be exactly delta neutral, he must sell a basket of stocks corresponding to one index contract. A change in interest rates will not only affect the delta of the futures contract, but can also affect the profitability of a program trade. If a trader institutes a buy program (buy the stocks, sell the futures), he is effectively borrowing cash in order to purchase the stocks. If the cost of funds is tied to a floating interest rate, any increase in rates will hurt his position and any decrease will help. If he institutes a sell program (sell the stocks, buy the futures) he is effectively lending cash. Now any increase in rates will help his position and any decrease will hurt. If the change in interest rates is sufficiently large, an initially profitable program trade might become unprofitable. This can be especially true if the program trade consists of very long-term futures contracts. In such a case, the interest considerations are magnified because of the increased costs of borrowing or lending over extended periods. In the same way, because of reduced interest considerations, changes in interest rates are unlikely to affect program trades consisting of short-term futures. We have thus far assumed that the dividend payout of all the stocks in an index remains constant, but this is not necessarily true. Companies can have good years and bad years, and their dividend policies can change accordingly. In a buy program (buy the stocks, sell the futures), any increase in dividends will help the position, and any decrease will hurt. In a sell program (sell the stocks, buy the futures), the effect is just the opposite. In a broadly based index consisting of hundreds of stocks it is unlikely that a change in the dividend policy of any one company, or even several companies, will have a significant impact on the profitability of a program trade. But in a narrowly based index consisting of only a few stocks, a change in the expected dividend",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.443706"
}