{
  "id": "8d8aac31b5dd",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 31,
  "content": "an order an institution needs to execute incrementally? How do you predict when the “herd” is large enough to form a stampede? Where is the infamous tipping point? If we do not have a reliable way to esti- mate these time horizons, we cannot execute a momentum trade profitably based on these phenomena. In a later section on regime switch, I will examine some attempts to predict these tipping or “turning” points. There are other causes of momentum that are more predictable: the persistence of roll returns in futures markets, and forced sale and purchases of securities due to risk management or portfolio rebalancing. Both these causes are explored in detail in my second book (Chan, 2013). There is one last contrast between mean-reverting and momen- tum strategies that is worth pondering. What are the effects of increasing competition from traders with the same strategies? For mean-reverting strategies, the effect typically is the gradual elimi- nation of any arbitrage opportunity, and thus gradually diminishing returns down to zero. When the number of arbitrage opportunities has been reduced to almost zero, the mean-reverting strategy is sub- ject to the risk that an increasing percentage of trading signals are actually due to fundamental changes in stocks’ valuation and thus is not going to mean revert. For momentum strategies, the effect of competition is often the diminishing of the time horizon over which the trend will continue. As news disseminates at a faster rate and as more traders take advantage of this trend earlier on, the equilibrium price will be reached sooner. Any trade entered after this equilib- rium price is reached will be unprofitable. REGIME CHANGE AND CONDITIONAL PARAMETER OPTIMIZATION The concept of regimes is most basic to financial markets. What else are “bull” and “bear” markets if not regimes? The desire to predict regime changes is also as old as financial markets themselves. Chan800064_c07.indd 137 6/7/2021 7:16:53 AM 140 QUANTITATIVE TRADING In Example 7.1, I illustrate how we apply CPO using Predict- Now.ai’s financial machine learning API to adapt the parameters of a Bollinger Band-based mean reversion strategy on GLD (the gold ETF) and obtain superior results. Example 7.1: Conditional Parameter Optimization applied to an ETF trading strategy (This example is reproduced from a blog post on predictnow.ai/blog.) To illustrate the CPO technique, we describe below an example trading strategy on an ETF . This strategy uses the lead-lag relationship between the GLD and GDX ETFs using 1-minute bars from January 1, 2006, until December 31, 2020, split- ting it 80%/20% between train/test periods. The trading strategy has 3 trading parameters: the hedge ratio (GDX_weight), entry threshold (entry_threshold), and a moving lookback window (lookback). The spread is defined as Spread tG LD closet GDXc lose tG DX weight__ _. (1) We may enter a trade for GLD at time t, and exit it at time t + 1 minute, hopefully realizing a profit. We want to optimize the three trading param- eters on a 5 × 10 × 8 grid. The grid is defined as follows: GDX_weight = {2, 2.5, 3, 3.5, 4} entry_threshold = {0.2, 0.3, 0.4, 0.5, 0.7, 1, 1.25, 1.5, 2, 2, 5} lookback = {30, 60, 90, 120, 180, 240, 360, 720} To be clear, even though we are using GLD and GDX prices and func- tions of these prices to make trading decisions, we only trade GLD, unlike the typical long-short pair trading setup. Every minute we compute Spread(t) in equation (1), and compute its “Bollinger Bands,” conventionally defined as Zs core t Spread tS preadE MA t Spread VAR t _ _ _ (2) where Spread_EMA is the exponential moving average of the Spread, and Spread_VAR is its exponential moving variance (see the endnote for their conventional definitions). Similar to a typical mean-reverting strategy using Bollinger Bands, we trade into a new GLD position based on these rules: a. Buy GLD if Z_score < -entry_threshold (resulting in long position). b. Short GLD if Z_score > entry_threshold (resulting in short position). Chan800064_c07.indd 140 6/7/2021 7:16:53 AM ( ) = ( ) - ( ) X ()=------.=(====)=-==-(~) .J ( ) 65 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 141 c. Liquidate long position if Z_score > exit_threshold. d. Liquidate short position if Z_score < -exit_threshold. exit_threshold can be anywhere between entry_threshold and –entry_ threhold. After optimization in the train set, we set exit_threshold = –0.6*entry_threshold and keep that relationship fixed when we vary entry_ threshold in our future (unconditional or conditional) parameter optimiza- tions. We trade the strategy on 1-minute bars between 9:30 and 15:59 ET , and liquidate any position at 16:00. For each combination of our three trading parameters, we record the daily return of the resulting intraday strategy and form a time series of daily strategy returns, to be used as labels for our machine learning step in CPOs. Note that since the trad- ing strategy may execute multiple round trips per day before forced liq- uidation at the market close, this daily strategy return is the sum of such round-trip returns. Unconditional vs. Conditional Parameter Optimizations In conventional, unconditional, parameter optimization, we select the three trading parameters (GDX_weight, entry threshold, and lookback) that maximize cumulative in-sample return over the three-dimensional parameter grid using exhaustive search. (Gradient-based optimization did not work due to multiple local maxima.) We use that fixed set of three optimal trading parameters to specify the strategy out-of-sample on the test set. With conditional, parameter optimization, the set of trading param- eters used each day depends on a predictive machine-learning model trained on the train set. This model will predict the future one-day return of our trading strategy, given the trading parameters and other market conditions. Since the trading",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T00:37:43.608661"
}