{
  "id": "365575f9c9c2",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 19,
  "content": "Effects of Backtest Overfitting on Out-of-Sample Performance.” Notices of the Chan800064_c03.indd 79 6/7/2021 2:04:51 PM 39 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 80 QUANTITATIVE TRADING American Mathematical Society 61 (5 May): 458–471. https://ssrn.com/ abstract=2308659. Chan, Ernest. 2006. “Reader Suggests a Possible Trading Strategy with the GLD–GDX Spread.” Quantitative Trading, November 17. http://epchan. blogspot.com/2006/11/reader-suggested-possible-trading.html. Chan, Ernest. 2017. “Paradox Resolved: Why Risk Decreased Expected Log Return but Not Expected Wealth.” Quantitative Trading, May 4. http://epchan.blogspot.com/2017/05/paradox-resolved-why-risk- decreases.html. Sharpe, William. 1994. “The Sharpe Ratio.” Journal of Portfolio Manage- ment, Fall. https://jpm.pm-research.com/content/21/1/49. Chan800064_c03.indd 80 6/7/2021 2:04:51 PM 40 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 81 CHAPTER 4 I n this chapter, we will be taking a break from the technical aspect of trading to focus on the business side of it. Assuming that your goal is to remain an independent trader and not work for a money management institution, the choice of the business structure for trading is important. The main choice you have to make is whether to open a retail brokerage account or to join a proprietary trading firm. The next step is to determine what features of the brokerage or trading firm are important to you. Finally, you have to decide what kind of physical trading infrastructure you need in order to execute your quantitative strategy. BUSINESS STRUCTURE: RETAIL OR PROPRIETARY? As a trader, you can choose to be completely independent or semi- independent. To be completely independent, you can simply open a retail brokerage account, deposit some cash, and start trading. No one will question your strategy, and no one will guide you in your trading. Furthermore, your leverage is limited by Securities and Exchange Commission (SEC) Regulation T—roughly two times Setting Up Your Business Chan800064_c04.indd 81 5/20/2021 10:54:59 AM 82 QUANTITATIVE TRADING your equity if you hold overnight positions. Naturally, all the profits and losses will accrue to you. However, you can choose to join what is called a proprietary trading firm such as Bright Trading and become a member of their firm. In order to become a member of such firms, you have to pass the FINRA Series 7 examination to qualify as a registered represent- ative of a brokerage. You will still need to invest your own capital to start an account, but you will obtain much higher leverage (or buy- ing power) than is available through a retail account. Depending on how much capital you invested, you may get to keep all your prof- its, or some percentage of them. In terms of liability, however, your loss is limited to your initial investment. (Actually, liability is also limited if you form an S corporation or limited liability company (LLC) and open an account through this entity at a retail broker - age. More on this in Box 4.1.) Often, you can also receive training from the firm, perhaps at an extra cost. You will also be subject to the various rules and regulations that the proprietary trading firm chooses to impose on its members, in addition to rules imposed by the SEC or FINRA. BOX 4.1 SHOULD YOU INCORPORATE BEFORE YOU TRADE? If you open a brokerage account as an individual, your liability is not lim- ited to what you deposit in that account. Retail brokerages are known to ask their customers to “make whole” the negative equity in their account when a highly levered position loses more than 100 percent of the margin deposit. This happened in the aftermath of the Swiss Franc unpegging in January 2015. Do not be surprised to get a stern legal letter requesting a large payment from your broker when that happens, and perhaps endless phone calls from a debt collector if you don’t pay up. To avoid this personal liability, I would recommend you set up a cor - poration as your trading vehicle and open an account through this entity at a retail brokerage. Your loss will then be limited to your initial invest- ment, though you may have to file corporate bankruptcy when things go wrong. In the United States, a limited liability company or S-Corp. may Chan800064_c04.indd 82 5/20/2021 10:55:00 AM 81 CHAPTER 4 I n this chapter, we will be taking a break from the technical aspect of trading to focus on the business side of it. Assuming that your goal is to remain an independent trader and not work for a money management institution, the choice of the business structure for trading is important. The main choice you have to make is whether to open a retail brokerage account or to join a proprietary trading firm. The next step is to determine what features of the brokerage or trading firm are important to you. Finally, you have to decide what kind of physical trading infrastructure you need in order to execute your quantitative strategy. BUSINESS STRUCTURE: RETAIL OR PROPRIETARY? As a trader, you can choose to be completely independent or semi- independent. To be completely independent, you can simply open a retail brokerage account, deposit some cash, and start trading. No one will question your strategy, and no one will guide you in your trading. Furthermore, your leverage is limited by Securities and Exchange Commission (SEC) Regulation T—roughly two times Setting Up Your Business Chan800064_c04.indd 81 5/20/2021 10:54:59 AM 41 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.606714"
}