{
  "id": "a095dada9029",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 93,
  "content": "the ﬂow state by adding challenges and in- creasing the complexity of the task. Similarly, if the performer is in the space where high challenges are met by skills that might not quite be up to the task, increasing the level of those skills will move the performer back into the potential ﬂow zone. It takes energy, attention, and focus to achieve this ﬂow state, but its presence can be a powerful clue that the performer is in an optimal state to learn, to grow, and to develop new skills. The Role of Attention and Focus In the normal world, our minds are usually scattered. It is not unusual to be doing a task and to be thinking about several other things; in fact, multitasking is considered an asset l 143 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c12 JWBT634-Grimes May 10, 2012 8:16 Printer: Hamilton Printing CHAPTER 12 Becoming a Trader Intention, good or bad, is not enough. —John Steinbeck M ost of this book applies equally well to individual or institutional traders across a wide range of time frames and asset classes. The lessons of statistical tendencies and market structure are universal; ideas regarding trade and risk management are important for everyone, and can even be adapted to work in conjunction with Mod- ern Portfolio Theory (MPT) in some applications. This chapter is different; it is written speciﬁcally for the individual self-directed trader trying to manage all of the complex tasks of trading on his or her own. The rest of the book has given you many of the pieces you need to be successful. Without a ﬁrm understanding of all of those pieces, you are not likely to be successful in the long run, but even if you are able to master the indi- vidual parts, success may still be elusive. Putting it all together into a coherent whole, building a trading methodology that ﬁts your personality, and living through the learning curve make up a monumental challenge. This chapter also is intended to be a reality check. If there is one message for new traders to take away from this book, it is this: trading is hard—very hard. It will challenge you in ways that you cannot imagine, and it will take much longer than you expect to reach a level of competence. Your success will be incremental and ephemeral at ﬁrst. Expect an emotional roller coaster where progress is followed by errors and failures that erase most of that progress in the next period. Remember that most people who try to trade will fail, or trading will remain a marginal hobby that has no real ﬁnancial impact on their net worth. If you are determined to make it something more, you have a long, hard journey ahead, and you must be prepared. 375 P1: OTA JWBT634-c12 JWBT634-Grimes May 10, 2012 8:16 Printer: Hamilton Printing BecomingaTrader 389 or asset classes better than others, or that you are trading a speciﬁc pattern well but giv- ing back all of the P&L in other, less successful trades. In addition, tracking performance over a period of time can give early warning of problems, can highlight style drifts, and can tie performance to certain market environments. For traders at all stages of devel- opment, the main questions to ask of this analysis are: r Are you making money? Does your P&L show that you have an edge? Are your results better than what someone could have achieved ﬂipping a coin or throwing a dart? r Is your performance dependent on one class of setup more than others? Could you improve performance by eliminating certain setups from your trading plan? r Is there a market, group of markets, or asset class that you trade better than others? r How is your performance changing compared to other time periods? These questions can be answered through some fairly simple procedures. Many bro- kers will supply statements that will answer some of these questions, but others will need to be addressed through your own work and records. Once these basic questions have been answered, the analysis and review can be extended with other questions, such as: r Are you repeating certain mistakes often enough that eliminating them could have a very positive effect on your overall P&L? r Are you achieving superior risk-adjusted performance? r Are there other things that you are doing that are hurting your numbers? This next section will walk through a theoretical analysis to show the basic con- cepts and math used. (The set of trades is available from the author’s web site at www .adamhgrimes.com/ and in Appendix C.) If this type of work is new to you, you should repeat the analysis yourself and compare your results to those in this section. Quantifying Your Edge Table 12.1 shows summary statistics for an active swing trader trading four separate systems over three months in a $100,000 account. Number of trades (N=) and cumulative net P&L (Sum) are given, as well as means for all trades and both winning and losing TABLE 12.1 Summary Statistics for Net P&L System N= Sum Mean StDev AvgWin AvgLoss Win% p= A 29 (2,531) (87) 616 456 (528) 44.8% 0.226 B 17 5,109 301 515 557 (314) 70.6% 0.014 C 16 1,109 69 653 361 (1,194) 81.3% 0.339 D 6 (529) (88) 479 468 (366) 33.3% 0.336 All 68 3,158 46 600 456 (538) 58.8% 0.263 144 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media,",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.709939"
}