{
  "id": "863c97452bed",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 43,
  "content": "share. The total hedge profit was therefore +(100 x $62.50) +(4600 x $3.875) = +$24,075. Adjustments: The adjustment process forced us to buy and sell stock to remain delta neutral. At week one we bought 600 shares of stock at 4954; at week two we bought 1400 shares at 521%; at week three we sold 200 shares at 5134; and so on. At week ten we sold out our remaining 900 shares of stock at 523%. The result of all these Figure 5-2 Stock Deltaof Total Delta Adjustment Total Share Interest on Week Price 50 call Position inShares Adjustment Cash Flow Cash Flow 0 48% ce) ) 0 0) ce) 0 1 49% 52 -600 buy 600 +600 —29,775 —411.14 2 52% 66 —1400 buy 1,400 +2000 -72,975 —895.69 3 51% 64 +200 sell 200 +1800 +10,350 +111.16 4 50 52 +1200 sell 1,200 +600 +60,000 +552.33 5 47 28 +2400 sell 2,400 —1800 +112,800 +865.32 ex-dividend 50¢ 6 48% 38 —1000 buy 1,000 -800 ~48,125 —295.34 7 52 73 ~3500 buy 3,500 +2700 —182,000 -837.70 8 52% 78 -500 buy 500 +3200 -26,125 ~-80.16 9 50% 55 +2300 sell 2,300 +900 +115,288 +176.88 10 52% sell 900 +47,138 92 Chapter 5 adjustments was a loss of $13,425. (Again, the reader may wish to confirm this by adding up all the numbers in the “cash flow” column.) Carrying Costs on the Initial Position: Originally we sold 100 options at $300 each, and bought 4600 shares of stock at $48.50 each. This resulted in a total debit of (100 x $300) — (4600 x $48.50} = $193,100. The carrying cost on this debit for ten weeks at an annual rate of 8.00% (our interest rate assumption} was $193,100 x .08 x 70/365 = $2,962.63. Note that this is somewhat different than the futures example, where only the option contracts entailed a carrying cost. Unlike futures trades, the purchase or sale of stock results in an immediate cash flow, and this cash flow becomes part of the carrying cost on the initial hedge. Interest on the Adjustments: Whenever we bought or sold stock to make an adjustment, the trade resulted in a cash flow, either a debit or a credit. We were able to earn interest on any credit, and we were required to pay interest on any debit, ata rate of 8.00 percent. For example, at week one we bought 600 shares of stock at 495, for a total cash outlay of $29,775. The cost of carrying this debit to expiration (nine weeks hence) was -$29,775 x 63/365 x .08 =-$411.14. The total interest cost from our adjustments is the sum of all the individual interest calculations, or -$81 4.34. Dividends: We also assumed that 30 days prior to expiration (between week five and six} the stock paid a dividend of 50¢. What was the dividend earnings or loss to our position? We initially bought 4,600 shares of stock. At the end of week five we were short 1800 shares of stock as part of the adjustment process. This means that on the ex-dividend date we were longa total of 2800 shares of stock. At a dividend of 50¢ per share, we received a dividend payout $1,400. Interest on Dividends: We were also able to earn interest on the $1,400 dividend payout for the remaining 30 days to expiration at a rate of 8.00%. The proceeds from this were $1,400 x 30/365 x .08 = $9.21. Summarizing the results, we have: Original Interest on Interest on Interest on Hedge Adjustments Hedge Adjustments Dividends Dividends +$24,075 -$13,425 -$2,962.63 -$814.34 +$1,400 +$9.21 The total profit on the hedge is therefore: +$24,075 -$13,425 -$2,962.63 -$814.34 +$1,400 +$9.21 = +$8,282.24 versus a theoretical profit of 100 x ($300 - $217) = 100 x $83 = +$8,300. As in our last example, our profit depended on our knowing the volatility of the underlying contract over the life of the option. This “known” volatility of 32.4% represents the actual volatility associated with the ten stock price changes in Figure 5-2. While we continue to assume that markets are frictionless, we noted in our futures option example that this is not necessarily true. In a locked futures market it is not always possible to freely buy and sell the underlying contract. A similar type of Using an Option’s Theoretical Value 93 restriction can occur in stock option trading. In our example we established the initial hedge by selling calls and purchasing stock. If, however, the calls had been underpriced, we might have chosen to buy calls and sell stock, stock which we might not necessarily own. This type of short sale, the sale of stock which is borrowed rather than owned, is prohibited in some markets. This makes it difficult to hedge certain types of option positions. As we shall see later, if we choose to sell puts it is necessary to hedge the position by selling stock. If we are not able to sell stock to hedge the sale of puts, we might hesitate to sell puts, even at a price greater than the theoretical value. Indeed, in markets where short sales are prohibited, puts tend to trade at inflated prices compared to calls, The short sale of stock is not totally prohibited in U.S. markets, but it is subject to an up-tick rule. This rule specifies that a short sale is always prohibited at a price lower than the price at which the previous trade took place (a down-tick]. A short sale is always permitted at a price higher than the price at which the previous trade took place (an up-tick), Finally, a short sale may take place at the same price at which the previous trade took place if the previous trade took place on an up-tick (also an up-tick). The up-tick rule was instituted following the market crash of 1929, with the intent of preventing a similar crash by prohibiting the sale, at continuously lower prices, of stock not actually owned. Below are ten",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.428996"
}