{
  "id": "99738d0fccee",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 46,
  "content": "up due to the increasing demand from power generators to provide electricity for air con- ditioning. This suggests a seasonal trade in natural gas where we long a June contract of NYMEX natural gas futures (Symbol: NG) at the close of February 25 (or the following trading day if it is a holiday), and exit this position on April 15 (or the previous trading day if it is a holiday). This trade has been profitable for 14 consecutive years at of this writing. Here is the annual P&L and maximum drawdown of this trade. (The 2007–2015 numbers are out-of- sample results): Year P&L in $ Maximum Drawdown in $ 1995 1,970 0 1996 3,090 −630 1997 450 −430 1998 2,150 −1,420 1999 4,340 −370 2000 4,360 0 2001 2,730 −1,650 2002 9,860 0 2003 2,000 −5,550 2004 5,430 0 2005 2,380 −230 2006 2,250 −1,750 2007 800 −7,470 2008* 10,137 −1,604 2009* –4,240 –8,013 2010* –8,360 –10,657 2011* 1,310 –3,874 Chan800064_c07.indd 185 6/7/2021 7:16:59 AM Special Topics in Quantitative Trading 185 Besides demand for gasoline, natural gas demand also goes up as summer approaches due to increasing demand from power generators to provide electricity for air conditioning. Hence, another commodity seasonal trade that has been profitable for 13 consecutive years as of this writing is the natural gas trade: Buy the natural gas futures contract that expires in June near the end of February, and sell it by the middle of April. (Again, see sidebar for details.) A SEASONAL TRADE IN NATURAL GAS FUTURES The summer season is also when natural gas demand goes up due to the increasing demand from power generators to provide electricity for air con- ditioning. This suggests a seasonal trade in natural gas where we long a June contract of NYMEX natural gas futures (Symbol: NG) at the close of February 25 (or the following trading day if it is a holiday), and exit this position on April 15 (or the previous trading day if it is a holiday). This trade has been profitable for 14 consecutive years at of this writing. Here is the annual P&L and maximum drawdown of this trade. (The 2007–2015 numbers are out-of- sample results): Year P&L in $ Maximum Drawdown in $ 1995 1,970 0 1996 3,090 −630 1997 450 −430 1998 2,150 −1,420 1999 4,340 −370 2000 4,360 0 2001 2,730 −1,650 2002 9,860 0 2003 2,000 −5,550 2004 5,430 0 2005 2,380 −230 2006 2,250 −1,750 2007 800 −7,470 2008 * 10,137 −1,604 2009* –4,240 –8,013 2010* –8,360 –10,657 2011* 1,310 –3,874 Chan800064_c07.indd 185 6/7/2021 7:16:59 AM 186 QUANTITATIVE TRADING Commodity futures seasonal trades do suffer from one draw- back, despite their consistent profitability: they typically occur only once a year; therefore, it is hard to tell whether the backtest perfor- mance is a result of data-snooping bias (which is why I especially marked the more recent years as out-of-sample). As usual, one way to alleviate this problem is to try somewhat different entry and exit dates to see if the profitability holds up. In addition, one should consider only those trades where the seasonality makes some eco- nomic sense. The gasoline and natural gas trades amply satisfy these criteria. HIGH-FREQUENCY TRADING STRATEGIES In general, if a high Sharpe ratio is the goal of your trading strategy (as it should be, given what I said in Chapter 6), then you should be trading at high frequencies, rather than holding stocks overnight. What are high-frequency trading strategies, and why do they have superior Sharpe ratios? Many experts in high-frequency trad- ing would not regard any strategy that holds positions for more Year P&L in $ Maximum Drawdown in $ 2012* –7,180 –8,070 2013* 5,950 –1,219 2014* 40 –3,168 2015* –2,770 –4,325 2016* 530 –1,166 * Out-of-sample results. Unlike the gasoline trade, this natural gas trade didn’t hold up as well out-of-sample. Natural gas futures are notoriously volatile, and we have seen big trading losses for hedge funds (e.g., Amaranth Advisors, loss = $6 billion) and major banks (e.g., Bank of Montreal, loss = $450 million). Therefore, one should be cautious if one wants to try out this trade—perhaps at reduced capi- tal using the mini QG futures at half the size of the full NG contract. Chan800064_c07.indd 186 6/7/2021 7:16:59 AM 100 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 190 QUANTITATIVE TRADING SUMMARY This book has been largely about a particular type of quantitative trading called statistical arbitrage in the investment industry. Despite this fancy name, statistical arbitrage is actually far simpler than trading derivatives (e.g., options) or fixed-income instruments, both conceptually and mathematically. I have described a large part of the statistical arbitrageur’s standard arsenal: mean reversion and momentum, regime switching, stationarity and cointegration, arbi- trage pricing theory or factor model, seasonal trading models, and, finally, high-frequency trading. Some of the important points to note can be summarized here: • Mean-reverting regimes are more prevalent than trending regimes. • There are some tricky data issues involved with backtesting mean-reversion strategies: Outlier quotes and survivorship bias are among them. • Trending regimes are usually triggered by the diffusion of new information, the execution of a large institutional order, or “herding” behavior. • Competition between traders tends to reduce the number of mean-reverting trading opportunities. • Competition between traders tends to reduce the optimal hold- ing period of a momentum trade. • Trading parameters for each day or even each trade can be opti- mized using a machine-learning-based method we called CPO. • A stationary price series is ideal for a mean-reversion trade. • Two or more nonstationary price series can be combined to form a stationary one if they are “cointegrating.” • Cointegration and correlation are different things: Cointegration is about",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:43.611245"
}