{
  "id": "559aa4545870",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 71,
  "content": "extreme low. Furthermore, it is entirely possible that the stop will be hit on a drop to an even more extreme low. If this happens and you are stopped out of the position on a fakeout, it is necessary to rebuy with a new stop beyond the new, lowest extreme. r In practice, if you are concerned about the particular market for some reason—for instance, an impending report or something else that could generate excessive volatility—you may want to have smaller size on the trade. One way to accomplish this is to set the initial stop farther away. This is a tool to be used only in rare, ex- treme cases. There are many examples of my initial stops and subsequent trade management deci- sions in Chapter 10. In addition, the trade templates in Chapter 6 also feature discussions on initial stop placement for each of those patterns. These are speciﬁc examples, but the principles can be adapted to your own personality and your own trading style. The most ily CB Richard EDis Group CBG • Da 29.00 ?!~I~!-11~----- !O~~ ~l\\~----.___ \\ :: I _If--· ,• I~ ·--~--~ 2'00 t .!l~~~/ I w .1,__ 2300 ,- .... ------.. ,, 00 , Mar 107 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c08 JWBT634-Grimes May 10, 2012 7:48 Printer: Hamilton Printing 238 TRADING STRATEGIES and then placing a stop a certain distance from that extreme point. Each day, the stop is moved closer to that extreme point by an amount called the acceleration factor ; this factor also increases every day so the stop is ratcheted in at an ever-increasing rate. If the market trends strongly, the Parabolic stop level will trail behind, but if the market reverses or goes ﬂat, the acceleration factor will usually force a trend change indication very quickly. Originally, if this stop level was reached, the trend was deemed to have changed and you were also supposed to ﬂip your position. Figure 8.2 shows an example of the Parabolic applied to a continuous chart of oat futures. Though it is difﬁcult to trade the Parabolic as a stand-alone system in the always-in context that was originally intended, it can be an extremely useful tool for discretionary traders who can turn to the Parabolic for trailing stop levels in trending markets. It is possible to initiate a position, take your ﬁrst partial proﬁt (if that is in your trading plan), and then use the Parabolic’s levels as trailing stops. When the stop level is hit, exit the position but do not ﬂip. The usual caveat applies: it is a mistake to use any trading tool that you do not completely understand. If you are going to use the Parabolic, do whatever you need to internalize its calculations. If calculating it by hand or in a spreadsheet helps, FIGURE 8.2 The Parabolic System Applied to Oat Futures @O - Daily Oats Continuous Contract [Jul11] Apr Jul 108 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c08 JWBT634-Grimes May 10, 2012 7:48 Printer: Hamilton Printing 242 TRADING STRATEGIES FIGURE 8.3 Partial Exits (Marked with Arrows) at Two Optimal Points Early in the Trade turns back up, but your P&L line now lags the market because you sold some of your position at a small loss, in effect locking in that loss. Figures 8.3 and 8.4 show two scenarios of a theoretical P&L with partial exits com- pared to the underlying market they are tracking. Both traders entered at the left edge of the chart with full trading size, but took partial exits of one-third of their initial position at two points early in the trade. The trader in Figure 8.3 obviously had a working crystal ball, because he knew to take his exits at the high points of the early swings. Conversely, the trader in Figure 8.4 made the worst possible decisions, and took off one-third of his position at the exact low points. The market eventually went higher, and both traders should have proﬁted, but notice that partial proﬁts taken on either side of the line that deﬁnes the entry price will tend to anchor the P&L on that side of the line. Locking in losses makes it very difﬁcult to ever recover those losses. If you are ever considering taking partial exits at a loss, it may make sense to simply exit the entire position at a small loss rather than deleveraging your P&L in the loss space. Use this tool to visual- ize various scenarios and their impact on your bottom line, and carefully consider the impact of these partial exits at a loss. 1,100 1,050 1,000 950 900 - Market -P&L 109 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c08 JWBT634-Grimes May 10, 2012 7:48 Printer: Hamilton Printing Trade Management 243 FIGURE 8.4 The Same Market, with Partial Exits at the Two Worst Points Early in the Trade Adding to Existing Trades There are a few different schools of thought on whether to add to existing trades. Be sure to separate these additions from the case of a normal, planned trade",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.706527"
}