{
  "id": "3c9c791a521c",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 28,
  "content": "by definition, the original rationale for the trade is contradicted. 83 So, it is difficult to combine risk management with fundamental analysis, but quite natural to do so with technical analysis. Once I switched from trading based on fundamental analysis to technical analysis, I went from consistently losing to becoming net profitable. When I started using technical analysis, I also started using risk management, and that made all the difference. One of the trades I remember best in my whole life was a losing trade. It was early on in my using the combination of technical analysis and risk management. The Deutsche mark had witnessed a large slide and then settled into a sideways range for four or five months. I interpreted this price action as the market forming a base. I went long in the trading range and placed a stop 15 ticks below the low of the range. For weeks thereafter, the market continued to move sideways within the range. Then it broke below the range and stopped me out. I was initially disappointed. But then, in the ensuing days and weeks, the market continued to head straight south, and the great thing was that I was not in the trade. I think it is one of my best trades because I took only a small loss despite being dead wrong on the market. My takeaway is that your best trades can be losing ones because they allow you to have the capital to place winning ones. There was a time when I was obsessed with trading. I would look at charts all day, then come home and look at charts all night. In a way, it was a good obsession because I enjoyed it, but at the same time, it was also an unhealthy one because it took so much time. I’m curious, how did you find time to trade and do your director of research job? It was never an issue because trading was always a sideline. First, I only traded periodically. And, even when I was trading, I would review the charts in the evening to decide on trades; I wasn’t trading intraday. Why did you trade only periodically? As I mentioned before, my modus operandi was always to start trading with a small amount of money—the definition of “small” increasing over time. That way, when I lost, I only lost a small amount while retaining the opportunity each time to substantially multiply my initial risk capital. If I lost my starting 84 stake, I would stop trading for months or sometimes even years. Even when I multiplied my starting stake substantially, once I hit a significant drawdown, I usually stopped trading. I would resume trading when I had a genuine desire to do so and when I had sufficient time. Because of this approach, there were many periods when I wasn’t trading at all. I was OK with that because I never considered trading a vocation, only a hobby to be indulged when I wanted to do it and had enough time—which often was n ot the case. Also, I realized that I didn’t have any particular skill in trading. On the contrary, some of my natural traits, such as impatience, make me poorly attuned to being a trader. I managed to be net profitable in trading only because of what I knew, not because I am a good trader. Bottom line: Although I started thinking I wanted to be a trader, I realized I didn’t have the requisite talent to do it well. Do you believe only people with innate skill and the right personality can be successful traders? To some extent that’s true. Anybody can become better at trading through knowledge and by incorporating key principles like risk management and learning the right things to do and not to do. But to achieve outstanding success as a trader requires some innate ability. Not everyone can be a sports star or a great musician. You need some inborn talent. Why should trading be any different? What is the story behind writing your first book? More than 40 years ago, in the early 1980s, an industry acquaintance, Perry Kaufman, was putting together a book called The Handbook of Futures Markets, an enormous anthology of articles on the futures markets. I think he wrote one or more chapters on trading systems, which was his specialty, but for the bulk of the book, he recruited different experts in the industry to write a chapter on a specific topic. He asked me to write a chapter on fundamental analysis, and I agreed. I started working on it, and at some point, I had 80 pages and wasn’t remotely near finished. I realized that my topic, fundamental analysis, was far too broad to be covered in a chapter. I also thought it would be crazy to write such an extensive exposition for someone else’s book. I figured I had unintentionally started writing my own book. I thought I perhaps had one- 85 third of such a book already done, so I might as well finish the task. I was wildly over-optimistic. As it turned out, I only had about one-tenth of what would be my first book done. Perry’s request was the initial catalyst for writing my first book, but there was also another motivation. At that time, I didn’t think there was a good, comprehensive book on futures market analysis and trading. I thought I could write one that was better than anything else that was available. So, I took a sabbatical to finish the book I had inadvertently started. I called Perry and told him that what I had written so far was too lengthy to be offered as a chapter in his book. I told him I had decided to write my own book and could offer him one of the chapters in that book as a chapter in his. He understood and was fine with the substitution. I then took a sabbatical to work",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "fundamentals",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T00:37:44.182384"
}