{
  "id": "c546ab50f70b",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 97,
  "content": "turns back down shortly after C, and there are not as many winning days above $500 as at the beginning of the chart. D: Finally, the trader’s P&L seems to be back under control, and the last part of the chart looks very much like the beginning, though the degree of variation (spread of the bands) is higher. This chart will serve the needs of most traders, but another possibility to consider is the Range Control Chart. This chart, shown in Figure 12.6, can be a useful complement to other P&L analyses. The procedure for creating this chart is simple: r For each period being evaluated (day, week, or trade), plot the raw data as a bar. r Choose a look-back period (20 days was used in Figure 12.6), and also plot the high and low for the look-back period. Consider the lessons of this chart in conjunction with the previous example: A: Variation is increasing, but it is increasing because of more large winning days. This is good because it suggests that even though the trader’s returns may be becoming more volatile, the variation is positive rather than being equally spread around zero. B: The high/low bands contract, highlighting the reduction of variation already seen on the previous chart. FIGURE 12.6 Range Control Chart 30,000 25,000 20,000 15,000 10,000 5,000 0 - 5,000 -10,000 1,500 1,000 500 0 - 500 -1,000 1,500 1,000 soo ,---,-\"'----\"--\" 0 -500 -1,000 -Actual - Proforma 1% Risk 147 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c12 JWBT634-Grimes May 10, 2012 8:16 Printer: Hamilton Printing Becoming a Trader 397 FIGURE 12.7 Three Control Charts C: Variation is once again increasing, but now more symmetrically. This may temper our optimism at the end of the previous analysis a bit. The trader is making money, but why is more of the volatility to the downside in this period compared to the ﬁrst part of the chart? Where have the large winning days gone? One more chart that some traders ﬁnd useful is a Win Ratio Control Chart, which is calculated by plotting a moving average of the win ratio over a look-back period. Though too much attention on win ratio is counterproductive, a shift in win ratio can be a harbinger of trouble to come, and it may be possible to identify problems before they become expensive. Figure 12.7 reproduces the ﬁrst two charts, with the addition of a Win Ratio Control Chart also using a 20-day look-back period. Consider what informa- tion a careful analysis of these three together can give the trader. Note that there are two large declines in win ratio, all of which may point to some potential issues with trading performance. Again, the answers to most trading problems are not on these charts, but in many cases, the right questions are. SUMMARY Trading is difﬁcult. Markets are highly random and nearly unpredictable, diverse and un- foreseeable risks crop up at every turn, and traders themselves are vulnerable to many 1,S00 1,000 500 0 -500 -1.000 1,500 1,000 500 J---~ ~---d 0 -500 - 1,000 100% 90% 80% 70% 60% 50% 40% .L----------------------------------------- 148 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp01 JWBT634-Grimes May 11, 2012 8:31 Printer: Hamilton Printing APPENDIX A Trading Primer A t ﬁrst glance, the process of making a trade seems to be simple. Someone wanting to buy an item meets with a potential seller, they agree on a price, and money is exchanged in return for the item. Even the most complex trading ideas begin with this concept. The mechanics may be much more complicated—perhaps the buyer and seller negotiate through a sophisticated electronic medium. Perhaps the item is actually a sophisticated ﬁnancial instrument or set of instruments. Perhaps there are complica- tions such as currency adjustments or ﬁnancing costs to be considered, or perhaps the transaction is merely arranged to occur at a future point in time. Regardless, this basic meeting of buyer and seller—weighing of value against value— is the very essence and the root of all market activity. Many books begin by saying that a trade occurs when a buyer and a seller agree on value, but this is not entirely correct. If this were so, if the parties truly agreed that the price represented the fair value of the asset, that one was equal to the other, wouldn’t they each be willing to immediately unwind the trade and even to take the other side? This is almost never the case. In simple buying or selling transactions (excluding spread- ing and hedging, which we will get to in a minute) the buyer is willing to part with the money because he believes the asset will offer him more value in the future than the money he gave up. The seller has made a decision that the utility value of the money she will receive exceeds the value she would get from continuing to own the asset, so each participant has made an assessment of value that might be unique to his or her particular situation at that point in time. Rather than an agreement, each and every trade that oc- curs in the market represents a disagreement over the value of the money and the assets being exchanged. 399 149 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately.",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.710534"
}