{
  "id": "67ed1f34dd98",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 6,
  "content": "trade in a market where there is a chance that the opposing trader will default on a contract. If a trader purchases an option, he wants to be certain that the seller will fulfill the terms of the contract if the option is exercised. In order to guarantee that the integrity of the market will be maintained, each options exchange has established a progression of responsibility for the fulfillment of the terms of an option. The primary responsibility falls to the individual trader. If the seller of an option is assigned, he must be prepared to take the required long or short position in the underlying contract at the specified exercise price. In practical terms, this means a trader must have access to capital at least equal to the option’s intrinsic value. If an individual trader is unable to fulfill the terms of the contract, the responsibility falls to the trader’s clearing firm. A clearing firm isa member firm of the exchange which processes trades made by an individual, and which agrees to fulfill any financial obligation arising from those trades. No individual may trade on an exchange without first becoming associated with a clearing firm. If the clearing firm cannot fulfill the terms of the contract, the final responsibility rests with the clearing house. Each exchange has established, or has become a member of, a clearing house which guarantees the integrity of all trades. Once an option trade has been made, the connection between the buyer and seller is severed, with the The Language of Options 9 clearing house assuming the role of buyer from every seller, and seller to every buyer. if there were no central clearing house, the buyer of an option would be totally dependent on the good faith of the seller or the seller’s clearing firm to fulfill the terms of the option in the event of exercise. Because the clearing house guarantees every trade, all buyers can be certain there will be an opposing party prepared to make or take delivery if an option is exercised. The clearing process is shown in Figure 1-8. This system of guarantees has proven effective in ensuring the integrity of options exchanges. While individual traders and clearing firms occasionally fail, a clearing house has never failed in the United States. MARGIN REQUIREMENTS When a trader makes an opening trade on an exchange, the exchange may require the trader to deposit with the clearing house some amount of margin, or good faith capital.4 Such deposits ensure that if the market moves adversely, the trader will still be able to fulfill any future financial obligations resulting from the trade. In lieu of cash, margin requirements may often be met by depositing government treasury instruments or, less commonly, commercial securities. Clearing firms collect these margin requirements from their traders and forward the funds to the clearing Figure 1-8: The Clearing Process If reports from both clearing firms match, the trade becomes official. | > | Clearing House <7] If the reports do not match, they are returned to each Buyer's clearing firm pean vn ane there reports trade to 0 Ine fi vat ual traders reports trade to Clearing house. for rectification. clearing house. i , t Buyer's Clearing Firm [Seller's Clearing Firm | Seller’s clearing firm Buyer reports trade Seller reports trade to his cleanng firm. to his clearing firm. a Buyer and seller agree on a contract, quantity, and price. Margin requirements for a professional trader in an equity option market are referred to as a Aaircut. 10 Chapter I house. In theory, margin deposits at the clearing house still belong to the individual trader and, as such, any interest or dividends accruing to the margin deposit also belongs to the trader. Some clearing firms, however, do not return this interest to the trader, claiming that it is part of the fee paid by the trader for the clearing services of the member firm. This can occasionally become a sensitive point between trader and clearing firm, and should be settled before an individual begins to trade. Margin requirements for both options and underlying contracts are set by the clearing house, using as guidelines the current value of the position as well as the potential risk. While an underlying position, particularly if itis a futures contract, usually has a fixed margin requirement, the margin for an option position can change over time since the margin for an option often depends on the amount by which it is in- or out-of-the-money. Positions consisting of a combination of options, or options and underlying instruments, may have reduced margin requirements because the risk to one contract may be partially offset by the value of another contract. Additionally, traders who are exchange members may receive professional consideration in the form of reduced margin requirements. Every trader should become familiar with the margin requirements for the market in which he is trading. Doing so will ensure that he has sufficient capital to initiate and hold positions as long as he deems necessary. SETTLEMENT PROCEDURES New option traders are often confused because settlement procedures may vary from one exchange to another. Indeed, settlement procedures for an option and its underlying contract may differ. Two methods are commonly used to settle exchange-traded contracts—stock-type settlement and futures-type settlement. Suppose a trader buys 100 shares of a $50 stock. The value of the stock is $5,000, and the buyer is required to pay the seller the full amount. If the stock rises to $60 per share, the owner of the stock will show a profit of $10 per share, or a total profit of $1,000. Even so, he won’t be able to actually spend this $1,000 profit until he formally liquidates the position by selling his 100 shares at $60 per share. This type of settlement procedure, where purchase requires full and immediate payment, and where profits or losses are unrealized until the position is liquidated, is known as stock-type settlement. In contrast to stock-type settlement, futures-type settlement requires",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.423069"
}