{
  "id": "cc2937e61101",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 27,
  "content": "ma k e up f or t h e l oss, h e d isregar d s money management an d increases position size su b stantia ll y. His initia l goa l is to re d uce oversizing h is tra d es b y 70 percent over t h e next two wee k s. T h ere are two t h ings to note h ere. T h e fi rst is t h at Ammar ’s goa l is state d in speci fi c terms against a sc h e d u l e. He is l oo k ing to re d uce h is overtra d ing b y 70 percent b y t h e en d o f two wee k s. It is critica l t h at goa l s b e speci fi c . We d iscuss more about the details of framing goals in Part III. The second thing to note is that Ammar isn ’t l oo k ing to e l iminate a ll oversize d tra d es rig h t away . W e are a ll h uman an d we a ll h ave our l imitations. By stating h is goa l as l ess t h an 100 percent, h e is ac k now l e d ging and making room for the fact that he won’t get it right all at once. Making an impor - tant c h ange l i k e t h is is a process. W e aren ’t l oo k ing f or per f ection. Reac h ing a goa l o f 70 percent wi ll d emonstrate so l i d commitment an d a strong tren d in overcoming h is erratic tra d ing b e h avior. In a dd ition, it gives Ammar a l itt l e ‘psyc h o l ogica l cover ’ to come up s h ort. W e a l rea d y k now t h at h e can b e h ar d on h imse lf w h en h is tra d es end in loss. There is no reason to promote self‐criticism when fallin g short of the be - h aviora l c h an g e you are envisionin g . Give yourse lf a l itt l e room an d , a b ove a ll , d on ’t become harsh and self‐critical when you don’t g et it exactly 100 percent ri g ht away. Remember, this is a p rocess. Look for the trend. T h e p l an f or your initia l g oa l is t h e vita l component o f t h is exercise. In Ammar ’s case, takin g a short break to do a brief mindfulness exercise structured on the acceptance exercise will help Ammar keep his mind in the moment and fortif y him f or c h an g in g h is b e h avior. He a l so remin d s h imse lf o f t h e importance o f b ein g a Exercise 8.4 Overcoming My Challenging Trading Situation What I stand for in my trading: My challenging situation: My Goals:My initial goal: My longer‐term goal: Plan for my initial goal: What will present the greatest challenge for me: How I will meet that challenge: 197ACCEPTANCE AND COMMITTED TRADING TABLE 8.2 Ammar’s Challenging Trading Situation What I stand for in my trading: S teadines s My challenging situation: Increasin g position size a f ter a l os s My Goals: My initial goal: T o notice when I am vulnerable to oversizing my position and to r educe this behavior by 70 percent over the next two weeks o f t ra d in g My longer‐term goal: Eliminate placing outsized positions completely within 45 days Plan for my initial goal: ( 1) Imme d iate l y a f ter a l osing tra d e l eave my tra d ing d es k an d engage in a 10‐minute a bb reviate d acceptance exercise. (2) A ff irm m y commitment to b eing a stea d y tra d er an d state to myse lf t h a t increasing position size runs against h ow I want to tra d e. (3) Be f ore t a k in g t h e next tra d e, recon f irm my commitment to b e a stea d y t ra d er an d tra d e wit h a pp ro p riate size . What will present the greatest challenge for me: T he tension and agitation I feel for having a loss along with the t hou g hts and emotions that I failed . How I will meet that challenge: Rat h er t h an try an d f ig h t t h em, I wi ll notice t h e tension in my b o d y an d a l so ac k now l e d ge t h e t h oug h ts o f f ai l ure an d t h e emotiona l unease t h at t h ese b ring. I wi ll app l y min df u l ness an d recognize t h a t th ese are on l y t h oug h ts an d f ee l ings t h at wi ll soon l eave me. T a k ing a f ew d eep b reat h s, I wi ll ma k e room f or my unwante d t h oug h ts an d f ee l ings, remin d myse lf t h at stea d",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "psychology",
    "risk_management"
  ],
  "created_at": "2026-02-05T00:37:45.720661"
}