{
  "id": "7968e4bf93c3",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 70,
  "content": "IBM stock or June IBM stock. THE EFFECT OF CHANGING INTEREST RATES AND DIVIDENDS Thus far we have considered ony the effects of changes in the price of the underlying market and changes in volatilityon the value of volatility spreads. What about changes in interest rates and, in the case f stocks, dividends? Because there is no carryinj cost associated with the purchase or sale of a futures contract, interest rates have onlya minor impact on futures options, and, consequently, a negligible effect on the value o futures option volatility spreads.‘ If, however, we are trading stock options and changethe interest rate, we change the forward price of stock (the current stock price pius th: carrying cost on the stock to expiration). When all options expire at the same time as they do in backspreads and ratio vertical spreads, the forward stock price for all options remains the same, so that the effects of the change are practically negligible. If, on he other hand, we are considering stock options with different expiration dates, we mut consider two different forward prices. And these two forward prices may not be equaly sensitive to a change in interest rates. For example, consider the following situation: 4. Interest rates can of course affect te relative value of different futures months. As noted, we can offset this risk by trading a futures spreal along with the futures option time spread. Volatility Spreads 155 Stock price = 100 Interest rate = 12% Dividend = 0 Suppose a trader initiates a long time spread: long 10 June 100 calls short 10 March 100 calls If there are three months remaining to March expiration and six months remaining to June expiration, the forward prices for March and June stock are 103 and 106, respectively. If interest rates drop to 8 percent, the forward price for March will be 102 and the forward price for June will be 104. With more time remaining, the June forward price is more sensitive to a change in interest rates. Assuming the deltas of both options are approximately equal, the June option will be more affected in total points by the decline in interest rates than the March option, and the time spread will narrow. In the same way, if interest rates increase, the time spread will widen because the June forward price will rise more quickly than the March forward price. Therefore, a long (short) call time spread in the stock option market must have a positive (negative) rho. Changes in interest rates have just the opposite effect on stock option puts. In our example, if interest rates fall from 12% to 8% the March forward price will fall from 103 to 102, while the June forward price will fall from 106 to 104. Again, if we assume that the deltas of both options are approximately equal, and recalling that puts have negative deltas, the June put will show a greater increase in value than the March put. The put time spread will therefore widen. In the same way, if interest rates increase, the put time spread will narrow. Therefore, a long (short) put time spread in the stock option market must have a negative (positive) rho. The degree to which stock option time spreads are affected by changes in interest rates depends primarily on the amount of time between expiration dates. If there are six months between expiration dates (e.g., March/September) the effect will be much greater than if there is only one month between expiration dates (e.g., March/April). Changes in dividends can also affect the value of stock option time spreads. Dividends, however, have the opposite effect on stock options as changes in interest rates (see Chapter 3). An increase (decrease) in dividends lowers (raises) the forward price of stock. If all options in a volatility spread expire at the same time (backspreads, ratio vertical spreads), the forward stock price will be identical for all options and the effect on the spread will be negligible. But in a time spread, if a dividend payment is expected between expiration of the short-term and long-term option, the long-term option will be affected by the lowered forward price of the stock. Hence, an increase in dividends, if at least one dividend payment is expected between the expiration dates, will cause call time spreads to narrow and put time spreads to widen. A decrease in dividends will have the opposite effect, with call time spreads widening and put time spreads narrowing. The effect of changing interest rates and dividends on stock option time spreads is shown in Figure 8-15. Even if both options are deeply in-the-money, a call time spread in the stock option market should always have some value greater than zero. If volatility is very low, the spread should still be worth a minimum of the cost of carry on the stock between 156 Chapter 8 Figure 8-15 The Effects of Changing Interest Rates on Stock Option Time Spreads Stock Price = 100; Volatility = 20%; Dividend = 0 Time to March expiration = 6 weeks Time to June expiration = 19 weeks If interest rates are... 0% 3% 6% 9% 12% June 100 call 4.81 §.35 5.92 6.52 7.15 March 100 call 2.71 2.88 3.05 3.24 3.43 Call Spread Value 2.10 2.47 2.87 3.28 3.72 June 100 put 4.81 4.26 3.76 3.30 2.88 March 100 put 2.71 2.53 2.37 2.21 2.06 Put Spread Value 2.10 1.73 1.39 1.09 82 The Effect of Changing Dividends on Stock Option Time Spreads Stock Price = +00; Volatility = 20%; Interest Rate = 6.00% Time to March expiration = 6 weeks Time to June expiration = 19 weeks If the quarterly dividendls... 0 1.00 2.00 3.00 4,00 June 100 call 5.92 4.81 3.82 2.97 2.26 March 100 call 3.05 2.53 2.07 1.66 1.31 Call Spread Value 2.87 2.28 1.75 1.31 95 June 100 put 3.76 4.62 5.62 6.75 8.01 March 100 put 2.37 2.84 3.37 3.96 4.62 Put Spread Value 1.39 1.78 2.25 2.79 3,39",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.433113"
}