{
  "id": "dfc4e91df100",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 117,
  "content": "of early exercise, can increase or decrease as the underlying market rises or falls, conversions and reversals using American options are not delta neutral. While these strategies may be unbalanced by only two or three deltas, the fact that they are often done in large size can result in an additional risk that the trader cannot afford to ignore. This also applies to boxes and jelly rolls, which are simply combinations of conversions and reversals. Consider these option values: Stock price = 100; Volatility = 25%; Interest rate = 8.00%; Dividend = 0 Time to expiration: March = 3 months, June = 6 months European European American American Option Value Delta Value Delta March 95 call 9.00 73.7 9.00 73.7 March 95 put 2.13 -26.3 2.24 -27.8 March 100 call 5.97 58.8 5.97 58.8 March 100 put 4.00 -41.2 4.20 -44.0 June 95 call 11.96 72.7 11.96 72.7 June 95 put 3.24 27.3 3.49 -29.9 June 100 call 9.03 62.3 9.03 62.3 June 100 put 5.11 -37.7 5.55 -42.1 254 Chapter 12 We can see how the possibility of early exercise affects the values and deltas of various arbitrages: European European American American Strategy Value Deita Value Delta March 95/100 box 4.90 0 4.99 -1.3 June 95/100 box 4,80 0 4.99 -1.8 March/June 95 jelly roll 1.85 0 1.71 +1.1 March/June 100 jelly roll 1.95 0 1.71 +1.6 Boxes become more valuable using American options because a trader who is long the box owns a put with a higher exercise price. If a trader buys the 95/100 box, he is longa 95 call and a 100 put, and short a 95 put and 100 call. The 100 put will become an early exercise candidate before the 95 put, making the American box more valuable than the same European box. The delta of the box is negative with American options because a trader who owns the box would like the market to decline so that he will be able to exercise the 100 put as quickly as possible. Jelly rolls become less valuable using American options because a trader who owns the jelly roll has sold a long-term put. If a trader buys the March/June 100 jelly roll, he is longa March 100 put and June 100 call, and is short a March 100 call and June 100 put. The June 100 put, being a longer term option, has more potential for early exercise than the March 100 put. The delta of the jelly roll is therefore positive because there is a greater danger of being assigned on the June 100 put. Hence, the trader who owns the jelly roll would like the market to rise so that he is less likely to be assigned on the June 100 put. A unique, early exercise situation affecting the value of boxes can also arise in a stock option market if there is a tender offer to buy a portion of the stock in a company. For example, with a stock trading at 100, one would expect to see the 100/105 box trading at close to five points. But suppose that a tender offer is made to buy half the outstanding shares at a price of 110. A trader who owns the 100/105 box will exercise his 100 calls in order to be able to tender stock. If he tenders 1000 shares, he might expect half, or 500 shares, to be accepted at the tender price of 110. But after the tender is completed, because it was for only half the outstanding shares, the stock price will return to its pre-tender price of 100. The trader’s remaining 500 shares will still be trading at 100. In other words, prior to the tender offer the 100 calls are worth 10, but after the tender the 105 puts are worth a minimum of five. Of course, one cannot say that the box is worth 15, because only half the outstanding shares are worth 110. The other half are worth 100. Still, the 100/105 box is likely to trade for significantly more than its usual price of five. The possibility of early exercise can also affect arbitrage strategies in the futures option market, but the difference between American versus European values is much less than in the stock option market because there is less interest consideration associated with futures options. For practical purposes, unless the options are very deeply in-the-money or are very long-term, the difference between American and Early Exercise of American Options 255 European vaiues for futures options is negligible. Some sample option and arbitrage values are shown below (we assume that all options are subject to stock-type settle- ment): Futures price = 100; Volatility = 25%; Interest rate = 8.00%; Time to expiration: March = 3 months, June = 6 months European European American American Option Value Delta Value Delta March 95 call 7.60 66.9 7.67 67.5 March 95 put 2.70 ~31.2 2.73 -31.3 March 100 call 4.88 51.5 4.88 51.8 March 100 put 4,88 46.6 4,88 -46.9 June 95 call 9.27 62.2 9.34 63.5 June 95 put 4,46 33.9 4.48 -34,2 June 100 call 6.76 51.4 6.80 52.2 June 100 put 6.76 -44,7 6.80 ~45.4 European European American American Strategy Value Delta Value Delta March 95 conversion 4.90 +1.9 4.94 +1.2 June 95 conversion 4.81 +3.9 4.86 +2.3 March 100 conversion 0 +19 0 +1.3 June 100 conversion 0 +3.9 0 +2.4 March 95/100 box 4.90 0 4.94 +.1 June 95/100 box 4.81 0 4.86 +.1 March/June 95 jelly roll 1.85 0 1.71 +11 March/June 100 jelly roll 1.95 0 1.71 +1.6 Many new traders seem to worry unduly about the possibility of early exercise: “If Tsell an option, what happens if I am suddenly assigned?” It is true that sometimes early assignment can cause a loss. But there are many factors which can cause a trader to lose money; early exercise is only one such factor. A trader should be prepared to deal with the possibility of early exercise just as",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.440161"
}