{
  "id": "49bf51e36313",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 119,
  "content": "on pivot points and market structure.) swing trading Formally, a style of trading that seeks to proﬁt from the next swing in the market. Swing traders generally do not scale in, and do not attempt to hold through large, adverse price movements. Informally, many writers use this term to describe the trader who focuses on three-day to two-week holding periods, but this is a faulty deﬁnition of the term. systematic trading Usually refers to a style of trading that is rule-based and that could be at least partially computerized. tail risk The risk of large outlier events at the tails of a probability distribution. These risks are mostly unhedgable except at great cost, and they create serious problems for traders and risk managers. technical analysis Technical analysis is the discipline of gauging the probabilities of future price movements and/or volatility conditions based on information contained in price changes themselves. theory of mind (ToM) The ability to attribute mental states and emotions to others, and to understand that they have beliefs, desires, and intentions different from our own. Some researchers postulate that this theory also forms the basis for market intuition. 190 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing Glossary 441 three pushes A typical end-of-trend pattern consisting of three symmetrical (in both price and time) pushes to a new high or a new low, followed by a reversal that shows a distinct change of character. time frame Usually means the time period of the bars on the chart. For example, the 5- minute time frame would refer to a chart with 5-minute bars. Can also be used to describe a scheme where a trader looks at several time frames of the same market, and refers to them as lower, higher, and trading time frames. trading time frame (TTF) In the three time frames scheme, this is the main, or focus, time frame. Lower and higher time frame charts may support decisions made based on the trading time frame. trailing stop A system of trade management that moves the stop to lock in proﬁts as the trade moves in the intended direction. transaction costs The costs involved in participating in a market. They cover all ﬁnanc- ing, commissions, fees, the bid-ask spread, and any adverse effect your own order has on prices. Most traders, particularly retail traders, have a poor understanding of transaction costs. trend continuation A class of trades that seeks to enter an established trend in the direc- tion of that trend. Many trend continuation trades are based on entering in consolidation areas or pullbacks. trend following An entire industry has been built around the term trend following. Many adherents of this school claim that trend following is far superior to other methods of trading, that it is easier than other types of trading, and that it essentially is the holy grail. None of these things are true. Trend following is a style of trading that usually attempts to position with a trend, with the idea that the trader may have to sit through signiﬁcant whipsaws and drawdowns. trend termination A class of trades that seeks to enter an established trend against the direction of that trend, with the idea that the trend is coming to an end. Note that these trades are not simply plays for trend reversal, as many of them will simply transition into trading ranges. true range The range of the bar plus any gap from the previous close. In other words, if the low of the current bar is above the previous bar’s close, the range of the current bar is the high-low. The true range of the bar is the range + (current bar’s low − previous bar’s close). t-test A common statistical signiﬁcance test. typical price The average of the high, low, and close for any trading bar. upthrusts The opposite of Wyckoff’s springs: price thrusts above resistance and im- mediately fails to carry through. This is also a type of failure test and a sign of classic distribution. variance The square of standard deviation, and a measure that is not particularly useful in most market applications because the units are units squared. (For instance, variance of price changes in USD would be in units of USD 2.) volatility clustering The tendency of high and low volatility areas to cluster together in market-derived time series. This is also a reﬂection of markets moving through different volatility regimes. 191 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing 442 GLOSSARY walk-forward testing A complement to backtesting, in which rules are applied to his- torical prices. In walk-forward testing, the rules are applied to fresh market data as it is generated. This is essentially a form of papertrading. weak form EMH A form of the EMH that holds that information contained in past prices cannot be used to predict future prices. If this form of EMH is true, then the discipline of technical analysis is invalid. whipsaws The tendency for many technical tools, systems, or indicators to accumulate many small losses while markets chop back and forth in trading ranges. For many of these systems, whipsaws are an unavoidable fact of life and must be offset by proﬁts from trending markets. z-score Also called a standard score, normal score, or a z-value: the number",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.714010"
}