{
  "id": "ebbd186169ad",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 12,
  "content": "travel. Was it just that, or was it because you perceived market conditions were less favorable? I had done so well for so long. My friends who were newbies weren’t texting me anymore. They were losing. I wasn’t making any money. It was just a perfect time to walk away. I took a break until August of this year [2022] when lithium prices broke out to multiyear highs and went parabolic. This price action got me super motivated. I am incredibly bullish on lithium equities for the next few years and think it’s going to be the price move of my career. There is a once-in-a-lifetime demand/supply imbalance that is starting, which has allowed the price of lithium to defy gravity. We are seeing a massive increase in EV penetration globally. This year, China is expecting 100% year-over-year growth in EV sales. Next year, they are expecting 100% growth again. US EV sales are running about 60% higher than last year, and the trend is strengthening. Lithium prices have increased tremendously, while lithium equity prices have not increased that much. So, I think there is a massive opportunity in lithium equities traded on 42 American exchanges. It is such a small sector that when these stocks go into play, I believe they will go far beyond what anyone could fathom. You have had this idea for a long time. What has changed? The change is the rise in lithium prices. A year ago, lithium prices were already high at $20,000 a ton. They recently went to $85,000. My playbook is to be heavily long lithium miners for the next three years, then roll the proceeds into solid-state battery companies, and then several years later roll my investment into recyclers, riding what I anticipate will be a giant electrification trend. I feel in my bones that this will be the biggest trade of my life, and I am all in. 43 Chris Camillo Neither Three years later How is it going? I’m trying to survive. It’s been a wild, wild year. Has 2022 been your toughest year? Oh, by far. Nothing has come even remotely close. As you might remember, my methodology involves identifying change, whether it is consumer behavior, cultural shifts, or trending products, and recognizing that change early. For this methodology to work, you need a stable market. You don’t want macroeconomic factors to become more important than the company- specific information you are trading on. This year is my worst nightmare. The market is being driven by macro events, which are far outside my area of expertise. This is the year for me to be trading less. I’ve been trying hard not to do a lot this year. What kind of macro events are you referring to? Supply chain issues that might prevent companies from being able to produce enough product even if they have excess demand. Also, inflation, which can increase a company’s labor and input costs and negatively impact its earnings even if revenues are up. I could be right about a company having abnormal demand for its product that the market can’t see, but what I might not see is that the company’s inability to manufacture sufficient product that quarter could negate my entire thesis. There is a situation where I did 44 my job and have an edge, but I don’t see things that are more important than the edge I have, and my trade doesn’t work. Can you give me an example? ON Holding [symbol: ONON], which makes running shoes, reported earnings today [November 16, 2022]. I anticipated that they would have the biggest sales quarter in the company’s history and were likely to raise sales guidance. Typically, when I expect a company to crush the quarter and increase sales guidance, I would place a very large bet. The bet I placed on that company before today’s earnings release was probably less than 5% of the position I usually would have had. The company did great on revenues and raised the revenue estimate for the next quarter. But due to the impact of inflation on product cost and their inability to produce as much product as they wanted because of supply issues, they missed earnings. I knew there was a real risk of that happening, so I placed a small bet. What has been critical for me this year is understanding I don’t know what I don’t know. What I do requires that information will be correlated to investors’ perception of a company’s value. When that ceases to be the case, it doesn’t matter how good my information is. It doesn’t matter how early I can detect change because that change impacting customer demand is not the essential thing that is happening to that company. The most important thing for that company might be that they can’t make enough of their product or that the cost of their product has gone up quicker than their ability to raise retail prices. You have to come to terms with the fact that the thing you do well might not matter at a given time. That is something a lot of traders have trouble accepting. They always want to believe that they can do something better than anyone else in any environment. You responded correctly to a challenging environment by drastically cutting your trading size. Given that, are there any trades that had a significant negative impact on your equity this past year? If there is one thing that I wish I had done differently this year, it is how I managed my position in Amazon. Amazon was a multiyear trade. As you 45 know, most of my trades last weeks or months, not years. Amazon was a super-cycle trade that the market never appreciated until one day it woke up and realized that cloud computing is everything. I had millions of profits in that trade, and I decided I wouldn’t exit the position because I didn’t want to take the tax hit. Amazon is down",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "strategies",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.179996"
}