{
  "id": "3546bebed334",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 13,
  "content": "traders would as- sume that this is indicative of a very strong market, but, statistically, this condition more often indicates short-term exhaustion and at least a slight reversal—be careful of enter- ing with the trend after several bars close on their highs. Trend and Trading Range Bars Large bars relative to recent bars on one time frame most likely contain trends on the lower time frame, especially if the close and open are near opposite ends of the bars. Small bars on one time frame are probably trading ranges on lower time frames, and, in general, bars that have their opens and closes nearer to the center point of the bar are also more likely to have been trading ranges. This is a simple concept, but understanding this dynamic is a key to building intuition about price action and the interaction of time frames. There is much subtlety here, but these are the essential concepts. Figure 1.13 shows lower time frame trends and trading ranges within the three boxes in the left panel that correspond to the three higher time frame bars in the right panel. Do not accept price bars at face value. Always think deeply about what is going on behind the scenes, on lower time frames. 8 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing 24 THE FOUNDATION OF TECHNICAL ANALYSIS FIGURE 1.13 One- and 15-Minute S&P Bars, Showing Lower Time Frame Trading Range and Trend within Higher Time Frame Bars The right panel of Figure 1.14 shows a daily chart of the E-mini S&P 500 futures at a time when the trend on that time frame was losing momentum. What are the signs on this time frame that suggest a loss of momentum? Each bar continues to make a higher high up into mid-April, but at a declining rate. We could characterize these as “reluctant highs,” to indicate waning momentum. In addition, the bars are becoming smaller, in- dicating that trading interest is drying up, and there are no more large trend bars (that open near the lows and close near the highs) in April. On each of the multiple time frame charts in this book, the lower time frame in the left pane expands on the highlighted area of the higher time frame chart on the right. In this case, the lower time frame tells the same story of loss of momentum, but in much more vivid detail. There are multiple fail- ure tests above the highs, as the market spikes to new extremes and is unable to ﬁnd the buying pressure to support itself there. Note that this reversal on the lower time frame could simply be subsumed into a trading time frame consolidation, but the lower time frame clearly shows the change in the buyers’ conviction. 1,327.00 1,326.00 ~ , .. // 1! ',325 .00 ' 1,324.00 1,325.00 1,324.00 ;i ·1i 1,i1□1i \\ .. , 1,323.00 , 1,323.00 , ' ,, , ' 1,322.00 I 1,322.00 r 1,321.00 1,321.00 14:30 14:45 15:00 15:00 9 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing The Trader’s Edge 25 FIGURE 1.14 Three-Hour (Left Pane) and Daily S&P 500 Futures Charts Notice that the lower time frame shows multiple tests and failures at the high. This level of resolution is lost on the higher time frame, which simply shows a gently rounding top. Many traders focus on trading pullbacks. A pullback (also called a ﬂag or consoli- dation) is a move against the prevailing trend. For instance, a pullback in a downtrend bounces against the trend and is an opportunity to enter a short position; a pullback in an uptrend is a decline. Most traders train themselves to see these structures easily, but pull- backs can also be hidden in higher time frames: one or two small bars that hold near the extreme of a trend leg (near the lows in a downtrend or the highs in an uptrend) are often a complete lower time frame pullback. As such, these simple one- or two-bar pullbacks (high and tight ﬂags) are tradable structures in very strong trends, as in Figure 1.15. This is a common and important pattern. Another important pullback pattern in an uptrend has several bars with downward closes separated by a single bar with an upward close. This pattern usually hides a com- plex pullback on the lower time frame, which is a three-legged structure consisting of an initial pullback followed by a small, failed attempt to resume the initial trend. From that second leg, the market turns down again to make another countertrend leg that is usually approximately as long as the ﬁrst one. This is a very common pattern, especially @ES-180 min E-mini S&P 500 Continuous Col!)ract [Jun11] , l ll 11~ 1,330.00 I ,.,~.00 I i'' l'-,,,w.oo j_,,-- ' I I '·\"'\" t '·\"'·' 0 , , 1,320.00 1,260.00 1,250.00 1,315.00 Apr 4/3 4/5 416 4/7 4/8 4/10 Apr 10 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options"
  ],
  "created_at": "2026-02-05T00:37:53.697005"
}