{
  "id": "f960d46af487",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 86,
  "content": "Setup The S&P 500 index, shown in Figure 10.21, had been in a yearlong uptrend and was showing signs of possible overextension on higher time frames. There was no strong down move setting up this countertrend trade, but there were multiple momentum di- vergences and failures on lower time frames that set up the possibility of a successful fade trade. Entry A: The actual entry is slightly more complex in this case. This bar presses to new highs and closes slightly above the previous resistance level. The next day trades high, then reverses to close under the old highs. Entry is on the close of the last bar on this chart. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trend Termination 317 Stop The stop should be around the small, downward-closing candle’s high, which is slightly less than an average day’s range from the entry. It is appropriate to risk less on these trades; having a very large position size (required by the tight stop) near the high of a strong market in a strong trend is potentially dangerous. FIGURE 10.22 First Proﬁt Target Is Quickly Hit The next day (Figure 10.22) saw strong selling, and the 1× proﬁt target was exceeded on this day. Again, even though the market may be very weak, maintain the discipline of these partial exits—this is absolutely crucial to your long-term success with these trades. B: The same concept at work as in the previous example: a brief consolidation breaks down into another down move. This is justiﬁcation for continuing to hold part of the position. C: This is the May 2010 Flash Crash. If you are ever holding a position into such an exceptional move, cover part or all of the position into the move. Do not be greedy and do not play for a one-in-a-million event. On those very rare occasions when the market offers windfall proﬁts, take them. Conclusions This is another exceptional outcome for a failure test trade, but does illustrate the power of this very simple trade entry. Traders who blindly fade trends will suffer loss after loss, while traders working with disciplined technical patterns like this can fade trends safely and effectively. There is also a lesson here in the interaction of @ES - Daily E-mini S&P 500 Continuous Contract [Sep11] ~ 20.00 · ~ -----, r ~ o.oo v -v ,,/ -20.00 '10 Feb l.lar Apr Apr l,lay Jun Jul 130 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Failure Test Failures 319 FAILURE TEST FAILURES On one hand, failures of the failure test pattern are simple—the market makes a new ex- treme and keeps going. However, this understates the potential damage and risk around these points. Some of these trades may fail with large gap moves, forcing the trader to exit far beyond the intended risk point. There is no perfect solution that can avoid all of these cases, but in addition to perhaps trading these with smaller risk, being aware of the patterns that typically set up failure of these patterns can provide additional insight into developing market structure. Failure Test Failure by Consolidation FIGURE 10.23 A Failure Test Fails by Consolidation A: This was an example of a slightly more complex entry on the third bar follow- ing a market high in Figure 10.23. This is an acceptable variation, particularly in the low-volume, preholiday environment of late December, but it is not a model entry. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 320 TRADING STRATEGIES B: This move falls short of the ﬁrst proﬁt target, which is a warning sign. In most cases, the stop and the ﬁrst proﬁt target on failure test trades are both relatively close to the entry price. You should not have to wait more than three or four bars for the proﬁt target to be hit, and many times it will be reached on the ﬁrst bar following the entry. It is justiﬁable to reduce risk in the trade (by exiting part of the position) somewhere following B because the trade is not working as well or as cleanly as expected. C: Exactly how long you hold the trade is a personal decision, but somewhere follow- ing C holding becomes a matter of hoping rather than of positioning with a clean, working trade. In this example, the worst outcome should have been scratching the trade, exiting very near the entry price for a small gain or loss. Failure Test Failure by Consolidation FIGURE 10.24 Another Example of Failure by Consolidation A: The chart in Figure 10.24 shows also another nonstandard entry, but the less-than- perfect outcomes of these trades are probably not due to the quality of the setup patterns. Fossil Inc. (Nasdaq: FOSL) was a fairly illiquid momentum stock during CTH11-Daily C 0 - 1,lar 2011 otton N 2 FOSL O • • a,ly Fossillnc C 130.00 120.00 110.00 1'15.00 105.00 100 .00 95.00 90.00 Ap, ~--..- -·• ••. ~ 7.00 \"'' ~ Jun 1.00 Jul 131 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Failure Test Failures 321 this time period, so it did not trade cleanly around levels. An entry could have been attempted at A, but most traders would have wanted to",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.708848"
}