{
  "id": "1b167db0678a",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 187,
  "content": "and the same exercise price. Strangle—A long (short) call and a long (short) put, where both options have the same underlying contract, the same expiration date, but different exercise prices. Strap—An archaic term for a position consisting of two long (short) calls and one long (short) put where all options have the same underlying contract, the same expiration date, and the same exercise price. Strike Price (Strike)}—Exercise price. Strip—aAn archaic term for a position consisting of one long (short) call and two long (short) puts where all options have the same underlying contract, the same expiration date, and the same exercise price. Also: A series of futures or futures options designed to replicate the characteristics of a long-term contract or option. A Glossary of Option and Related Terminology 429 Swap—An agreement to exchange different cash flows. Most commonly a swap involves exchanging variable rate interest payments for payments calculated from a fixed interest rate. Swaption—An option to enter into a swap agreement. Synthetic—A combination of contracts having approximately the same characteristics as a different contract. Synthetic Call—A long (short) underlying position together with a long (short) put. Synthetic Put—A short (long) underlying position together with a long (short) call. Synthetic Underlying—A long (short) call and short {long} put, where both options have the same underlying contract, the same expiration date, and the same exercise price. Tau (t)—The commonly used notation for the amount of time remaining to expiration. Theoretical Value—An option value generated by a mathematical model given cer- tain prior assumptions about the terms of the option, the characteristics of the underly- ing contract, and prevailing interest rates. Theta (@)—The sensitivity of an option’s theoretical value to a change in the amount of time remaining to expiration. Three-Way—A position similar to a conversion or reversal, but where the long or short position in the underlying instrument has been replaced with a very deeply-in-the- money call or put. Time Box—A long call and short put with the same exercise price and expiration date, together with a short call and long put at a different exercise price and expiration date. This is simply a jelly roll using different exercise prices. Time Premium—Time value. Time Spread—The purchase (sale) of one option expiring on one date and the sale (purchase) of another option expiring on a different date. Typically, both options are of the same type, have the same exercise price, and have the same underlying stock or commodity. Time Value—The price of an option less its intrinsic value. The price of an out-of the- money option consists solely of time value. Type—tThe designation of an option as either a call or a put. Underlying —The instrument to be delivered in the event an option is exercised. 430 Appendix A Variation—The cash flow resulting each day from changes in the settlement price of a futures contract. Vega—The sensitivity of an option’s theoretical value to a change in volatility. Vertical Spread—The purchase of one option and sale of one option, where both options are of the same type, have the same underlying contract, and expire at the same time, but have different exercise prices. Volatility—The degree to which the price of an underlying instrument tends to fluctuate over time. Volatility Skew—The tendency of options at different exercise prices to trade at different implied volatilities. Warrant—A long-term call option. The expiration date of a warrant may under some circumstances be extended by the issuer. Write—Sell an option. % Appendix B + The Mathematics of Option Pricing OPTION PRICING MODELS I. The Black-Scholes Model and Its Variations Abbreviations used in the following mathematical formulae: C = theoretical value of a call P theoretical value of a put U = price of the underlying contract E exercise price t time to expiration in years v = annual volatility expressed as a decimal fraction T = risk-free interest rate expressed as a decimal fraction e base of the natural logarithm In = natural logarithm N’(xx) = the normal distribution curve = e(-x?/2) N(x) = __ the cumulative normal density function (the area under N’(x)} A. The Black-Scholes Model for evaluating European options on non-dividend paying stocks (U = price of the underlying stock):! C = UN(h) - Ee*t Nfh—wit) P = -UN(-h) + Ee“ N(wVt-h) where h = wt 1. Black, Fischer and Scholes, Myron, “The Pricing of Options and Corporate Liabilities,” Journal of Political Economy, Vol. 81, No. 3, May/June 1973, pages 637-654. 431 432 Appendix B For stocks which pay dividends, the stock price (U) can be replaced by the current stock price less the present value of the expected dividends: n U= by det jel where d = __ each expected dividend payout over the life of the option t, = _ the time in years to each dividend payout The sensitivities of the Black-Scholes Model are: call delta = N(h) put delta = -~N(-h) callgamma = ut gamma = N‘) 6 ~ PUL ~ Uwt Uv N’Ch) call theta = + rEettN(h— vt avt Uv N(h) ut theta = a eet Nt —h Pp NT ( ). call vega = putvega = UvtN’h) call rho = tEe*N(h-vvt) put rho = —tEettN(vvt-h) B. The Black Model for evaluating European options on futures contracts (U = price of the futures contract): C = UettN(h) — EettN(h—- vt) P = Ue\" N(-h) + Bett N(vvt — h) U v2 ne | 7 t e h = OS where We The sensitivities of the Black Model are: call delta = e“'N(h) put delta = —e\"N(-h) callgamma = utgamma = et No) 6 = PUES ~ Uvwt call theta = —UettN(h) + rEe“tN(h—vvt) + Uett vN’(h)/2Vt_ put theta = WUettN(-h) — rEewtN(vVt—h) + Uett yN(h)/2Vt 2. Black, Fischer, “The Pricing of Commodity Contracts”, Journal of Financial Economics, No. 3, 1976, pages 167-179. The Mathematics of Option Pricing 433 call vega = putvega = UettN(hyt call rho = tC put rho = —t?P C. The Garman Kohihagen Model for evaluating European options on foreign curren- cies (U = price of",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.451156"
}