{
  "id": "d432fdbc1e58",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 194,
  "content": "a disciplined trader will choose to sit on the sidelines until trading conditions become more opportune. In-the-money call butterflies and time spreads, and out-of-the-money put butterflies and time spreads, are those in which all exercise prices are lower than the current price of the underlying contract. Out-of-the-money call butterflies and time spreads, and in-the-money put butterflies and time spreads, are those in which all exercise prices are higher than the current price of the underlying contract. 453 Appendix D speaids own (1nd) [feo (WO) WLI les sarjpenng (and) eo (WL) WLO Anq ind WLY Hlesand WLo Anq eo WLY Hlesjes WL Anq ‘spealds |eoMeA |Inq s}nd peyeu jes “~ speaids atUy ynd Jo jeo WLY ||8s Saleyng ynd Jo jjeo Wy Ang sa[Bue.ys/se|pperys [es speaids jeoan olel speaids awn (nd) jo (WLI) W.LO Iles saljpeayng (ind) feo (WLO) WLI Anq ind WLY 1198/1nd WLI Ang eo WY Hesyireo WLLO Ang ispeaids jeomea seeq BulApepun au} Ang uoyeoea uo 06 speeds atuy (3nd) eo (Wil) WLO Ang saliveyng (nd) eo (WLO) WLI Hes ind wi) tlesand wi Ang 122 W.LO Iles/reo WL Anq ispeaids [eoIUaa |INq sjyeo peyeu Ang speaids own jnd Jo yyeo Way Anq Saljpeyng ynd Jo feo WL I18s sobuejs/sejppeys Ang speaidsyorq speaids atu (3nd) [feo (WLO) WLI Ang saljpenng (ind) eo (WLI) WLO Iles ind WLO |lesAnd wi Anq Wee WL Hes/reo Wy Ang spealds jeoqiea se0q s]jeo peyeu jes BurAyepun ay) jes sjnd peyeu Anq uBIH a]e19poW MO} _ ALNILLWIOA Gandil 454 ABuow-ay)-Jo-Ino = WLO A@uowW-auj-ye = WILY [e4jnon YsHIng ysyeeg NOILD3YI0 LAMYVA ASuoW-ouj-ul = WL éAboyeas 1Yybiy ey) Sey :1-q eanbi4 «+ Appendix E + Synthetic and Arbitrage Relationships Appendix E 456 UyUoUl UOTeIdxe JWale]jip e Ut Y]WOUW UOTeIIdxa aUu0 Ul sutApepun Joys oneyTUAs * ZurAplepun Zuo] ONayuAs — frou Atal aoud asPplexe JWaraljip ee + dold asplexe suo Te xo SULALJapun Ios sneyyUAs BulAyJapun 3uoy INeyyUAS q ind yous + jyeo Buoy + sulApepun Joys = SULALepun SUC] MMeyIUAS + BULATJOpUN LOYs = UOTsJeAUOD asleAal ind 3uo] + Yeo Wous + sutApapun Bug] = sUlATIopunN ous IMeulUAs + BULAPapun SUC] = UOISJaAUOO yyeo MWoys + 8ulAjJepun suoj = Ind Woys aneuUAs yjeo3uo] + Buldpepunjiioys = jnd Buoy speujuAs ynd Woys + BuLAjJepuN Woys = Teo Woys opeujUAs ind uo] + SulAjJepun Zuo] = [eo Buoy] JpeuUAs ynd uo] + [eo Wous = BurAjapun wWous oneuuds Ind}oUs + [fed BuO] = BuLAyepun Buoy IeyUAs sosa7IeNs sseNigry :syuoTeamMby oneupuAs (‘alep uonetdxe pue apd as[oJexe ous at] aaPy 0} paunsse ale suondo ‘pejou asiMJoujo ssayuy) SHIDALVULS FOVULIGAUV UNV SLINATVAINOT OLLAH.LNAS 457 Synthetic and Arbitrage Relationships spuaplalp peloedxe — (aold aspiexe Wa}-WoUs) anfea qeseid — (aad asfoJexe UWal-Zu0p) anjea qwesaid = spUaplalp peloedxe — 1XeU at} 0} uonendxe suo Woy aid asioJexe ay} UC s1s02 UIALeD = Jeysew [OI Aljel (saotid asloxe UeeAk}eq qunowr) anfea Juasaid = JeyseU XO spuaplAlp peqedxe — (goq1d as[oJexe) dud BULALIeD + gold esaiaxe — aod eoud BulApepun = god ind — adyid yjeo = 1axew ZulAvapun Ineuuds SyI0IS 10] (‘anjea uoneridxe ey} 0} [eonuap! s] enjea quaseid au pue ‘o1eZ ale S1sO0 ZuIAIeD [Te Juawepes sadA}-semjny 0} yoalqns ase JoyIeW SemINy e Ul stondo ustAA) (sedtid as]oJexe UeeAkleq qunowre) anfea Wesaid = Jeyeu KOq (aod astoexe — aad samny) 1800 BUIALIED — gold astaexe — ead sulApepun = gold jnd — yfeo = Joysew SuApepun sneuqAs sjayepy samy JOF (‘q xtpueddy ul uO IUNy eNUeUOdxe oY} JO uotiduasap ety eas ‘,enjea quasald, Jo UOIssNOSIp palfelep a10ul & JOF *s1soo BUIAIeD aty Ag pajuNoosIp uoTeddxe Je onjea aU} SI ,enfeAa IWeseld,, “one dxe 0} Ale) JO 180) otf aq 0} JURSUT ST 3809 BulALe9,, Sdysuone jel BULMOTIO} au} Uf) (pantuiied asfoJexe Area ou) SNOLLdO NWadOuNA WOA SANTVA FOVULIGUVY Appendix E 458 peaids atin ind (8uoy) ous + peaids aur ype Guoys) 8U0] = YIUOW Jeep & Ul UOISI@AUOD asJeAel + UJUOUL GUO UI UO[sJeAUOd = [TOI ATjel ajsuens (110ys) BuO] + aTppens (BuoT) Wous = Aqeyng uon (BuO) Woys = Agieyng Gsoys) BuO] Sad asfJexe JeysIy au} ye XOg (BUOT) Woys + saoyd asfoJexa JAMO] SUA Ie XO (WOYS) BUC] = seoud asiiexe ates aut ulm AyJeyng ind Buop Woys + Aysetng [ed (ous) Zuo] solep uopendxe pue sedtid astoJexe oures ou} UM AlJetng ind = Agienng [ed peeids ind jeonsea (TING) Jeeq + peards [fed jeIneA (Wee) [ING = add aslJeXe JUsJeYIP & Je UOISIGAUOD asleAal + 2dUd aS1OJeXe GUO Je UO[SIAAUOD = xOq SdIHSNOILVTSe TAATSN WAHLO “* Appendix F Recommended Reading This book represents only one of many possible approaches to option evaluation and trading. The reader who desires a complete proficiency in options is strongly advised to seek out as many different sources of information as possible. The following list includes those books which are likely to be of interest to the serious option trader. An attempt has been made to categorize books according to their level of difficulty (usually in terms of the mathematics involved), although categoriza- tions are subjective and in some cases may overlap. Where possible, the primary focus of the book (stock options, futures options, interest rates, currencies, etc.) has also been noted. {References to academic articles, including the original presentation of the more commonly used pricing models, appear as footnotes in the text.) ELEMENTARY BOOKS Barenblat, Scot G.; and Mester, Donald T. Stock Index Options (stock indexes) Probus Publishing Co.; Chicago, IL 1992; 206 p. Caplan, David The Options Advantage (futures) Probus Publishing Co.; Chicago, IL 1991; 222 p. Colburn, James T. Trading in Options on Futures (futures) The New York Institute of Finance; New York, NY 1990; 310 p. Frost, Ronald J. Options on Futures, Revised Edition (futures) Probus Publishing Co.; Chicago, IL 1994; 254 p. Fullman, Scott H. Options: A Personal Seminar (stocks) New York Institute of Finance; New York, NY 1992; 373 p. 459 460 Hexton, Richard Dealing in Traded Options (stocks) Prentice-Hall International Ltd.; Hertfordshire, UK 1989; 192 p. Luft, Carl F.; and Sheiner, Richard K. Understanding and Trading Listed Stock Options, Rev. Ed. (stocks) Probus Publishing Co.; Chicago, IL 1994,",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "fundamentals",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.452208"
}