{
  "id": "3b662ea54725",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 176,
  "content": "he will win, a trader should only invest an amount in expiration straddles which he is prepared to lose. But when conditions are right, a trader ought to be willing to make the investment. Even if he loses several times in succession, in the long run he will encounter gaps in the market, or sudden increases in volatility, often enough to make such strategies profitable. VOLATILITY IS INDEPENDENT OF THE PRICE OF THE UNDERLYING CONTRACT When a trader feeds a volatility into a theoretical pricing model, the volatility defines a One standard deviation price change at any time during the life of the option, regardless of whether the underlying contract happens to be rising or falling in price. If a contract is currently at 100, and we assume a volatility of 20%, a one standard deviation price change is always based on this volatility of 20%. If at some later time during the life of the option the contract should move up to 150 or down to 50, 20% is still assumed to be the operative volatility. 400 Chapter 18 Unfortunately, this assumption seems to fly in the face of most traders’ experience. If one were to ask a stock index or bond trader whether his market were more volatile when rising or falling, he would probably say that it was more volatile when falling. On the other hand, if one were to ask an agricultural or precious metal trader the same question about his market, he would almost certainly give the opposite answer. Those markets tend to be more volatile when rising. In other words, the volatility of a market is not independent of the price of the underlying contract. On the contrary, the volatility over time seems to be dependent on the direction of movement in the underlying contract. In some cases a trader expects the market to become more volatile if the movement is downward and less volatile if the movement is upward; in other cases a trader expects the market to become more volatile if the movement is upward and less volatile if the movement is downward. Because volatility in some markets does seem to be dependent on the price of the underlying contract, a further variation of the Black-Scholes model has been proposed. The constant-elasticity of variance, or CEV, model® is based on an assumed relationship between volatility and the price level of the underlying contract. This relationship determines the probability of price moves of various magnitudes at each moment in time. Price changes are still random under a CEV assumption, but the randomness varies with the price of the underlying contract. Like the jump-diffusion model, the CEV model is mathematically complex, and therefore difficult for most traders to compute. And like the jump-diffusion model it requires additional input in the form of a mathematical relationship between the volatility and price movement in the underlying contract. Given these difficulties, the CEV model has not found wide acceptance among option traders. Over small periods of time the percent price changes in an underlying contract are normally distributed, resulting in a lognormal distribution of underlying prices at expiration Does the real world look like a lognormal distribution? One way to answer the question is to ask how percent price changes over small periods of time are distributed. If this distribution is normal, then the prices at expiration are likely to be lognormally distributed. Figure 18-5a is a frequency distribution of daily price changes in the S&P 500 stock index from 1989 through 1993. Each bar represents the number of occurrences of a given price change to the nearest 1/4 percent. As one would expect, most of the changes are relatively small and close to zero. As we move away from the zero in either direction, 8. For information on the CEV model see: Cox, John C.; and Ross, Stephen A.; “The Valuation of Options for Alternative Stochastic Processes”; The Journal of Financial Economics, Volume 3, March 1976; pages 145-166. Beckers, Stan; “The Constant Elasticity of Variance Model and Its Implications for Option Pricing”; Journal of Finance; June 1980; pages 661-673. Schroder, Mark; “Computing the Constant Elasticity of Variance Option Pricing Model”; Journal of Finance, Vol. 44, No. 1; March 1989; pages 211-219. Models and the Real World 401 Figure 18-5a: S&P 500 Stock Price Index, Percent Daily Price Changes 1989-1993 225 200-4 175+ 150+ Total number of days = 1265 0 Largest upward move = +3.73 % 8 1284 Largest downward move = -6.12 % & Mean = +.044 % 5 Standard deviation = .795 % es 8 100- Annualized volatility = 12.653 % normal distribution ie] Skewness = -.352 Kurtosis = +4.343 75 50-4 255 OTT Toe ot - 5 -4 -3 -2 ~1 ie} +1 +2 +3 +4 we encounter fewer and fewer occurrences. The distribution certainly seems to have many of the characteristics of a normal distribution. But is it really a normal distribution, and if it isn’t, how does it differ from such a distribution? If the frequency distribution conforms exactly to a normal distribution, the tops of the bars should coincide exactly with a true normal distribution. To find out if this is the case, the mean (+.044%) and standard deviation (.795%) have been calculated for all 1,265 daily price changes over the five-year period. From these numbers, a theoreti- cally exact normal distribution has been overlaid on our frequency chart. Note that the actual frequency distribution is similar to the normal distribution, but there are some Clear differences. Because the bars representing the small price changes rise above the normal distribution curve, there seem to be more small price changes than one would expect from a true normal distribution. There are also several large price changes, or outliers, which rise above the extreme tails of the normal distribution. These outliers seem to indicate that there are more large moves in our frequency distribution than one would expect from a true normal distribution. Finally, in the midsections, between the peak of the",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "market_structure",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.449357"
}