{
  "id": "04242c5c0932",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 29,
  "content": "3.31 In an Uptrend, Upswings Are Larger than Downswings Length of Swing Analysis Simple math tells us that in an uptrend the upswings must be longer than the down- swings, and the reverse is true in downtrends. If a market is gaining more on the up- swings than it is losing on the pullbacks, the net effect will be to move to a higher price level—this is a very elementary deﬁnition of a trend and is also consistent with the Dow Theory trend construct. One very simple way we can look at trends is to draw lines con- necting the pivot lows to the pivot highs in each of the major swings, and then simply compare the lengths of those lines to previous swings in terms of both vertical distance (price) and horizontal distance (time). Some examples will help to clarify. In a strong uptrend, the upswings are larger than the downswings, usually both in price and in time (see Figure 3.31). Any break or change in this pattern should be a warning that something is changing and that the trend integrity could be weakening. For instance, a common pattern that suggests the trend is running out of steam occurs when successive upswings are shorter relative to previous upswings, as in Figure 3.32. It is also interesting to consider the overlap between this length of swing analysis and traditional chart patterns. For instance, Figure 3.32 might also be read as a “gently rounding top” by chart pattern–oriented traders. With some slight adjustments, the same pattern of smaller upswings might FIGURE 3.32 Shorter Upswings Can Be a Warning of Impending Trend Failure F - Daily Ford Motor Jul Oct I - ! ! .L 18.00 14.00 13.00 12.00 11.00 10.00 '11 37 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 83 A B FIGURE 3.31 In an Uptrend, Upswings Are Larger than Downswings Length of Swing Analysis Simple math tells us that in an uptrend the upswings must be longer than the down- swings, and the reverse is true in downtrends. If a market is gaining more on the up- swings than it is losing on the pullbacks, the net effect will be to move to a higher price level—this is a very elementary deﬁnition of a trend and is also consistent with the Dow Theory trend construct. One very simple way we can look at trends is to draw lines con- necting the pivot lows to the pivot highs in each of the major swings, and then simply compare the lengths of those lines to previous swings in terms of both vertical distance (price) and horizontal distance (time). Some examples will help to clarify. In a strong uptrend, the upswings are larger than the downswings, usually both in price and in time (see Figure 3.31). Any break or change in this pattern should be a warning that something is changing and that the trend integrity could be weakening. For instance, a common pattern that suggests the trend is running out of steam occurs when successive upswings are shorter relative to previous upswings, as in Figure 3.32. It is also interesting to consider the overlap between this length of swing analysis and traditional chart patterns. For instance, Figure 3.32 might also be read as a “gently rounding top” by chart pattern–oriented traders. With some slight adjustments, the same pattern of smaller upswings might FIGURE 3.32 Shorter Upswings Can Be a Warning of Impending Trend Failure P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 84 MARKET STRUCTURE FIGURE 3.33 The First Downswing That Is Larger than the Preceding Upswing, in Time or Price, Is a Warning to Pay Attention generate a double top, a triple top, or a head and shoulders pattern. This is a good lesson—all of these patterns are essentially the same pattern . A very important structural element in swing analysis is the ﬁrst downswing in an uptrend that is longer than the preceding upswing (see Figure 3.33). Vertically, this swing will make a lower low, setting up a potential trend change condition, but it is even more important to realize that this swing can indicate a distinct change of character in the market. It usually shows a failure on the part of the buyers to support the market, and, depending on the strength of the selling pressure in the swing (which must be judged from price action or lower time frame market structure), it may even set up a potential countertrend short on the next bounce. This is perhaps the single most important pattern in length of swing analysis. Of course, it is not always so simple. Though we might expect a shortable bounce following the pattern in Figure 3.33, it is also possible that this type of downswing may simply set up a complex consolidation. Furthermore, though a complex consolidation is usually a trend continuation pattern, there are other possible resolutions that may follow that pattern. Any of the possible pullback failure patterns apply equally well to complex consolidations because they are simple pullbacks on the higher time frame. These examples have dealt exclusively with uptrends, but they are simply reﬂected and reversed for downtrends. These patterns can form a foundation for a robust under- standing of trend analysis. Do not be put off by the simplicity of this analysis. In the right context, simple tools work very well. Using Trend Lines to Deﬁne Rate of Trend Trend lines are one of the most used and abused tools in modern technical analysis. One good working deﬁnition of a trend line is a line drawn between two points on a chart, but then",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options"
  ],
  "created_at": "2026-02-05T00:37:53.699735"
}