{
  "id": "661d52c9cc7c",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 51,
  "content": "Decreased Expected Log Return but Not Expected Wealth .” Quantitative Trading . May 4. http://epchan.blogspot.com/2017/05/paradox-resolved-why-risk-decreases .html . Chan , Ernest . 2020 . “What Is the Probability of Your Profit?” PredictNow .ai . https://www.predictnow.ai/blog/what-is-the-probability-of-profit-of -your-next-trade-introducing-predictnow-ai/ . Chan800064_bbiblio.indd 205 5/20/2021 10:50:18 AM 111 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 206 BIBLIOGRAPHY Clark, Nicola. 2008. “French Bank Says Its Controls Failed for 2 Years.” New York Times, February 21. http://www.nytimes.com/2008/02/21 /business/worldbusiness/21bank.html?ex=1361336400&en=cf84f3776a877 eac&ei=5124&partner=permalink&exprod=permalink. Duhigg, Charles. 2006. “Street Scene; A Smarter Computer to Pick Stock.” New York Times, November 24. Economist. 2007a. “This Year’s Model.” December 13. www.economist .com/finance/displaystory.cfm?story_id=10286619. Economist. 2007b. “Too Much Information.” July 12. www.economist .com/finance/displaystory.cfm?story_id=9482952. Economist. 2019. “March of the Machines. The Stock Market Is Now Run by Computers, Algorithms, and Passive Managers.” October 5. www .economist.com/briefing/2019/10/05/the-stockmarket-is-now-run-by -computers-algorithms-and-passive-managers. Fama, Eugene, and Kenneth French. 1992. “The Cross-Section of Expected Stock Returns.” Journal of Finance XL VII (2): 427–465. Fielden, Sandy. 2006. “Seasonal Surprises.” Energy Risk. September. https://www.risk.net/infrastructure/1523742/seasonal-surprises. Gershgorn. 2017. “The Data That Transformed AI Research—and Possibly the World.” Qz. https://qz.com/1034972/the-data-that-changed-the-direction -of-ai-research-and-possibly-the-world/. Grinold, Richard, and Ronald Kahn. 1999. Active Portfolio Management. New York: McGraw-Hill. Heston, Steven, and Ronnie Sadka. 2007. “Seasonality in the Cross-Section of Expected Stock Returns.” AFA 2006 Boston Meetings Paper, July. lcb1. uoregon.edu/rcg/seminars/seasonal072604.pdf. Kahneman, Daniel. 2011. Thinking, Fast and Slow. Farrar, Straus and Giroux. Khandani, Amir E., and Andrew Lo. 2007. “What Happened to the Quants in August 2007?” MIT. https://web.mit.edu/Alo/www/Papers/august07.pdf. Kochkodin, Brandon. 2021. “How Wall Street Bets Pushed GameStop Shares to the Moon.” Bloomberg. www.bloomberg.com/news/articles/2021 -01-25/how-wallstreetbets-pushed-gamestop-shares-to-the-moon?sref =MqSE4VuP . Lewis, Michael. 2014. Flash Boys. W.W. Norton. Chan800064_bbiblio.indd 206 5/20/2021 10:50:18 AM 112 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Bibliography 207 Lo, Andrew, 2019. Adaptive Markets: Financial Evolution at the Speed of Thought. Princeton University Press. López de Prado, Marcos. 2018. Advances in Financial Machine Learning. Wiley. Lowenstein, Roger. 2000. When Genius Failed: The Rise and Fall of Long-Term Capital Management. Random House. Lux, Hal. 2000. “The Secret World of Jim Simons.” Institutional Investor Magazine, November 1. Markoff, John. 2007. “Faster Chips Are Leaving Programmers in Their Dust.” New York Times, December 17. www.nytimes.com/2007/12/17 /technology/17chip.html?ex=1355634000&en=a81769355deb7953&ei =5124&partner=permalink&exprod=permalink. Oldfield, Richard. 2007. Simple but Not Easy. Doddington Publishing. Peters, O., and M. Gell-Mann 2016. “Evaluating Gambles Using Dyanmics.” Chaos 26: 023103. https://doi.org/10.1063/1.4940236. Phillips, Daniel. 2020. “Investment Strategy Commentary: Value Stocks: Trapped or Spring-Loaded?” Northern Trust, September 24. https://www .northerntrust.com/canada/insights-research/2020/investment-management /value-stocks. Poundstone, William. 2005. Fortune’s Formula. New York: Hill and Wang. Ritter, Jay. 2003. “Behavioral Finance.” Pacific-Basin Finance Journal 11 (4) September: 429–437. Schiller, Robert. 2008. “Economic View; How a Bubble Stayed under the Radar.” New York Times, March 2. www.nytimes.com/2008/03/02/ business/02view.html?ex=1362286800&en=da9e48989b6f937a&ei=5124&p artner=permalink&exprod=permalink. Sharpe, William. 1994. “The Sharpe Ratio.” Journal of Portfolio Management, Fall. https://jpm.pm-research.com/content/21/1/49. Singal, Vijay. 2006. Beyond the Random Walk. Oxford University Press. Taleb, Nassim. 2007. The Black Swan: The Impact of the Highly Improbable. Random House. Thaler, Richard. 1994. The Winner’s Curse. Princeton, NJ: Princeton University Press. Chan800064_bbiblio.indd 207 5/20/2021 10:50:18 AM 113 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 208 BIBLIOGRAPHY Thorp, Edward. 1997. “The Kelly Criterion in Blackjack, Sports Betting, and the Stock Market.” Handbook of Asset and Liability Management, Volume I, Zenios and Ziemba (eds.). Elsevier 2006. www.EdwardOThorp.com. Toepke, Jerry. 2004. “Fill ’Er Up! Benefit from Seasonal Price Patterns in Energy Futures.” Stocks, Futures and Options Magazine, March 3 (3). www.sfomag.com/issuedetail.asp?MonthNameID=March&yearID=2004. Uhlenbeck, George, and Leonard Ornstein. 1930. “On the Theory of Brownian Motion.” Physical Review 36: 823–841. Chan800064_bbiblio.indd 208 5/20/2021 10:50:18 AM 114 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 209 About the/uni00A0Author E rnest P . Chan is the founder of PredictNow.ai, a financial machine-learning SaaS available as a no-code service or via an API. He is also the founder of QTS Capital Management, LLC. ( www.qtscm.com ), which manages a hedge fund and separate client brokerage accounts. He has been quoted by the Wall Street Journal , New York Times, and CIO magazine on quantitative invest- ing, and has appeared on CNBC ’ s Closing Bell . His firm has also been profiled in a Bloomberg Businessweek article. Ernie is the author of Quantitative Trading: How to Build Your Own Algorithmic Trading Business , Algorithmic Trading: Winning Strategies and Their Rationale , and Machine Trading: Deploying Computer Algorithms to Conquer the Markets , all published by John Wiley & Sons. To learn more about his books and training courses, visit www.epchan.com . He maintains a popular blog at predictnow.ai/blog , where readers can also download his other publications. Ernie is an expert in developing statistical models and advanced computer algorithms to discover patterns and trends from large quantities of data. He was a machine-learning researcher at IBM ’ s T. J. Watson Research Center ’ s Human Language Technologies group, at the Data Mining and Artificial Intelligence group at Morgan Stanley, and at the Horizon proprietary trading group at Credit Suisse, as well as at various other hedge funds. He is also an adjunct faculty at Northwestern",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:43.612071"
}