{
  "id": "2adca0928373",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 10,
  "content": "The simplest way to do this is to calculate the daily returns based on the data. If you have open, high, low, and close prices, you can calculate the various combinations of daily returns such as from the previous high to today’s close as well. You can then examine closely those days with returns that are, say, four standard deviations away from the average. Typically, an extreme return should be accompanied by a news announcement, or should occur on a day when the market index also experienced extreme returns. If not, then your data are suspect. PERFORMANCE MEASUREMENT Quantitative traders use a good variety of performance measures. Which set of numbers to use is sometimes a matter of personal pref- erence, but with ease of comparisons across different strategies and traders in mind, I would argue that the Sharpe ratio, maximum drawdown, and MAR ratio are the most important. Notice that I did not include compound annualized growth rate (CAGR), the measure most commonly quoted by investors, because if you use this measure, you have to tell people a number of things about what denominator you use to calculate returns. For example, in a long–short strategy, did you use just one side of capital or both sides in the denominator? Is the return a leveraged one (the denominator is based on account equity), or is it unleveraged (the denominator is based on market value of the portfolio)? If the equity or market value changes daily, do you use a moving average as the denominator, or just the value at the end of each day or each month? Most (but not all) of these prob- lems associated with comparing returns can be avoided by quoting Sharpe ratio, maximum drawdown, and MAR ratio instead as the Chan800064_c03.indd 47 6/7/2021 2:04:49 PM Backtesting 49 However, annualizing the standard deviation of returns is a bit trickier. Here, based on the assumption that the monthly returns are serially uncorrelated (Sharpe, 1994), the annual standard devia- tion of returns is 12 times the monthly standard deviation. Hence, overall, the annualized Sharpe ratio would be 12 times the monthly Sharpe ratio. In general, if you calculate your average and standard deviation of returns based on a certain trading period T, whether T is a month, a day, or an hour, and you want to annualize these quantities, you have to first find out how many such trading periods there are in a year (call it N T). Then Annualized Sharpe Ratio Sharpe Ratio Based onNTT For example, if your strategy holds positions only during the NYSE market hours (9:30–16:00 ET), and the average hourly returns is R, and the standard deviation of the hourly returns is s, then the annualized Sharpe ratio is 1638 Rs/ . This is because NT = (252 trading days) × (6.5 trading hours per trading day) = 1,638. (A com- mon mistake is to compute N T as 252 × 24 = 6,048.) Example 3.4: Calculating Sharpe Ratio for Long-Only Versus Market-Neutral Strategies Let’s calculate the Sharpe ratio of a trivial long-only strategy for IGE: buying and holding a share since the close of November 26, 2001, and selling it at close of November 14, 2007. Assume the average risk-free rate during this period is 4 percent per annum in this example. You can download the daily prices from Yahoo! Finance, specifying the date range desired, and store them as an Excel file (or the comma-separated file for use in the R code), which you can call IGE.xls. The next steps can be done in either Excel or MATLAB: Using Excel 1. The file should have columns A–G already from the download. 2. Sort all the columns in ascending order of Date (use the Data-Sort func- tion, choose the “Expand the selection” radio button, and choose the “Ascending” as well as the “My data has Header row” radio buttons). 3. In cell H3, type “=(G3-G2)/G2”. This is the daily return. Chan800064_c03.indd 49 6/7/2021 2:04:50 PM 16 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 50 QUANTITATIVE TRADING 4. Double-clicking the little black dot at the lower right corner of the cell H3 will populate the entire column H with daily returns of IGE. 5. For clarity, you can type “Dailyret” in the header cell H1. 6. In cell I3, type “=H3-0.04/252,” which is the excess daily return, assum- ing a 4 percent per annum risk-free rate and 252 trading days in a year. 7. Double-clicking the little black dot at the lower right corner of cell I3 will populate the entire column I with excess daily returns. 8. For clarity, type “Excess Dailyret” in the header cell I1. 9. In cell I1506 (the last row in the next column), type “=SQRT(252) * AVERAGE(I3:I1506)/STDEV(I3:I1506)”. 10. The number displayed in cell I1506, which should be “0.789317538,” is the Sharpe ratio of this buy-and-hold strategy. The finished spreadsheet is available at my website at epchan.com/ book/example3_4.xls. Using MATLAB % make sure previously defined variables are erased. clear; % read a spreadsheet named \"IGE.xls\" into MATLAB. [num, txt]=xlsread(`IGE'); % the first column (starting from the second row) % contains the trading days in format mm/dd/yyyy. tday=txt(2:end, 1); % convert the format into yyyymmdd. tday=datestr(datenum(tday, `mm/dd/yyyy'), `yyyymmdd'); % convert the date strings first into cell arrays and % then into numeric format. tday=str2double(cellstr(tday)); % the last column contains the adjusted close prices. cls=num(:, end); % sort tday into ascending order. [tday sortIndex]=sort(tday, `ascend'); % sort cls into ascending order of dates. cls=cls(sortIndex); % daily returns dailyret=(cls(2:end)-cls(1:end-1))./cls(1:end-1); % excess daily returns assuming risk-free rate of 4% % per annum and 252 trading days in a year excessRet=dailyret - 0.04/252; % the output should be 0.7893 sharpeRatio=sqrt(252)*mean(excessRet)/std(excessRet) This MATLAB code is also available",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "crypto",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.604939"
}