{
  "id": "cd9d82821c4e",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 87,
  "content": "This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Failure Test Failures 321 this time period, so it did not trade cleanly around levels. An entry could have been attempted at A, but most traders would have wanted to see more decisive action above resistance to set up an entry. B: The best entry for this trade is probably at B, but it may also have been a second entry for traders who booked a loss following A. Consider expectations for a trade like this, particularly in a market-leading momentum stock: If the trade is correct, the stock should immediately melt. There should be sharp and clean downward momentum away from the level. C: This downward momentum did not develop, and the trade eventually failed at C. In this case, the preceding consolidation was small, only two or three bars. It is a challenge to make adjustments to the trade within this time period, so it is reasonable to expect that a trader might have booked another loss at C. This is another reason for doing these trades on half risk, relative to most other trade classes. In this example, a trader might have taken full losses following two entries at both A and B. Though unusual, this does happen, so it must be anticipated in the trading and risk management plans. Failure Test Failure with Second Entry FIGURE 10.25 A Failure Test with Obligatory Second Entry LBTYA-D,~L~~GS~IOoCIA At[f~ ::: .'~ ~ , ,: t ti 111, \\_ 4100 /. '11i 1111, i/ - ------ -iw m, ' I I I • 1l1~ ~, - 4000 I ~ L oso A-~P.~- ~-- ,~~--- - ---···~ ~~~~----'.1.00 ~- • Jun ~ _,. . ~ ··,,lay Apr Mar 132 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 324 TRADING STRATEGIES FIGURE 10.26 A Developing Climax in Silver Futures low—a very tight stop in a volatile market, but also a reasonable risk point. In this case, the exit was fortuitous, coming on the day following the ultimate high for the move; not all trades will have outcomes this dramatic, but you must respect the potential for a very dangerous countertrend move when the climax ﬁnally turns. A: “I have been ... able to tighten the stop to above the entry price. I am still deeply distrustful of the trend ... , but, for now, am positioned to take advantage of any continued upside.” This is a case of using a high and tight pullback to tighten the stop on an existing trade. Though no contracts were added in this pattern, a failure of the pattern would have been very bad for the trade, so a tighter stop was justiﬁed. Consider also that, even though I was uncomfortable with the potential in the trade, I did not exit and so was positioned to proﬁt from the ensuing uptrend. B: “Silver is certainly overbought by any measure, but this is not a case where fading strength is justiﬁed.” Taken alone, the concepts of overbought and oversold are dangerous and are probably overemphasized in much of the literature. Strong trends reach overextended levels and just keep going. C: “My aggressive addition to Silver worked ... stop [is now] just under yesterday’s low.” The two small days provided another entry point to add additional exposure—yet another variation of the high and tight consolidation . P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trading Parabolic Climaxes 325 D: “I have moved the stop to just below yesterday’s low. In the intermediate term, everything suggests higher prices, and the possibility of extreme volatility. The challenge is ... balancing proﬁt taking ... [against] holding a core position.” E: “The break, when it does come, could be dramatic. ... I am working a tight stop very close to yesterday’s low.” F: “I am ratcheting the stop very tightly every day. This is a proﬁt-taking strategy, looking for weakness to take us out of the market.” Trade management does not always mean executing. In this case, tightening the stop reduced risk and locked in additional proﬁts on a daily basis. Even though there were no execu- tions, this is active trade management. G: “We were taken out of our long position in Silver futures yesterday, having booked a good proﬁt for ﬁve weeks’ work,” and the market immediately collapsed into a dramatic sell-off. Not all trades will be this dramatic, but rather than extrap- olating the move and seeing virtually unlimited proﬁts, always consider the possibility of a collapse like this. In this case, a simple technical pattern and a very tight trailing loss allowed our clients to sell Silver the day following the high water mark for the uptrend . Climax Failures FIGURE 10.27 Does This Climax in Cotton Set Up a Short Trade? @SI- Daily Silver Continuous Contract (Sep11] 28.000 Feb Mar Apr l,lay @CT- Daily Cotton No. 2 Continuous Contract (Dec11] 35.00 30.00 25.00 ~ ~2.00 ------== ----- ~ ---- --- 1 00 ------ - . Jun Jul Aug Sep 133 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.709015"
}