{
  "id": "a26b4711fbf6",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 50,
  "content": "changing. Suppose a trader has a delta position of +500 prior to the opening of the market. If he wishes to be delta neutral he knows that he will have to sell 500 deltas on the opening. He can accomplish this by selling five underlying contracts. But suppose that his gamma position is +100 and the market is expected to open two points higher. If it does in fact open two points higher his delta position will no longer be +500, but +700 since he will become 100 deltas longer for each point rise in the underlying. He now knows that in order to be delta neutral he must sell 700 deltas, or seven underlying contracts. He can make this calculation without any computer assistance simply by knowing his initial delta and gamma positions. Since the delta of an option must always remain in the range of zero to 100 (zero to ~100 for puts), we can logically conclude that the gamma must also be changing. Otherwise, continuously adding or subtracting a constant gamma would take the delta beyond this range. The effect of changes in market conditions on the value of gammas is shown in Figures 6-8, 6-9, and 6-10. Figure 6-8 demonstrates that the gamma is greatest for an option which is at-the-money, and becomes progressively smaller as an option moves either into- or out-of-the-money. Figures 6-9 and 6-10 show that the gamma of an at-the-money option can increase dramatically as expiration approaches, or as we decrease our volatility assumption. A trader’s gamma position, which may have initially been small, can become increasingly large through the passage of time or through changes in volatility. An option position must always be monitored to ensure that its risk characteristics remain within acceptable limits. While the gamma is perhaps the most common measure of the change in the delta, the delta is also subject to change from market conditions other than movement in the price of the underlying contract. Figures 6-11 and 6-12 show how call and put deltas change as time passes. Figures 6-13 and 6-14 show how deltas change with changes in volatility. Note that all four sets of graphs have the same shape. As we increase the time to expiration or increase volatility, all options tend to become more at-the-money, with call deltas approaching 50 and put deltas approaching -50. Conversely, as we decrease the amount of time to expiration or decrease volatility, all option deltas move away from 50 (-50 for puts}. An option which is in-the-money will move further into-the-money, and an option which is out-of-the-money will move further out-of-the-money. Options which are at-the-money and have deltas close to 50 tend to maintain the same delta characteristics regardless of changes in time or volatility. Perhaps a comment is in order here about what at-the-money means. Traders tend to think of an at-the-money option as one whose exercise price is approximately equal to the current price of the underlying contract. By this definition a trader will instinc- tively assign a delta of 50 to any option whose exercise price is currently at-the-money. However, a theoretical pricing model will interpret the at-the-money option (the one with a delta of 50) as the option whose current exercise price is most likely to be closest to the price of the underlying contract at expiration. Suppose that interest rates are 12% annually and that a certain stock is currently trading at $100. If two five-month calls are available with exercise prices of 100 and 105, which call has a delta closer to 50? We Option Values and Changing Market Conditions 107 Figure 6-8: Call or Put Gamma vs. Underlying Price 65 90 Time = 60 days Volatility = 20% 110 oO E € oO oO 0---—\">= = —_ T T T T T T 80 85 90 95 100 105 110 115 120 Underlying Price Figure 6-9: Call or Put Gamma vs. Time to Expiration 257, Underlying Price = 100 Volatility = 20% 2075: 154 oO E € 10+ 00 54 110 we et ce et ee SE ——_ 90 0 & T T T T T T T T T 0 20 40 60 80 100 120 140 160 180 200 Time to Expiration (days) 108 Chapter 6 Figure 6-10: Call or Put Gamma vs. Volatility 25 Underlying Price = 100 Time = 60 days 205 15> Gamma “100 10- Volatility (%) Figure 6-11: Call Delta vs. Time to Expiration 100 90° 90 80-7 Underlying Price = 100 70- Volatility = 20% 607 100 5074 peeennneens we Delta 407 307 20+ 104 a O71 << T + T 1 80 100 120 140 160 Time to Expiration (days) 1 180 200 Option Values and Changing Market Conditions 109 Figure 6-12: Put Delta vs. Time to Expiration 07 -10+ Underlying Price =100 -30- Volatility = 20% -40+ 100 90 -20+ | Delta cn oO 0 20 40 60 80 100 120 140 Time to Expiration (days) 160 180 200 Figure 6-13: Call Delta vs. Volatility 100 T 90-1 90 80° Underlying Price = 100, Time = 60 da 701 ve 607 50-4 ctsetmenta tone Delta 40+ 307 207 10+ ae Volatility (%) 35 40 110 Chapter 6 Figure 6-14: Put Delta vs. Volatility “207 Underlying Price = 100 Time = 60 days -40- -504 Delta -607 -70- ee -80+ enn -100 T | a T T T T T 0 5 10 15 20 25 30 35 40 Volatility (%) saw in Chapter 4 that the mean of the distribution assumed in most theoretical pricing models is the forward price (the break-even price] for the underlying contract. In our present case, the forward price is the current stock price of $100 plus the $5 carrying costs over the five-month holding period. The 105 call is therefore the one which the model interprets as being at-the-money, and hence will have a delta of 50. Depending on the type of underlying contract, under extreme interest rate conditions or with a great deal of",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.430073"
}