{
  "id": "e1bceccce3ea",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 181,
  "content": "at 87.86, the implied volatility of an option with an exercise price of 87.86 (a theoretically at-the-money option) would be approximately 3.57%. We can therefore express the volatility at each exercise price as the difference between that exercise price’s volatility and 3.57. Using this approach, the 91 exercise price, with an implied volatility of 3.81 (the point where the graph crosses the 90 exercise price), would be assigned a value of 3.81 - 3.57 = .24 The 86 exercise price, with an implied volatility of 3.68, would be assigned a value of 3.68 — 3.57 = .11 Figure 18-8d 6.00 . T \\ \\ / $807 \\ 5 weeks to expiration \\ Bund futures = 91.57 A \\ ) 5.00 \\ a 4.507 implied Volatility 11 weeks to expiration * Bund futures = 89.23 2 weeks to expiration 4.004 Bund futures = 91.57 17 weeks to expiration Bund futures = 87.86 3,50 T = | Tt T -0.15 -0.10 -0.05 0.00 0.05 0.to 0.16 In(ex. price/fut. price)/sqrt(time) 412 Chapter 18 This method is satisfactory when implied volatilities remain relatively constant. But suppose the implied volatility in the Bund option market were to double to 7.00%. Under these circumstances, the implied volatilities at each exercise price can also be expected to double. The 90 exercise price, instead of having an implied volatility of 3.81, will have an implied volatility of 7.62. And the 86 exercise price, instead of having an implied volatility of 3.68, will have an implied volatility of 7.36. Since implied volatility can change in the marketplace, we need a method of relating the overall change in implied volatility to the change in each exercise price’s implied volatility. The easiest way to do this is to express the implied volatility at each exercise price as a percent of the at-the-money implied volatility. For example, with an at-the-money implied volatility of 3.57, the 90 exercise price, with an implied volatility of 3.81, would be assigned a value of 3.81 / 3.57 = 106.7% The 86 exercise price, with an implied volatility of 3.68, would be assigned a value of 3.68 / 3.57 = 103.1% Combining this method of expressing the implied volatility in terms of a percent of at-the-money volatility, together with the logarithmic/time method of expressing the exercise price, yields the transformations shown in Figure 18-8e. Figure 18-8e 140 1 ] | \\ | 130 | 9 weeks to expiration | ’ g und futures = 91.57 f fe} , E @ x= = 120 6 Bs) & ray B 140 eo s 41 weeks to expiration eks to expiration 3 Bund futures |= 89.23 NE i futures = 91.57 2 NS a 400 = 17 weeks to dxpiration Bund futures = 87.86 90 a -0.15 -0.10 -0.05 0.00 0.05 0.10 0.15 In(ex. Srice/fut. price)/sqrt(time) Models and the Real World 413 With our new x-axis and y-axis the skews, while not identical, tend to look much alike. If we were to make the assumption that the skew would look similar to those in Figure 18-8e under all conditions, we might think of the skew as an additional variable in a theoretical pricing model. Instead of the five usual variables (time to expiration, exercise price, underlying price, interest rates, volatility), we now have six (Figure 18-9). If we are going to feed the skew into the model as a variable, we need to do itina way which the model understands. This means we need to find a formula by which to express the skew. While this may sound difficult, many skews can be expressed as simple equations. In Figure 18-10 a function has been graphed out which approximates the shape of the volatility skews in Figure 18-8. If we make the assumption that this function gives a good approximation of the skew, we can use the function as the volatility skew variable in our theoretical pricing model. To analyze the value of an option position under changing assumptions about underlying price, time to expiration, and volatility, we need only express the volatility at each exercise price using this function: volatility at an exercise price = the at-the-money volatility times f(x) where the exercise price, E, is always expressed in relation to its underlying price, U, and the amount of time to expiration, t: In (E/U) / Vt There is no law that says a trader must agree with the skew implied in the option market. A trader might believe that there is little chance of an unexpectedly large move in the underlying market. In this case, he can lower the wings of the skew, On the other Figure 18-9 Time to Expiration Exercise Price Underlying Price A Theoretical pe Theoretical aa > Pricing Model Value Interest Rates Volatility Volatility Skew ——___—__ 414 Chapter 18 Figure 18-10 140 1909 ~ ~ r — \\ ‘ wings| inflated , / \\ ‘ (better chance of a large move) f / 120 110 Implied Volatility (% of at-the-money) 100 wings reduced (smaller change of a large move) f(x) = 30 * (472) +4 where}x = In(ex.price/fut.price)/sqrt(time) 90 -0.15 -0.10 -0.05 0.00 0.05 0.10 0.15 In(ex. price/fut. price)/sqrt(time) hand, if he believes that a there is a high probability of an unusually large move, he can raise the wings of the skew. This type of modification is also shown in Figure 18-10. A market maker can also use the skew to adjust his bids and offers. If the market maker finds himself with a large positive gamma position and wants to sell options to cut back on the risk associated with the position, he can shift the skew slightly downward. This will have the effect of lowering his bids and offers on all options. If the market maker finds himself short a large number of out-of-the-money calls or puts, he can adjust his skew by raising the wings. This will have the effect of raising his bids and offers on out-of-the-money options. The Bund options in our example form what is probably the most",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.450186"
}