{
  "id": "adfdf1d1b03b",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 179,
  "content": "407 Black-Scholes model, the selling of overpriced options and the buying of underpriced options would eventually cause the implied volatility of every option to line up exactly. Yet this almost never happens in any market. The marketplace, like every individual trader, is trying to evaluate options as efficiently as possible, given all the information available. Whether one believes that markets are efficient or not, one can certainly argue that the marketplace is at least trying to be efficient. From the wide range of implied volatilities found in almost every option +t think the Rlack-Scholac mdr. ket, we can reasonably infer that the marketplace does not think Me ordCK-ocNndies model is one hundred percent efficient. Unfortunately, trying to identify the source of the inefficiency may not be possible. It might have to do with the fact that markets are not frictionless; or the fact that prices do not always follow a diffusion process; or that volatility may vary over the life of an option; or that the real world may not look like a lognormal distribution. Whatever the reason, the marketplace believes that options at any moment are priced efficiently, even if those prices happen to differ from model-gen- erated values. For traders using a theoretical pricing model, prices are often expressed in terms of their implied volatilities. A trader who wants to continue using a theoretical pricing model, but wants to use it in a way which is consistent with the way the marketplace is apparently using the model, might look to the distribution of implied volatilities for additional information. He might begin by plotting the implied volatilities across different exercise prices, and then draw a graph that fits the data points. This has been done in Figure 18-8a for December Bund options. The resulting graph, usually referred to as the volatility skew, has a well defined shape. The low point of the graph is close to the price of the underlying contract (87.86), and the tails of the graph rise as we move to exercise prices further away from the underlying price. One inference which most traders draw from this shape is that the marketplace appears to believe there is a better chance for a large price move in the real world than is predicted by the Black-Scholes model. This is not unreasonable if we look again at Figures 18-5a, 18-5b, and 18-5c. The outliers seem to indicate that large moves occur more frequently in the real world than is predicted by a normal distribution. It is the possibility of these large moves which apparently causes the marketplace to inflate the prices of options which are far out-of-the-money or deeply in-the-money. We can also see that some options are clearly too expensive or too cheap with respect to their neighbors. We may not know exactly what the 88.50 call is worth, but we can see that it is clearly too cheap with respect to the 88 and 89 calls. In the same way, we may not know what the 87 put is worth. But it is clearly too expensive with respect to the 86.50 and 87.50 puts. In the former case, a trader might try to sell the 88.50/89.00/89.50 butterfly. In the latter case, a trader might try to buy the 86.50/87.00/87.50 butterfly. Whatever we think of the skew, there ought to be a smooth progression of implied volatilities from one exercise price to the next. A trader using the Black-Scholes model might take the view that the volatility skew contains useful information which can be incorporated into the decision- making proc- ess. While he might believe that options are generally either overpriced or underpriced, he might also believe that the volatility skew reflects the relative value of options. He 408 Chapter 18 Figure 18-8a 4,00 3.954 VT Coe 3.90 \\ | / 3.85 3.80 \\. 3.75+ 3.70 1 3.65 \\ \" 3604 Implied Volatility Pe ee Pa ' 3.55 84.0 85.0 86.0 87.0 88.0 89.0 90.0 91.0 92.0 Exercise Price might therefore look for a method of using the skew as part of his method of evaluating options. Unfortunately, dealing with a volatility skew can be a problem because there is no exact formula to use as a guide. Moreover, each trader tends to use the skewina way that best serves his ultimate goal. A market maker might treat the skew one way, while a speculator or hedger treats the skew in a different way. Additionally, each trader must determine the relative accuracy of the information reflected in the skew. A trader who disagrees with a skew will find that some strategies will be more attractive than others. For example, consider a trader who is active in the Bund option market, and who is trying to find a simple way to integrate a volatility skew into his theoretical pricing model. He wants his theoretical values to be consistent with the skew, but he also has an opinion on volatility. What might the trader do? Going back to Figure 18-7, we can see that the at-the-money implied volatility in the Bund option market is approximately 3.58. Suppose a trader felt that implied volatility was too low, and that a more reasonable volatility was .25 percentage points higher, at 3.83. If the trader still believed that the skew represented the relative value of options, he might raise the whole skew .25 Volatility points and use these new volatilities to evaluate options at different exercise prices. This would reflect his opinion that implied volatility was too low, but would also take into consideration the relative value of options reflected by the skew. Ina similar manner, the trader could also shift the skew right or left as the price of the underlying contract changed. If the underlying contract several weeks later were to Models and the Real World 409 move up 2.00, a trader could keep the shape of the skew constant but shift the whole skew up 2 points. At the same time, he could raise or lower the skew, using",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure",
    "crypto",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.449878"
}