{
  "id": "7a6839b31f54",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 3,
  "content": "kind enough to read this material and offer their comments and suggestions. Without their help I could not hope to cover all the important aspects of options. To all of them, and to the editors at Probus Publishing Company, who displayed patience above and beyond the call of duty, I offer my thanks and enduring gratitude. Sheldon Natenberg Chicago June 1994 fo 1 Se The Language of Options Every option market brings together traders and investors with different expectations and goals. Some enter the market with an opinion on which direction prices will move. Some intend to use options to protect existing positions against adverse price move- ment. Some hope to take advantage of price discrepancies between similar or related products. Some act as middlemen, buying and selling as an accommodation to other market participants and hoping to profit from the difference between the bid and ask rice. ° Even though expectations and goals differ, every trader’s education must begin with an introduction to the terminology of option trading, and to the rules and regulations which govern trading activity. Without a facility in the language of options, a trader will find it impossible to communicate his desire to buy or sell in the marketplace. Without a clear understanding of the terms of an option contract, and his rights and responsibilities under that contract, a trader cannot hope to make the best use of options, nor will he be prepared for the very real risks of trading. CONTRACT SPECIFICATIONS Options are of two types. A call option is the right to buy or take a long position in a given asset (typically a security, commodity, index, or futures contract) at a fixed price on or before a specified date. A put optionis the right to sell or take a short position in a given asset. Note the difference between an option and a futures contract. A futures contract Tequires delivery at a fixed price. The buyer and seller of a futures contract both have Obligations which they must meet. The seller must make delivery and the buyer must take delivery of the asset. The buyer ofan option, however, has a choice. He can choose to take delivery (a call) or make delivery (a put). If the buyer of an option chooses to either make or take delivery, the seller of the option is obligated to take the other side. In option trading all rights lie with the buyer and all obligations with the seller. The asset to be bought or sold under the terms of the option is the underlying asset Or, More simply, the underlying. The exercise price, or strike price, is the price at which the underlying will be delivered should the holder of an option choose to exercise his Tight to buy or sell. The date after which the option may no longer be exercised is the expiration date, 2 Chapter I If an option is purchased directly from a bank or other dealer, the quantity of the underlying to be delivered, the exercise price, and the expiration date can all be tailored to meet the buyer’s individual requirements. If the option is purchased on an exchange, the quantity of the underlying to be delivered, as well as the exercise price and expiration date, are predetermined by the exchange. ! As an example of an exchange traded option, the buyer of a crude oil October 21 call on the New York Mercantile Exchange has the right to take a long position in one October crude oil futures contract for 1,000 barrels of crude oil (the underlying), at a price of $21 per barrel (the exercise price), on or before October expiration (the expiration date). The buyer of a General Electric March 80 put on the Chicago Board Options Exchange has the right to take a short position in 100 shares of General Electric stock (the underlying) at a price of $80 per share (the exercise price), on or before March expiration (the expiration date). Since stock has no expiration date, the underlying asset for a stock option is simply some number of shares in the underlying stock. In the case of futures options, however, the situation can be somewhat confusing, since a futures contract has a limited life span. The underlying asset for an option on a futures contract is usually the futures month identical to the expiration month of the option. The underlying asset for a crude oil October 21 call on the NYMEX is one October crude oil futures contract. The underlying asset for a Treasury Bond June 96 put on the Chicago Board of Trade is one June Treasury Bond futures contract. Some futures exchanges also list serial options, whereby options with different expiration dates have identical underlying futures contracts. When there is no futures contract with the same expiration month as the option, the underlying contract for that option is the nearest futures contract after the expiration of the option. For example, the underlying for a December Deutschemark option on the Chicago Mercantile Exchange is one December Deutschemark futures contract. With no October or November futures contract available, the underlying for an October or November Deutschemark option is also one December futures contract. December is the nearest futures month after the expiration of October and November options. Expiration dates for exchange traded contracts are not uniform, but are set by each individual exchange. The expiration date for stock options in the United States is usually the third Saturday after the third Friday of the expiration month. For options on futures contracts, however, the expiration need not coincide with the delivery month specified in the option contract. In some cases the exact expiration date for a futures option can predate the delivery month of the underlying futures contract by several weeks. A crude oil option on the NYMEX will typically expire the first Saturday of the preceding month, so that an October option will actually expire the first Saturday in September. 1. Several exchanges have",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "risk_management"
  ],
  "created_at": "2026-02-05T08:09:54.422529"
}