{
  "id": "130c3949f673",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 24,
  "content": "and could convey this information to a theoretical pricing model, any evaluation of options on that market would be more accurate than if we simply ignored volatility. Since option models are based on mathematical formulae, we will need some method of quantifying this volatility component so that we can feed it into the model in numerical form. RANDOM WALKS AND NORMAL DISTRIBUTIONS Consider for a moment the pinball maze pictured in Figure 4-1. When a ball is dropped into the maze at the top it moves downward, pulled by gravity, through a series of nails. When the ball encounters each nail there is a 50% chance the ball will move to the right, and a 50% chance it will move left. The ball then falls down to a new level where it encounters another nail. Finally, at the bottom of the maze the ball falls into one of the troughs. The path the ball follows as it moves downward through the maze of nails is known as a random walk. Once the ball enters the maze nothing can be done to artificially alter its course, nor can one predict ahead of time the path the ball will take through the maze. 51 52 Chapter 4 Figure 4-1: Random Walk If enough balls are dropped into the maze, we might begin to get a distribution of balls similar to that in Figure 4-2. Most of the balls tend to congregate near the center of the maze, with a decreasing number of balls ending up in troughs further away from the center. The distribution which results from dropping many balls into our maze is referred to as a normal, or bell-shaped, distribution. If we were to drop an infinite number of balls into the maze we might approximate the distribution with a normal, or bell-shaped, curve such as the one overlaid on the distribution in Figure 4-2. Such a curve is symmetrical (if we flipped it from right to left it would look the same), it has its peak in the center, and its tails always flare down and away from the center. Normal distribution curves are used to describe the likely outcomes of random events. For example, the curve in Figure 4-2 might also represent the results of flipping a coin 15 times. Each outcome, or trough, would represent the number of heads which occurred after each 15 flips. An outcome in trough zero would represent zero heads and 15 tails; an outcome in trough 15 would represent 15 heads and zero tails. Of course, we would be surprised to flip a coin 15 times and get all heads or all tails. Assuming the Volatility 53 Figure 4-2: Normal Distribution coin is perfectly balanced; some outcome in between, perhaps 8 heads and 7 tails, or 9 heads and 6 tails, seems more likely. Suppose we change our maze slightly by closing off a row of nails so that each time a ball encounters a nail and goes either left or right, it must drop down two levels before it encounters another nail. [f we drop enough balls into the maze we may end up with a distribution represented by the curve in Figure 4-3. Since the sideways movement of the balls is restricted, the curve will have a higher peak and narrower tails than the curve in Figure 4-2. In spite of its altered shape, this curve still represents a normal distribution, although one with slightly different characteristics. Finally, we might block off some of the spaces between nails so that each time a ball drops down a level it must move two nails left or right before it can drop down to 4 new level. Again, if we drop enough balls into the maze we may get a distribution Which resembles the curve in Figure 4-4. This curve, while still a normal distribution Curve, will have a much lower peak and its tails will spread out much more quickly than the curves in either Figure 4-2 or 4-3. 54 Chapter 4 Figure 4-3: Low Volatility Distribution 'e ( [ le [ [fal ff | (C[ [lg ill [lig f (Il \\ BY, \\ Suppose we now think of the ball’s sideways movement as the up and down price movement of an underlying contract, and the ball’s downward movement as the passage of time. If we assume that each day the underlying contract can move up or down $1, the price distribution after 15 days might be represented by the curve in Figure 4-2. If we assume the price can move up or down $1 every two days, the price distribution after 15 days might be represented by the curve in Figure 4-3. And if we assume that each day the price can move up or down $2, the price distribution might be represented by the curve in Figure 4-4. With the underlying contract presently at $100 and 15 days to expiration, how might we evaluate a $105 call? One way is to assume that prices follow a random walk through time and that one of the curves in Figures 4-2, 4-3, or 4-4 represents the likely distribution after 15 days. The comparative value of the $105 call under these three scenarios is shown in Figure 4-5. If we assume a distribution similar to Figure 4-3, we can see that the underlying contract has very little chance of reaching $105. Conse- quently, the value of the $105 call will be low. If we assume a distribution similar to Figure 4-2, there is an increased probability of the underlying reaching $105, and this will increase the value of the $105 call. Finally, if we assume a distribution similar to Volatility 55 Figure 4-4: High Volatility Distribution Figure 4-4, there is a very real likelihood that the $105 call could finish in-the-money. As a result, the value of the option will increase dramatically. (f we assume only that the price movement of an underlying contract follows a Tandom walk, and nothing about the",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.425883"
}