{
  "id": "f59b547dd507",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 125,
  "content": "simply trying to replicate the automatic rehedging (gamma) characteristics of the option. The cost of the option, or the cost of the rehedging process, is the price the hedger pays for the option’s gamma characteristics. Since we need to continuously compute the delta to replicate an option through a rehedging process, this method of replication requires us to use a theoretical pricing model. We are therefore likely to encounter many of the same problems which we encounter anytime we use a theoretical pricing model to evaluate an option. Is the model itself correct? Do we have the right inputs? Leaving aside the question of the Hedging with Options 271 Figure 13-8 % of Asset Asset Delta of Needed for Required Week Value 100 call Replication Adjustment (¢) 101.35 57 57% sell 43% 1 102.26 62 62% buy 5% 2 99.07 46 46% sell 16% 3 100.39 53 53% buy 7% 4 100.76 56 56% buy 3% 5 103.59 74 74% buy 18% 6 99.26 45 45% sell 29% 7 98.28 35 35% sell 10% 8 99.98 50 50% buy 15% 9 103.78 93 93% buy 43% 10 102.54 100 100% buy 7% model’s correctness, anyone wishing to use this method will have to come up with a reasonable volatility estimate. If the volatility estimate turns out to be too high or too low, the cost of replicating the option will be more or less than originally expected. But notice that the cost of replication will always be the right cost. If the market is more volatile than expected, the cost will be greater in terms of required adjustments. But the value of the option would also have been greater. Higher volatility means a higher theoretical value. In the same way, if the market is less volatile than expected, the cost will be less in terms of required adjustments. The value of the option would also have been less. Lower volatility means a lower theoretical value. This process of continuously rehedging an underlying position to replicate an option position is often referred to as portfolio insurance. The method can be used to protect any long or short position against adverse movement, but it is most commonly used by fund managers who wish to insure the value of the securities in a portfolio against a drop in value. For example, suppose a manager has a portfolio of securities currently valued at $100 million. If he wants to insure the value of the portfolio against a drop in value below $90 million, he can either buy a $90 million put, or he can replicate the characteristics of a $90 million call. If he is unable to find someone willing to sell him a $90 million put, he can evaluate the characteristics of the $90 million call and continuously buy or sell the portion of his portfolio required to replicate the call position. In effect, he has created his own put. Unfortunately, the costs of buying and selling a large number of securities in odd amounts may be quite high. While the concept of portfolio insurance may be attractive from a theoretical perspective, the transaction costs may make the process too expensive to be of practical value. Is there any way a fund manager can use portfolio insurance While keeping transaction costs within acceptable bounds? One common method involves using futures contracts as a substitute for the portfolio holding. If the mix of securities in a portfolio approximates an index, and futures contracts are available on that index, the manager can approximate the results of portfolio insurance by purchas- ing or selling futures contracts to increase or decrease the holdings in his portfolio. In 272 Chapter 13 the United States several index futures are available, the most popular being the futures contract on the S&P 500 index traded at the Chicago Mercantile Exchange. Many fund managers use S&P 500 futures to insure their portfolios against adverse movement in the stock market. This method is not without risk, since the S&P 500 index is unlikely to exactly duplicate the holdings of any one portfolio. Still, the risk may be acceptable given the reduced transaction costs. Even if options are available on an underlying asset, a hedger may still choose to effect a portfolio insurance strategy himself rather then purchasing the option in the marketplace. For one thing, he may consider the option too expensive. If he believes the option is theoretically overpriced, in the long run it will be cheaper to continuously rehedge the portfolio. Or he may find insufficient liquidity in the option market to absorb the number of option contracts he needs to hedge his position. Finally, the expiration of options which are available may not exactly correspond to the period over which he wants to protect his position. If an option is available, but expires earlier than desired, the hedger might still choose to purchase options in the marketplace, and then pursue a portfolio insurance strategy over the period following the option’s expiration. For all these reasons, portfolio insurance has become an increasingly popular method of protecting a position in an underlying asset. a 14 % Volatility Revisited While there are many ways in which traders interpret volatility, in theory the value of an option depends on only one volatility, the volatility of the underlying contract which will occur over the life of the option. Of course, this volatility is unknown to a trader since it will occur in the future. Nevertheless, if a trader wants to use a theoretical pricing model, he will be required to make some prediction about the volatility of the underlying contract over the life of the option. Making an intelligent volatility forecast can be a difficult and frustrating exercise, especially for a new option trader. The forecasting of directional price movements through technical analysis is a commonly studied area in trading, and there are many sources to which a trader can turn for information on this subject. Unfortunately, volatility is a much newer concept, and there",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.441449"
}