{
  "id": "3fd9dc131374",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 89,
  "content": "for the larger loss. FIGURE 10.30 A Successful Sell Anti P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: The Anti 329 D: Though the stock recovered to close above the midpoint of the session, this strong down day in Figure 10.30 is conﬁrmation that the balance of power has shifted, and should add conﬁdence to the trade. Note also that, depending on the exact location of the entry and the stop, the ﬁrst target may have been hit on this ﬁrst downward bar. Do not expect that every one of these will be a clean trade with no retracements. In this case, there were multiple small pauses as the market traded lower. Maintain the discipline of proﬁt taking, and avoid the temptation to add to the trade unless another pattern, such as a nested pullback, sets up. In this case, the small failure test at E might have been motivation to exit any remaining short exposure. Anti 2 FIGURE 10.31 A Sell Anti in Baidu Inc. (Nasdaq: BIDU) Setup A: This “slide along the bands” trend in Figure 10.31 is a sign of a very strong though potentially overextended trend. Imagine the frustration that a trader attempting AG - Daily F. trS! Majestic s ·1v 1 er Corp BIDU - Daily Baidu Inc 135 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 330 TRADING STRATEGIES to fade this pattern would have felt—without any clear risk points, the trend continued to grind higher, rolling over any attempted short entries. B: In this case, a single large bar completely shifted the technical picture. This bar was out of character with the recent price action and carried price well through the moving average. Note that the MACD registered a signiﬁcant new low, rela- tive to its recent history, on this thrust. Entry C: The actual entry would have been somewhere around C or the bars following, executing the plan of shorting intraday breakdowns or perhaps simply shorting below the previous day’s low. Stop Only the near stop is shown in this example, though a much farther stop, above the extreme of the trend high, is also possible.FIGURE 10.32 A Clean, Sharp Breakdown out of a Sell Anti P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: The Anti 331 D: Whether this bar in Figure 10.32 or a preceding bar was the entry, the initial target was probably hit on the bar following D. Book partial proﬁts here, and lower the stop to reduce open risk in the trade. E: Remember, the swing trader’s job is to take one clean move out of the market. Though there was more downside over the next four to six weeks, most swing traders would have covered their position on the sharp reversal at E. F: This is essentially a higher time frame pullback and is not strictly part of the Anti trade, though it is an example of how a lower time frame structure (the Anti) can set up an environment that is favorable to a larger pattern. Anti 3 FIGURE 10.33 A Buy Anti Setup in the EURUSD Setup A: This downtrend in Figure 10.33 was perhaps not as dramatically overextended as the uptrends in the previous examples, but multiple tests below the lower band, followed by a last-gasp sell-off that quickly failed, were warnings of a possible overextension and of a trend that was primed for reversal. BIDU • Daily Baidu Inc ~------- ~ ---- · ···· -····· ···- --/\"'-. I 2.00 ~ --~ /\"\\, ·-- ~~--,J V ,... _____ ,... --- ________ \\..._,/ .. --4.00 1,lar Apr I.lay Jun EURUSD. Daily Euro/ US Dollar 1.40000 136 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 332 TRADING STRATEGIES B: The bounce at B is out of character with the preceding price movement. The up- swing was longer than previous upswings, both in price and in time, and the MACD conﬁrms with a new high. Entry C: This is a small complex consolidation (two legs down, separated by a failed rally attempt) nested inside an Anti. An Anti is, in fact, basically a pullback—the distinguishing feature is its location in the trend. An entry could have been at- tempted near the right edge of the chart, against a stop somewhere above 1.20. FIGURE 10.34 A Strong Uptrend Develops oﬀ the Buy Anti D: You have to pay attention with these entry setups, and cannot always wait until the end of the bar. In this case, if you missed the early entry on the previous day’s breakout, it might have made sense to pass on the trade, rather than entering after such a large up day as D in Figure 10.34. However, this is a case in which the statistical tendencies for different asset classes matter. An individual stock or stock index might have been more set for a small reversal following day like D, but currencies do not show this tendency. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: The Anti 333 E: Though signiﬁcant exposure should have been trimmed early, at lower proﬁt tar- gets, this small pullback is a justiﬁable second entry. Many traders will treat an entry like this as an entirely separate trade, perhaps continuing to hold",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.709294"
}