{
  "id": "24f094787928",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 155,
  "content": "20 ABC straddles he can purchase 25 ABC straddles. The effect of doing the spread in this new ratio is shown in Figure 16-6. We can see from Figure 16-6 that in the new size of 25 x 40 the spread breaks even if XYZ does move 25% faster than ABC. But the position acts like a long straddle if ABC and XYZ move at the same rate. In the new size of 25 x 40 the volatility difference between the two contracts has become a factor in determining the correct ratio. Originally, the trader balanced his spread based on the following relationship: ABC contracts x $delta of ABC x ABC option delta must equal XYZ contracts x $delta of XYZ x XYZ option delta But taking into consideration the different volatilities of the two contracts, the spread is now balanced if: ABC contracts x $delta of ABC x ABC option delta x ABC volatility equals XYZ contracts x $delta of XYZ x XYZ option delta x XYZ volatility Our XYZ call position is: 40 x $100 x .50 x .25 = $500 Taking into consideration the volatility, each ABC call has a $delta of $200 x .50 x .20 = $20 342 Chapter 16 Figure 16-5: Long 20 ABC 50 Calls/Long 20 ABC 50 Puts Short 40 XYZ 100 Calls/Short 40 XYZ 100 Puts _ ABC and XYZ move up and down at the same rate Profit & Loss XYZ moves up and down 25% faster than ABC T T T T T T T T T T T T T T T T T T 7 40 41 42 43 44 45 46 47 #48 #49 #50 51 52 53 54 55 56 57 58 59 60 ABC Price Therefore, the proper number of ABC contracts required to balance the spread is 500/20, or 25 contracts. The spread is now completely balanced since: 25 x $200 x .50 x .20 = 40 x $100 x .50 x .25 We can see that the volatility relationship between the two contracts can be an important factor in determining the proper ratio in an intermarket volatility spread. Since predicting the correct volatility of even one underlying contract can be such a difficult task, what chance does the trader have of being correct about the volatility of two different contracts? The important consideration in an intermarket spread is not necessarily the volatility of each individual contract, but the volatility relationship between the contracts. If a trader can determine the relationship, the actual volatility might not affect the spread value. For example, if we determine that XYZ is always 25% more volatile than ABC, the actual volitilities of ABC and XYZ don’t really matter. The ratio is the same whether the volatility of ABC is 20% and XYZ is 25%, or ABC is 12% and XYZ is 15%, or ABC is 28% and XYZ is 35%. In each case XYZ is 25% more volatile than ABC, so the ratio of XYZ to ABC is the same. Is it possible to identify markets with well defined volatility relationships? While there can be no absolute answer, some markets do seem to be so closely related that their volatilities take on a well defined relationship. Intermarket Spreading 343 Profit & Loss Figure 16-6: Long 25 ABC 50 Calls/Long 25 ABC 50 Puts Short 40 XYZ 100 Calls/Short 40 XYZ 100 Calis ABC and XYZ move up and down at the same rate XYZ moves up and down 25% faster than ABC re | T T T TT T T T T T T T T i7 T TT T T 40 41 42 43 44 #45 46 47 #48 #<449 #50 5&1 52 53 54 55 56 57 58 59 60 ABC Price For example, several indexes exist which track the performance of the U.S. stock market. Not only might we expect these indexes to move up or down together, at least over longer periods of time, but we might also expect them to have similar volatility characteristics. As an example, the 50-day historical volatilities of two of these indexes, the S&P 100 (OEX) and the New York Stock Exchange Composite Index (NYA), are shown in Figure 16-7. There is clearly some relationship between the volatility of these two indexes, but how close is the relationship? To help answer the question, NYA volatility has been plotted as a percent of OEX volatility in Figure 16-8. We can see that NYA volatility is typically somewhere between 80% and 95% of OEX volatility. As a rough estimate we might decide that on average NYA volatility is approximately 87% of OEX volatility. Suppose we find that OEX options, traded on the Chicago Board Options Exchange, and NYA options, traded on the New York Stock Exchange, are trading at approximately the same implied volatility. Since we expect the NYA to be approximately 13% less volatile than the OEX, how can we construct a strategy which exploits this apparent mispricing between OEX and NYA options? If we decide to buy at-the-money OEX straddies and sell at-the-money NYA straddles, and also take into consideration the relative volatilities of the two markets, we know that in a balanced spread: Chapter 16 344 26-Sny e6dy L6-AON Lene b6-de4 06-PO 06-AeW 68-08 68-6ny 6e.dy 88-AON gene * Ayyejoa peauoysiy Aep 0S X30 AUEIOA peou0}sIYy Aep 0S WAN 9¢ AWINEIOA [EOUOISIH WAN SNSJ@A X3O 2-91 enBly (%) AuneloA pezipenuuy 345 Intermarket Spreading z6-Bny e6-1dy L6-AON i bene 16-484 06790 o6-AeWw 68-98q 68-ny e68-idy se-AON 88INt Ll Ll 1 1 1 L 1 WSL — -%08 ooh GB + %06 + %&6 ern ene ne ee ena %O00t AUINEIOA XAO Jo USD B se AUINEIOA WAN ‘8-91 eanbi4 346 Chapter 16 number of OEX straddles x OEX $delta x .87 must equal number of NYA straddles x NYA $delta Suppose the OEX is at 440 and the NYA is at 260. Since both contracts have the same point value of $100, the $deltas for the two indexes",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure",
    "strategies",
    "crypto",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.446209"
}