{
  "id": "20c790d8b293",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 64,
  "content": "puts (-46) = = i) — ou © sell 7) calls and puts gS at the same exercise price ratio vertical spreads. But other spreads, including straddles, can be ratioed. This is usually done to ensure that the spread is delta neutral. A long straddle has many of the same characteristics as a backspread. Like a backspread it has limited risk and unlimited profit potential. With a long straddle, however, the trader’s potential profit is unlimited in either direction. If the market moves sharply up or down, the straddle will realize ever increasing profits as long as the market continues to move in the same direction. A short straddle has many of the same characteristics as a ratio vertical spread. The spread will realize its maximum profit if the market stays close to the call and put exercise price. The spread has a limited profit potential, and unlimited risk should the market move violently in either direction. The new option trader often finds long straddles attractive because strategies with limited risk and unlimited profit potential offer great appeal, especially when the profit is unlimited in both directions. However, if the hoped for movement fails to materialize, he soon finds that losing money little by little, even a limited amount, can also be a painful experience. This is not an endorsement of either long or short straddles. Under the right conditions either strategy may be sensible. But the intelligent trader’s primary concern ought to be the total expected return. If the strategy with the greatest expected return also entails unlimited risk, a trader may have to accept that risk as part of doing business. Volatility Spreads 143 STRANGLE Like a straddle, a strangle consists of a long call and a long put, or a short call and a short put, where both options expire at the same time. In a strangle, however, the options have different exercise prices. If both options are purchased, the trader is long the strangle; if both options are sold, the trader is short the strangle. Typical long and short strangles are shown in Figures 8-7 and 8-8. Strangles have characteristics similar to straddles, and are therefore similar to backspreads and ratio vertical spreads. Like a long straddle, a long strangle needs movement to be profitable, and has unlimited profit potential should such movement occur. Like a short straddle, a short strangle has unlimited risk in either direction, but will show a profit if the underlying market remains in a narrow trading range. If a strangle is simply identified by its expiration month and exercise prices, there may be some confusion as to the specific options involved. A June 95/105 strangle might consist of a June 95 put and June 105 call. But it might also consist of a June 95 call and a June 105 put. Both these combinations are consistent with the definition of a strangle. To avoid confusion a strangle is commonly assumed to consist of out-of-the- money options. If the underlying market is currently at 100 and a trader wants to purchase the June 95/105 strangle, it is assumed that he wants to purchase a June 95 put and a June 105 call. When both options are in-the-money, the position is sometimes referred to as a guts. Figure 8-7: Long Strangle oY Hf et . ts) puts (Calls) calls (pu at a lower at a higher = exercise price exercise price 77) oO fo] J tong 20 March 105 calls long 30 June 110 calls long 20 March 95 puts long 15 June 100 puts 144 Chapter 8 Figure 8-8: Short Strangle short 30 March 110 calls short 10 June 95 calls short 40 March 90 puts short 10 June 105 puts = — fe) — ou n 3 3 : sell sell puts (calls) calls (puts) at a lower at a higher exercise price exercise price In the absence of other identifying information, strangles, like straddles, are usually executed with a one-to-one ratio (one call for each put). However, there is no law against executing a strangle with some other ratio. If the call has a delta of 15 and the put has a delta of -30, and a trader wants to be delta neutral, it is perfectly acceptable to trade two calls for each put. If we ignore the limited or unlimited risk/reward characteristics of backspreads, long straddles, and long strangles, these spreads essentially differ in the degree of desired movement. A backspread needs some market movement to show a profit, a long straddle needs more movement, and a long strangle needs even greater movement. Indeed, a strangle is usually considered the most highly leveraged of all option positions because out-of-the-money options are cheap relative to other options. Several strangles can often be purchased for the price of just one straddle. If significant movement occurs with such a position, its value can increase dramatically. But there is a tradeoff. If movement fails to occur, the position will swiftly lose its value through the passage of time. The same considerations of degree are also true for ratio vertical spreads, short straddles, and short strangles. A ratio vertical spread, a short straddle, and a short strangle all want the market to sit still. But again, the strangle is considered the most highly leveraged of these positions. If a trader sells several strangles and the market does sit still his profits will usually be greater than if he had sold one straddle or done a moderate sized ratio vertical spread. If, however, the market makes an unexpectedly large move, short strangles also entail the greatest risk. All option positions are a tradeoff Volatility Spreads 145 between risk and reward. Jf the reward is great, so is the risk; if the risk is small, so is the reward. Based on their similar characteristics, it is sometimes convenient to classify long straddles and long strangles as special types of backspreads. This follows logically from the definition of a backspread: long more contracts than short, with all",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "crypto",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.432096"
}