{
  "id": "44a20da7ee9d",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 31,
  "content": "Murrell, “Values W ork in Acceptance and Commitment Therap y : Settin g a Course for Behavioral Treatment.” In Mindfulness and Acceptance: Expanding the Behavioral Tradition, ed. Steven C. Ha y es et al. (New Y ork: Guilford Press, 2004), 139. 4. Georg H. Eifert and John P . Forsyth, Acceptance and Commitment Therap y for Anxiet y Disorders: A Practioner’s Guide to Using Mindfulness, Acceptance and V alues‐Based Behavior Change Strategies ( Oakland, CA: New Harbin g er, 2005), 161–166. PART III Maximizing Y our Trading Performance 36 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 205 I n Part I and Part II of the book , we have looked at how our minds work and what w e can do to develop eff ective mental skills to overcome the psychological chal- lenges we face in trading. If you have made the e ff ort to complete the exercises and have applied some of the methods presented in the book, you may now be able to begin recognizing the mental shortcuts that aff ect your trading and to engage your deliberative mind better, and you may now see the infl uence of cognitive heuristics and biases beginning to subside. For traders who have become ensnared in thoughts and feelings of fear or other strong emotions, if you have started practicing mindful- ness, you may b e a bl e to b egin d e f using f rom t h ose t h oug h ts an d f ee l ings, maintain b etter attention on t h e mar k et, an d start to ta k e t h e actions t h at support your tra d es. Y ou are now on the track to g reater success. However, overcomin g psycholo g ical c h a ll en g es is on l y one aspect o f tra d in g psyc h o l o g y . For tra d ers to maximize t h eir tra d ing per f ormance t h ere is anot h er very important aspect o f tra d ing psyc h o l ogy traders need to know and learn: performance psycholo g y. So far we have dealt only with what seems to be “ne g ative” psycholo g y: the psy- c h o l ogy o f negative emotions, unwante d t h oug h ts, cognitive b iases, an d erratic behaviors. But there is a “positive” side of psycholo g y traders can employ in their The Trading P syc h o l o gy g Process: High- Quality Preparation g CHAPTER 9 209THE TRADING PSYCHOLOGY PROCESS: HIGH-QUALITY PREPARATION Simi l ar l y, t h e During time frame is all about Eff ective Tradin g Execution (EE), and we will discuss the associated hi g h-value activities and mental skills of Eff ective Execution . O ur After time frame involves the psychological skills and activities of r Constructive Se lf ‐Assessment (CSA). It is in t h is time f rame t h at we intentiona lly evaluate our tradin g performance. Once we understand the HVMSs and HV As within each of the time frames, we can t h en assess ourse l ves on eac h d omain an d d etermine w h ere we are strong or wea k . From h ere, we can ta k e steps to en h ance our tra d ing per f ormance an d our persona l self‐development. Not only do we have an inventory of HVMSs/HV As and proce - d ures to b enc h mar k our tra d ing per f ormance, t h is same inventory a l so gives us a h ig hl y e ff ective and practical process to follow . In this chapter we will focus on the mental e l ements an d activities o f Hig h -Qua l ity Preparation. C h apters 10 an d 11 wi ll b e d e - voted to E ff ective Tradin g Execution and Constructive Self‐Assessment, respectively . T a bl e 9 . 1 i ll ustrates h ow t h e tra d ing psyc h o l ogy f ramewor k is d ivi d e d into t h e three major areas: High-Quality Preparation, Eff ective Execution, and Constructive Self‐Assessment. Each of the three major areas is further divided into hi g h‐value mental skills. High-Quality Preparation, for example, is subdivided into the HVMSs of: Perspective, Personal Awareness, Self‐Motivation, and Mental Discipline. W e dis - cuss each of these mental skills alon g with the specifi c tradin g activities that to g ether form the process of High-Quality Preparation in this chapter. As we go through the details and discuss these HVMSs, think about how you mi g ht rank yourself on each of them. How consistent are you in each? The closer you score yourself to bein g fully consistent, the more dialed in you are for that high-value mental skill. Less consis - tency su gg ests you have some work to do in that area. The idea is to measure where y ou are in each of these mental domains. For each of the next three chapters, y ou are provided with a set of questions you can use to assess yourself in each of these important areas. These self‐assessment tools come at the end of each chapter. Keep in mind we are evaluatin g ourselves in terms of mental and psycholo g ical skills spe - cifi cally relevant to the mental side of",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology"
  ],
  "created_at": "2026-02-05T00:37:45.721201"
}