{
  "id": "aa20bfa5b604",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 145,
  "content": "are 100 x 6% x 2/12 = 1.00 we know that the call should be 1.00 more expensive than the put. If the put is trading for 4.00, the call should be trading for 5.00. Suppose that the stock is trading for 100 and the put 4.00, but the call is actually trading for 4.25. What should a trader do? Regardless of the trader’s opinion about volatility, it’s clear that the call is .75 too cheap with respect to the put. A trader familiar with synthetic relationships will attempt to take advantage of this relative mispricing by Stock Index Futures and Options 321 executing a reverse conversion: buy the call for 4.25, sell the put for 4.00, sell the stock for 100. The result will be a profit at expiration of .75 when the trader closes out the position by either exercising the put or being assigned on the call. True arbitrage relationships are unlikely to be violated in an option market where there is a well defined and freely traded underlying contract. If such a relationship is violated, a trader can always trade the underlying instrument against the mispriced arbitrage relationship and essentially lock in a profit equal to the mispricing. The cumulative effect of all traders attempting to profit from a mispriced relationship is that the mispricing quickly disappears. Now consider a trader who encounters a similar mispricing in a stock index option market where the options are settled in cash. Suppose that the index is at 400 and that, according to the synthetic relationship, the 400 call should be 3.00 greater than the 400 put. With the 400 put trading at 6.00, the trader would expect to see the 400 call trading at 9.00. What should he do if he finds that the 400 call is actually trading at 7,50? The trader would like to take the same action in the index that he would take if he were dealing with options in an individual stock: buy the call for 7.50, sell the put for 6.00, and sell the index for 400.00. This ought to result in a profit of 1.50, the amount by which the call and put are mispriced relative to each other. Is this a practical strategy in the index option market? Certainly the trader can buy the 400 call and sell the 400 put. But when the trader goes to sell the index he may find that it is not as easy as he originally thought. Depending on how broadly based the index is, the trader may have to sell several hundred stocks in various proportions. It might be possible to do so, but it will certainly not be as easy as selling one stock. Even if he is able to sell all the stocks in the index in the right proportion, has he executed a true reverse conversion? A true reverse conversion consists of being long a call and short a put, and short the underlying instrument, where the underlying instrument is the instrument to be delivered when an option is exercised. If the basket of stocks were the true underlying instrument, the trader would make delivery of, or take delivery of, the basket if the 400 call or 400 put were exercised. But this is not what happens in an index market. If the trader exercises the call, or is assigned on the put, there is a cash transfer. But the trader is still left holding the basket of stocks. The fact that the index is settled in cash can make a conversion or reverse conversion a much riskier strategy in an index option market than in an individual stock option market, especially if the options are American. Moreover, arbitrage strategies are typically done in large size because of their narrow profit margin. If a trader executes such a strategy and finds himself assigned overnight, his position might become horribly unbalanced. The next day even a small adverse move in the index could prove disastrous. If a trader could execute all the stocks in the index, and could be certain of holding the position to expiration, he would still have to physically liquidate his stock position. Since the option values at expiration are determined by the closing index value, and since the index value is determined by the closing trades in each individual stock, the 322 Chapter 15 trader must ensure that he closes each of his individual stock positions at the closing price on the exchange from which the index is calculated. In many cases, he can accomplish this by placing market-on-close (MOC) orders for each individual stock. But he must be very careful. If he fails to close out each stock position at the appropriate price, his arbitrage may not produce the profit originally expected. Because it can be difficult to trade a complete and correctly proportioned basket of stocks, and because there is the additional risk of early exercise after an index arbitrage has been executed, mispriced synthetic relationships are not as easy to exploit in index option markets as in other option markets. Not only do such mispricings occur more frequently in index option markets, they can persist for long periods of time. Finding a Substitute for the Index Regardless of the difficulty in executing arbitrage strategies, if a synthetic relationship appears to be sufficiently mispriced a trader will look for some way to exploit the situation, even with the additional risks that go with such a strategy. This means either trying to execute the basket of stocks underlying the index, or looking for an acceptable substitute for the basket. If the index is narrowly based, with only 20 or 30 stocks, it may not be unreason- able to try and execute a complete basket of stocks. If the index is more broadly based, with several hundred stocks, the difficulties of executing every stock in the right quantity may make it impractical to execute a complete basket. In such a case, a trader may question whether a",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.444651"
}