{
  "id": "935abee3afd3",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 91,
  "content": "posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trading at Support and Resistance 337 Breakouts: Early Entry in Base FIGURE 10.38 Buying a Spring at Support in VHC Setup After a long run-up, VirnetX Holding Corporation (AMEX: VHC) rolled over into an extended consolidation, as shown in Figure 10.38. A: The initial downswing, at A, might have set up a sell Anti. B: However, at B, buyers stepped in and it became clear that there would be no easy downward momentum; the stock then traded in a multimonth range near the pre- vious highs. This type of consolidation often sets up an attractive breakout trade, but the problem is ﬁnding a precise entry and managing the risk in the trade. Entry One way to enter a breakout trade is to recognize the pattern setting up, and enter in anticipation of the breakout. C: In this case, a failure test of the previous pivot at C offered an attractive entry. Note that this is a classic Wyckoff spring, though the best examples of springs should penetrate previous support more decisively. Stop Initially, this entry is nothing more than a failure test at the previous pivot. The appropriate stop is just beyond the low of C, but the issue of potential slippage and a gap opening must be considered. One answer is to accept both of those risks as normal P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 338 TRADING STRATEGIES trade risks and to trade full size. It is also possible to initiate a smaller position near this low, planning to add to the trade later or to set the stop slightly lower. All of these are legitimate answers to these issues, but this question must be clearly addressed in the trading plan. FIGURE 10.39 A Complicated Winning Breakout Trade D: The stock immediately reversed off the spring and traded sharply back to highs in Figure 10.39. D marks the actual breakout, which failed on this attempt. Con- sider the difference between initiating a position at C or at D. The trader who enters at D is now in a position of weakness and must exit the position, while the trader who entered at C is holding substantial proﬁts and has many more trade management options available. Will you exit part or all of the position on the failure, taking proﬁts and looking to reestablish? Will you add to your po- sition at D and then adjust it if the trade fails? Will you do nothing? These are all choices available only to the trader who positions somewhere near the bottom of the range. E. The stock holds a tighter consolidation up against resistance. E is a small spring, and may not be a realistic entry as it penetrates previous support by only a few cents. F: The actual breakout comes at F, as the stock ﬁnally clears resistance and trades sharply higher. VHC O • • ally VirnetX Hold' ing Corp 14.00 12.00 Feb lolar VHC O • • a,ly Virnet:X Hold· ,ng Corp 139 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 340 TRADING STRATEGIES FIGURE 10.40 A Complicated Breakout Trade in JPMorgan Chase & Company (NYSE: JPM) FIGURE 10.41 A Downtrend Follows a Downside Breakout 48.00 • JPl.lorgan Chas e &{ o ~ ~t• 47.00 , ••• \"''\" .,11 I VII~ '6.00 ,~f 'j'!l\\~tl ~·--- --~~ j I, \"-\" I .- ~-- \"·\" Apr 41.00 48.00 47.00 46.00 140 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 342 TRADING STRATEGIES At Breakout Point (Failure Test) FIGURE 10.42 A Breakout Failure in Discover Financial Services (NYSE: DFS) This failure pattern, shown in Figure 10.42, is nothing more than a failure test at the potential breakout level. (We could say that a failure test is a failed breakout.) A and C are classic springs (which are themselves downward breakout failures); each would have been an excellent entry for the potential upside breakout. There are also two failed upside breakouts here. B is a small failure test at the highs, and D is a large-scale failure. These failures can be dramatic and they demand respect. Breakouts often encourage large groups of traders to enter overextended markets; the reversals from failures at these points can be violent. Note that the breakout may fail on the same bar or a few bars following the actual breakout. The main challenge here is differentiating between a normal breakout pullback, which may or may not violate the breakout level, and a more decisive failure. At First Consolidation The ﬁrst pullback following a breakout is often an excellent spot to enter a trade. If the breakout works and a longer trend develops, this entry will have been right at the inception of the new trend. However, there is still a possibility of a failed breakout, which, in this case, will fail through a failed pullback. Deep study DFS - Daily o· iscover f -inancial s -erv,ces 22.00 21.50 21.00 , , 20.50 20.00 0.80 Mar Apr May 141 This PDF file is part of the audiobook THE ART AND SCIENCE",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.709610"
}