{
  "id": "01ead3c81b3a",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 63,
  "content": "the upside profit potential is unlimited; in a put backspread the downside profit is unlimited. But the primary consideration is that some movement will occur. If no movement occurs, a backspread is likely to be a losing strategy. Typically, a backspread is done for a credit. That is, the amount of premium received for the sold options is greater than the premium paid for the purchased options. This ensures that the backspread will be profitable if the market makes a large move in either direction. If the market collapses in the case of a call backspread, or the market Figure 8-1: Call Backspread sall the buy the lower higher exercise exercise price price 2 oa ~<a B long 30 March 105 calls (24) g short 10 March 95 calls (78) long 25 June 110 calls (23) short 10 June 100 calls (51) Volatility Spreads 139 Figure 8-2: Put Backspread buy the sell the lower higher exercise exercise price price = 6 o _ n 3 long 80 March 90 puts (-6) aa short 10 March 100 puts (-48) long 45 June 95 puts (-30) short 30 June 100 puts (-46) explodes in the case of a put backspread, all options will expire worthless and the trader will keep the credit from the initial transaction. A trader will tend to choose the type of backspread which reflects his opinion about market direction. If he foresees a market with great upside potential, he will tend to choose a call backspread; if he foresees a market with great downside potential he will tend to choose a put backspread. He will avoid backspreads in quiet markets since the underlying contract is unlikely to move very far in either direction. RATIO VERTICAL SPREAD (also referred to as a ratio spread, short ratio spread, vertical spread, or front spread) A trader who takes the opposite side of a backspread also has a delta neutral spread, but he is short more contracts than long, with all options expiring at the same time. Such a spread is sometimes referred to as a ratio spread or a vertical spread. However, these terms can also be applied to other types of spreads. In order to avoid later confusion, we will designate the opposite of a backspread as a ratio vertical spread. Typical ratio vertical spreads, and their expiration values, are shown in Figures 8-3 and 8-4, From these graphs we can see that a ratio vertical spread will realize its maximum profit at expiration when the underlying contract finishes right at the short (sold) option’s exercise price. Since a ratio vertical spreader assumes the opposite risks of a backspreader, his risk is unlimited on the upside in a call ratio vertical spread, and 140 Chapter 8 Figure 8-3: Call Ratio Vertical Spread Profit Loss long 20 March 95 calls (78) short 30 March 100 calls (61) long 10 June 95 calls (67) short 30 June 110 calls (23) buy the lower exercise price sell the higher exercise price Figure 8-4: Put Ratio Vertical Spread Profit Loss 7 long 20 March 95 puts (-21) short 60 March 90 puts (-6) long 15 June 105 puts (-62) short 20 June 100 puts (-46) sell the lower exercise price buy the higher exercise price Volatility Spreads 141 unlimited on the downside in a put ratio vertical spread. While a ratio vertical spreader expects the market to remain relatively stable, he will tend to choose either a call or put ratio vertical spread in order to limit his losses if he is wrong. If he is primarily worried about a swift rise in the market, he will choose a put ratio vertical spread; if he is primarily worried about a swift fall in the market, he will choose a call ratio vertical spread. In both cases, if the market does make a big move, his loss will be limited since the calls can only collapse to zero if the market falls, and the puts can only collapse to zero if the market rises. STRADDLE A straddle consists of either a long call and a long put, or a short call and a short put, where both options have the same exercise price and expire at the same time. If both the call and put are purchased, the trader is said to be long the straddle; if both options are sold, the trader is said to be short the straddle. Typical long and short straddles, with their expiration values, are shown in Figures 8-5 and 8-6. While most straddles are executed with a one-to-one ratio (one call for each put), this is not a requirement. A straddle can also be ratioed, so that it consists of unequal numbers of calls and puts. Any spread where the number of long market contracts (long calls or short puts) and short market contracts (short calls or long puts) are unequal is considered a ratio spread. The most common types of ratio spreads are backspreads and Figure 8-5: Long Straddle buy = calls and puts 2 at the same oO exercise price n 3 — long 10 March 100 calls (61) long 10 June 95 calls (67) long 10 March 100 puts (-48) y long 25 June 95 puts (-30) 142 Chapter 8 Figure 8-6: Short Straddle short 30 March 105 calls (24) short 10 March 105 puts (-75) short 20 June 100 cails (51) short 20 June 100 puts (-46) = = i) — ou © sell 7) calls and puts gS at the same exercise price ratio vertical spreads. But other spreads, including straddles, can be ratioed. This is usually done to ensure that the spread is delta neutral. A long straddle has many of the same characteristics as a backspread. Like a backspread it has limited risk and unlimited profit potential. With a long straddle, however, the trader’s potential profit is unlimited in either direction. If the market moves sharply up or down, the straddle will realize ever increasing profits as long as the market continues",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.431928"
}