{
  "id": "37753af5dc21",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 32,
  "content": "in life; it’s not just about trading. Often, people experience a disappointing result, but there may be hidden reasons that are more compelling and drove that outcome. That’s two. What about a third quote? I like Jim Rogers’s quote: “I just wait until there is money lying in the corner, and all I have to do is go over there and pick it up. I do nothing in the meantime.” It is such a colorful way of describing the quality of patience to wait for the right trade—a critical trait in success ful trading. What is the quote you think about often? Anybody who’s ever worked for me would know exactly what I’m going to say because I bring it up all the time. It’s the same line you mentioned: “Everybody gets what they want.” It’s become an ethos of the way that I live life. It’s almost like a law of the universe. If I’m speaking to a large company, and I think they’ll never be interested in our product, and I don’t belong in the same room as these people, then that is the outcome I will get. If, instead, I believe that our product can help them and that there is every reason I will be successful, that is the outcome I will get. Three hours north of where we are having this conversation, in Orlando, there’s Disney World, which is built on swampland. Can you think of a worse place for crowds of people to have a positive outdoor experience than a swamp? There are more mosquitos in swamps than anywhere else. Any rational person would have said it was a crazy idea to build a huge theme park on swampland. But the chief engineer [William “Joe” Potter] knew what he wanted, and he made it happen by designing Disney World so that any water in the park is always moving. Even the buildings are designed to not allow still water to collect anywhere. That is a classic example of someone getting what they wanted. Everyone would have said the project was impossible, but the answer was as simple as just moving water. So, in everything I do, I ask, “Am I putting myself in a position to get what I want, or am I the blocker in the situation?” What has been your favorite thing about the Market Wizards journey? There is a sense of satisfaction in having written books that appealed to so many people worldwide. Over the years, I’ve received many emails and phone calls from readers expressing gratitude for the positive impact the 93 books have had on their trading and their lives. It is humbling to know that my books have changed people’s lives. Also, the books allowed me to speak at numerous events and travel to many different countries. Something that deeply impacted me was the inscription you wrote in one of your books and gave to me before I left for college. It was the most perfect advice that anyone could receive. I don’t remember. What did I write? I have it framed on my wall right here: Follow your talent. Choose what interests you. Don’t settle for less than your best. Be honest. Believe in what you can achieve. That is a good summary of my philosophy. That inscription summarizes everything we talked about today. “Follow your talent” goes back to what you said about everyone having their own particular skill. It also relates to why you switched majors and why you focused on writing instead of trading. “Choose what interests you” reminds me of your description of Shapiro, the contrarian trader, who pursues a trading style that reflects who he is. Your copper article perfectly exemplifies “Don’t settle for less than your best.” If you did anything less than your best, you might never have gotten your first job and the entire career that followed. “Be honest” is a core principle if you want to have long-standing relationships. It also relates to trading because you must be honest with yourself. “Believe in what you can achieve” ties into getting what you want. If you don’t have that belief, you won’t achieve your goal because you’re the barrier to getting what you want. Honesty is something that I got from my father; he was absolutely honest. 94 I have a visceral memory of when the importance of honesty hit me. I was probably about nine or ten, and we lived in Goldens Bridge. You were driving me home. I don’t know if you remember, but there was this old mansion with colonial pillars on a large plot of land, which was a real outlier in the neighborhood. It was situated right at a road fork we always passed on the way home. You asked me whether I had eaten a pack of cookies, and I lied and said I did not. You pulled the car over at that fork, turned to me, and said, “Zachary, if you do anything in life, you have to be honest. That’s the most important thing.” That moment just stayed with me.",
  "word_count": 849,
  "topics": [
    "options",
    "psychology",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:44.183002"
}