{
  "id": "b183b60e7f86",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 107,
  "content": "2012 8:27 Printer: Hamilton Printing 418 APPENDIX B: A DEEPER LOOK AT MOVING AVERAGES AND THE MACD FIGURE B.9 The Fast Line of the MACD Crosses Zero When the Moving Averages Touch indicators. Figure B.11 compares the modiﬁed with the standard MACD (3, 10, 16). Notice that the standard tool adds another plot, usually plotted as bars behind the indicator. This plot, the MACD histogram, shows the difference between the fast and slow lines of the MACD histogram, so it is actually the MACD of the MACD. Some traders ﬁnd this to be a useful component, but it is possible to extract much of the same information from a careful reading of the fast and slow lines themselves. A Deeper Look The fast line is very sensitive to changes in the rate of change of prices. Read that again, carefully: the fast line swings up in response to the second derivative, or the rate of change of the rate of change of price. When we actually work with this tool, we usually think of it a little more loosely, as simply measuring the momentum of prices, but it is a good idea to be as precise as possible here at the beginning—this tool measures changes in momentum, not momentum itself. To begin to build some intuition about this tool, Figure B.12 shows a modiﬁed MACD applied to an idealized price series that breaks into @TU - Daily 2 Year U.S. Treasury Notes Conmuous Contract 105'08.0 105'04.0 105'00.0 104'28.0 104'24.0 104'20.0 104'16.0 ~ 0.2000 ~ {':'\\ ~~ ~ 0.0500 ? ~ \\.:? ~ <::.;> -0.1000 Mar Apr May 168 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing Appendix B: A Deeper Look at Moving Averages and the MACD 419 FIGURE B.10 The Slow Line of the MACD Is a Smoothed Version of the Fast Line a steady-state uptrend and then cleanly transitions to a sideways market. Consider the inﬂections in the MACD: r A: The fast line responds immediately to the change in the market by hooking higher on the ﬁrst price bar of the uptrend. r B: Everything between points A and B is an artifact of the indicator. Though the slope of the fast line changes in a curve, this does not reﬂect any change in the rate of trend in the market, which is trending steadily higher. At B, 10 bars into the uptrend, the 10-period moving average is now trending steadily with prices (remember, the fast line measures the difference between a 3-period and a 10-period moving average), so the indicator goes ﬂat. r C: The fast line again responds immediately to the shift in the market by hooking down on the ﬁrst bar that breaks the trend pattern. Note that the MACD fast line going down does not mean that prices are going down, but that the rate of change of prices has gone down, in this case to zero. r D: The fast line levels out, again 10 bars following the change in the market. @TU - Daily 2 Year U.S. Treasury Notes Contiluous Contract 105'08.0 105'04.0 105'00.0 104'28.0 104'24.0 104'20.0 104'16.0 0.2000 ......,-.,.----, ,-L- ~,:----:-,:-c--:,(:-...:..:: - ~:.:.:.-=.:;t~ ----~ --.:.,_,&-1~ ,-:-::--,L-,,...----..:. ~='=--:....---~ 0.0500 -0.1000 Mar Apr May 169 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing 420 APPENDIX B: A DEEPER LOOK AT MOVING AVERAGES AND THE MACD FIGURE B.11 Modiﬁed and Standard MACDs (Both 3, 10, 16) Compared If you are looking at Figure B.12 and thinking that this could never be relevant in actual trading, consider the daily chart of Apple Inc. in Figure B.13. After a downtrend, the market transitioned to an uptrend at the point marked A, and the MACD fast line immediately responded by hooking upward, just as in the inﬂection marked A in the previous chart. Real market action, of course, contains much more noise and variation than our simpliﬁed example, but much of the downturn in the line at point B in Figure B.13 is due to this 10-bar artifact. A trader paying too much attention to the indicator’s line at this point might surmise that momentum had turned downward. Prices did take a small pause at this point, but the indicator’s reaction was out of proportion to that change. Point C is also interesting; a large move up is required to hook the fast line up after an extended trend. Half of the battle with using indicators is knowing when to use them and when to ignore them. If you are reacting to every jot of the indicator, you are missing the point. It is much better to use the tool only at potential inﬂections to add another layer of conﬁdence to analysis that focuses primarily on the price bars themselves. @TU - Daily 2 Year U.S. Treasury Notes Conmuous Contract 105'04.0 105'00.0 104'28.0 104'24.0 104'20.0 104'16.0 ~ O~M Modified MACO --- - -- - - -- - --- - 0.1000 ~ ~-- --- - _, ---[\\ ~~ 00000 ~ Vlf~ ~0.1000 Mar Apr May 170 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.712208"
}