{
  "id": "4a1c0bf8a78d",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 40,
  "content": "where each swing, both up and down, is bigger than the preced- ing swings. There are also a number of diamond-shaped formations where price ﬁrst P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing 120 MARKET STRUCTURE FIGURE 4.21 An Expanding Range expands and then contracts in a classic triangle, and, of course, there are associated trading rules and targets for each formation. My rule for these is simple: the market is confused (as evidenced by the price action) and I do not have to have a position. I ﬁnd it difﬁcult to deﬁne my risk or to control my positions when volatility is expanding in an unpredictable (nondirectional) fashion. Furthermore, these areas tend to expend a lot of stored-up energy and we do not often see strong moves out of these patterns. More often than not, they resolve into random, directionless, low-volatility ranges. As much as pos- sible, I avoid these types of environments or at least signiﬁcantly reduce risk in them, but this may not be the right answer for all traders. Figure 4.21 shows a schematic example of a widening range. SUMMARY Compared to trends, trading ranges are more complicated, and present more challenges and dangers to traders who would trade within these structures. The highly random na- ture of price action in these ranges often creates illusions of patterns that do not exist. In addition, lower volume and potential liquidity problems create a real danger of large adverse price spikes which result in much larger than expected losing trades. However, market structure rests on an alternation of trending and trading range patterns; it is not possible to truly understand the story of how supply and demand plays out in the market without a thorough understanding of trading ranges, and of price action around support and resistance. So far, we have looked at both trends and trading ranges in some depth, but our study is still missing an important element. Many of the best opportunities come at those points where trends become trading ranges and vice versa. Many of the largest losses and greatest dangers also come in these areas, so it is important that we spend some time studying price action and market structure in these transition areas. .... .... .... .... .... 60 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing CHAPTER 5 Interfaces between Trends and Ranges What we call the beginning is often the end. And to make an end is to make a beginning. —T.S. Eliot E ven the most powerful market trends eventually come to an end, and they can do so in several ways. Traders riding trends need to understand the patterns of trend termination, but it is also equally important to consider what follows the end of a trend. At best, these interfaces between trends and trading ranges are periods of great uncertainty and potential volatility. At worst, many traders will ﬁnd that these are the most difﬁcult areas of market structure to read reliably, and that they are the source of consistent losses. These areas also offer the greatest opportunity for many traders, but this opportunity is accompanied by risks and uncertainty. Using a simpliﬁed model of market structure where markets are always either trending or in trading ranges, there are only three possible transitions: 1. Breakout: A market breaks out of a trading range, and enters a trend. 2. Trend termination into trading range: An established trend ends, and the market enters a trading range. 3. Trend reversal: An established trend ends, and reverses into a trend in the opposite direction. To this list we must add a few failures that may complicate issues. After the fact, we might miss these areas as they will simply be continuations of previous conditions, but a trader making decisions at the hard right edge of the chart would likely have placed trades based on information available at the time. This difference between “middle of the chart” (i.e., after the fact) analysis and trading at the right edge is poorly understood 121 P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing Interfaces between Trends and Ranges 123 FIGURE 5.1 Breakout Trade in DryShips Inc. (Nasdaq: DRYS), Summer 2007 however, tend to use the term breakout without distinction for both cases. In general, most stock traders, especially nonprofessionals, view shorting in a different light than going long, and futures traders are much less likely to have this bias. In this book, I use breakout for both trades as well, since there is really no quantiﬁable difference between the two. Patterns Preceding Good Breakouts The best breakout trades are driven by high institutional interest and involvement. Mar- kets, especially deep, liquid ones, do not make large moves without the commitment of large pools of money. In general, these large traders are usually trading positions that are so large they could not enter them on the actual breakout. Small traders—the public who, on balance, tend to lose money—focus a lot of attention on entering at the actual breakout points. In many cases, the larger traders who are already positioned will take advantage of the volatility and sell a portion of their positions to the small traders rush- ing to buy the breakouts. Think about this if you trade breakouts; this is the pressure that often results in failed breakouts. How smart is it for you to be buying where very DRYS - Daiy DryShips Inc 60.00 50.00 40.00 30.00 May Jun Jul Aug Sep Oct 61 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.701620"
}