{
  "id": "6f0acb6ab812",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 97,
  "content": "of 100. Rearranging the components of a synthetic underling position, we can create four other synthetic relationships: synthetic long call = long an underlying contract + long put synthetic short call = short an underlying contract + short put synthetic long put = short an underlying contract + long call synthetic short put = long an underlying contract + short call Again, all options must expire at the same time and have the same exercise price. Each synthetic position has a delta approximately equal to its real equivalent and will therefore gain or lose value at approximately the same rate as its real equivalent. If the underlying instrument in our examples is a June futures contract, we can create six synthetic positions: synthetic long June future = long June 100 call + short June 100 put synthetic short June future = short June 100 call + long June 100 put synthetic long June 100 call = long June future + long June 100 put synthetic short June 100 call = short June future + short June 100 put synthetic long June 100 put = short June future + long June 100 call synthetic short June 100 put = long June future + short June 100 call We need not create a synthetic position using the 100 exercise price. We can choose any available exercise price. Along June 110 call together with a short June 110 put is still a synthetic long June futures contract; however, at June expiration the June futures contract will be purchased at 110. Ashort June 95 call together with a long June 95 put is a synthetic short June futures contract. But at expiration the June futures contract will be sold at 95. Option Arbitrage 215 Suppose an underlying contract is trading at 102.00 and we want to take a long position in the market. We can simply go into the underlying market and buy the contract at 102.00. But we now have an additional choice. We can take a long synthetic position by purchasing a June call and selling a June put at the same exercise price. Which of these strategies is best? As with any option strategy, the decision depends on the prices of the options in the marketplace. Suppose the June 100 call is trading at 5.00 and the June 100 put is trading at 3.00. If we buy the June 100 call for 5.00 and sell the June 100 put for 3.00, we will show an immediate debit of 2.00. If at expiration the underlying contract is at 110.00, we will show a credit of 10.00 when we exercise our June 100 call, for a total profit of 8.00. If we ignore interest considerations, this is identical to the profit we would have realized had we instead bought the underlying contract at 102.00. This is shown in Figure 11-1. Suppose the underlying contract is still trading at 102.00, but now the June 100 call is trading at 4.90 and the June 100 put is trading at 3.05. If we take a synthetic long underlying position by purchasing the June 100 call and selling the June 100 put, we will show a debit of 1.85. Now if the underlying contract is at 110.00 at expiration we will show a total profit of 8.15 (the debit of 1.85 from the option trades, plus the 10-point credit when we exercise the 100 call]. This is .15 better than we would do by taking a long position in the underlying contract at 102.00. As long as the price of the June 100 call is exactly two points greater than the price of the June 100 put, the profit or loss resulting from a synthetic position will be identical Figure 11-1 20 buy a 100 call at 5.00 and sell a 100 put at 3.00 185 or buy an underlying contract at 102.00 Profit & Loss a -107 T 80 85 90 95 100 105 110 415 120 Underlying Price 216 Chapter 11 to an actual position taken in the underlying contract at a price of 102.00. The difference between the call and put price is often referred to as the synthetic market. In the absence of any interest or dividend considerations, the value of the synthetic market can be expressed as: call price — put price = underlying price — exercise price If this equality holds, there is no difference between taking a position in the underlying market, or taking an equivalent synthetic position in the option market. With the June 100 call at 5.00 and the June 100 put at 3.00, we can write: 5.00 — 3.00 = 102.00 — 100.00 2.00 = 2.00 There is no difference between the synthetic and its real equivalent. . With the June 100 call at 4.90 and the June 100 put at 3.05, we can write: 4.95 — 3.05 # 102.00 — 100.00 1.90 # 2.00 Here the synthetic side is cheaper, and we therefore prefer to take a long underlying position synthetically by purchasing the call and selling the put. Now suppose the price of the June 100 call is 5.15 and the price of the June 100 put is 2.90, with the underlying contract still trading at 102.00. We have: 5.15 = 2.90 # 102.00 — 100.00 2.25 # 2.00 Now the real side is cheaper, so we prefer to take a long position by purchasing the actual underlying contract. On the other hand, if we want to take a short underlying position, we will prefer to sell the underlying contract synthetically by selling the call and purchasing the put. If we do this, we are selling a contract which is only worth 2.00 for 2.25. The reader may have noted that the synthetic and real markets will be the same when the time value of the call and the time value of the put are identical. In our example, the synthetic and real markets are identical when the June 100 call and the June 100",
  "word_count": 1000,
  "topics": [
    "options",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.437179"
}