{
  "id": "55e5056c9403",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 81,
  "content": "some resistance at A in Figure 10.6, just beyond the ﬁrst proﬁt target for this trade. Consider how a trading plan like this puts you in control. If you entered after the ﬂush, took partial proﬁts at 1× your risk or the previous swing high, and now hold a partial position against a raised stop, the worst possible outcome is a small proﬁt. (Be careful with phrases like P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 300 TRADING STRATEGIES “worst possible outcome” though, because there is always the possibility of an outlier. But for all practical intents and purposes, this would be a risk-free trade at this point.) Conclusions The outcome of this trade is an example of the best-case scenario in which the market accelerates into further trend legs. At the time of entry, the trend was already potentially overextended, but there were other factors that suggested the possi- bility of a continued advance. Buying blindly into such an overextended market is dan- gerous, as sudden, sharp reversals are to be expected, but a good technical pattern can provide a clear risk point. The discipline of taking partial proﬁts is important: pay yourself as the market makes proﬁts available, and, in doing so, reduce open risk in the trade. Many traders looking at a chart like this try to ﬁnd ways to pile in and maximize proﬁts, but they will often ﬁnd themselves with top-heavy positions at the points where volatility explodes. By reducing risk as the trade matures, the position will be able to endure elevated volatility without excessive swings or unnecessary risk. Pullback, High and Tight FIGURE 10.7 A High and Tight Flag in AMZN @SI- Daily Silver Continuous Contract act 36.000 34.000 32.000 30.000 28.000 J~'\" =,;,:/d - - - ~::::S-=--~ 1.50 ~ --···· 0.00 '11 Feb lolar Apr Al,IZN - Daily Amazon.com Inc '11 Feb lolar Apr 122 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 302 TRADING STRATEGIES FIGURE 10.8 Targets Are Hit, but the Move Is Weak If you had entered on the next open (see Figure 10.8), which gapped above the con- solidation pattern, the ﬁrst target would have been touched within the same session. Once again, reducing risk at this target is a key to effective position management. A: The initial thrust out of the pattern did fail by going into another consolidation pattern. Depending on risk tolerance and the willingness to hold a ﬂat position, a trader could have been justiﬁed in holding through this pattern, but it is not an example of best practice. B: Another thrust to highs fails to see follow-through, and generates a glaring sell divergence on the MACD. Where should you exit any remaining long exposure? Though B is a downward close, it is a small range day and is still potentially consistent with consolidation. However, the next open gapped lower and traded down off the open with a vengeance. Any remaining longs should have been out long before the close of this day. C: Another possible long entry, but not an example of one of the best setups on this time frame. A trade entered at this point would essentially have been a trade on the weekly time frame, as the long consolidation was required to work off the meltdown from B, following three pushes to a high. Appropriate stops for a trade entered at C are far away, perhaps under 175. Again, this large stop is consistent with a trade executed on the weekly time frame, but is far too large for the daily chart. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trend Continuation 303 Conclusions This is an excellent example of a high and tight ﬂag. If a market makes a strong thrust in either direction (one to three bars) and is able to consolidate near the extreme of that thrust for a few bars, this sets up a good continuation play on a break- out of the pattern. This is potentially an aggressive trade that can lead to volatile swings both for and against the position, and it does require active management. This particu- lar example had an anticlimactic outcome, though the setup and entry were textbook examples of the pattern. Pullback, Nested FIGURE 10.9 A Nested Pullback in Coﬀee Futures A nested pullback is a small consolidation pattern that sets up in a drive from a larger, possibly higher time frame pattern. In some sense, it is simply a pullback preceded by the typical strong setup thrust, but the difference is that bigger-picture context and motivation are provided by the larger pattern. This particular example (Figure 10.9) is a breakout from a multiweek range that showed no signs of failure or reversal, so the ﬁrst pause was a reasonable spot to increase long exposure. Note that there is some overlap between these setups, and this could just as well have been categorized as the ﬁrst pullback following a breakout. A: Though it was not clear at the time, A marks a classic Wyckoff spring. It is not always necessary to trade these patterns; much of the beneﬁt comes from the AMZN • Daily Arna zoo.com Inc Jul C Continuous Contract @KC- Daily Coffee • ~ A \"'-\" ~;,--- ·-. ~- J:2s· • v~----___ . .--- ·----- ~ \"\" Nov 0 ' \\_J ' ,.- -- 4.00 Dec ~ '11 Feb 123 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.708095"
}