{
  "id": "e17f4c0e138b",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 106,
  "content": "& Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing 416 APPENDIX B: A DEEPER LOOK AT MOVING AVERAGES AND THE MACD log scale charts, you are actually drawing curves on normal, linearly scaled charts. This may be perfectly correct in the context of a longer-term chart where the curve faithfully represents the growth rate, but it is something that must be fully understood. THE MACD Moving average convergence/divergence (MACD) was one of the early technical tools developed by Gerald Appel in the mid-1970s. As an interesting aside, this is one of the few commonly used indicators whose name actually says something accurate about the tool. Consider some other indicators: stochastics have nothing at all to do with stochas- tic processes; the Relative Strength Index (RSI) neither measures relative strength nor is it an index; the Commodity Channel Index (CCI) is not commodity-speciﬁc, nor does it deal with channels, nor is it an index. This is not an exhaustive list, but you get the idea. The standard MACD consists of four elements: a fast line (the MACD proper), a slow line (the signal line), a zero line for reference, and a histogram (bar chart) that shows the difference between the slow and fast lines. The standard MACD is con- structed from exponential moving averages, but this modiﬁed version uses simple mov- ing averages and dispenses with the MACD histogram altogether, resulting in a cleaner indicator. Basic Construction of the MACD The fast line of the MACD measures the distance between a shorter-term and a longer- term moving average. To understand exactly what this measure says about price action, think about how different periods of moving averages will respond to price movement. A moving average with a short look-back window (period) will track price movements more closely than an average with a longer period. Figure B.8 shows 3-period and 10- period simple moving averages applied to a daily chart of two-year Treasury notes. The line plotted below the price bars is the fast line of the MACD, which is simply the value of the slow moving average subtracted from the value of the fast average. When the fast av- erage is above the slow average, this line is positive and vice versa. Notice the important behavior at the points marked A and B on this chart. Though price was higher at B, the distance between the moving averages was actually smaller, so the indicator registers a lower level at B. The distance between these two averages is one way to measure the momentum behind a market’s movements, and this lower peak in the indicator suggests that the second price high was made on lower momentum. Another important point is that the fast line of the MACD will register zero when the two averages cross; this highlights a condition of relative equilibrium on the time frame being measured. Figure B.9 marks spots where the fast line crosses the zero line, and shows that this happens when the moving averages intersect. Figure B.10 shows the slow line (sometimes called the signal line) of the MACD, which is simply a 16-period moving average of the fast line. It is important to note that, 166 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing Appendix B: A Deeper Look at Moving Averages and the MACD 417 FIGURE B.8 The Fast Line of the MACD Measures the Distance Between Two Moving Averages being a smoothed version of the fast line, it lags the fast line considerably, but also gen- erally reﬂects the trend of the fast line—if the fast line is far above zero, the slow line will usually be sloping upward and vice versa. There are several ways to use the slow line, but the general concept tying them all together is that it reﬂects the trend on an intermediate-term time frame. This is the construction of the particular variation of the MACD that I use. For each bar, calculate: r Fast line: 3-period SMA minus 10-period SMA. r Signal line: 16-period SMA of the fast line. r Histogram: none. r Plot a zero line for reference. Using the same (3, 10, 16) settings in a standard MACD will give similar results, but, in my experience, the long memory of the exponential moving averages (EMAs) does make a difference at times. You will certainly be able to apply the same concepts to the standard MACD, but make sure you understand the differences between the two @TU-Daily 2 Year U.S. Treasury Notes Contiluous Contract 105'08.0 105'04.0 105'00.0 104'28.0 104'24.0 104'20.0 104'16.0 A 0.2000 0.0500 -0.1000 Mar Apr May 167 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing 418 APPENDIX B: A DEEPER LOOK AT MOVING AVERAGES AND THE MACD FIGURE B.9 The Fast Line of the MACD Crosses Zero When the Moving Averages Touch indicators. Figure B.11 compares the modiﬁed with the standard MACD (3, 10, 16). Notice that the standard tool adds another plot, usually plotted as bars behind the indicator. This plot, the MACD histogram, shows the difference between the fast and slow lines of the MACD histogram, so it is actually the MACD of the MACD. Some traders ﬁnd this to be a useful component, but it is possible",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.712008"
}