{
  "id": "5da271672a10",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 65,
  "content": "~ ,~ I C _ -- 0.00 Feb Apr May Jun 95 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 207 drive to a dramatic new low (selling climax?), and the MACD barely moves below the previous low. C sets up yet another example of a divergence, as price makes a new high unaccompanied by a new high on the MACD. Last, D shows a new price low against a higher low on the MACD. In all of these cases, the momentum divergence would suggest that the dominant group in the market may be losing their hold and that a reversal is more likely than continuation. Any book on technical analysis will show you that this is the way divergence is supposed to work. There is only one small problem: divergences fail about as often as they work. Figure 7.15 shows a darker side of momentum divergence. At least four momentum divergences set up against this trend, all of which failed. Any extended trend will set up multiple momentum divergences, most of which will fail. This is, in fact, one working deﬁnition of a trend: just as a trend breaks support or resistance, trends will also roll over momentum divergences. Traders using these divergences to set up countertrend trades will incur steady losses, but paying attention to these divergences can be equally damaging to traders who are only trading with the trend if they use them as warning signs to exit their positions prematurely. This does not invalidate the concept of momentum divergence, but it does highlight the importance of having a trading plan that respects FIGURE 7.15 Strong Trends Result in Failed Momentum Divergences @SB -Daily Sugar No. 11 Continuous Contract [Oct11] 15.00 10.00 1.40 0.20 96 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 208 TRADING STRATEGIES the reality of market action. Clearly deﬁne how and when you will use momentum diver- gences, and, if you will actually set up trades using them, have precise plans for managing those trades. A skilled countertrend trader could likely have executed shorts on each of the momentum divergences in Figure 7.15 and emerged at the right edge of the chart with only small losses, but this is a difﬁcult way to make a living. This tool, like any other momentum indicator, measures potential divergences be- tween subsequent swings in the market. If there are no swings, there is nothing to mea- sure so we cannot have divergence. Many times, markets will set up patterns that re- semble valid divergences, but there is no retracement in between the two points being measured. Consider the divergences marked in Figure 7.16. Though the indicator shows the classic patterns of divergence, at the corresponding points on the price bars the mar- ket was simply sliding higher. A few further reﬁnements will wrap up our consideration of divergences. It is possi- ble to see momentum divergences without referring to the indicator, especially after the trader internalizes many patterns and variations of charts. There are subtle relationships between the length of swings, angle of swings (a visual indication of rate of change, assuming that vertical scaling is consistent), and the speciﬁc formations at the turn of FIGURE 7.16 These Are Not Valid Divergences 1,140.00 10.00 Dec '11 97 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 210 TRADING STRATEGIES Fast Line Drive and Hold Probably no writer has done as much as Tom DeMark to foster an objective, scientiﬁc approach to trading with indicators. His work demands careful study; interested readers could start with his 1997 New Market Timing Tech- niques. One very important point he makes that is often overlooked by many traders is that an indicator’s ability to go into overbought territory is often evidence of real strength in the market, and the reverse is true for oversold readings. Though the MACD does not have overbought/oversold levels and is not even properly an overbought/oversold indi- cator, many traders will initially be inclined to fade extreme moves on the indicator. This is natural, especially for traders who have some familiarity with stochastics, RSI, or a handful of other common indicators, but it is important to realize that one of the com- mon patterns of the MACD is that the fast line will go into overbought territory in a strong trend and stay there for an extended period of time. The inability of the fast line to back off is a reﬂection of the conviction behind the price movement and should not be taken as an indication to start looking for countertrend trades. Figure 7.17 shows yet another example from Silver futures. In this case, a very strong uptrend pegs the MACD fast line in potentially overextended territory, and it stays there for much of the move. FIGURE 7.17 A Strong Trend Will Peg the MACD Fast Line @SI- Daily Silver Continuous Contract [Sep11] 19.000 18.000 ~ 0.40 D. ~-...... - ./\\ cs ~",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.705596"
}