{
  "id": "b2e8440727f4",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 165,
  "content": "action, he will have to sell some options, either calls or puts. If he considers a large move in the underlying stock a possibility, he may not want to sell calls since this will leave him net short contracts on the upside. This will probably lead him to sell off some of the puts which he is long, either the 195 or 200 puts. Up to now we have not considered the risk associated with a change in interest rates or, in the case of stock options, dividends. While these risks are usually small with respect to the other risks, if the position is large enough we might want to consider how a change in interest rates or dividends will impact the position. The sale of 18 stock contracts has created a cash credit for this trader, and the interest earned on this credit will be a part of his profit. Assuming that he is subject to a floating interest rate, any increase in rates will help, since he will earn more on his cash credit, and any decline in interest rates will hurt, since he will earn less on his cash credit. We can estimate the impact on the position of a 1% change in interest rates by calculating the interest earned to expiration at the current stock price: Position Analysis 371 Figure 17-5e delta position -1500-4 -20004 “ -2500 -1000- 500 “500 volatility = 18% volatility = 24% volatility = 30% 180 a0 T 190 195 200 T T 1 ; 205 210 215 220 225 stock price 230 Figure 17-5f gamma position 140 420-4 100- volatility =18% a < a volatility = 24% volatility = 30% — — 190 195 200 T T , 205 210 218 220 205 stock price 372 Chapter 17 1% x 42/365 x 202.50 = .233 Since the trader is short 18 stock contracts, the total impact of a 1% change in interest Tates is: 233 x 18 = 4.19 For each percentage point increase in interest rates, his position will increase in value by approximately 4.19; for each percentage point decline in interest rates, his position will decline in value by approximately 4.19. If interest rates were to immediately drop from 6% to 4%, the position’s potential profit would drop by approximately 8.38. The underlying stock for this position currently pays no dividend, but the trader may want to consider the possibility that the company will decide to start paying a dividend. If the company decides to pay a dividend prior to June expiration, the trader, as a borrower of stock, will be required to pay this dividend amount to the stock lender. Since he is short 18 stock contracts, for each point increase in the dividend, the trader will lose 18 times the dividend in potential profit. If the company decides to pay a dividend of 2.00, the trader’s position will be reduced in value by approximately 36.00. If the trader believes that the company might in fact decide to pay a dividend prior to June expiration, or if he feels that interest rates could fall significantly, he will want to take some action to reduce his risk. Since the risk results from the short stock position, he can eliminate most of his risk by eliminating the 18 short stock contracts. Assuming that the trader wants to maintain the same delta position, he can accomplish this by buying back the short stock and replacing it with either deeply in-the-money options (buy deeply in-the-money puts or sell deeply in-the-money calls), or by selling synthetic stock contracts (sell calls and buy puts at the same exercise price). The former strategy would be the same as executing a three-way; the latter strategy would be the same as executing a conversion. The sensitivity of the position to a change in interest rates and dividends is shown in Figures 17-5g and 17-5h. FUTURES OPTION POSITIONS The foregoing positions have all consisted of stock options, but delta, gamma, and vega characteristics are similar whether a trader is dealing with stock or futures options. Except for the effect of interest rates and dividends, the analyses of the positions would be essentially the same for futures options. While futures options are not subject to dividend considerations, nor are they as sensitive to changes in interest rates as stock options, there is an additional dimension to the analysis of a futures option position because the relationship between futures months is often less well defined than with stock options. For example, consider the position in Figure 17-6. This is typical of the type of position an active trader often ends up with: a seemingly disjointed collection of options and underlying contracts which cannot be easily categorized. Nonetheless, it is important that the trader recognize the risks which the position currently presents, as well as those risks which might arise if conditions change. Position Analysis 373 Figure 17-5g 350 300 250 g 200 & 6 a 150 interest rate = 12% § S interest rate = 9% 3 £ 100 interest rate = 6% (current) 50-4 ie} interest rate = 3% -50 T —T T T T t — T T 180 185 190 195 200 205 210 215 220 225 230 stock price Figure 17-5h 300 oO ao 2 . & dividend = 0 (current) re a B = dividend = 2.00 S o £ aa ee a nl 60 es dividend = 4.00 -100-4 T T T T T v T TO T 180 185 190 195 200 205 210 215 220 225 230 stock price Chapter 17 374 O00! 8e- seinjn} 9'S6- 66'SI 010 vLOO'— sz $'96- 09'r Lo'¥ ynd $g p'26~ erst 0z0' Z€00°~ Lg Lz6- g9'e 99° ynd gg L'98- L8'¥h ve0° g900°— 96 998- v2 Le e- ynd gg 8'Prl- 6S'¢h 6r0\" LOO Bel a rl— €6' I 16} ind |g g'6g- avi 650° $2 LO0\"— 891 0'69- pel ak ge+ ynd og 8 bP— v9'bh 650° 92 10\"— OL} 6 bp— aL OL €6-",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.447700"
}