{
  "id": "b18b9b8b9a26",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 127,
  "content": "would not be unreasonable to apply some of the same principles used in technical analysis to volatility analysis. It is important to remember, however, that while price changes and volatility are related, they are not the same thing. If a trader tries to apply exactly the same rules of technical analysis to volatility analysis, he is likely to find that in some cases the rules have no relevance, and that in other cases the rules must be modified to take into account the unique characteristics of volatility. Since the author 1. For a mare detailed discussion of volatility cones, see: Burghardt, Galen and Lane, Morton; “How to Tell if Options are Cheap”; The Journal of Portfolio Management, Winter 1990, pages 72-78. 276 L661 _ 0661 _ 6861 8861 Z861 rl ; 9861 _ 3861 _ 86h _ 861 _ 286t OL ma (%) ANINe|OA, TA L661-Zs861 Anine|oA yAeWeYyosyneg Aeq-0s :2-r1 einbi4 277 Volatility Revisited UOdHTeIIdXy 0} SHBS/AA OS lb tb lp 86 GE ce 6 9S ES O42 Lt vl LL 8 S ¢ l 1 t 1 4 4 1 1 i i 1 | aINUsdiad YIOL alquadied USZ ueipay a|UadI98d UIGL Wot 8{WUBII9d YOG +O} Toh bb 9h 1661-2861 UORNqUISIG AjNe/OA YAeWISYOSINeq :¢-p71 aunBIg 81 (%) AURBIOA Chapter 14 278 c26-uBr L6-des 6-unr 16-4984 = 06-790 06-1INC 06-/2 68-A0N 68-6ny 68-1dy ee ! I Nl | ! rs +OL < Oo Q gE = < Ss -Pl 9} gi L661—-686b Awejo, ysewWeYyosyneg Aeq-0s *r-r1 einbiy Volatility Revisited 279 claims no particular expertise in the area of technical analysis, the reader is left to his own devices in this regard. VOLATILITY FORECASTING Given the volatility characteristics that we have identified, how might we go about making a volatility forecast? First we need some volatility data. Suppose we have the following historical volatility data on a certain underlying instrument: last 30 days 24% last 60 days 20% last 120 days 18% last 250 days 18% Certainly, we would like as much volatility data as possible. But if this is the only data available, how might we use it to make a forecast? One method might be to simply take the average volatility over the periods which we have: (24% + 20% + 18% + 18%) / 4 = 20% Using this method, each piece of data is given identical weight. Might it not be reasonable to assume that some data is more important than other data? A trader might assume, for example, that the more current the data, the greater its importance. Since the 24% volatility over the last 30 days is clearly more current than the other volatility data, perhaps 24% should play a greater role in our volatility forecast. We might, for example, give twice as much weight to the 30-day data as to the other data: (40% x 24%) + (20% x 20%} + (20% x 18%) + (20% x 18%) = 20.8% Our forecast has gone up slightly because of the extra weight given to the more recent data. Of course, if it is true that the more recent volatility over the last 30 days is more important than the other data, it follows that the volatility over the last 60 days ought to be more important than the volatility over the last 120 days and 250 days, It also follows that the volatility over the last 120 days must be more important than the volatility over the last 250 days. We can factor this into our forecast by using a regressive weighting, giving more distant volatility data progressively less weight in our forecast. For example, we might calculate: (40% x 24%) + (30% x 20%} + (20% x 18%) + (10% x 18%) = 21.0% Here we have given the 30-day volatility 40% of the weight, the 60-day volatility 30% of the weight, the 120-day volatility 20% of the weight, and the 250-day volatility 10% of the weight. We have made the assumption that the more recent the data, the greater its importance, Is this always true? If we are interested in evaluating short-term options, it May be true that data which covers short periods of time is the most important. But Suppose we are interested in evaluating very long-term options. Over long periods of 280 Chapter 14 time the mean reverting characteristic of volatility is likely to reduce the importance of any short-term fluctuations in volatility. In fact, over very long periods of time the most teasonable volatility forecast is simply the long-term mean volatility of the instrument. Therefore the relative weight we give to the different volatility data will depend on the amount of time remaining to expiration for the options in which we are interested. Ina sense, all the historical volatility data we have at our disposal are current data; they simply cover different periods of time. How do we know which data is the most important? In addition to the mean reverting characteristic, volatility also tends to exhibit serial correlation. The volatility over any given period is likely to depend on, or correlate with, the volatility over the previous period, assuming that both periods cover the same amount of time. If the volatility of a contract over the last four weeks was 15%, the volatility over the next four weeks is more likely to be close to 15% than far away from 15%. We can again use the weather analogy from Chapter 4. If the high temperature yesterday was 25°, and we had to guess what the high temperature today would be, a guess of 30° would make more sense than a guess of 50°. Once we realize this, we might logically choose to give the greatest weight to the volatility data covering a time period closest to the life of the options in which we are interested. That is, if we are trading very long-term options, the long-term data should get the most weight. If we are trading very short-term options, the short-term data should get the most weight. And",
  "word_count": 1000,
  "topics": [
    "options"
  ],
  "created_at": "2026-02-05T08:09:54.441807"
}