{
  "id": "1c386567ac84",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 23,
  "content": "a much lower probability of success. An example will help to clarify this. Figure 3.15 shows what appears to be a pullback in a good uptrend on the daily U.S. Dollar Index futures chart in the left pane. This is the second pullback off a potential trend change in early November; the market has rallied to the upper Keltner channel, and has pulled back approximately to the moving average. All other things being equal, this would normally be a good potential long trade. However, a look at the weekly chart (right pane) shows that this time frame is actually in a strong downtrend, and has only pulled back to its moving average. Seen in this context, the uptrend on the daily chart is likely to terminate suddenly as the weekly chart reasserts control and the downtrend on that time frame resumes. Follows Good Momentum or Impulse When trading pullbacks in a trend, it is helpful to make sure the market is actually trending. One of the best ways to separate out the suboptimal trading environments is to trade only pullbacks that are preceded by signiﬁcant momentum in the direction of the trend. There are many ways to quantify ~~! ;\\/\\ @DX- Daiy U.S. Dolar Index Continuous Contract [Jun11) 83.000 90.000 \\ 82.000 111 88.000 \\.._ 11 8'.000 , , ,~ 86.000 1 \\\\\\ !'1 (..---~I MOOO ,./ ~-11~·-,\\ ::: ,i nooo I ! 78.oo0 Oct Nov Dec 27 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 67 this, but simple, visual chart analysis can be very useful. The highest-probability trades will follow large moves relative to previous swings on the chart. Again, we are into the territory of subjective analysis, but this is a legitimate skill that can be developed with experience and exposure to many patterns. The question the trader needs to ask is: “Am I seeing a move here that should have continuation?” The most important thing to keep in mind is that we are looking for sharp impulse moves and for signiﬁcant momentum moves that indicate there is an imbalance in the market that should resolve with another move in the same direction. It is also possible to quantify this condition with the MACD or another momentum indicator—look for the indicator to register a signiﬁcant new high or low (relative to its recent history), and trade only pullbacks following that condition. Figure 3.16 shows an example of this kind of trading in action. For each of the points marked on the chart, compare the price action of the market to the action of the fast line (the solid line) of the modiﬁed MACD. At the point marked A on the chart, the MACD has registered a signiﬁcant new high relative to its recent history (not visible to the left of the chart). This would suggest that a trader could look to buy any weakness to position long for another drive to the upside; the small pullback beginning six bars after A offered FIGURE 3.16 Trading Momentum in GS, December 2009 GS - Daily Goldman Sachs Group 140.00 Aug Sep Oct Nov Dec 28 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 70 MARKET STRUCTURE FIGURE 3.17 A Strong Trend in BIDU Holds the Stock Tight against the Upper Keltner Channel countertrend to the prevailing trend on the trading time frame, so we should be on guard for that lower time frame trend to abort in the direction of the trading time frame’s trend. Lower time frame ranges should be smaller in most pullbacks, and there should not be as much conviction in taking liquidity from the book. In addition, the best pullbacks are often more or less symmetrical on the trading time frame, though it is not unusual to see the occasional spike outside the conﬁnes of the pattern. These spikes can, in fact, offer attractive entry points for trades, but the majority of the action should be conﬁned within clearly deﬁned boundaries. Compare Figure 3.18, which shows retracements in JPMorgan Chase & Company (NYSE: JPM) during the latter half of 2009, with Figure 3.19, which highlights retrace- ments in U.S. Steel Corporation (NYSE: X) during the spring of the same year. Notice that the retracements in X are much more consistent: they are at approximately the same angle and the same depth, and they are generally clean, symmetrical geometric patterns. In contrast, the retracements in JPM are much more erratic. They cover very different angles, are less predictable in depth, and one, into early October, features a dramatic drop that would have shaken most longs out of the market. You would be correct in BOU -Daily B id 8 u Inc f 70.00 J~ 65.00 1tlit✓,,, t -- ~\" ~· __ ./ .... ,Jl,lf .-· __ / \"-\" l r ... •• ,, \"1 '!,'/J!\"-4 - ~ , ,,- 50.00 -r1------ hf'11Hr11'- 1n, - fl _\\!!i1- ., ,,l ,_,H!~'11,---' I I ll1tff( , qrlf ''- 45.00 40.00 -1 .00 Mar Apr 29 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley &",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.698726"
}