{
  "id": "2cc65c675681",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 52,
  "content": "though the trade had not quite reached the target. Last, it is also possible to manage pullback trades using risk multiples as proﬁt tar- gets, for instance, taking partial proﬁts at one or two times (1 × or 2×) the initial risk on the trade. This is a solid plan, but it probably also makes sense to incorporate infor- mation from the conservative and MMO proﬁt targets, as they are based on the reality of market structure and volatility-driven relationships. For instance, if the ﬁrst 1 × risk proﬁt target is a little beyond the conservative previous swing target, it might be a good idea to move the target to the conservative target. However, if you are trading the 1 × plan and ﬁnd that your ﬁrst target is signiﬁcantly beyond the conservative target, an ad- justment might skew the reward/risk ratio signiﬁcantly. These are the types of issues that must be considered within a comprehensive trading plan. X -Daily us . . Steel Corporation ~9 ,- 56.01> 54.00 52.00 jl·-... ni I I t!Oi ,,/ \"·\" I ~1--ll~ . 0 ... I'/. / t 91 ~ ,tu ,0,. ·-.. _ r-· \"·\" _'11 1 f ..... 1,U «.oo ~ 6 \"\" . . . . . . .. . . . \"·\" ~ -----~ oa ·-· · v~-- D , ... Nov ' , ~ - - --1.0 0 Dec - - ···· '-./ '11 -1 .0D 74 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 161 FIGURE 6.8 The MMO Price Target for the First Pullback Trade in X Comments We will look at several variations of this trade, but the concept of using pullbacks in trending markets is one of the most robust discretionary trading techniques. It uses the normal pattern of a trending market (impulse-retracement-impulse) to posi- tion at attractive prices in the trend. Trading these patterns successfully is not as easy as might be expected. One challenge is assessing the strength of the trend while looking for that ﬁne line between a very strong market and one that is overextended, perhaps primed for reversal. Trades in the latter market are much more likely to fail and result in losses, so being able to discriminate between the two environments is an essential trading skill. All of the information in the sections on trend structure must eventually be considered in trading these patterns and incorporated into your trading plan. Much of this can be quantiﬁed, but some traders will be more comfortable using much of this information on a subjective, almost subconscious, level. Another potential challenge is in the timing of the entry. Because pullbacks often have many of the characteristics of small trading ranges, price action within pullbacks tends to be more random and it can be difﬁcult to time the entry point with conﬁdence. In addition, pullbacks are actually contratrend lower time frame trends, so early entries P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing 162 TRADING STRATEGIES can result in losses if the lower time frame trend is still in control. The third challenge is stop placement. The general idea with stop placement is to avoid the noise and to place stops at a level that would prove the trade incorrect. Finding this point in pullbacks can be a little more difﬁcult; the lower time frame trends sometimes continue further than expected, and conservative stops can be hit at exactly the wrong point. In fact, one of these failures is so common that it deserves separate consideration under the category of complex pullbacks. Despite all of these potential issues, many traders will ﬁnd that pullbacks offer some of the most attractive and consistent trading opportunities. A proﬁtable trading plan can be built around this one trade, though an awareness of trend termination patterns will inform your perspective and help you manage losing trades. The next setup looks at an entry that combines the power of the pullback with the direction of momentum on the shortest time frames. PULLBACK, ENTERING LOWER TIME FRAME BREAKOUT Trade Type Trend continuation and breakout blend. Concept This trade setup times the entry into the pullback by using the momentum of a lower time frame breakout so that the trade will be entered when the market is moving in the intended direction of the trade. This entry has the advantage of offering the conﬁrmation of momentum with the trade-off that trade location will not be as good. This entry will require larger initial stops compared to entering near support or resistance, and have correspondingly lower reward/risk ratios. Setup This is another variation on the pullback concept; the same setup conditions as in the previous trade apply here. Trigger The difference is the actual entry trigger, which, in this case, is on a break- out of some structure within the pullback itself, usually visible most clearly on a lower .. Steel Corporation X-Daily US A :..:.:.::..=... Oct Nov 52.00 48.00 46.00 44.00 42.00 75 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 163 FIGURE 6.9 A Breakout on the Intraday (Left Pane) Serves as an Entry into the Higher Time Frame Pattern time frame. Figure 6.9 shows an example in Dendreon Corporation (Nasdaq: DNDN) in which a breakout of resistance on the",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.703517"
}