{
  "id": "de2da36f1687",
  "source": "Thinking_In_Bets.pdf",
  "source_type": "pdf",
  "title": "Thinking In Bets",
  "chunk_index": 2,
  "content": "9780735216358_ThinkingIn_TX.indd 209 12/1/17 1:24 AM9780735216358_ThinkingIn_TX.indd 208 12/1/17 1:24 AM A D v ENTURE s IN M ENTAL T IME T RA v EL 193 If you zoomed in on the performance of Berkshire Hathaway stock during the banking crisis, September 2008 to March 2009, you would feel terrible most days : Yet we know from the first chart, the big picture, that all those minute - to -minute and even day- to -day changes had little effect on the investment’s general upward trajectory. Our problem is that we’re ticker watchers of our own lives. Happiness (however we individually define it) is not best mea- sured by looking at the ticker, zooming in and magnifying moment - by -moment or day- by -day movements. We would be better off thinking about our happiness as a long- term stock holding. We would do well to view our happiness through a wide- angle lens, striving for a long, sustaining upward trend in our happiness stock, so it resembles the first Berkshire Hathaway chart. Mental time travel makes that kind of perspective possible. We can use our past- and future- selves to pull us out of the BERKSHIRE HATHAWAY (SEPT. 2008 −MARCH 2009) 9/2/08 10/2/08 11/2 /08 12/2/08 1/2/09 2/2/09 3/2/09 160,000 140,000 120,000 100,000 80,000 60,000 40,000 20,000 0 9780735216358_ThinkingIn_TX.indd 192 12/1/17 1:24 AM 9780735216358_ThinkingIn_TX.indd 193 12/1/17 1:24 AM If you zoomed in on the performance of Berkshire Hathaway stock dur‑ ing the banking crisis, September 2008 to March 2009, you would feel terrible most days: Y et we know from the first chart, the big picture, that all those minute‑to‑minute and even day‑to‑day changes had little effect on the investment’s general upward trajectory. i ~ i i",
  "word_count": 285,
  "topics": [
    "technical_analysis",
    "crypto"
  ],
  "created_at": "2026-02-05T00:37:47.321620"
}