{
  "id": "b679487fe21a",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 25,
  "content": "the patterns that make risk man- agement based solely on pattern geometry difﬁcult—how far away do you put the stop? No matter where you might think it should go, there will, in some subset of these pat- terns, be spikes to that level and beyond. Figure 3.21 shows an example of a continuation 8.00 --------, 2.00 Feb Apr May 32 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 74 MARKET STRUCTURE FIGURE 3.21 A Pullback in 30-Year Treasury Bond Futures That Failed via Sharp Momentum pattern in the 30-year Treasury bond futures that seemed to have everything going for it: the market had consolidated on support for two months, the breakdown of that support was fairly clean and had good momentum, and the market started to consolidate under that previous support. This is an excellent pattern on which to base a short trade, but in this case it was not to be. At the point marked A, buyers swept the market up through the top of the pullback, back above support, and it did not look back. It absolutely is necessary to limit your risk on these patterns, because many of them will not return to your entry price after they fail. In fact, if the pattern was a truly excel- lent setup, there may be many traders trapped on the wrong side of the market, and this pressure can sometimes create a long-term inﬂection point in a trend. Imagine shorting at the very bottom of a turn into an uptrend, and shorting more as the market rallies, only to see a full-ﬂedged uptrend emerge. Traders will inevitably be caught in situations like this; it is the task of risk management to make sure that they become normal, planned-for losses and not outright disasters. However, there is another important pattern to be aware of. It is sometimes pos- sible to turn trapped traders to our advantage, as many excellent trades are driven by traders trapped either into or out of the market. In the aforementioned example, if you l'\"· uous Contract B nds Con D ·1y 30 Yr U.S.Treasury o @US- a, Dec '11 Feb 128 126 Mar Apr 33 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 75 FIGURE 3.22 A Failure to Break Down Out of a Pullback in the S&P Futures Sets Up a Good With-Trend Entry have continued shorting into the new uptrend, eventually you would have been trapped on the wrong side of the market with an outsized loss and forced to throw in the towel. This, obviously, is not good. However, take a look at Figure 3.22, which shows a complex consolidation in an uptrend in the E-mini S&P 500 Futures. At the point marked A, the consolidation had failed: the pattern was broken by two large candles under the bottom of the pattern, with a close far underneath at A. If you were an aggressive short, it might even have been reasonable to initiate a short on this bar, but look carefully at what hap- pened next. There was no momentum and no selling conviction below the level. Within two days, the market was solidly back above the consolidation, went on to take out the highs, and put in another trend leg over the next several weeks. This is an extremely im- portant pattern for pullback traders, who are always trying to ﬁnd the ideal combination of trade location and probability. Usually, buying as low as possible means buying when prices are declining, but this type of failure at the bottom of the consolidation allows an entry at low prices that is also aligned with short-term momentum. This is an outstanding entry pattern for pullback traders. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 76 MARKET STRUCTURE FIGURE 3.23 Proﬁt Targets for Pullbacks In Uptrends and Downtrends Failure around Previous Pivot When trading pullbacks, it is unrealistic to assume that every pullback will result in a new trend leg equal to the setup leg or that they will give rise to trends that continue for many more legs. This, of course, is the best-case outcome, but it is far more common to ﬁnd pullback trades that give opportunities for smaller proﬁts. More consistent results will come from taking at least partial proﬁts at a more conservative proﬁt target; the pivot high or low (in an uptrend or a downtrend, respectively) of the setup leg is an ideal target and should be considered the ﬁrst, most conservative proﬁt target for any pullback trade. Figure 3.23 shows this pullback target schematically for both uptrends and downtrends. The third pullback failure occurs around this proﬁt target—either before, at, or just beyond it. It is not necessary to examine each possibility in detail, because they are all conceptually the same. The market reaches the neighborhood of the ﬁrst proﬁt target and simply is not able to trade very far beyond that target. For traders taking partial proﬁts here, these patterns are not even actually failures; the ﬁrst target was reached. The important point is that traders should always be on guard for potential failure at this area, particularly in the area of previous pivots (e.g., the high of the setup trend leg preceding the pullback). There are many possibilities for trade management,",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.699027"
}