{
  "id": "e0ccf655647a",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 42,
  "content": "level and never come back. (This, incidentally, is the absolute best-case scenario for breakout traders, and trades like this are rare.) However, there are some common patterns at the actual breakout point that can separate the best breakout trades from the rest. High Volatility A breakout should be a clearly visible event. If a market approaches a breakout point, trades tightly below the point with signiﬁcant signs of accumulation, and then very politely and gently lifts through resistance to trade higher, this is probably not a good sign. Good breakouts are driven by unusual order ﬂow, so we need to see P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing Interfaces between Trends and Ranges 127 Especially for short-term traders, breakout trading can be exciting, and the immediate feedback allows for rapid learning and skill development. Patterns Following Good Breakouts In a good breakout, the extra volatility and one-sided liquidity lead to a sharp move above the breakout level. Nothing in the market continues indeﬁnitely, though, and eventually this initial thrust gives way to a pause and a pullback. This is a critical point because, if the breakout is the beginning of a new trend, this ﬁrst pullback after the breakout is the optimal time to establish positions for the new trend. If the breakout is going to fail, it is going to fail at this ﬁrst pullback. In addition, the character of the price action in this ﬁrst pullback can communicate a lot of information about the conviction behind the move and the character of the market. Pullback Holds Outside the Breakout Level This is probably the most intuitive example, and the one that many traders focus most of their efforts on. The market breaks through the level, trades sharply beyond the level, and then makes a clean pullback that holds outside the breakout level. This makes sense because there should be urgency and real order ﬂow following the breakout. Large players should be interested in defend- ing the breakout level, and small players should be willing—perhaps stupidly, but still willing—to chase the market. All of this should logically result in the market being un- able to come back to the breakout level. It is easy to ﬁnd examples of these patterns, and also very easy to manage these trades that never come back to the entry price. Figure 5.4 shows schematic examples of this pattern. Pullback Violates the Level It is certainly easiest to manage trades when the pull- back holds outside the breakout level, because it is simple to put a breakeven stop at your entry price and never be at a loss on the trade. For the trader, this is the ideal situa- tion, but think about it for a moment; ask yourself why the market should work this way. Why should the large players who positioned inside the range, and maybe even provided some liquidity at the breakout point, defend the level precisely or aggressively? It is safe to assume that many of them are working from a hybrid approach that combines valua- tion with at least a quasi-technical approach. Though they may recognize the validity of FIGURE 5.4 First Pullback Holds Outside Breakout Level P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing Interfaces between Trends and Ranges 129 FIGURE 5.5 The Breakout Level Can Also Be Violated on the Pullback sure your trading plan respects the realities of the market; any other plan is a recipe for disaster. Figure 5.5 shows schematic examples of breakout trades violating the breakout level on the pullback. Remember, this is not necessarily a sign of a failed breakout. Patterns of Failed Breakouts The preceding example is not meant to imply that every breakout trade works, nor that short-term traders were necessarily stupid to exit their trades on a failed breakout. Breakouts do fail, they fail frequently, and price movements following these failures can be violent. One of the characteristics of market action is that markets will probe levels for resting orders, seeking out levels where that will create trading volume. It is not that difﬁcult to ﬁgure out where these orders might be placed, since traders use previous piv- ots and visible support and resistance levels to deﬁne risk points for trades. Stop orders tend to cluster just outside the day’s range, or at more or less predictable chart levels. This may not be completely intuitive at ﬁrst, but here is one way this could work. Imagine that you are a large player who would like to sell some of your inventory in a futures market. You can see that the market has held a resistance level cleanly (let’s say $80.00 for this example) on several tests, and it is reasonable to assume that many traders are short against this visible level. If so, where will those traders probably put their stops? There is no exact level, but we can assume that they will be clustered just beyond the resistance, probably in the range from $80.01 to $80.20. What do you do the next time the market trades up to $79.98? Remember, you actually are holding more of a long position than you are comfortable with and you want to sell some, but you want to sell as high as possible. Paradoxically, one good way to accomplish that goal might be to actually buy more at $79.98, $79.99, and eventually to try to buy enough that your buying pushes the market to $80.01. Even though you need to sell, the most effective way for you to sell actually begins with you buying more. If you are correct and shorts have their stop orders clustered there, those stops will trigger and a rush of additional buying will come into the market. As soon as those stops ﬁre off, you can stop your buying (which is a good thing, because now you are even more long than you were before), and you will be more than happy to sell some of your position to those",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.701935"
}