{
  "id": "b784f59f13b6",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 75,
  "content": "understanding that some traders have that “the more you risk, the more you make” does seem to have some validity. As we increase the amount risked per trade, the average terminal value increases, as does the mean of the maximum value; risking $5,000 per trade gives us almost 50 percent more proﬁt than our initial $2,000 risk. However, there is a cost. The standard deviation of ter- minal values increases faster than the mean, which can be seen by the steadily risking coefﬁcient of variation. If we accept, for a moment, the standard deviation as a measure of risk, we are taking on additional units of risk and not being adequately compensated by higher returns. At the $5,000 risk level, we have a disturbing number of accounts that went bankrupt. A new line has been added to the table that shows the difference between the termi- nal value and the expected value. The difference was very small at the $2,000 risk level, but it increases with the risk level. One reason for this departure is that the bankruptcy limit makes the test, and actual trading, asymmetrical. If an account hits this barrier, it is removed from the test and that value becomes its terminal value; this is also the reality of capital constraints in trading and money management. Otherwise, martingale betting strategies (where you double your bet size each time you take a loss) would work, but in reality, traders using this type of strategy invariably go broke if they trade long enough. Emboldened by the observation that more risk equals more proﬁts, let’s say you de- cide to, as we kindly say in the vernacular, “go nuts.” You increase risk to the reckless levels in Table 9.3, and ﬁnally some truths become very clear. At some point, with in- creasing risk, the party is over—the rising losses and risks of bankruptcy start to outpace TABLE 9.3 Aggressive Risk Levels in the Monte Carlo x = 6,000 x = 8,000 x = 10,000 x = 25,000 Mean Terminal Value 243,140 281,387 314,822 463,980 Median Terminal Value 242,800 290,400 338,000 310,000 Std Dev of Terminal Value 108,326 153,502 200,806 519,633 Coeﬃcient of Variation 0.45 0.55 0.64 1.12 Mean of Max Value 275,360 327,832 376,324 610,805 Mean of Min Value 68,993 61,058 54,662 28,480 Highest Terminal Value 559,600 712,800 866,000 2,015,000 Lowest Terminal Value (5,600) (7,200) (8,000) (20,000) Percent Terminal DD ≥75% 5.2% 11.0% 17.6% 47.7% Percent of Accounts Bankrupt 5.0% 11.0% 17.6% 47.7% Terminal Value − E () (6,860) (18,613) (35,178) (261,020) P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing Risk Management 273 any incremental gains. Somewhere between $8,000 and $10,000 risk per trade, we ﬁnally reach a mean terminal value that is double what we have with our modest $2,000 trading risk, but we also have somewhere around 15 percent of the accounts going bankrupt. Though decisions have to be made within your own risk tolerance, it is hard to imagine this being acceptable. Consider the $25,000 per trade risk as a very extreme example. For one thing, you are risking a quarter of your initial account balance on each trade, which means you can be wrong three times before being taken out of the game on the fourth bad trade. What are the chances of that happening? It turns out the chances are pretty good, as nearly half of the accounts go bankrupt at this excessive risk level. Also, we are now risking 11.5 times our initial $2,000 risk, and the mean terminal value is not really that much higher—certainly not enough to justify the excessive risk of going bankrupt. Consider one more thing about this $25,000 scenario: there was at least one account in this test that ran the starting capital of $100,000 up to over $2,000,000 (not visible in the summary table), at the same time that half the other accounts were going bankrupt. It is always possible to ﬁnd one exceptional example. Fixed Fractional Position Sizing in Action Though risking a ﬁxed amount on each trade is an improvement over having no system at all, there are some problems with this plan. For instance, if the account balance shrinks or grows dramatically, the initial dollar amount risked may lose some relevance. If your account doubles, why are you still risking the same amount per trade? Fixed fractional risk is one solution to this problem: always risking a ﬁxed percent- age of the trading account’s equity on each trade. Let’s begin this investigation with a 2 percent risk, which, at the beginning of the run, will be the equivalent of the $2,000 risk in Table 9.1. Keep in mind that the amount risked will change on every trade, as the ac- count balance waxes and wanes. As we have winners, the account gets bigger, so we are risking more on the next trade; conversely, as we run into a string of losers and the ac- count shrinks, the risk on each trade will also shrink. Table 9.4 shows the results of this 2 TABLE 9.4 Fixed Fractional and Fixed Position Sizes Compared Fixed 2,000 2% of Equity Mean Terminal Value 149,259 163,033 Median Terminal Value 152,000 158,317 Std Dev of Terminal Value 33,760 56,266 Coeﬃcient of Variation 0.23 0.35 Mean of Max Value 159,070 179,236 Mean of Min Value 89,254 89,385 Highest Terminal Value 253,200 434,738 Lowest Terminal Value 50,800 57,654 Percent Terminal DD ≥75% 0.0% 0.0% Percent of Accounts Bankrupt 0.0% 0.0% 114 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing 274 TRADING STRATEGIES percent ﬁxed fractional sizing, and, though they are not directly comparable, reproduces the numbers from Table 9.1 for comparison.",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.707202"
}