{
  "id": "6d6a7426c212",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 4,
  "content": "and 2021. This year [2022], I had an amazing start. I was up about 100% through May, and then everything unraveled. I’m still trying to figure out what went wrong. I think part of the problem was that because there was so much going on, I spent more time than usual at my desk and not enough time away from it. During the first half of the year, I was forced to take time off from trading because I was attempting to pass my motorcycle test, which I kept failing. I failed four times before I finally passed. Training to pass the test forced me to take lots of breaks from trading. When you say, “everything unraveled,” what kind of results are we talking about? Did you give back a significant portion of your profits earlier in the year? No, I’m up about 10% since May. I was confused by your negative tone. You have a triple-digit year going. Most traders would be thrilled by that. It may sound silly to say that I’ve had a bad time when I’m up 10%, but I measure my performance relative to the opportunity set. There’s been just as much opportunity in the second half of the year as there was in the first half. I set high standards for myself. I’m aiming for consistency in my performance. 19 It sounds like you have a distorted image of your performance. You had a spectacular early part of the year, and you are still net positive for the remainder of the year. You are being way too hard on yourself. If you’re a long-only equity trader, you will be down this year. But I’m an event trader, and the events have been bountiful this year. I’m disappointed with the way the year ended. If this were a more stable year without many events to trade, then maybe I would feel differently. But this has been a year with a lot of opportunity, and to succeed as a trader, you have to capitalize sufficiently when the opportunities are there. Over the last few years, have there been any trades that were major contributors to your performance? Not really, almost all my winning trades have been under 10%. So, unlike the earlier years in your career when you had quite a significant number of giant winning trades, your performance in recent years has been more a consequence of a lot of moderate gains. I keep reminding myself that I don’t need to knock it out of the park on every trade. In some ways, it’s better to make just a little bit on a trade. Does that mean you are trading a smaller position size relative to your account size than you were in your earlier years? Absolutely, and as a result, my drawdowns are also smaller. My last significant drawdown was 7% in March 2020. I wanted to reduce my volatility because I felt like a lot of my drawdowns were, in some sense, self-sabotage. Sometimes, I would get too confident, take too large of a position at the wrong moment, and then take a big loss. Then I would feel underconfident for the next series of trades, which would have been quite profitable. I’m quite proud that I have avoided repeating those situations. Was the March 2020 drawdown primarily due to a single event? It was. In response to Covid, the Fed announced a quantitative easing program on a Sunday, and I wanted to go long on the news. Buying the open after a weekend event is always risky because the market will usually discount the event on the open. But I was banking on additional upside momentum after the open because many people were still quite unsure of the market. Also, the Fed announcement came only a few hours before the 20 Sunday evening market open, so I thought the information might not have gotten through to enough market players to be fully discounted on the open. My strategy was to buy the S&P on the open with a tight stop. This trade occurred in the final week of the March contract before expiration, when most open contracts are rolled into the subsequent June contract. I was aware of the approaching expiration but thought there would still be sufficient volume in the March contract so that it didn’t make a difference which contract I bought. I went long the March contract on the higher open. It immediately reversed, locking limit down, and I couldn’t get out. I liquidated as soon as trading resumed, but by that time, I had a 6% or 7% loss on the trade. Was it just the March contract that stopped trading? That is the frustrating part. Trading wasn’t suspended in the June contract. If I had been in the June contract instead of the March contract, I would have lost only about 1% o n the trade. When we initially spoke, you were in a transition incorporating technically oriented trades that you held longer than your event trades, which you entered and exited on the same day. Have you continued in that vein? It’s still a work in progress. How have the technically based trades done? Let me check. They were: 19% in 2019, 18% in 2020, flat in 2021, and 14% in 2022. It sounds like it is still a minor component of your trading. I guess you could call it minor in terms of P&L, but it’s major in terms of its psychological impact. In event trading, you can go through periods where nothing is happening, which can be quite boring. During such times, it’s nice to have another strategy to keep me busy. Does having this technical strategy to keep you busy help prevent you from taking suboptimal trades when event trading opportunities are sparse? Maybe a little bit, but I have worked hard over the years to become more disciplined and wean out those suboptimal trades. I’m much more comfortable with knowing what my",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.178944"
}