{
  "id": "60177c2fa0c5",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 20,
  "content": "As a trader, you can choose to be completely independent or semi- independent. To be completely independent, you can simply open a retail brokerage account, deposit some cash, and start trading. No one will question your strategy, and no one will guide you in your trading. Furthermore, your leverage is limited by Securities and Exchange Commission (SEC) Regulation T—roughly two times Setting Up Your Business Chan800064_c04.indd 81 5/20/2021 10:54:59 AM 41 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Setting Up Your Business 83 work best, as tax gains or losses can be passed directly to you person- ally. Even if you are not a US resident, you can still easily incorporate a US LLC for trading in a US brokerage account. I used bizfilings.com for that, but there are many other similar services, such as Stripe Atlas. No legal help is required if you are the sole shareholder. Of course, you will still be subject to the various rules and regulations imposed by the SEC, such as Regulation T . I made them sound like bad things when I spoke of rules and regula- tions imposed by proprietary trading firms. But, actually, some of these rules (such as the prohibition from trading penny stocks or the prohibition from carrying short positions overnight) are actually risk management measures for your own protection. Often, when the going is good, traders will bemoan these constraints limiting their flexibility and profitability. They may even decide to start their own retail trading accounts and start trading on their own. However, when they suffer the (almost inevitable) big drawdown, they will wish that someone were there to restrain their risk appetites and come to regret this unfettered freedom. (The teenager in us has never left, after all.) The decision whether to go retail or to join a proprietary trading firm is generally based on your need of capital, the style of your strat- egy, and your skill level. For example, if you run a low-risk, market- neutral strategy that nevertheless requires a much higher leverage than allowed by Regulation T in order to generate good returns, a proprietary account may be better for you. However, if you engage in high-frequency futures trading that does not require too much capital, a retail account may save you a lot of costs and hassles. Similarly, a very experienced trader with strong risk management practices and emotional stability probably doesn’t need the guidance given by a proprietary firm, but less experienced traders may benefit from the imposed restraints. There is another consideration that applies to those of you who have discovered some unique, highly profitable strategies. In this situation, you may prefer to open a retail trading account, because if you trade through a proprietary account, your proprietary trading firm is going to find out about your highly profitable strategy and may “piggyback” on your strategy with a lot of its own capital. In this case, your strategy will suffer more market impact trading cost as time goes on. Table 4.1 summarizes the pros and cons for each choice. Chan800064_c04.indd 83 5/20/2021 10:55:00 AM 42 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 84 QUANTITATIVE TRADING One final note: Some may think that there is a tax advantage in joining a proprietary trading firm because any trading loss can be deducted from current income instead of as capital loss. Actually, you can choose to apply for trader tax status even if you have a retail brokerage account so that your trading loss can offset other TABLE 4.1 Retail versus Proprietary Trading Issue Retail Trading Proprietary Trading Legal requirement to open account None. Need to pass FINRA Series 7 examination and satisfy other FINRA-imposed restrictions. Initial capital requirement Substantial. Small. Available leverage or buying power Determined by SEC Regulation T . Generally 2x leverage for overnight positions, and 4x for intraday positions. Based on firm’s discretion. Can be as high as 20x or more for intraday or hedged positions. Liability to losses Unlimited, unless account is opened through an S corporation or LLC. Limited to initial investment. Commissions and fees Low commissions (perhaps less than 0.5 cent a share) and minimal monthly fees for data. Higher commissions and significant monthly fees. Bankruptcy risk of brokerage No risk. Account insured by Securities Investor Protection Corporation (SIPC). Has risk. Account is not insured. Training, mentoring, guidance None. May provide such services, sometimes at a fee. Disclosure of trade secrets Little or no risk, especially if retail brokerage does not have proprietary trading unit. Has risk. Managers can easily “piggyback” on profitable strategies. Restrictions on trading style No restrictions, as long as it is allowed by SEC. May have restrictions, such as prohibitions on holding overnight short positions. Risk management Mostly self-imposed. More comprehensive and imposed by managers. Chan800064_c04.indd 84 5/20/2021 10:55:00 AM 43 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Setting Up Your Business 89 broker’s trading server. As discussed in Chapter 2, any delay in the transmission of your order to your brokerage results in slippage, which is quite real in terms of lost profits. In fast-moving markets, every millisecond counts. Besides offering a high-speed connec- tion, a VPS (e.g., speedytradingservers.com) will",
  "word_count": 1000,
  "topics": [
    "psychology",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.606888"
}