{
  "id": "bf03454810a6",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 105,
  "content": "in the market. Traders using an SMA in an intuitive fashion are not likely to be misled, because they are focusing on the bigger picture, but systematic approaches or tools (such as trend indicators) derived from an SMA may have some issues with outliers. Particularly in intraday data, where the overnight gap is signiﬁcant, or longer-term equities, which have frequent price shocks due to earnings announcements, systematic tools based on simple moving averages are subject to distortion. Few traders realize that simple moving averages are low-pass ﬁlters, meaning that they will ﬁlter out (eliminate) higher-frequency oscillations and cycles. Figure B.5 shows a situation that will probably not be encountered in actual trading: a market that is mov- ing in an idealized 20-period sine wave, with 20-period SMA and EMA applied. Though it may be very counterintuitive, the SMA is completely ﬂat. When the SMA length matches the sine wavelength, there are always as many values above as below the moving average, There is a single large price shock not visible on this chart 163 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing 414 APPENDIX B: A DEEPER LOOK AT MOVING AVERAGES AND THE MACD FIGURE B.5 Twenty-Period EMA and SMA Applied to a Theoretical 20-Period Sine Wave Notice that the SMA (dotted line) is completely ﬂat on the zero line. so the average nets to zero—an SMA will always hide any cycles that are whole-number multiples of the SMA length. You might think that this is pure theory and that it would not have any application to a real trading situation, but extraordinary situations do occur. I once had a trader I was working with point out that his moving average on a 1-minute chart was not “working right” on part of the chart because it was not reacting to the mar- ket’s movements. For about 45 minutes, this stock had settled into a very dependable cycle that just happened to match the length of the moving average he was using, so, while the market was oscillating fairly wildly, his average wouldn’t budge. There are cy- cles in the market. It is difﬁcult to trade them because they are ephemeral and they shift frequently, but they will sometimes line up with your moving averages with seemingly bizarre results. Trade long enough and you will see pretty much everything. Let’s end this section with an example that is important for longer-term investors to keep in mind. The natural language of the market is percentage changes and growth rates, which is why ﬁnance math is based on discounting cash ﬂows and compound interest, and why the ﬁrst task of any research project is converting prices into returns. Shorter- term traders tend to think in differences (e.g., “I made a point and a half in that stock.”); longer-term investors think more often in percentages. Figure B.6 shows a market that is growing at a constant rate; each data point is a 5 percent increase over the previous one. On a linearly scaled chart, a market appreciating at a constant growth rate will describe a curve, not a straight line. On a linear chart, moving averages will seem to lag behind the price curve at an ever-increasing distance. What is actually happening, however, is that the moving averages lag a constant per- centage behind prices. The linear chart does not misrepresent anything, but it is not the right tool to look at percentage-based relationships. Figure B.7 is exactly the same as 164 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing Appendix B: A Deeper Look at Moving Averages and the MACD 415 FIGURE B.6 Moving Averages Applied to a Market Growing at 5 Percent Constant Rate, Linear Scale the previous chart; the only difference is that the y-axis is log scale rather than linear. Remember, log scale charts are designed so that equal distance intervals on the y-axis are equal percentage changes, not equal price changes as on a linear chart. Note the ticks on the right side of the y-axis, which are evenly spaced prices on the linear chart, become compressed near the top of the axis when log scaled. Be clear on this effect: straight lines on log charts are curves on linear charts. If you are drawing trend lines on FIGURE B.7 Moving Averages Applied to a Market Growing at a Constant 5 Percent Rate, Log Scale Note that curves on previous chart are straight lines here. 165 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing 416 APPENDIX B: A DEEPER LOOK AT MOVING AVERAGES AND THE MACD log scale charts, you are actually drawing curves on normal, linearly scaled charts. This may be perfectly correct in the context of a longer-term chart where the curve faithfully represents the growth rate, but it is something that must be fully understood. THE MACD Moving average convergence/divergence (MACD) was one of the early technical tools developed by Gerald Appel in the mid-1970s. As",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "fundamentals",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.711826"
}