{
  "id": "ae2cf05dfc98",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 21,
  "content": "in the development of other pricing models, we will for the moment restrict ourselves to a discussion of the Black-Scholes model and its various forms. In later chapters we will consider the question of early exercise. We will also look at alternative methods for pricing options when we question some of the basic assumptions in the Black-Scholes Model. The reasoning which led to the development of the Black-Scholes Model depends on the five steps we listed earlier in this chapter when we proposed a simple method for evaluating options. Black and Scholes worked originally with call values, but put values can be derived in much the same way. Alternatively, we will see in Chapter 11 that in an arbitrage-free market there is a unique relationship between an underlying contract, and a call and put with the same exercise price and expiration date. This relationship enables us to derive a put value simply by knowing the associated call value. In order to calculate an option’s theoretical value using the Black-Scholes Model, we need to know at a minimum five characteristics of the option and its underlying contract. These are: i. The option’s exercise price 2. The amount of time remaining to expiration 5. We are speaking here of options on a physical foreign currency, rather than options on a foreign currency futures contract. The latter may be evaluated using the Black Model for futures options. Introduction to Theoretical Pricing Models 45 3. The current price of the underlying contract 4, The risk-free interest rate over the life of the option 5. The volatility of the underlying contract The last input, volatility, may be unfamiliar to the new trader. While we will put off a detailed discussion of this input to the next chapter, from our previous discussion one can reasonably infer that volatility is related to the speed of the market. If we know each of the required inputs, we can feed them into the theoretical pricing model and thereby generate a theoretical value. Black and Scholes also incorporated into their model the concept of the riskless hedge. For every option position there is a theoretically equivalent position in the underlying contract such that, for small price changes in the underlying contract, the option position will gain or lose value at exactly the same rate as the underlying position. To take advantage of a theoretically mispriced option, it is necessary to establish a hedge by offsetting the option position with this theoretically equivalent underlying position. That is, whatever option position we take, we must take an opposing market position in the underlying contract. The correct proportion of underlying contracts needed to establish this riskless hedge is known as the hedge ratio. Why is it necessary to establish a riskless hedge? Recall that in our simplified approach an option’s theoretical value depended on the probability of various price outcomes for the underlying contract. As the underlying contract changes in price, the probability of each outcome will also change. If the underlying price is currently $100 and we assign a 25% probability to $120, we might drop the probability for $120 to 10% if the price of the underlying contract falls to $80. By initially establishing a riskless hedge, and then by adjusting this hedge as market conditions change, we are taking into consideration these changing probabilities. In this sense an option can be thought of as a substitute for a similar position in the underlying contract. A call is a substitute for a long position; a put is a substitute for a short position. Whether it is better to take the position in the option or in the underlying Figure 3-4 Exercise Price Time to Expiration Theoretical > Theoretical Underlying Price Pricing Model Value Interest Rates Volatility 46 Chapter 3 contract depends on the theoretical value of the option and its price in the marketplace. If a call can be purchased (sold) for less (more) than its theoretical value, it will, in the long run, be more profitable to take a long (short) market position by purchasing (selling) calls than by purchasing (selling) the underlying contract. In the same way, ifa put can be purchased (sold) for less (more) than its theoretical value, it will, in the long run, be more profitable to take a short (long) market position by purchasing (selling) puts than by selling (buying) the underlying contract. Since the theoretical value obtained from a theoretical pricing model is no better than the inputs into the model, a few comments on each of the inputs will be worthwhile. EXERCISE PRICE There ought never be any doubt about the exercise price of an option, since it is fixed in the terms of the contract and does not vary over the life of the contract.° A Deutschemark March 58 call traded on the Chicago Mercantile Exchange cannot suddenly turn into March 59 call ora March 57 call. An IBM July 55 put traded on the Chicago Board Options Exchange cannot turn into a July 50 put ora July 60 put. TIME TO EXPIRATION Like the exercise price, the option’s expiration date is fixed and will not vary. Our DM March 58 call will not suddenly turn into an April 58 call, nor will our IBM July 55 put turn into a June 55 put. Of course, each day that passes brings us closer to expiration, so in that sense the time to expiration is constantly growing shorter. However, the expiration date, like the exercise price, is fixed by the exchange and will not change. Time to expiration, like all inputs in the Black-Scholes Model, is entered as an annualized number. If we are entering raw data directly into the model we must make the appropriate annualization. With 91 days remaining to expiration, we would enter an input of .25 (91/365 = .25). With 36 days remaining, we would enter .10 (36/365 = .10). However, most option evaluation computer programs already have this transfor- mation incorporated into the software so that we need",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.425443"
}