{
  "id": "0267db19bf0f",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 170,
  "content": "market is not locked, a trader can trade synthetic long or short futures contracts. In the stock market, there may be prohibitions against the sale of stock not actually owned. Or if short sales are allowed, there may be restrictions on when such sales can be made. Ifa trader cannot freely sell stock, put prices become inflated compared to call prices, and all the conversions and reversals appear to be mispriced with respect to their theoretical values. If short sales are not freely permitted, many stock option traders try to carry some long stock so they will always be in a position to sell stock if the need arises. Also, we saw in Chapter 5 in the discussion of time spreads, and in Chapter 12 in the discussion of boxes, that tender offers for a stock can distort the value of these positions. In the case of time spreads, traders may be forced to exercise call options with some time value remaining because no stock can be borrowed to carry a short position. A box may be trading at greater than its theoretical value if a partial tender offer is made and early exercise is a possibility. While there are occasionally tax considerations, for most market participants these are usually minor. When considering a strategy, a trader is unlikely to ask himself, “If this trade makes or loses money, what wiil be the tax consequences?” Nor should most traders ask such a question. Differences in tax consequences, or changing tax conse- quences, rarely make one strategy better than another.2 2. Thisis not to say that tax consequences are always insignificant. Tax considerations can sometimes play a role in portfolio management. They can also play arole in stock option strategies involving dividends, when the dividends are subject to different tax rules than the gains or losses from stock or options. Models and the Real World 387 The assumption that a trader can always borrow or lend money freely is a more serious weakness in pricing models. Even if a trader has sufficient funds to initiate a trade, he may find at some later date that he is required to come up with additional funds in the form of increased margin requirements.° If money were freely available margin would never be a problem. A trader could always borrow margin money and deposit the money with the clearing house. Since the borrowing and lending rate are assumed to be the same, and since the clearing house in theory pays interest on the margin deposit, there would never be a problem obtaining margin money, nor would there ever be a cost associated it. in the real world traders do not have unlimited borrowing capacity. If a trader cannot meet a margin requirement he may be forced to liquidate a position prior to expiration. Since all models, even those which allow for early exercise, assume that a trader will always have the choice of holding a position to expiration, the inability to meet margin requirements, and therefore maintain the position, can make the values generated by the theoretical pricing model less reliable. Experienced traders learn to consider the risk of a position not only from the standpoint of how much the position might lose if things go wrong, but how much margin might be required to maintain the position over the life of the options. A trader should always have sufficient margin money available to meet this latter requirement. Even if a trader had unlimited borrowing capacity, the fact that for most traders borrowing and lending rates are not the same can also cause problems with strategies based on model generated values. A trader who borrows margin money at one rate will almost certainly receive a lower rate when he deposits this money with the clearing house. The difference between these rates, which will result in a loss to the trader, is something of which the model is unaware. And the greater the difference between borrowing and lending rates, the less reliable will be the values generated by the model. The most serious flaw in the frictionless markets hypothesis is the assumption that there are no transaction costs. While a strategy might or might not be affected by tax or interest rate considerations, there are always transaction costs. These costs can come in the form of brokerage fees, clearing fees, or an exchange membership. For many market participants, transaction costs may be so great that a strategy which looks sensible based on model-generated values may not be worth doing when transaction costs are also taken into consideration. Moreover, transaction costs can accrue not only when the strategy is initiated or liquidated, but also every time an adjustment is made. Ifa strategy will require many adjustments because it has a high gamma and the trader intends to stay delta neutral, the transaction costs can have an especially great impact on model- generated values. 3. The possibility that a trader in a futures option market may also have to come up with additional variation money, as opposed to margin money, subsequent to establishing an option position Is incorporated into most models. This is why a conversion or reversal in a futures option market may not be delta neutral. 388 Chapter 18 INTEREST RATES ARE CONSTANT OVER THE LIFE OF AN OPTION The interest rate component assumed in a theoretical pricing model is the riskless rate over the life of an option. Any credits or debits associated with an option strategy will be subject to an interest rate identical to the least risky rate corresponding to the term of the option. In most markets the least risky rate is the rate associated with government issued securities. A trader in a U.S. option market who sells straddles consisting of three-month calls and puts is assumed by the model to have invested the resulting credit in three-month government treasury bills. If both the option position and the treasury bills are held to expiration, this effectively locks in one interest rate",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.448419"
}