{
  "id": "d1e7dc03f980",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 9,
  "content": "d es wor k e d . I was very tense an d anxious a ll t h e time. I couldn’t sleep at ni g ht. All I thou g ht about was the market and the losses. It was a ni g htmare. In the end, somethin g g ood did come out of it. T h at was t h e rea l ization o f h ow important my investment process is t o my wor k . W h en I was tra d ing, I h a d no process. I was essentia ll y act - in g randomly . I completely lost my way . ” B i ll y , a position tra d er in t h e equities mar k et, saw For d Motor Com - pany stoc k s h oot up d ramatica ll y , easi l y c l earing recent resistance. A l- th oug h not a b rea k out tra d er, Bi ll y b oug h t t h is stoc k near t h e d ai l y h ig h j ust before the market close. Later, he admitted that his best tradin g p l ay is “a l ways to l oo k f or t h e l ow‐vo l ume pu llb ac k a f ter a momentum move.” Here, however, he acted impulsively . Y ou can see the stock and h is purchase labeled A on Fi g ure 2.2 . The next few days saw the stoc k drift higher, though the stock was no longer moving swiftly as it did FIGURE 2.2 Bill y ’s Impulsive Trade in Ford Motor Compan y Source: TradeStation T echnologies, Inc. 50,000,000 F-Daily A B 10 17 24 Oct 8 15 22 12 19 26Nov 5 10 17 24 2013 7 14 14.50 14.30 14.00 13.50 13.00 12.00 12.50 1 1 .00 1 1 .50 10.00 130,000,000 1 10,000,000 90,000,000 70,000,000 55,424,950 30,000,000 10.50 Dec 11 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 53STRONG EMOTIONS IN TRADING Exercise 2.2 Developing Emotional Intelligence: My Patterns for Strong Emotions Event or Situation that Triggers the Emotion Hot Thoughts That Ignite and Amplify Strong Emotions How You Feel Actions You Take Results and Consequences emotiona ll y inte ll i g ent f or a tra d er to k now h ow h is or h er persona l patterns typi - ca ll y evo l ve w h en stron g emotions are tri gg ere d . Once c l ari fi e d , more pro d uctive actions can b e ta k en . T a k e a f ew moments an d re f er to your examp l es f rom Exercise 2.1 (Becomin g Aware of Fear and Other Stron g Emotions). Select a stron g emotion pattern that you experience and defi ne your own personal rule‐set for this emotion. Use the next exercise, Exercise 2.2, to b ecome more emotiona ll y inte ll igent a b out your strong emotions an d h ow t h ey emerge an d in fl uence your actions. As much as it may seem paradoxical and contrary to what you mi g ht assume, bein g a bl e to manage onese lf is not a b out contro ll ing emotions as muc h as it is a b out b eing open to f ee l ings, inc l u d ing strong emotions. Certain l y, s e lf ‐management invo l ves b eing a bl e to app l y se lf ‐ca l ming tec h niques an d coping s k i ll s (w h ic h we d iscuss in detail in future chapters) to maintain a settled disposition when mildly anxious. Self ‐ management a l so invo l ves mars h a ll ing positive f ee l ings to motivate us or to b e a bl e to delay the impulsive desire for immediate gratifi cation for a larger reward later. 12 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 59 T h e Strugg le to Contro l an d E l iminate Emotions CHAPTER 3 T r aders experiencing strong, unwanted emotions such as fear and anxiety natu - r ally try to control them. Because stron g emotions interfere with tradin g , trad - ers look for a way to g et rid of them. This seems reasonable—what everyone would do. But therein lays the rub. Experienced traders know that doing the same things as ever y one else puts y ou in the herd, not outside of it. Profi tabilit y and success in trad - in g will be elusive when takin g the same actions as others, especially when emotions are involved. W e have already seen that we have little control over our amygdala and the internal, psychobiolo g ical events that fear and other stron g emotions unleash when the fi g ht‐fl i g ht response is tri gg ered. Aside from this tradin g axiom and our biology , there are sound psychological reasons why actively trying to control strong emotions will make matters worse. W e will see later wh y this is virtuall y alwa y s",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "crypto"
  ],
  "created_at": "2026-02-05T00:37:45.718366"
}