{
  "id": "724a33ad1c26",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 39,
  "content": "fi t o b jective. When using this assessment protocol, keep in mind that both technical and mental f actors are important an d s h ou ld b e note d . W h en i d enti f ying l imitations, f or ex - amp l e, you mig h t recognize t h at, a l t h oug h your pro fi t target on a l ong tra d e was h ig h er, you c l ose d t h e tra d e a f ter it reac h e d on l y 60 percent o f its o b jective b ecause you were f ear f u l t h at price l oo k e d t h reatening. As you consi d er w h y t h is was a l imi - tation, you mi g ht reco g nize both technical and mental limitations: technical in tha t you were not rea d in g t h e mar k et we ll . T h e minor t h reatenin g price action you saw while in the trade was not evidence of stron g supply hittin g the market. Mentally in that trade you were anxious, worried about keepin g profi ts you made, and feelin g averse to g ivin g any pro fi ts b ac k . T h us, f or t h is tra d e at l east, you h ave l earne d t h a t you need more work on both the mental and technical sides of tradin g when in a profi table trade that has more to run. Should y ou learn from multiple reviews like this over multiple days or weeks that this same issue keeps occurrin g across diff eren t Exercise 11.1 Trader’s Performance Assessment 1. What were my trading strong points? Why were these strengths? 2. What were my trading limitations? Why were they limitations? 3. What have I learned about myself and my trading? 4. What steps can I take based on what I have learned? - - 45 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 271THE TRADING PSYCHOLOGY PROCESS you achieve the goals refl ected in your developmental need and you have turned a l imitation into a persona l tra d ing strengt h . T o ac h ieve exce ll ence an d mastery in tra d in g , you nee d to b e min df u l t h rou gh- out the process of Hi g h‐Quality Preparation, Eff ective Execution, and Constructive Self‐Assessment. En g a g e mindfully and fully in the cycle of continuous improvement. As you work with this process of self‐development and improvement over time, you wi ll gain a s h arper perspective on your tra d ing psyc h o l ogy an d your tra d ing, em b racing its pro b a b i l istic nature an d t h e ro l e it p l ays in your l i f e. Y our persona l awareness of your stren g ths and limitations will expand and your motivation will im p rove. Y ou wi ll b ecome b etter at menta l ‐d isci pl ine an d h ave more se lf ‐con fi d ence b ecause you wi ll b e f ocusing on t h e t h ings t h at l ea d to improvement an d you wi ll see improvement h appening. Y ou wi ll d eve l op a more b a l ance d emotiona l intensity as you perform the tasks of tradin g , experiencin g fewer emotional whipsaws and f ewer emotiona l h ijac k ings. Y ou wi ll h ave improve d your f ocus an d poise an d b e a bl e to maintain your composure. Self‐esteem will grow as you assume responsibility for your tradin g and you make the eff ort to practice it deliberatively . Y ou will add si g nifi - cant value to your trading through continuous self‐improvement. These are the true elements of tradin g psycholo g y . And, as you may have noticed, they work not just for tradin g , but for life, as well. T able 11.1 , High‐Value Mental Skills and Some High‐Value Actions of Construc - tive Self‐Assessment, provides a summary of Constructive Self‐Assessment. The four hi g h‐value mental skills are listed and examples of HV As are provided. W e end this chapter as we have ended the previous two chapters with a Mental Skills Inventory for Constructive Self‐Assessment in Exercise 11.2. TABLE 11.1 High‐Value Mental Skills and Some High‐Value Actions of Constructive Self‐Assessment After: Constructive Self‐Assessment High‐Value Mental Skills Examples of High‐Value Actions Se lf ‐Estee m Per f ormance Accounta b i l it y P e r se v e r a n ce C ontinuous Improvemen t D e f ining ro l es an d va l ues outsi d e o f tra d in g M aintaining a tra d ing journa l R egu l ar review o f c h arts Seek feedback and advice from experienced traders C oncentrate on one tra d ing met h o d R egu l ar use o f Tr a d er ’s Per f ormance Assessment See k f ee db ac k f rom mentors an d tra d ing psyc h o l ogist s E ngage in d e l i",
  "word_count": 1000,
  "topics": [
    "psychology"
  ],
  "created_at": "2026-02-05T00:37:45.722343"
}