{
  "id": "5eac7f4a069f",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 103,
  "content": "& Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing APPENDIX B A Deeper Look at Moving Averages and the MACD T he charts and the discussion that follow may look a little strange, but the thought process is important. Too many times, traders use indicators or tools on their charts that they do not understand. Rules are developed based on the action of a squiggly line without fully understanding what that line measures and represents. Though some traders will ﬁnd some success with an approach like this, it misses much of the potential in these tools. To fully understand a technical tool, it is useful to peer deeply into its construction, and to understand how it reacts to changes in the underlying market. One of the best ways to do this is to “feed” an indicator an artiﬁcially created dataset that focuses on speciﬁc types of market action. Think of this as a way to look at the indicator in a laboratory environment, isolating and controlling for various inﬂuences. MOVING AVERAGES If you want to really understand the tools you are using and how they will react to ex- treme situations, it helps to understand how they will react in the most simple, basic contexts as well. Of course, everyone grasps the basics of moving averages: add higher prices and the average will go up. When price ﬂattens out, the average eventually will ﬂatten, too. When price turns down, it will cut through the moving average, and, at some point, it will start pulling the average down with it. This is all simple, but it is not the point. The point is to build an intuitive and intimate understanding of the behavior of the average as it responds to changing market data. One of the best ways I have found to fos- ter this intuition with any technical tool is to generate simple price patterns in artiﬁcial price series, and then to plot the indicator on this synthetic price data. (Nearly all chart- ing packages allow users to import ASCII data, but if this is not possible, the indicator may be calculated directly in an Excel spreadsheet and graphed there.) Think of this as a 409 159 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing 410 APPENDIX B: A DEEPER LOOK AT MOVING AVERAGES AND THE MACD controlled laboratory experiment: you are controlling the data that is fed to the indicator so you can begin to understand the details of the indicator’s reactions to that data. This process, along with careful thought and reﬂection, will build an understanding that goes beyond a simple understanding of the patterns on the screen. The charts that follow are examples of this process. There is value in these speciﬁc examples, but it is even more important that you can take the procedure and adapt it to your own use. These examples show both 20-period simple moving averages (SMAs) and exponential moving averages (EMAs) to compare their behavior and ﬂuctuations. The formulas required to build these indicators are already available from many books or the Internet, so they will not be a focus in this chapter, but you must have a clear con- ceptual understanding of the behavioral differences between the two. The simple moving average simply averages the price over a look-back window. It is completely blind to any data outside of that window, which creates the ﬁrst potential issue: a simple moving av- erage moves twice in reaction to any single large event. The value of the moving average has a change both when the event occurs and when it passes out of the left side of the evaluation window. The EMA is a considerably more complex animal. Recent data are weighted more heavily in an EMA, and, technically, no data points are ever dropped from the average. Rather than being dropped, past data is rolled off with an exponential decay. In actual practice, the effect of distant past data far out of the evaluation period of the average is so small that it is insigniﬁcant, but it is still there. It is important to realize, though, that this effect smoothes the left-hand side of the evaluation window—an EMA will not jump twice as a simple moving average will. This is one of the main advantages of the EMA over the SMA. Comparing EMA and SMA Behavior Consider ﬁrst how the moving averages react to a sudden shock in the market. Figure B.1 shows an artiﬁcial data series that is ﬂat, then suddenly breaks into a precise linear trend, which just as abruptly comes to an end as prices ﬂatten out again. Both the SMA (dotted line) and the EMA (solid line) are 20-period averages, but the front-weighting effect of the EMA causes it to react more quickly to the initial price shock. After a period of time, both averages settle into a steady relationship to the price trend, but the simple moving average is much quicker to return to the center after the trend stops. This effect is due to the decay in the EMA, which sees all data to the left of the average; the SMA is just a simple average of the past 20 data points. Once the market has been ﬂat for 20 bars, the simple moving average exactly equals the close. There are two important lessons here. Most traders know the ﬁrst, but few know the second. For an SMA and an EMA of the same length: r The EMA will react faster to a large price change because it front-weights the",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "market_structure",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:53.711493"
}