{
  "id": "0e88bf997897",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 9,
  "content": "trade of the year. That was a frustrating experience for me. 31 So, you only got out of the trade because you were managing money? Yes. I felt obligated to adhere to the risk guidelines I had told the investor. Is the fact that your daily loss could be due to a surrender of open profits something you didn’t think about when you told the investor your protocol? Yes, that’s right. Did that episode prompt you to change anything in the way in which you communicate to investors? Yes, I spoke to the investing firm, and they were more than happy for me to take the additional variance as long as I was OK with it. But before having that conversation, I wanted to stick to our risk guidelines, especially in a year when the markets have been so volatile. Otherwise, things are going OK, although 2022 has probably been my worst year ever. Are you down for the year? I’m still up about 18%. I think in 2022 in particular, many traders would be happy with your “worst year.” True to form, you have had some double-digit winning months since our last interview. Any trades that were instrumental to these big winning months? Coming into January 2021, Covid was still raging in the U.S. We got some news from Johnson & Johnson about their vaccine. Although the headline data wasn’t great, more importantly, the data around deaths was very encouraging. The vaccines were never about stopping people from getting Covid; they were about preventing people from dying, which many people still didn’t understand. The equity markets had a negative reaction to the news. I thought people were overestimating the lingering effects of Covid and were way too bearish about the outlook. I went long S&P futures and short T-note futures, anticipating a pickup in growth and inflation. February 2021 was my best month that year. Any mistakes you have learned from during the past few years? My biggest frustration this year has been going for home runs and being unable to sustain the trades because my size was too large, and my stops 32 were too tight. The lesson here is that I need to size my trades to account for their potential duration and volatility. I also need to trade more around my positions and take profits off the table when I get them, which is what I’ve been doing for the last few months. By taking profits off the table, do you mean taking partial profits? Yes. Is the implication that if you took some initial profits out of a position, you’d have more staying power for the rest of the position? Yes, exactly. 33 John Netto Monday Is My Favorite Day Three years later Any trades that were particularly noteworthy during the last few years? The big trade for me was crypto in 2021, which provided one of the best trading opportunities I’ve seen in the last 15 years. It was a special trending market you don’t get many times in your career. You could ride that wave until you were done riding it. You could buy every pullback until crypto unraveled in November 2021. How long have you been trading crypto? I started trading crypto futures to make up a material part of my trading in 2020. What made you so bullish on crypto at the time? There was an institutional allocation shift taking place. Crypto was becoming more mainstream, and there was an underallocation to it. Also, I had seen this type of market froth before. As long as you had zero interest rates and an influx of liquidity, bellwether crypto coins like Bitcoin and Ethereum, which are traded as futures, would be beneficiaries. If you understood the fundamental asset allocation that was taking place and the risk-on environment that was lifting all boats, you could step in and buy the dips. I knew it was a game of musical chairs and that, at some point, the music would stop—but in the meantime, you could trade 34 it. It was going to work until it didn’t. When it stopped working, I got stopped out. You were buying the market on pullbacks. Did you then get out on rallies? Yes, absolutely. I only held the trade for a few days, sometimes as little as 12 to 24 hours. Oftentimes, I would even get up every few hours at night to check the market. How did you time your trades? There’s an intuitive feel you develop after decades of doing this. At some point, you get a sense that the sellers have exhausted themselves, and the low is probably in. I’m going to buy here. I’m going to set my stop here and my target here. It wasn’t much more complicated than that. How did you know when the game was over? You never know anything. OK, how did you know the game was probably over? The Fed made a dramatic shift in November 2021 when they went from saying that inflation is transitory to acknowledging inflation is a big problem. That was a major sea change, and in the weeks afterward, the dips weren’t bouncing as they had before. I wish I could tell you I stopped buying the dips at the highs, but I still made some losing attempts from the long side after that point. By the beginning of 2022, it was clear that the trade wasn’t working anymore, and I haven’t bought Bitcoin since then. Were there any other trading themes that were important in recent years? Yes, trading on CPI release days. For context, two years ago, on a day when the CPI price index was released, the one-day S&P straddle would trade at 20 to 25 points. The CPI simply didn’t move the market. During the second half of 2022, the same straddle would trade around 70–75 points on days when the CPI was released. If the one-day straddle in a market is three times the price it was two",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.179590"
}