{
  "id": "73347180db51",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 168,
  "content": "the ratio vertical call spread presented at the beginning of this chapter: ABC stock price = 99.00; = Time to June expiration = 7 weeks Volatility= 20%; Interestrate=6%; Dividend =0 Option Option Option Option Position Price Th. Val. Delta Imp. Vol. long 10 June 95 calls 6.25 5.82 76 23.7 short 30 June 105 calls 1.63 1.08 26 24.5 At the same time, suppose we also have a long strangle in a different stock: XYZ stock price = 62.00; = Time to July expiration = 11 weeks Volatility = 23%; Interest rate = 6%; Dividend = .50 in 8 weeks Option Option Option Option Position Price Th. Val. Delta Imp. Vol. long 20 July 65 calls 1.38 1.52 36 21.6 long 20 July 60 puts 1.50 1.57 -34 22.3 If we combine these two positions, how might we analyze the overall risk? One possible method might be to look at the change in value of the two positions per point move in the underlying stocks. But because the two stocks are trading at different prices, Position Analysis 381 and because they are expected to have different volatilities, a one-point move in ABC is unlikely to be matched by a one-point move in XYZ. To equate movement in ABC with movement in XYZ, it may be more useful to look at price changes in terms of standard deviations. For example, we can approximate a weekly standard deviation for each stock by dividing the annual volatility by ¥52, and multiplying this by the stock price: ABC: 20%/7.2 x 99 = 2.75 XYZ: 23%/7.2 x 62 = 1.98 From these numbers we can generate graphs showing the position value given various standard deviation price changes in each underlying stock. This has been done in Figure 17-7a. Since we have a ratio vertical spread in ABC stock options and a long strangle in XYZ stock options, it should come as no surprise that the position will show its maximum theoretical profit when ABC sits still and XYZ makes a big move. In order to complete our analysis we might want to look at the delta, gamma, theta, and vega of the position. But, again, with the stocks at different prices it may be difficult to equate the sensitivities of the ABC options with the sensitivities of the XYZ options. Since our total position is an intermarket spread, rather than looking at the delta, gamma, theta, and vega of the position, we might instead look at the $delta, $gamma, $theta, and $vega sensitivities introduced in Chapter 16. These sensitivities are shown in Figures 17-7b through 17-7e.° Figure 17-7a 100 | XYZ moves down : XYZ moves up 4st. devs. 4st. devs. “, 80> 4 XYZ moves up 60 ae 2 st. devs. @ 404 Nw | fe) en ee ee 2 a = ~ — ae ee mo [re ae ~ SN 8 —— @ ~ 5 NA 9 SS o . SN XYZ moves down NG 2 st. devs. me Ne -407 . SOA XYZ doesn’t move SONS -607 | -80 on T + T T T T -4 -3 2 | 0 1 2 3 4 ABC Price Movement (st. devs.) 3. In Figures 17-7b through 17-7e we make the assumption that each point is worth $100. 382 Chapter 17 Figure 17-7b 1500 XYZ Moves up po 4st, devs. 1000-5 — nn 500+ 7 ~. XYZ moves u _ 2st devs” got — N 2 07 S - oo a = -500-4 ™ ~~ NN 8 ~N a — sg | —— AS} -1000 . XYZ moves down goo, 4S SeNS: XYZ moves down . ; 2 st. devs. a XYZ doesn’t move -200074 -2500 1 4 : : _- — -4 -3 -2 -1 0 1 2 3 4 ABC Price Movement (st. devs.) Figure 17-7c 2007 4 150- = 1004 NN XYZ doesn't move § _ = . fe) N a MS 6 N E 507 XYZ moves & up or down ao 2 st. devs. fo) ~N me . - o+ 2 = : ~~ a ae a a XYZ moves up or down -50-] 4 st. devs. -100 T T T T T T -4 3 -2 -1 Q 1 2 3 4 ABC Price Movement (st. devs.) Position Analysis 383 Figure 17-7d 100 XYZ moves down 4 st, devs. 60- XYZ moves down 2 st. devs. 40-4 XYZ moves up 4, st. devs. XYZ doesn’t move Total $Theta Position -2074 XYZ moves up 2. st. devs. -40-4 -60- 4 -3 -2 4 ) 1 ABC Price Movement (st. devs.) 4 a4 - 500 4004-0 Se oo a - “. XYZ moves up > . 2. st, devs. XYZ doesn't move XYZ moves down 2 st. devs. 10074 Total $Vega Position XYZ moves down -1004 4st. devs. -200+ XYZ moves up 4, st. devs. -300 —T T T T T —T 4 -3 -2 -1 0 1 2 ABC Price Movement (st. devs.) 384 Chapter 17 It may initially be difficult to grasp why the $gamma, $vega, and $theta are changing as they are. If one recalls that the gamma, theta, and vega are always greatest for an at-the-money option, the position should show its greatest positive $gamma, negative $theta, and positive $vega when ABC is close to 95 (the position is long ABC 95 calls) and when XYZ is close to either 60 or 65 (the position is long XYZ 60 puts and XYZ 65 calls). The position should show its greatest negative $gamma, positive $theta, and negative $vega when ABC is close to 105 (the position is short ABC 105 calls) and the when XYZ is as far away from 60 and 65 as possible. Since price movement in Figures 17-7a through 17-7e is expressed in standard deviations, in order to interpret the graphs we need to know where the exercise prices are in terms of standard deviations. With ABC at 99 and a one standard deviation price change of 2.75, the ABC exercise prices in terms",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.448130"
}