{
  "id": "ca9baeca9fa2",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 7,
  "content": "f or you to contro l w h en tra d ing? It l iste d f ear, gree d , an d h ope as possi bl e responses. As Figure 2.1 s h ows, t h e response was revea l ing. Tra d ers overw h e l ming l y endorsed fear as the most di ffi cult emotion to control when tradin g . It was cited a b out twice as f requent l y as eit h er gree d or h ope. Fear is a very common an d f re - quent experience among tra d e r s . Even success f u l tra d ers wit h years o f experience say t h ey are never comp l ete l y comfortable in makin g and mana g in g trades. Tim Bourquin interviewed over 200 success f u l tra d ers an d d isti ll e d w h at h e l earne d into common h a b its most tra d ers f o l- low that lead to success in trading. One surprising fi nding was that all successful trad - ers came to realize that bein g uncomfortable when tradin g is okay . The traders he interviewed—some with over 20 years of trading experience—were “never really all that comfortable in their tradin g chair.” They still had doubts, still had worries, and still experienced anxiety and fear. They felt the stress of tradin g and yet found that they could still make good, profi table decisions while feeling uncomfortable. Al - thou g h these successful traders learned to “ g et comfortable with their discomfort,” FIGURE 2.1 SFO Magazine Reader Poll on Emotions Source: Stocks, Futures and Options Magazine 7, no. 8 (August 2008): 10. Hope SFO Magazine Poll Question Which Emotion Is the T oughest for Y ou to Control When T rading: Hope, Greed, or Fear? Greed Fear 0% 10% 20% 30% 40% 50% Reprinted with premission from www.T raderPlanet.com 60% 8 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 44T RADE MINDF U LLY an d actions are not re l ate d to soun d , competent tra d ing b ut so l e l y to your interna l state. It is crucia l to b egin to b ecome aware o f w h at your min d is saying. Is it a b ou t w h at t h e mar k et is o b jective l y d oing vis– à–vis your tra d e, or is it a b out b eing wrong, l osin g money , missin g out, or l eavin g money b e h in d —a ll o f w h ic h h ave not h in g to d o wit h ma k ing, managing, an d exiting a tra d e. It is a l so critica l to b ecome aware o f what your tradin g behavior is connected to. Is your action—such as enterin g a trade b e f ore it g ives a c l ear entry si g na l — d one to appease w h at your min d is te ll in g you, or is it d one b ecause t h at is t h e rig h t action f or t h is tra d e at t h is time? T h ese are cru- cial tradin g psycholo g y considerations. T ypically , if your tradin g is adversely aff ected by fear, you will see one or more patterns in your tra d ing. Y ou mig h t notice, f or examp l e, t h at you ten d to cut tra d es TABLE 2.1 Examples of Thoughts and Erratic Trading Actions Associated with Fear Type of Fear Examp les of Thoughts Examples of Erratic Actions Being W rong “I can ’t h ave anot h er l oss .” “I can ’t te ll my spouse/signi f ican t person I’ve had another loss.” “I can’t be wrong, here. ” Cutting winning tra d es s h ort . F ai l ing to pu ll trigger. Moving stops away from approaching price. Crowding stops. Averaging d own . I gnoring money management . Avoi d ing tra d es . L osing Money “I nee d a b etter in d icator/tra d e setup t o re d uce l osses .” “I must k eep my l osses to (a b are minimum) X percent. ” “Yo u ’re in p ro f it. Don ’t l et t h is turn into a loss! ” “I have to make up for this morning’s loss .” Continuous l y l oo k ing f or a b etter tra d e setup/in d icator/ana l ytica l tec h nique to r e d uce l osses ( h o l y grai l quest) . See k in g h i gh f requency win rate/ l ow f requency l oss rate. Cutting winning trades shor t Crowding stops or moving them away from approachin g price . Ta k in g unp l anne d tra d es an d d ou bl in g d own to ma k e up f or a l oss. Avoi d ing tra d es . Trimming position size a f ter a l oss. M issing O ut “T h e mar k et is moving wit h out me! ” “I misse d t",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:45.718134"
}