{
  "id": "585bfef02425",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 69,
  "content": "222 TRADING STRATEGIES FIGURE 7.27 The Potential Breakout on the Daily Is Contradicted by the Weekly Complex Consolidation (Bear Flag) Higher time frame pullbacks can also be a ﬁlter to skip trades that set up against those pullbacks. Figure 7.27 is an important example that shows what might have been seen as a good setup for a breakout on the daily chart: the consolidation up against re- sistance normally suggests the possibility of a strong break above that level, and is the opposite of the price rejection that normally accompanies a level holding. However, the weekly chart provided context, showing that the breakout was actually coming near the top of what was more likely to be bearish complex consolidation on the weekly chart. In this case, the higher time frame provides a bearish bias, which clearly contradicts the smaller pattern on the daily chart. The consolidation on the weekly could certainly fail, and it would do so through the success of the bullish breakout on the daily, but the probabilities favor downside continuation. There are a number of things you can do with this information, ranging from skipping the trade on the daily to taking it on smaller risk (which is not usually a good idea), or perhaps even watching for a breakout failure and entering a short trade on the daily. This last possibility combines a small pattern on one time frame with a bigger-picture bias from a higher time frame, which is an excellent use of multiple time frame information. At the very least, beware of patterns on one time frame that are clearly contradicted by strong patterns on higher time frames, especially when the patterns occur at potential inﬂection points. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 223 Higher Time Frame Drives to Targets In general, markets tend toward efﬁciency, and random walk prevails most of the time; when markets are more predictable, it is usually in short spurts of activity, which can sometimes be identiﬁed through speciﬁc patterns in prices. One common area of a more predictable spurt occurs when a pattern has broken into a move to a target—for instance, on the drive out of a consolidation pattern or following a strong break of support or resistance. These situations are not that common, but recognizing that a scenario like this is in play can lend support to otherwise uninteresting lower time frame patterns. Consider Figure 7.28, which shows several small consolidations on the daily chart of Finisar Corporation (NASDAQ: FNSR). These are perfectly acceptable consolidations (the ﬁrst is an Anti, and the second is a simple bear ﬂag), but the weekly chart provided strong tailwinds for these patterns and made them much more attractive than they might have been on their own. Another possible use of this concept is to monitor evolving price action on lower time frames while a trade is underway on the trading time frame. If consolidation pat- terns resolve in the intended direction of the trade, all is well. If the trade should fail, it will usually do so through a failure of one of these lower time frame patterns. Being able to read evolving price action and market structure on the lower time frame can of- ten provide excellent exits from trades, but it is necessary to balance this new layer of information against the possibility of being overly reactive to insigniﬁcant noise. FIGURE 7.28 The Weekly Flag Adds Power to Small Consolidations on the Daily Chart FNSR - Weekly l 45.00 .. ,._ , .. :·~·~-... ~ I :: !' j ~ 00 lij 11 i ,~ I ~ lij I j \\\\. :: P./ j,j~ a.oo ! II~ '\\ ,,_oo 1 / i I \"00 1 19.00 ~ W.OO t• ,;oo IL-,1r;--1 -~~~~Jun • May Apr 105 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 224 TRADING STRATEGIES Higher Time Frame Failure Tests Most traders who have studied multiple time frame interactions are comfortable with the idea that a market can be uptrending on one time frame, ranging on another, and downtrending on yet another, but there is another important consideration that few traders understand: the strongest trends often emerge in higher time frame consolidation areas. We know that price tends to respect support and resistance levels in trading ranges, oscillating back and forth between those levels. These levels are often rough and poorly delineated, and price action within the range tends to be more random and subject to sudden, large shocks. The irony is that what ap- pear to be large shocks on one time frame are often strong, tradable trends on the lower time frame. Since one of the cleanest trades in a range is the test beyond the conﬁnes of the range that immediately reverses, as in the classic Wyckoff spring or upthrust, we can trade reactions off those higher time frame ranges with some degree of conﬁdence. Figure 7.29 shows a continuous chart of Gold futures. After an extended uptrend, this market ran into resistance, made multiple marginal highs, and eventually rolled over into a trading range at the beginning of 2011. The sell-off found support at a previous swing low (visible on the weekly chart in the right pane), and the subsequent move off that low was a strong uptrend on the daily chart. In this case, resistance eventually failed and the market continued much higher, but this is not the point. The point is that the daily chart showed a clean, strong uptrend off the support level deﬁned by the weekly FIGURE 7.29 A Clean Daily Uptrend While the Weekly Chart Is in a Trading",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.706219"
}