{
  "id": "6cfa48f22b47",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 62,
  "content": "the odds are against him, and he wants the greatest chance of showing a profit, his best course is to wager the maximum amount on one outcome, and hope that in the short run he gets lucky. If he continues to make bets over a long period of time, the laws of probability will eventually catch up with him and the casino will end up with the bettor’s money. The ideal scenario from the casino’s point of view is for 38 players to place 38 bets of $1,000 each on all 38 numbers at the roulette table. Now the casino has a perfect spread position. One player will collect $36,000, but with $38,000 on the table the casino has a sure profit of $2,000. The option trader prefers to spread for the same reason that the casino prefers the bets to be spread around the table: spreading maintains profit potential but reduces short-term risk. There is no perfect spread position for the option trader, as there is for a casino. But the intelligent option trader learns to spread off his risk in as many different ways as possible in order to minimize the effects of short-term bad luck. New traders are sometimes astonished at the size of the trades an experienced trader is prepared to make. For example, an independent floor trader in Treasury Bond options at the Chicago Board of Trade who buys 100 calls at 2-00 ($2,000) each has taken a position worth $200,000. How can he afford to do this? His capital resources certainly play a role in the risk he is willing to accept. But equally important is his ability Introduction to Spreading 135 to spread off risk. An experienced trader may know a wide variety of ways to spread off the risk associated with the 100 calls he purchased, either using other options, futures contracts, cash bonds, or some combination of these instruments. He may not be able to completely eliminate his risk. But he may be able to reduce it to such an extent that his risk is actually less than that of a much smaller trader who does not know how to spread, or knows only a limited number of spreading strategies. a 8 & Volatility Spreads To take advantage of a theoretically mispriced option, it is necessary to hedge the purchase or sale of the option by simultaneously taking an opposing market position. In the examples in Chapter 5, the opposing market position was always taken in the underlying instrument. It is also possible to hedge an option position with other options which are theoretically equivalent to the underlying instrument. For example, suppose we feel a certain call with a delta of 50 is underpriced in the marketplace. If we buy 10 calls, giving us a total delta position of +500, we can hedge our position in any of the following ways: Sell five underlying contracts Buy puts with a total delta of -500 Sell calls, different than those which we purchased, with a total delta of +500 Combine several of these strategies, such that we create a total delta of -500 6, +, ~e BOCd 6, “~~ 0, “ With many different calls and puts available, as well as the underlying contract, there are many different ways of hedging our ten calls. Regardless of which method we choose, each spread will have certain features in common: “ Each spread will be approximately delta neutral. “+ Each spread will be sensitive to changes in the price of the underlying instrument. * Each spread will be sensitive to changes in implied volatility. Each spread will be sensitive to the passage of time. Spreads with the foregoing characteristics fall under the general heading of volatil- ity spreads. In this chapter we will define the basic types of volatility spreads and look at their characteristics, initially by examining the expiration values of the spread, and then by considering the delta, gamma, theta, vega, and rho associated with each spread. Before defining the primary types of spreads, it should be noted that spreading terminology is not uniform. Traders sometimes use different terms when referring to the same spread; they sometimes use the same term when referring to different spreads. An attempt has been made to use the most common terminology, but alternative spread definitions are also given where appropriate. 137 138 Chapter 8 BACKSPREAD (also referred to as a ratio backspread or long ratio spread) A backspread is a delta neutral spread which consists of more long (purchased) options than short (sold) options where all options expire at the same time. In order to achieve this, options with smaller deltas must be purchased and options with larger deltas must be sold. A call backspread consists of long calls at a higher exercise price and short calls at a lower exercise price. A put backspread consists of long puts at a lower exercise price and short puts at a higher exercise price. Typical backspreads and their values at expiration are shown in Figures 8-1 and 8-2. (These, and the example spreads in the following sections, are taken from the option evaluation table in Figure 8-20.) In each case, a move away from the long option’s exercise price will increase the value of the spread. Depending on the type of backspread, movement in one direction may be preferable to movement in the other direction. In a call backspread the upside profit potential is unlimited; in a put backspread the downside profit is unlimited. But the primary consideration is that some movement will occur. If no movement occurs, a backspread is likely to be a losing strategy. Typically, a backspread is done for a credit. That is, the amount of premium received for the sold options is greater than the premium paid for the purchased options. This ensures that the backspread will be profitable if the market makes a large move in either direction. If the market collapses in the case of a call backspread, or the market Figure",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.431784"
}