{
  "id": "2aafdce7f2d0",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 46,
  "content": "average out of your loss. At some point the market will reverse, but you may have been margin called and taken out of business long before that happens. Like most things in technical analysis, we see similar patterns on all time frames— intraday, daily, and all the way out to monthly and beyond, but the pattern varies in signiﬁcance depending on the time frame. A parabolic exhaustion on a 1-minute chart might mark a high that lasts for several hours, whereas the corresponding pattern on a daily chart could set a high that would hold for many years. It is also fairly common to see lower time frame moves that are counter to a higher time frame exhaust themselves in a small climax into ideal entry points on the higher time frame. For instance, if you are watching a potential complex pullback in an uptrend on the daily chart, watch intraday time frames carefully as the market comes near the measured move objective for the complex pullback (see Figure 5.13). If you see a selling climax and a parabolic exhaustion on the intraday time frame, entering long in the reversal is an excellent trade because it plays to both the intraday selling climax and the market structure of the higher time @W.C (D) • Daily Wheat Continuous Contract [Jull 1] Composite ., ., --_ _, -., .,., B ---., ., -. .,. ., ,. ... ., - ----~-,-/' ~•!tth .vL , , -• -itf{Ut Ir. , l,ir1fl1rrlfl J1l1JH-,, '96 Apr 1,600 1,568 1,536 1,504 1,472 1,440 1,408 65 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing 140 MARKET STRUCTURE FIGURE 5.13 Watch for Parabolic Expansion and Exhaustion into Ideal Higher Time Frame Entry Points frame. Though slightly more complex because it depends on the interaction of two time frames, this is actually one of the best and most reliable trend reversal setups: positioning with a higher time frame pattern against a parabolic exhaustion on a lower time frame. Position sizing and risk points may be different depending on whether you want to trade it as a stand-alone reversal on the shorter time frame or want to focus on the entry on the higher time frame pattern, but this is a powerful pattern that should be in every technical trader’s arsenal. Expectations Following Parabolic Exhaustion Once the entry in the parabolic expansion has been identiﬁed, it is important to start considering reasonable expecta- tions for the trade. There is, of course, the possibility that the exhaustion will be ab- sorbed and the market will continue in the direction of the original trend. In the case of large-scale exhaustions, this is very unlikely as they tend to cause structural shifts in the psychology of market participants, but there are also many smaller climaxes, especially on shorter time frames, that do often result in continuation after further consolidation. One classic example is a small climax that caps a trend, resulting in a two-legged com- plex consolidation. After this structure, the extreme condition created by the climax may be worked off, and it is quite likely the market can continue the original trend. Again, this is extremely unusual after larger climaxes as in Figure 5.12, but, even then, it is possible. More common is the sequence of a sharp countertrend move, consolidation, and then another sharp break in the direction of the countertrend move. This technically completes a two-legged complex consolidation, but the distinguishing factor is that the countertrend momentum is much sharper than in a standard pullback. The easy trade is usually playing for this second countertrend leg, but this is also the point where the market may extend into a new trend. The key will be judging the bounces that are in the direction of the original (preclimax) trend. If they are reluctant and are smaller, ide- ally both in price and in time, than the legs in the direction of the new trend, there is a good chance that a trend change has taken place. It is also not unusual to see a market spend an extended period of time consolidating before making another move. Last, another pattern to be aware of is the triangle consolidation that is set up by two back-to-back impulse moves in opposite directions. If a market makes a sharp move, followed by an almost equally sharp move in the opposite direction, there is a very high probability of an extended consolidation. One of the most common areas to ﬁnd this P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing Interfaces between Trends and Ranges 141 A B FIGURE 5.14 Two Sharp Moves in Opposite Directions Usually Lead to a Triangle formation is following these parabolic climaxes. If the ﬁrst, very strong countertrend move is immediately reversed by another movement in the direction of the original trend, there is a good chance of a protracted consolidation following. For most traders, these are not proﬁtable areas in which to tie up mental or ﬁnancial capital. Learn to read this pattern, pictured in Figure 5.14, as a warning sign, and simply avoid trading in these areas. Last Gasp There is a trading rule that says, only half in jest, that the market will always do whatever will hurt the greatest number of traders. Part of this is subjective—we all use humor to deal with losses at times—but there also is a reality here, driven by that core tendency of markets to seek volume and activity. After an extended run-up followed by a well- recognized topping formation (e.g., head and shoulders or double top), there will likely be many traders who short in anticipation of a trend reversal",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.702589"
}