{
  "id": "4d8927dfc2fc",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 53,
  "content": "out-of-themoney option have theoretical values of 2.00 and .50, respectively. If we raise our volatility assumption to 20%, the options might now have theoretical values of 3.00 and 1.00. The at-the-money option has shown the greater total point increase (1.00 vs. .50), while the out-of-the-money option has shown the greater percent increase (50% vs. 100%). Since many option strategies involve buying and selling unequal numbers of options, the latter characteristic will be important when we look at trading strategies. (The reader can confirm this by looking again at Figure 4-11.) Note also in Figure 6-20 that the vega of all options declines as expiration approaches. Therefore, a long-term option will always be more sensitive to a change in volatility than a short-term option with otherwise identical contract specifications. A four-month option will have a greater vega, and therefore be more sensitive to a change in volatility, than a one-month option. This last point illustrates an important principle of option evaluation, that time and volatility are closely interconnected. More time to expiration means more time for volatility to take effect, while less time to expiration may mean that any change in volatility will have only a minor effect on an option’s value. Moreover, changes in the amount of time remaining to expiration and changes in volatility often have similar effects on an option’s value. Decreasing volatility is similar to decreasing time to expiration. Ifa trader cannot remember what effect the passage of time will have on his 116 Chapter 6 Figure 6-20: Call or Put Vega vs. Time to Expiration 0.30 Underlying Price = 100 0.257 Volatility = 20% 100...\" 0.20+ 0.157 Vega 0.107 0.054 0.00} ; 0 20 40 60 80 100 120 140 160 180 200 Time to Expiration (days) position, he might consider instead what effect a reduction in volatility will have. This can be seen by comparing Figures 6-15 and 6-18 (theoretical values with respect to changes in time and volatility), Figures 6-11 and 6-13 (delta values with respect to changes in time and volatility), and Figures 6-9 and 6-10 (gamma values with respect to changes in time and volatility). In each case the similar shapes of the graphs indicate similar effects of time and volatility. Finally, we can see in Figure 6-21 that the vega of an atthe-money option is relatively constant, regardless of changes in volatility. This makes it easy to estimate the theoretical value of an at-the-money option under a wide variety of volatility scenarios. THE RHO The sensitivity of an option’s theoretical value to a change in interest rates is given by its rho (P). Unlike the other sensitivities, one cannot generalize about the rho since its characteristics depend on the type of underlying instrument and the settlement proce- dure for the options. The general effects have already been summarized in Figure 6-2. Note that foreign currency options which require the delivery of the currency, rather than the delivery of a futures contract, are affected by both domestic and foreign interest rates. Hence, such options have two interest rate sensitivities, rho, (the domestic interest rate sensitivity) and rho, (the foreign interest rate sensitivity]. The latter is sometimes denoted with the Greek letter phi (®). Option Values and Changing Market Conditions 117 Figure 6-21: Call or Put Vega vs. Volatility 0.18 100 Underlying Price = 100 ae ~ 0.124 Time = 60 days 7 0.107 Vega 0.08- 0.06 0.044 0.025 0.00 T we T T T T T T 0 5 10 15 20 25 30 35 40 Volatility (%) If both the underlying contract and options are subject to futures-type settlement, the rho must be zero, since no cash flow results from either a trade in the underlying contract or a trade in the options. When options on futures are subject to stock-type settlement, the rho associated with both calls and puts is negative. An increase in interest rates will decrease the value of such options since it raises the cost of carrying the options. In the case of stock options, calls will have positive rhos (an increase in interest rates will make calls a more desirable alternative to buying the stock) and puts will have negative rhos (an increase in interest rates will make puts a less desirable alternative to selling the stock). Although changes in interest rates can affect an option’s theoretical value, the interest rate is usually the least important of the inputs into a pricing model. For this reason the rho usually takes a back seat to the other, more critical, sensitivities: the delta, gamma, theta, and vega. Indeed, few traders pay much attention to the rho. However, for completeness, some of the characteristics of the rho are shown in Figures 6-22 (stock options) and 6-23 (futures options). In all cases the options which have the highest rho are those which are deeply in-the-money, because they require the greatest cash outlay. And the greater the amount of time to expiration, the greater the rho. Note also that because an option is a substitute for a position in the underlying instrument, the rho for stock options is much greater in magnitude than the rho for futures options. The purchase or sale of stock results in a much greater cash flow than the purchase or sale of a futures contract. (The vertical scale in Figure 6-23 is approximately ten times greater 118 Chapter 6 Figure 6-22: Futures Option Rho vs. Underlying Price -0.017 a put (60 days) _..-\" ; ae -0.02- -0.03~ we -0.04+ ra Rho ‘0.05, Put (50 days)” -0.065 ra Exercise Price = 100 ; Volatility = 20% 0.077 Interest Rate = 8.00% -0.084\" cael oad call (60 days) *s. call (150 days) —— 90 -0.09 T TT T T 80 85 95 100 105 Underlying Price 110 115 120 than the vertical scale in Figure 6-22.) Because of its relatively minor importance, we will generally disregard the rho in analyzing option strategies and managing risk. SUMMARY It is important for the active option trader to become familiar with",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.430530"
}