{
  "id": "deadbb95f676",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 82,
  "content": "classic Wyckoff spring. It is not always necessary to trade these patterns; much of the beneﬁt comes from the AMZN • Daily Arna zoo.com Inc Jul C Continuous Contract @KC- Daily Coffee • ~ A \"'-\" ~;,--- ·-. ~- J:2s· • v~----___ . .--- ·----- ~ \"\" Nov 0 ' \\_J ' ,.- -- 4.00 Dec ~ '11 Feb 123 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 304 TRADING STRATEGIES information they add to the market structure. In this case, the presence of the spring pointed to accumulation in the range and suggested that the breakout might have some real strength behind it. B: The actual breakout happened over several sessions and showed no signs of ex- haustion or failure. At the end of this chart, the market was consolidating in a tight pullback. Entry This is another type of very small pullback, and the same entry techniques that work for nested pullbacks will serve here. Look at the last bar on this chart and ask yourself: is there a potential entry on strength on the next bar? Stop Some traders may prefer to use a very tight stop on a pattern like this, and it cer- tainly is possible. My choice to use a slightly deeper stop is primarily a risk management choice that respects the tendency for volatility expansion following a contraction like this. There is also no rule that says you must hold a position to the stop level; in many cases, it makes sense to exit the trade once the pattern is decisively violated. FIGURE 10.10 Two Strong Trend Legs Follow the Nested Pullback Coffee broke out of the small nested pullback, and accelerated into an even stronger trend leg, as evidenced by the thrust above the upper Keltner channel in Figure 10.10. C: This is an example of how a technical pattern may be used to manage an existing position, even if it is not strong enough to justify a stand-alone entry. It would P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trend Continuation 305 have been difﬁcult to initiate a trade on the small pullback at C, but traders holding existing longs could see that the pattern was unfolding according to expectations. D: This is a classic example of a minor buying climax. Note the parabolic acceler- ation, the free bar, and the immediate sharp reversal. This is precisely the kind of pullback you do not want to buy, so existing longs should have exited their positions somewhere in this move. You will never sell the high tick of the move (D), but you will be able to limit losses on the reversals. This area also brings up the limitations of an indicator; the MACD did not show a momentum divergence, but the price structure was clearly climactic. E: The downthrust at D was strong enough to set up a potential short (an Anti trade) in the pullback at E. At the very least, being caught long on a breakdown of this pattern is unacceptable. Conclusions There are many things going on in this example. Most important is the idea of using a small consolidation as an entry trigger into a bigger pattern. The succes- sive price action at C, D, and E is also a good lesson in using these patterns to manage existing positions. Complex Pullback FIGURE 10.11 A Complex Pullback in the EURUSD • Contract • Coffee C Continuous @KC- Daily 240.00 230.00 220.00 Dec '11 Feb f.lar Nov '11 124 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 306 TRADING STRATEGIES Setup A: After a month-long drive coming off a failure test of the lows in early January 2011 (see Figure 10.11), the EURUSD showed some signs of exhaustion near the upper band and rolled over into a pullback. B: It would have been a reasonable play to attempt to establish a long position fol- lowing this pullback, but most long traders would have had a losing or, at best, breakeven trade following B. Entry After such a losing trade, many traders are tempted to move on and to remove the market from consideration. This is a mistake. A much better plan is to continue to monitor developing market structure, understanding that a complex pullback is likely. There are several possible entry techniques, ranging from buying tests of the pattern based on trend lines (not relevant in this example) to again paying small breakouts near the bottom of the pattern. Stop It is reasonable to establish tighter stops on these complex consolidations than on simple pullbacks. Moves out of these patterns should be both cleaner and stronger than corresponding moves out of simple pullbacks; a failure out of a complex consolida- tion is much more likely to lead to a sharp reversal and complete failure of the pattern, so further stops tend to result in larger losses with no compensating factors of probability or reward/risk. FIGURE 10.12 A Complex Consolidation Leads to Signiﬁcant Upside P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trend Continuation 307 If you executed the trade with this stop, there are several choices for targets. I set my ﬁrst target at one times my risk in almost all cases, the only exceptions being when that",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.708267"
}