{
  "id": "ec3d18d37d77",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 31,
  "content": "from now. That means there are certain aspects of markets and the right and wrong things to do 90 in trading that are timeless. That is why a book like Reminiscences of a Stock Operator, which I read 65 years after it was written, still resonated with me. Many of the trading-related passages in the book still seemed entirely fresh and pertinent, even though it was written in a different financial era. When writing Market Wizards, I had an objective of writing a book on trading that, like Reminiscences, would capture basic truths about trading that would remain relevant 50 or 75 years later. That is not to say I had an expectation of achieving this, but it was my goal. When I think of my career, the book that stands out as timeless is Dale Carnegie’s How to Win Friends and Influence People , published around 1936. It is just as relevant today as it was then because the core of who people are has not changed. Now, there are many new ways to communicate with people, but the fundamental idea that if you want to be interesting, then be interested in somebody has not changed. The elements that make someone successful at trading or anything else—having the right mindset and ethos, not being emotional—don’t change because intrinsic human characteristics don’t change. I think Market Wizards is more a book about human psychology than a trading book. I have said the same thing myself. What three quotes stand out to you in all the books you have written and among all the people you interviewed? And I’ll tell you there is one quote from your books that I probably think of at least once a week. I’m curious, what is the quote? I don’t want to give it away now because I want to hear your response first. At the top of the list, I would place Bruce Kovner’s quote: “Know where you will get out before you get in.” If I were restricted to one sentence in offering advice on trading, that would be it. This quote is so important because it captures 90% of risk management in a simple prescription. By establishing the exit point on a trade before you place the trade, and adhering to it by, say, using a stop-loss order, you limit the loss to a predefined level (barring a price gap beyond your stop level). The advice is also wise because you determine where you will get out when you still have complete objectivity— before entering the trade. Once you are in a trade, you lose that objectivity. 91 A provocative quote that rings in my mind is Ed Seykota’s observation: “Everybody gets what they want out of the market.” Initially, I found this statement hard to accept. Surely, many people who lose in the markets don’t want to lose. Then I had an experience that gave me insight into the truth in Ed’s assertion. I relate the entire story in the first chapter of The New Market Wizards, and I won’t go through it all here. But here is a brief description. I was extremely busy with my job as Director of Futures Research and writing a book. I didn’t want to trade because I knew it would create even greater time stress. One day, I saw a trade that I felt strongly about. At first, I resisted the temptation to start trading again, but then I placed the order. Sure enough, the trade worked. Subsequent trades were net profitable. At one point, my net profits were sufficient to pay for a car that I was in the market for. I considered cashing in my account and using the proceeds to pay for the car but then thought, “How could I give up the opportunity to grow my account substantially more?” Soon after, I made a series of extremely stupid mistakes that violated my trading rules. My profits evaporated, and as my account neared breakeven, I stopped trading. Several months later, Ed Seykota and I were both speakers at a conference in San Francisco. That evening, I related the whole story to Ed. He asked why I didn’t stop trading and buy the car with the profits if I was under such time pressure. I explained my rationale. Ed replied, “In other words, the only way you could stop trading was by losing. Is that right?” There it was. I had wanted not to be trading, and that is what I got. Another time Seykota’s quote resonated with me had nothing to do with trading. It concerns your sister Samantha. In her freshman year in college, she was good enough to earn the spot as the starting goalie on the ice hockey team. But she disliked the pressure of being a goalie. She also wasn’t happy about the enormous time commitment required to be on a college sports team. In her sophomore year, she didn’t do as well and ended up giving up college hockey at the end of that season. Ostensibly, she seemed to be trying as hard, but the results were not the same. I remember sitting in the stands at one of her games that year and thinking of Seykota’s line: “Everybody gets what they want.” At a deeper level, she didn’t want to play anymore, and that is what she got. 92 So, Seykota’s quote applies more broadly in life; it’s not just about trading. Often, people experience a disappointing result, but there may be hidden reasons that are more compelling and drove that outcome. That’s two. What about a third quote? I like Jim Rogers’s quote: “I just wait until there is money lying in the corner, and all I have to do is go over there and pick it up. I do nothing in the meantime.” It is such a colorful way of describing the quality of patience to wait for the right trade—a critical trait in success ful trading. What is the quote you think",
  "word_count": 1000,
  "topics": [
    "psychology",
    "risk_management",
    "fundamentals",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T00:37:44.182853"
}