{
  "id": "9c14d08533f9",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 30,
  "content": "interviews, which is 90% of the work, I am cognizant of three goals: staying true to the traders’ comments, relaying trading insights, and creating a chapter that is a good read. I believe the last of these goals helps me overcome the limitations of the interview format. You wrote the first Market Wizards book pre-internet. How did you find the people to include in the book? I knew some of the traders in the first book personally. I already mentioned how I met Michael Marcus. Michael, when he was managing money for Commodities Corp, hired Bruce Kovner, and through Michael, I met Bruce. Michael was also the source for Ed Seykota. Michael kept a very low profile and was reluctant to do the interview. A mutual acquaintance helped convince Michael to agree to participate. I flew out to his home in Malibu, and we spent the entire day in a wide-ranging conversation, initially sitting in his living room, then walking on the beach, and continuing through a 88 dinner cooked by his personal chef. After dinner, Michael pushed back his chair and said, “This has been a cathartic experience. I’m glad I agreed to do it. You should interview Ed Seykota.” “Who is Ed Seykota?” I asked. “Ed is the best trader I know,” Michael answered. If you are doing a book on great traders, and someone who turned a $30,000 account into $80 million tells you about the best trader he knows, you’re obviously interested. Michael got Ed on the phone and told him about what I was doing. I spoke to Ed, and he agreed to do the interview. I canceled my scheduled flight back to New York and flew to Lake Tahoe instead to interview Ed Seykota. Other traders in the book were well-known. For example, Richard Dennis was already a legend, having turned a starting stake of less than $1,000 into $200 million. Jim Rogers had co-founded the Quantum Fund with George Soros, a firm he had left to manage his own money. Although still early in his career, Paul Tudor Jones had established a reputation as a star futures trader. Larry Hite had founded Mint Investment, one of the largest futures funds at the time. Michael Steinhardt had a 20-year-plus record as one of the best-performing hedge funds. Marty Schwartz was a solitary trader who would normally have been entirely unknown, but he kept entering these public trading contests and consistently scoring incredible returns. Then, there were traders I found by making inquiries. For example, I kept hearing the firm BLH mentioned as one of the major buyers or sellers in the bond futures market. When I asked industry sources who BLH was, I discovered it was a single trader in Peoria. That certainly got my interest. When did you realize the traders you were interviewing had different methodologies? I realized that every trader was different in the first Market Wizards book, and that observation remained true in every subsequent book. To quote myself, “There are a million ways to make money in the markets. The irony is that they are all very difficult to find.” How does a trader decide which methodology is best for them? 89 That is essentially a matter of self-discovery to determine which approach resonates and feels most comfortable. And it will be different for everyone. The right approach has to be something that fits your personality. A good example is Jason Shapiro in Unknown Market Wizards. Jason enjoys arguing unpopular opinions. By his description, if he goes to a party where most of the guests are liberal, he will argue the conservative side, and if most of the guests are conservative, he will argue the liberal side. So, what kind of trading approach does he end up adopting? He is a contrarian trader—a strategy that fits him like a glove. As another example, Ed Thorp, a brilliant mathematician, used his mathematical skills to uncover and exploit various market inefficiencies. Reflecting on all the traders you have interviewed, how much of trading success do you think is due to being right on trade selection versus having the proper risk management? I definitely come down on the side that risk management is more important than anything else. Most people, especially novice traders, think that trading success is all about trade entry and that risk management is an add-on, if they even consider it all. Successful traders, however, understand that risk management is the key because to win, you have to be able to stay in the game. And if you don’t have effective risk management, no matter how skilled you are at picking trades, sooner or later, there will be a trade where you are dead wrong, and it can wipe out your account. At what point did you know that the first Market Wizards book would be successful? Early on. The W all Street Journal printed a favorable review right after the book came out, and the book immediately sold out. Unfortunately, the publisher took a couple of months to get the book back in stock, which was very frustrating. Why do you think the book continues to sell more than 30 years after you wrote it, despite all the changes that have taken place since then? Markets are driven by human emotions, which don’t change. They were the same 100 years ago, and they’ll be the same 100 years from now. That means there are certain aspects of markets and the right and wrong things to do 90 in trading that are timeless. That is why a book like Reminiscences of a Stock Operator, which I read 65 years after it was written, still resonated with me. Many of the trading-related passages in the book still seemed entirely fresh and pertinent, even though it was written in a different financial era. When writing Market Wizards, I had an objective of writing a book on trading that, like Reminiscences, would capture basic truths about trading that would remain relevant 50",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T00:37:44.182690"
}