{
  "id": "05d2cceba167",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 153,
  "content": "trader will also show a profit if the market falls in both ABC and XYZ, or if ABC and XYZ move up at the same rate. This is because the trader received more for the XYZ options which he sold than he paid for the ABC options which he bought. If Intermarket Spreading 337 Figure 16-1: Long 10 ABC 50 Calls/Short 20 XYZ 100 Calls ABC moves up twice as fast as XYZ ABC moves up 33% \\ a faster than XYZ n oO g _e a oS a - a ie a a ABC moves up at the same rate as XYZ ee ra 0 — T T T T T T T T T T TT 48 49 50 51 52 53 54 55 56 57 58 59 60 ABC Price the market falls and the entire position ends up worthless, or if ABC and XYZ move up at the same rate, the trader is left with a profit equal to the excess price of XYZ options. The only market conditions which would hurt this spread would be an upward move in both ABC and XYZ, with XYZ outperforming ABC. What action could the trader take if the implied volatilities were reversed, with ABC having an implied volatility of 24% and XYZ having an implied volatility of 20%? Now if ABC and XYZ both rise, the marketplace expects ABC to outperform XYZ. Since this is also what the trader believes, there does not seem to be any opportunity. But Suppose, instead of buying calls in ABC and selling calls in XYZ, the trader decides to take his long position in ABC by selling puts, and his short position in XYZ by purchasing puts. Assuming, again, that he uses at-the-money puts which he knows to have a delta of approximately -50, he might create a $delta neutral position by selling 10 ABC 50 puts and buying 20 XYZ 100 puts. If the market moves up, and ABC is stronger than XYZ, all the options will collapse to zero. He will be left with a profit equal to the excess credit when he sold ABC 50 puts at an implied volatility of 24% and bought XYZ 100 Puts at an implied volatility of 20%. And if the market moves down, based on his assumption that ABC will be stronger than XYZ, the trader expects XYZ to move down more quickly than ABC. Hence, the XYZ puts will appreciate more rapidly than the ABC puts, leaving the trader with an ever-increasing profit. The results of this strategy is Shown in Figure 16-2. Profit & Loss 338 Chapter 16 Figure 16-2: Short 10 ABC 50 Puts/Long 20 XYZ 100 Puts XYZ moves down — twice as fast as ABC XYZ moves down ~ 33% faster than ABC on . [oo ~ XYZ moves down at the same rate as ABC ae —— os 9 ~— 4 i T T 7 T T T T T T T 40 41 42 43 44 45 46 47 48 49 50 51 52 ABC Price In the foregoing examples we used at-the-money options which we knew to have a delta of 50. What about using either in-the-money or out-of-the-money options? Now the situation becomes more complex. If we use at-the-money options we are only required to determine that ABC and XYZ implied volatilities are mispriced with respect to each other. If, however, we start to vary the options’ exercise prices, we need to determine not only whether ABC and XYZ options are mispriced with respect to each other, but also whether the individual implied volatilities are too high or too low. Whenever options appear cheap because implied volatility is lower than a trader’s volatility forecast, the trader will try to buy out-of-the-money options (options with lower deltas). Whenever options appear expensive because implied volatility is higher than a trader’s volatility forecast, the trader will try to sell out-of-the-money options. For example, if ABC options not only appear too cheap with respect to XYZ options, but also appear too cheap compared to a trader’s volatility forecast for ABC, the trader will try to buy ABC options with smaller deltas and sell XYZ options with larger deltas. Assuming the trader wants to be long ABC and short XYZ, he might buy ABC 55 calls and sell XYZ 100 calls. Or he might buy ABC 50 calls and sell XYZ 95 calls. He is trying to create an intermarket call backspread, by purchasing options with smaller deltas, and selling options with larger deltas. In the same way, if ABC options appear too expensive with respect to XYZ, and also appear too expensive compared to a trader’s volatility forecast, he might take his long position in ABC by selling puts with lower deltas, and take his short position in XYZ options by purchasing puts with higher deltas. This will Profit & Loss Intermarket Spreading 339 create an intermarket put ratio vertical spread. Examples of an intermarket call packspread and an intermarket put ratio vertical spread are shown in Figures 16-3 and 16-4, Note that such spreads are sensitive not only to the volatility relationship between ABC and XYZ, but also to the general level of volatility. A backspread wants the market to become more volatile; a ratio vertical spread wants the market to become less volatile. INTERMARKET VOLATILITY SPREADS Suppose a trader has decided that ABC and XYZ ought to have very similar volatilities, put he finds that the implied volatility of ABC options, at 20%, is markedly different than the implied volatility of XYZ options, at 25%. If the trader also believes that one market will outperform the other, he might take a position by purchasing calls (puts) in one market and selling calls (puts} in the other market. But suppose the trader has no opinion on the relative strengths of the two markets. His only opinion is that options in one market are too cheap or expensive in relation to options in the other market. He simply",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.445909"
}