{
  "id": "9713bb1dd11a",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 30,
  "content": "derived quite simply, but not as Chan800064_c06.indd 131 6/7/2021 2:06:04 PM 132 QUANTITATIVE TRADING simply as the Kelly formula, so I leave its derivation for the reader to look up in the Thorp article referenced earlier. To find the optimal f, which maximizes g, simply take its first derivative with respect to f and set the derivative to zero: dg df ms f/ 2 0 Solving this equation for f gives us f = m/s2, the Kelly formula for one strategy or security under the Gaussian assumption. REFERENCES Chan, Ernest. 2006a. “A ‘Highly Improbable’ Event? A Historical Analysis of the Natural Gas Spread Trade That Bought Down Amaranth.” Quantitative Trading blog, October 2, http://epchan.blogspot.com/2006/10/highly-improba- ble-event.html. Kahneman, Daniel. 2011. Thinking, Fast and Slow. Farrar, Straus and Giroux. Khandani, Amir E., and Andrew Lo. 2007. “What Happened to the Quants in August 2007?” MIT. https://web.mit.edu/Alo/www/Papers/august07.pdf. Lowenstein, Roger. 2000. When Genius Failed: The Rise and Fall of Long-Term Capital Management. Random House. Peters, O., and M. Gell-Mann. 2016. “Evaluating Gambles Using Dyanmics.” Chaos 26, 023103. https://doi.org/10.1063/1.4940236. Poundstone, William. 2005. Fortune’s Formula. New York: Hill and Wang. Ritter, Jay. 2003. “Behavioral Finance.” Pacific-Basin Finance Journal 11(4, September): 429–437. Taleb, Nassim. 2007. The Black Swan: The Impact of the Highly Improbable. Random House. Thaler, Richard. 1994. The Winner’s Curse. Princeton, NJ: Princeton University Press. Thorp, Edward. 1997. “The Kelly Criterion in Blackjack, Sports Betting, and the Stock Market.” Handbook of Asset and Liability Management, Volume I, Zenios and Ziemba (eds.). Elsevier 2006. www.EdwardOThorp.com. Chan800064_c06.indd 132 6/7/2021 2:06:04 PM ( ) = + - 62 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 132 QUANTITATIVE TRADING simply as the Kelly formula, so I leave its derivation for the reader to look up in the Thorp article referenced earlier. To find the optimal f, which maximizes g, simply take its first derivative with respect to f and set the derivative to zero: dg df ms f/ 2 0 Solving this equation for f gives us f = m/s2, the Kelly formula for one strategy or security under the Gaussian assumption. REFERENCES Chan, Ernest. 2006a. “A ‘Highly Improbable’ Event? A Historical Analysis of the Natural Gas Spread Trade That Bought Down Amaranth.” Quantitative Trading blog, October 2, http://epchan.blogspot.com/2006/10/highly-improba- ble-event.html. Kahneman, Daniel. 2011. Thinking, Fast and Slow. Farrar, Straus and Giroux. Khandani, Amir E., and Andrew Lo. 2007. “What Happened to the Quants in August 2007?” MIT. https://web.mit.edu/Alo/www/Papers/august07.pdf. Lowenstein, Roger. 2000. When Genius Failed: The Rise and Fall of Long-Term Capital Management. Random House. Peters, O., and M. Gell-Mann. 2016. “Evaluating Gambles Using Dyanmics.” Chaos 26, 023103. https://doi.org/10.1063/1.4940236. Poundstone, William. 2005. Fortune’s Formula. New York: Hill and Wang. Ritter, Jay. 2003. “Behavioral Finance.” Pacific-Basin Finance Journal 11(4, September): 429–437. Taleb, Nassim. 2007. The Black Swan: The Impact of the Highly Improbable. Random House. Thaler, Richard. 1994. The Winner’s Curse. Princeton, NJ: Princeton University Press. Thorp, Edward. 1997. “The Kelly Criterion in Blackjack, Sports Betting, and the Stock Market.” Handbook of Asset and Liability Management, Volume I, Zenios and Ziemba (eds.). Elsevier 2006. www.EdwardOThorp.com. Chan800064_c06.indd 132 6/7/2021 2:06:04 PM 63 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 133 CHAPTER 7 T he first six chapters of this book covered most of the basic knowledge needed to research, develop, and execute your own quantitative strategy. This chapter explains important themes in quantitative trading in more detail. These themes form the bases of statistical arbitrage trading, and most quantitative trad- ers are conversant in some if not most of these topics. They are also very helpful in informing our intuition about trading. I will describe the two basic categories of trading strategies: mean-reverting versus momentum strategies. Periods of mean- reverting and trending behaviors are examples of what some traders call regimes, and the different regimes require different strategies, or at least different parameters of the same strategy. Mean-reverting strategies derive their mathematical justification from the concepts of stationarity and cointegration of time series, which I will cover next. Following that, I will discuss a novel application of machine learning to adapt the parameters of a trading strategy to different regimes that we call Conditional Parameter Optimization (CPO). Then I will describe a theory that many hedge funds use to manage large portfolios and one that has caused much turmoil in their per- formances: namely, factor models. Other categories of strategies that traders frequently discuss are seasonal trading and high-frequency Special Topics in Quantitative Trading Chan800064_c07.indd 133 6/7/2021 7:16:52 AM 64 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 137 unpredictable time horizons. How could you know how big an order an institution needs to execute incrementally? How do you predict when the “herd” is large enough to form a stampede? Where is the infamous tipping point? If we do not have a reliable way to esti- mate these time horizons, we cannot execute a momentum trade profitably based on these phenomena. In a later section on regime switch, I will examine some attempts to predict these tipping or “turning” points. There are other causes of momentum that are more predictable: the persistence of roll returns in futures markets, and forced sale and purchases of securities due to risk",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:43.608531"
}