{
  "id": "dc4f0e7c76d9",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 16,
  "content": "the signs they left in the market, he could align his po- sitions with their activity and interests; in the end, it is the buying and selling pressure of these large pools of money that actually moves the markets. This method is as powerful and as relevant today as it was a hundred years ago. Wyckoff proposed a four-stage market cycle. His idea was that the cycle resulted from the actions of these large players who planned their operations in the market to take advantage of the uneducated public’s inappropriate reactions to price movement, but we also see evidence of this cycle in the price patterns of assets such as medieval commodity prices; stocks in early, unsophisticated markets; or trading on very short time frames. It is unlikely that there is the same intervention and manipulation in all of these cases, so the Wyckoff cycle may simply be an expression of the normal ways in which human psychology expresses itself in the marketplace. 31 P1: OTA JWBT634-c02 JWBT634-Grimes May 10, 2012 7:22 Printer: Hamilton Printing 32 THE FOUNDATION OF TECHNICAL ANALYSIS WYCKOFF’S MARKET CYCLE In this brief introduction, we will consider three aspects of each phase of the cycle. First, we will try to understand the market using a simpliﬁed model focusing on the psycho- logical perspective of two major groups: the smart money players who are assumed to be driving the market, and the general, uninformed public. Second, we will consider the crowd psychology of the public, and how individuals are naturally inclined to make mis- takes that work in favor of the smart money. Last, we will begin to consider the dis- tinctions and patterns of each part of the cycle from a pure price-pattern perspective; this analysis is important because it motivates and provides context for many trading patterns and methods. Figure 2.1 presents this cycle in a simple, idealized format. The four phases are: 1. Accumulation: A sideways range in which large players buy carefully and skillfully, without moving the price. The public is unaware of what is going on; the market is off the radar and out of the public focus while under accumulation. 2. Markup: The classic uptrend. At this point, the public becomes aware of the price movement, and their buying serves to propel prices higher. Smart money players who bought in the accumulation phase may sell some of their holdings into the strength of the uptrend, or they may just hold and wait for higher prices. 3. Distribution: Eventually, the uptrend ends and the market enters a distribution phase in which the smart money players sell the remainder of their holdings to the public who are still generally anticipating higher prices. Really smart money players might even sell more than they own and go short in this range. 4. Markdown: The downtrend that follows distribution. Smart money players who are short will buy back some of their shorts into this weakness. Eventually, the public re- alizes that higher prices are not in their future, so they panic and sell their positions. This panic, more often than not, marks the end of the downtrend. Accumulation Distribution MarkdownMarkup FIGURE 2.1 The Classic Wyckoﬀ Cycle 14 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c02 JWBT634-Grimes May 10, 2012 7:22 Printer: Hamilton Printing The Market Cycle and the Four Trades 35 FIGURE 2.2 Accumulation in Daily Platinum Futures with a Classic Spring at A also worth considering that what I am presenting here is an idealized and simpliﬁed per- spective on a market in accumulation. In actual practice, these patterns are often much more complex and obscured by noise. From a longer-term perspective, crowd psychology is simple and easy to understand while a market is in accumulation. If the smart money operators are accumulating well and doing their job right, the public simply does not care about the market. The distin- guishing psychological feature of a market in accumulation is that it is off the public’s radar; no one is thinking about it or talking about it. No journalist writes an article about a market in sideways consolidation, and no one talks about such markets on television. They are invisible and boring; only smart, professional traders know to watch for these formations. At some point, unobserved and unnoticed, the accumulation breaks to the upside and the stock moves into the next phase of the cycle. Markup: The Classic Uptrend The second part of the cycle is the uptrend ( markup), and the action of the smart money is not as clearly deﬁned here. Perhaps the institutions may simply hold their full line un- til the stock is marked up to prices at which they consider it advantageous to sell, or PLV10-0 aily Platinum Oct 2010 1,750.00 1,700.00 Jun Jul Aug Sep 15 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing PART II Market Structure 16 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing CHAPTER 3 On Trends Don’t ﬁght forces, use them. —R. Buckminster",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "psychology"
  ],
  "created_at": "2026-02-05T00:37:53.697568"
}