{
  "id": "0816f0d01fb2",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 18,
  "content": "there are some common ways to improve it. How to refine a strategy without introducing data-snooping bias and to remain simple with few parameters is more of an art than a science. The guiding principle is the same as that of parameter optimization: Whatever changes you make to the strategy to improve its perfor - mance on the training set, it must also improve the performance on the test set. Often, there are some very simple strategies that are fairly well known in traders’ circles and are still somewhat profitable, though their returns seem to be diminishing. An example is the pair trad- ing of stocks. The reason they are diminishing in returns is that too many traders are taking advantage of this arbitrage opportunity and gradually erasing the profit margin. However, it is often possible to introduce minor variations in the basic strategy, which will boost its returns. These minor variations are often far less well known than the basic strategy, and therefore far less well exploited by traders. Some- times they involve excluding certain stocks or groups of stocks from the universe. For example, traders often prefer to exclude pharma- ceutical stocks from their technical trading program because of the dramatic impact of news on their prices, or else they may exclude stocks that have pending merger or acquisition deals. Other trad- ers change the entry and exit timing or frequency of the trades. Yet another variation concerns the selection of the stock universe: We saw in Example 3.7 that a strategy that has a very good Sharpe ratio when it is applied to small-cap stocks becomes very unprofitable when applied to large-cap stocks. pnl <- pnl - rowSums(abs(weights-backshift(1, weights))*onewaytcost, na.rm = TRUE) sharpeRatioTestset <- sqrt(252)*mean(pnl[testset], na.rm = TRUE)/sd(pnl[testset], na.rm = TRUE) sharpeRatioTestset # -3.378513 Chan800064_c03.indd 77 6/7/2021 2:04:51 PM 78 QUANTITATIVE TRADING When introducing these refinements to your strategy, it is prefer- able that the refinement has some basis in fundamental economics or a well-studied market phenomenon, rather than some arbitrary rule based on trial and error. Otherwise, data-snooping bias looms. SUMMARY Backtesting is about conducting a realistic historical simulation of the performance of a strategy. The hope is that the future perfor - mance of the strategy will resemble its past performance, though as your investment manager will never tire of telling you, this is by no means guaranteed! There are many nuts and bolts involved in creating a realistic historical backtest and in reducing the divergence of the future per- formance of the strategy from its backtest performance. Issues dis- cussed here include: • Data: Split/dividend adjustments, noise in daily high/low, and survivorship bias. • Performance measurement: Annualized Sharpe ratio and maximum drawdown. Example 3.8: A Small Variation on an Existing Strategy Let’s refine the mean-reverting strategy described in Example 3.7. Recall that strategy has a mediocre Sharpe ratio of 0.25 and a very unprofitable Sharpe ratio of –3.19 after transaction costs in 2006. The only change we will make here is to update the positions at the market open instead of the close. In the MATLAB code, simply replace “cl” with “op” everywhere. You can download the R code as example3_8.R and Python code as exam- ple3_8.ipynb. Lo and behold, the Sharpe ratio before-and-after costs are both very positive! I will leave it as an exercise for the reader to improve the Sharpe ratio further by testing the strategy on the S&P 400 mid-cap and S&P 600 small-cap universes. Chan800064_c03.indd 78 6/7/2021 2:04:51 PM 38 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Backtesting 79 • Look-ahead bias: Using unobtainable future information for past trading decisions. • Data-snooping bias: Using too many parameters to fit histori- cal data, tweaking a strategy too many times in backtest, and avoiding it using a large enough sample, out-of-sample testing, and sensitivity analysis. • Transaction cost: Impact of transaction costs on performance. • Strategy refinement: Common ways to make small variations on the strategy to optimize performance. After going through this chapter and working through some of the examples and exercises, you should have gained some hands-on experience in how to retrieve historical data and backtest a strategy with Excel, MATLAB, Python, or R. When one starts testing a strategy, it may not be possible to avoid all these pitfalls due to constraints of time and other resources. In this case, it is okay to skip a few precautions to achieve a quick sense of whether the strategy has potential and is worthy of closer exam- ination. Sometimes, even the most thorough and careful backtest cannot reveal problems that would be obvious after a few months of paper or real trading. One can always revisit each of these issues after the model has gone live. Once you have backtested a strategy with reasonable perfor - mance, you are now ready to take the next step in setting up your trading business. REFERENCES Bailey, David, and Marcos López de Prado. 2012. “The Sharpe Ratio Effi- cient Frontier.” Journal of Risk 15 (2 Winter 2012/13). https://papers.ssrn. com/sol3/papers.cfm?abstract_id=1821643. Bailey, David, J. Borwein, Marcos López de Prado, and J. Zhu. 2014. “Pseudo-Mathematics and Financial Charlatanism: The Effects of Backtest Overfitting on Out-of-Sample Performance.” Notices of the Chan800064_c03.indd 79 6/7/2021 2:04:51 PM 39 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 80 QUANTITATIVE TRADING American Mathematical Society 61 (5 May): 458–471. https://ssrn.com/ abstract=2308659. Chan, Ernest. 2006. “Reader Suggests a Possible Trading Strategy with the GLD–GDX Spread.” Quantitative Trading, November 17. http://epchan.",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:43.606533"
}