{
  "id": "a660980ba396",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 63,
  "content": "if the rubber band is stretched and could be ready to snap back. Traders who fade markets that are in relative equilibrium will accumulate a steady stream of losses. A good rule of thumb is to not consider any fade trade unless the market is extended beyond the bands on whichever time frame you are trading. Remember, risk management is essential in this kind of trade, as the band does not present any kind of actual barrier. There is always the psychological tendency to attach too much meaning to any line on a chart; this is why traders focus on moving averages, bands, or even whole P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 199 numbers (e.g., where grid lines fall on charts). The market can do anything, however, and there are no lines on charts that provide any ﬁrm barriers to price. Blindly fading bands with no risk management plan could easily result in staggering losses. Enter on a Pullback from the Bands A market overextended outside the band will, eventually, reverse back inside the bands. At this point, it is often possible to initiate a trade in the direction of the original band touch. Buying somewhere near the middle of the bands after the market touches the upper bands or shorting after it touches the bottom is often a good trade. This trade could potentially be executed mechanically, but many traders will ﬁnd best results using this condition to identify markets primed to move and then executing those trades with discretion. For a discretionary trader, this is a useful illustration of quantifying a fundamental principle of price behavior through the structure of an indicator. Figure 7.8 shows examples of both fading moves to the band (marked A) and entering pullbacks on the moving average after the band has been touched (B). (In this case, the entry condition for pullbacks required a close outside the band, rather than a simple touch.) FIGURE 7.8 Fading Closes Outside the Keltner Channel (Marked A) or Entering at the Moving Average (Marked B) Both of these are reliable trades that capitalize on basic elements of price behavior. T - Daily AT&T Inc A / ~ . . ~- ,! I Jt 11 1,··' -,-~, 111 (: ~r- ljtfi';)~t,., I \\ __ ,jl~l1J1-,1ll11l- ·- ij,:' If I I iii 28.00 } ~)j A 27.00 26.00 Oct '11 Apr 91 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 200 TRADING STRATEGIES Slide Outside the Bands Markets normally move in alternating patterns of impulse and consolidation; the opposing trades of fading at the band and reentering in the middle of the bands capture this principle well. This is the pattern when the market machinery is operating normally. Strong buying (demand) eventually raises prices to a level where supply is adequate to overcome that buying pressure and the market drifts down. Af- ter a period of rest, buyers reassert themselves and push the market into another leg. However, this cycle can and does short-circuit, and it is also important to be aware of the patterns that occur in the distortions: normal strength results in a buyable pullback, or normal weakness results in a shortable pullback, but extreme strength or weakness usually indicates exhaustion. This is something to be aware of because amateurs often see the strongest moves and want to enter into the next pullbacks. Professionals realize that a very strong move often means the party is over and it is time to take proﬁts and stand aside. One pattern that indicates an exceptionally weak or strong market is shown in Figure 7.9. When a market presses into the upper or lower band and stays there, this is indicative of a one-sided market with extreme pressure. The absence of any real FIGURE 7.9 A Market Pressing into One of the Channels Is Indicative of a very Strong Imbalance This is also usually a diﬃcult trading environment. LO _ Daily Lolila rd Inc (New) r 115.00 110.00 105.00 100.00 95.00 90.00 85.00 80.00 75.00 '11 Apr 92 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 201 pattern makes it very difﬁcult to trade this type of market. There are no pullbacks, and this structure is often a potential climax pattern on the higher time frame, so there is the ever-present possibility of a severe snapback. Many traders will be inclined to con- tinually fade such a move because it is very difﬁcult to ﬁnd with-trend entries, but this is usually the wrong plan. The best course of action is almost always to have no position unless you are managing risk and proﬁts in preexisting positions. Spike through Both Bands Well-trending markets tend to be controlled, with more or less proportional actions and reactions. Another way this standard pattern can break down is for a market to make an extremely sharp move through one side of the band that is immediately reversed and then spikes clear through the other band. (See Figure 7.10.) As a general rule of thumb, whenever a market makes a sharp move in one direc- tion immediately followed by an equally sharp move in the other direction, the normal expectation should be for that market to spend some time consolidating and oscillating in a series of",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.705240"
}