{
  "id": "a84422106223",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 41,
  "content": "entry signals • A stop price A fixed holding period is the default exit strategy for any trading strategy, whether it is a momentum model, a reversal model, or some kind of seasonal trading strategy, which can be either momentum or reversal based (more on this later). I said before that one of the ways momentum is generated is the slow diffusion of information. Chan800064_c07.indd 169 6/7/2021 7:16:58 AM Special Topics in Quantitative Trading 171 robust than can be obtained directly from a trading model. In Exam- ple 7.5, I demonstrate this method of estimating the half-life of mean reversion using our favorite spread between GLD and GDX. Example 7.5: Calculation of the Half-Life of a Mean-Reverting Time Series We can use the mean-reverting spread between GLD and GDX in Exam- ple 7.2 to illustrate the calculation of the half-life of its mean reversion. Using MATLAB The MATLAB code is available as example7_5.m. (The first part of the pro- gram is the same as example7_2.m.) % === Insert example7_2.m in the beginning here === prevz=backshift(1, z); % z at a previous time-step dz=z-prevz; dz(1)=[]; prevz(1)=[]; % assumes dz=theta*(z-mean(z))dt+w, % where w is error term results=ols(dz, prevz-mean(prevz));theta=results.beta; halflife=-log(2)/theta % halflife = % % 7.8390 The program finds that the half-life for mean reversion of the GLD-GDX is about 10 days, which is approximately how long you should expect to hold this spread before it becomes profitable. Using Python The Python code is available as example7_5.ipynb. (The first part of the program is the same as example7_2.ipynb.) Calculation of the Half-Life of a Mean-Reverting Time Series import numpy as np import pandas as pd import matplotlib.pyplot as plt from statsmodels.tsa.stattools import coint from statsmodels.api import OLS df1=pd.read_excel('GLD.xls') df2=pd.read_excel('GDX.xls') df=pd.merge(df1, df2, on='Date', suffixes=('_GLD', '_GDX')) Chan800064_c07.indd 171 6/7/2021 7:16:58 AM 89 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 172 QUANTITATIVE TRADING df.set_index('Date', inplace=True) df.sort_index(inplace=True) Run cointegration (Engle-Granger) test coint_t, pvalue, crit_value=coint(df['Adj Close_GLD'], df['Adj Close_GDX']) (coint_t, pvalue, crit_value) # abs(t-stat) > critical value at 95%. pvalue says probability of null hypo- thesis (of no cointegration) is only 1.8% (-3.6981160763300593, 0.018427835409537425, array([-3.92518794, -3.35208799, -3.05551324])) Determine hedge ratio model=OLS(df['Adj Close_GLD'], df['Adj Close_GDX']) results=model.fit() hedgeRatio=results.params hedgeRatio Adj Close_GDX 1.639523 dtype: float64 z = GLD - hedgeRatio*GDX z=df['Adj Close_GLD']-hedgeRatio[0]*df['Adj Close_GDX'] plt.plot(z) prevz=z.shift() dz=z-prevz dz=dz[1:,] prevz=prevz[1:,] model2=OLS(dz, prevz-np.mean(prevz)) results2=model2.fit() theta=results2.params theta x1 -0.088423 dtype: float64 halflife=-np.log(2)/theta halflife x1 7.839031 dtype: float64 Using R The R code is available as example7_5.R. (The first part of the program is the same as example7_2.R.) source(backshift.R') data1 <- read.delim(\"GLD.txt\") # Tab-delimited data_sort1 <- data1[order(as.Date(data1[,1], '%m/%d/%Y')),] # sort in ascending order of dates (1st column of data) tday1 <- as.integer(format(as.Date(data_sort1[,1], '%m/%d/%Y'), '%Y%m%d')) Chan800064_c07.indd 172 6/7/2021 7:16:58 AM 90 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 173 If you believe that your price series is mean reverting, then you also have a ready-made target price—the mean value of the histori- cal prices of the security, or μ in the Ornstein-Uhlenbeck formula. This target price can be used together with the half-life as exit sig- nals (exit when either criterion is met). Target prices can also be used in the case of momentum models if you have a fundamental valuation model of a company. But as fundamental valuation is at best an inexact science, target prices are not as easily justified in momentum models as in mean-reverting models. If it were that easy to profit using target prices based on fundamental valuation, all investors have to do is to check out stock analysts’ reports every day to make their investment decisions. Suppose you are running a trading model, and you entered into a position based on its signal. Sometime later, you run this model again. If you find that the sign of this latest signal is opposite to your original position (e.g., the latest signal is “buy” when you have an existing short position), then you have two choices. Either you adjcls1 <- data_sort1[,ncol(data_sort1)] data2 <- read.delim(\"GDX.txt\") # Tab-delimited data_sort2 <- data2[order(as.Date(data2[,1], '%m/%d/%Y')),] # sort in ascending order of dates (1st column of data) tday2 <- as.integer(format(as.Date(data_sort2[,1], '%m/%d/%Y'), '%Y%m%d')) adjcls2 <- data_sort2[,ncol(data_sort2)] # find the intersection of the two data sets tday <- intersect(tday1, tday2) adjcls1 <- adjcls1[tday1 %in% tday] adjcls2 <- adjcls2[tday2 %in% tday] # determines the hedge ratio on the trainset result <- lm(adjcls1 ~ 0 + adjcls2 ) hedgeRatio <- coef(result) # 1.64 spread <- adjcls1-hedgeRatio*adjcls2 # spread = GLD - hedgeRatio*GDX prevSpread <- backshift(1, as.matrix(spread)) prevSpread <- prevSpread - mean(prevSpread, na.rm = TRUE) deltaSpread <- c(NaN, diff(spread)) # Change in spread from t-1 to t result2 <- lm(deltaSpread ~ 0 + prevSpread ) theta <- coef(result2) halflife <- -log(2)/theta # 7.839031 Chan800064_c07.indd 173 6/7/2021 7:16:58 AM 174 QUANTITATIVE TRADING simply use the latest signal to exit the existing position and become flat or you can exit the existing position and then enter into an oppo- site position. Either way, you have used a new, more recent entry signal as an exit signal for your existing position. This is a common way to generate exit signals when a trading model can be run in shorter intervals than the optimal holding period. Notice that this strategy of exiting a position based on running an entry model also tells us whether a stop-loss strategy is recom- mended. In a momentum model, when a more recent entry signal is opposite to an existing position, it means that the direction of momentum has changed, and thus a loss (or",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "market_structure",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.610398"
}