{
  "id": "fdb99c5a6ce7",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 0,
  "content": "Sheldon Natenberg OPTION VOLATILITY NG Advanced Trading Strategies and Techniques McGraw-Hill New York San Francisco Washington, D.C. Auckland Bogota Caracas Lisbon London Madrid Mexico City Milan Montreal New Delhi San Juan Singapore Sydney Tokyo Toronto © 1994, Richard D. Irwin, a Times Mirror Higher Education Group, Inc. company ALL RIGHTS RESERVED. No part of this publication may be reproduced, stored ina retrieval system, or transmitted, in any form or by any means, elec- tronic, mechanical, photocopying, recording, or otherwise, without the prior written permission of the publisher and the authors. This publication is designed to provide accurate and authoritative information in regard to the subject matter covered. It is sold with the understanding that the author and the publisher are not engaged in rendering legal, accounting, or other professional advice. ISBN 1-55738-486-X Printed in the United States of America BB 22 21 20 19 18 17 CB/TAQ/BIS McGraw-Hill nu A Dimston of The McGraw-Hill Companes To Paul, for convincing me to become an options trader; To Hen and Jerry, for their financial help when | needed it; To Eddie, who encouraged me to finish the book and get off the computer so he could do his homework; And most of all to Leona, for her support and encouragement. ¢¢ Table of Contents +“ Preface to the First Edition Preface to the Second Edition 1% The Language of Options Contract Specifications Exercise and Assignment Market Integrity Margin Requirements Settlement Procedures e2% Elementary Strategies Simple Buy and Sell Strategies Risk/Reward Characteristics Combination Strategies Constructing an Expiration Graph % 3 % Introduction to Theoretical Pricing Models Expected Return Theoretical Value A Word on Models A Simple Approach Exercise Price Time to Expiration Price of the Underlying Interest Rates Dividends Volatility oon fre 13 13 16 19 23 35 36 37 39 40 46 46 47 47 48 49 vi Table of Contents de 4 Volatility 51 Random Walks and Normal Distributions 51 Mean and Standard Deviation 56 Underlying Price as the Mean of a Distribution 60 Volatility as a Standard Deviation 60 Lognormal Distributions 61 Daily and Weekly Standard Deviations 65 Volatility and Observed Price Changes 67 A Note on Interest Rate Products 68 Types of Volatilities 69 eh} Using an Option’s Theoretical Value 81 + 6 Option Values and Changing Market Conditions 95 The Delta 99 The Gamma 103 The Theta 111 The Vega or Kappa 113 The Rho 116 Summary 118 7 Introduction to Spreading 127 What Is a Spread? 127 Why Spread? 132 Spreading as a Risk Management Tool 133 a & Volatility Spreads 137 Backspread (also referred to as a ratio backspread or long ratio spread) 138 Ratio Vertical Spread (also referred to as a ratio spread, short ratio spread, vertical spread, or front spread) 139 Straddle 141 Strangle 143 Table of Contents vii Butterfly 145 Time Spread (also referred to as a calendar spreador horizontal spread) 148 The Effect of Changing Interest Rates and Dividends 154 Diagonal Spreads 157 Other Variations 157 Spread Sensitivities 159 Choosing an Appropriate Strategy 161 Adjustments 168 Entering a Spread Order 169 29 Risk Considerations 173 Choosing the Best Spread 173 Practical Considerations 181 How Much Margin for Error? 187 Dividends and Interest 188 What Is a Good Spread? 192 Adjustments 193 A Question of Style ; 195 Liquidity 196 10% Bull and Bear Spreads 199 Naked Positions 199 Bull and Bear Ratio Spreads 199 Bull and Bear Butterflies and Time Spreads 201 Vertical Spreads 202 #11¢ Option Arbitrage 213 Synthetic Positions , 213 Conversions and Reversals 217 Arbitrage Risk 223 Boxes 228 Jelly Rolls 231 Using Synthetics in Volatility Spreads 233 Trading without Theoretical Values 235 viii “12% Early Exercise of American Options Futures Options Stock Options The Effect of Early Exercise on Trading Strategies 713% Hedging with Options Protective Calls and Puts Covered Writes Fences Complex Hedging Strategies Portfolio Insurance + 14 & Volatility Revisited Some Volatility Characteristics Volatility Forecasting A Practical Approach Some Thoughts on Implied Volatility e154 Stock Index Futures and Options What Is an Index? Calculating an Index Replicating an Index Stock Index Futures Index Arbitrage Index Options Biases in the Index Market % 16 Intermarket Spreading An Intermarket Hedge Volatility Relationships Intermarket Volatility Spreads Options on Spreads Table of Contents 241 241 243 250 257 258 260 263 265 268 273 273 279 282 290 301 301 302 304 305 309 313 326 331 335 336 339 351 Table of Contents ix 717% Position Analysis 353 Some Simple Examples 353 Graphing a Position 358 A Complex Position 367 Futures Option Positions 372 18 + Models and the Real World 385 Markets Are Frictionless 386 Interest Rates Are Constant over the Life of an Option 388 Volatility Is Constant over the Life of the Option 390 Trading Is Continuous 304 Volatility Is Independent of the Price of the Underlying Contract 399 Over small periods of time the percent price changes in an underlying contract are normally distributed, resulting in a lognormal distribution of underlying prices at expiration 400 Skewness and Kurtosis 402 Volatility Skews 405 A Final Thought 416 « Appendix A + A Glossary of Option and Related Terminology 419 Appendix B The Mathematics of Option Pricing 431 Option Pricing Models 431 Normal Distributions 439 Volatility Calculations 442 The Extreme Value Method 443 The Exponential and Natural Logarithm Functions 446 ¢ Appendix C + Characteristics of Volatility Spreads 449 * Appendix D + What’s the Right Strategy? 451 x Table of Contents “ Appendix E # Synthetic and Arbitrage Relationships 453 Arbitrage Values for European Options (no early exercise permitted} 455 Other Useful Relationships: 456 “ Appendix F + Recommended Reading 457 Elementary Books 457 Intermediate Books 459 Advanced Books 461 Index + 463 « Preface to the First Edition Within the last decade trading options has increased at an explosive rate. Not only have traditional market participants, speculators, hedgers, and arbitrageurs all become ac- tively involved in option markets, but the number of individual floor traders willing to risk their own capital in these markets has",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.421977"
}