{
  "id": "96c84e6c3c01",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 5,
  "content": "time to process exercise and assignment notices, the holder of an exchange traded option must usually submit an exercise notice no later than the close of business on the day prior to expiration. 3. Certain index options, such as the S&P 500 traded on the Chicago Board Options Exchange, and the Major Market traded on the American Stock Exchange, are European. Some foreign currency options traded on the Philadelphia Stock Exchange are also European. the Language of Options 7 $435 per ounce, $35 per ounce will be credited to his account. With a certain stock trading at $62, the intrinsic value ofa $70 put is $8. By exercising his option, the holder of the put can sell the stock at $70 per share. If he then buys the stock back at the market price of $62, he will show a total credit of $8. A call will only have intrinsic value if its exercise price is less than the current market price of the underlying contract. A put will only have intrinsic value if its exercise price is greater than the current market price of the underlying contract. The amount of intrinsic value is the amount by which the call’s exercise price is less than the current underlying price, or the amount by which the put’s exercise price is greater than the current underlying price. No option can have an intrinsic value less than zero. Usually an option’s price in the marketplace will be greater than its intrinsic value. The additional amount of premium beyond the intrinsic value which traders are willing to pay for an option is the time value, sometimes also referred to as the option’s time premium or extrinsic value. As we shall see, market participants are willing to pay this additional amount because of the protective characteristics afforded by an option over an outright long or short position in the underlying contract. An option’s premium is always composed of precisely its intrinsic value and its time value. If a $400 gold call is trading at $50 with gold at $435 per ounce, the time value of the call must be $15, since the intrinsic value is $35. The two components must add up to the option’s total premium of $50. If a $70 put on a stock is trading for $9 with the stock at $62, the time value of the put must be $1, since the intrinsic value is $8. The intrinsic value and the time value must add up to the option’s premium of $9. Even though an option’s premium is always composed of its intrinsic value and its time value, it is possible for one or both of these components to be zero. If the option has no intrinsic value, its price in the marketplace will consist solely of time value. If the option has no time value, its price will consist solely of intrinsic value. In the latter case, we say that the option is trading at parity. While an option’s intrinsic value can never be less than zero, it is possible for an option, if it is European, to have a negative time value. (More about this when we look at early exercise in Chapter 12.) When this happens the option can trade for less than parity. Usually, however, an option’s premium will reflect some non-negative amount of intrinsic and time value. Any option which has a positive intrinsic value is said to be in-the-money by the amount of the intrinsic value. With a stock at $44, a $40 call is $4 in-the-money. With Deutschemarks at 57.75, a 59 put is 1.25 in-the-money. An option which has no intrinsic value is said to be out-of the-money. The price of an out-of-the-money option Consists solely of time value. In order to be in-the-money, a call (put) must have an €Xercise price lower (higher) than the current price of the underlying contract. Note that if a call is in-the-money, a put with the same exercise price and underlying contract Must be out-of-the-money. Conversely, if the put is in-the-money, a call with the same €Xercise price must be out-of-the-money. Finally, an option whose exercise price is identical to the current price of the Underlying contract is said to be at-the-money. Technically, such an option is also Out-of-the-money since it has no intrinsic value. We make the distinction between an 8 Chapter 1 Figure 1-7: In- and Out-of-the-Money Options Current Underlying Price Lower Exercise Prices Higher Exercise Prices ~~ _ In-the-Money Calls Out-of-the-Money Calls Out-of-the-Money Puts In-the-Money Puts ~ = at-the-money and out-of-the-money option because an at-the-money option has the greatest amount of time premium and is usually traded very actively. If we want to be very precise, the exercise price of an option must be identical to the current price of the underlying contract for the option to be at-the-money. However, for exchange-traded options, the term is commonly applied to the call and put whose exercise price is closest to the current price of the underlying contract. With a stock at $74 and $5 between exercise prices ($65, $70, $75, $80, etc.)}, the $75 call and the $75 put would be considered the at-the-money options. These are the call and put options with exercise prices closest to the current price of the underlying contract. MARKET INTEGRITY An important consideration for every market participant is the integrity of the market. No trader will want to trade in a market where there is a chance that the opposing trader will default on a contract. If a trader purchases an option, he wants to be certain that the seller will fulfill the terms of the contract if the option is exercised. In order to guarantee that the integrity of the market will be maintained, each options exchange has established a progression of responsibility for the fulfillment of the terms of an option. The primary responsibility falls to the individual trader. If the seller of an option is assigned, he must be prepared to take the required long",
  "word_count": 1000,
  "topics": [
    "options",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.422883"
}