{
  "id": "46afee3179ec",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 94,
  "content": "System N= Sum Mean StDev AvgWin AvgLoss Win% p= A 29 (2,531) (87) 616 456 (528) 44.8% 0.226 B 17 5,109 301 515 557 (314) 70.6% 0.014 C 16 1,109 69 653 361 (1,194) 81.3% 0.339 D 6 (529) (88) 479 468 (366) 33.3% 0.336 All 68 3,158 46 600 456 (538) 58.8% 0.263 144 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c12 JWBT634-Grimes May 10, 2012 8:16 Printer: Hamilton Printing 390 THE INDIVIDUAL, SELF-DIRECTED TRADER trades separately. The percentage of winning trades is given as Win% in the table. In this example, losing trades are 1 − Win% for all categories, but in other cases there may be breakeven trades to consider. Standard deviation is calculated as an intermediate step to deriving the p value, which is a signiﬁcance test (one-tailed t-test) for the mean P&L being >0. First, consider the bottom line of the table, which gives summary statistics for all trades combined. Over this period, this trader made $3,158 on starting capital of $100,000. The ﬁrst question to ask is: Is this good performance? Even a simple question like this may not have a simple answer. On one hand, $3,158 is not a lot of money, but if this is performance over one quarter, a 3.16 percent gain is perhaps not bad. Assuming this trader can repeat this performance regularly, 3.16 percent quarterly compounds to a re- spectable 13.2 percent annually: (1 + 0.0316) 4 − 1. However, it is not so simple: The standard deviation of the trades is a staggering $600 compared to a mean trade of $46. This is not good, and suggests that the positive performance could have been nothing more than luck. The p value of 0.263 basically says that, given this set of trades, there is a 26.3 percent chance of seeing results at least this extreme due to random chance even if the trader did not actually have an edge. Figure 12.1, a running total of the individual trades, provides another check on consistency and edge. (Note that this ﬁgure does not mirror the daily account P&L that is marked to market; this graph simply sums each trade’s closed P&L. Graphs like this can be ordered either by trade entry or by exit date.) Consider this P&L line and ask yourself how hard it is to believe that it ended above zero just due to chance. In this case, there seems to be little consistency and the line wanders about as far above as below the zero FIGURE 12.1 Cumulative P&L by Trade P1: OTA JWBT634-c12 JWBT634-Grimes May 10, 2012 8:16 Printer: Hamilton Printing Becoming a Trader 391 FIGURE 12.2 Trade-by-Trade Net P&L line. This is not what we would expect to see if a trader had a strong edge. Though this is not an actual statistical test, visual inspection of a time series chart is a good companion to deeper analyses. Yet another check comes from plotting the P&L of each individual trade (not cumu- lative) as in Figure 12.2. One of the most important aspects of this graph is the long runs of both winning and losing trades. There seem to be roughly three separate sections to this trader’s performance: The ﬁrst half of the graph shows winning and losing trades ap- proximately equally matched, and then there is a potentially nasty series of losing trades as two large losses, followed by two small wins, lead to eight losing trades in a row. However, this period is followed by a nearly unbroken series of wins on the last third of the graph. There are questions that must be asked here that cannot be answered by this simple analysis: Why did this happen? Does the trader’s style favor certain market environments over others, or is there an element of performance psychology here? Is the trader himself responsible for these streaks of losses or wins? Essentially all of the positive P&L comes from the long run of wins at the end, so is there some repeatable element in that set of trades? The answers to all of these questions may well be no. It is possible that these runs are just the normal expectation for the system, and that any tweaking would be counterproductive, but these are the kinds of questions to ask. Though the trader’s performance is not promising, all is not lost. The breakdown of trades by system (A, B, C, and D) in Table 12.1 shows that the B-class trades might have 6,000 4,000 2,000 0 -2,000 -4,000 -6,000 -8,000 1,500 1,000 500 0 •• .h hi I I I I I I I 1'1 11 'I' \"'r ,., .. , -500 - 1,000 - 1,500 145 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c12 JWBT634-Grimes May 10, 2012 8:16 Printer: Hamilton Printing 392 THE INDIVIDUAL, SELF-DIRECTED TRADER a stronger edge. These trades, taken alone, made $5,109 on 17 trades, showing a mean trade of $301 with a standard deviation of $515, achieving statistical signiﬁcance as well. This trader should possibly consider these trades further, and ask if some of the other trades could be eliminated from the playbook. This is also a vivid illustration of the fact that neither reward/risk ratio nor winning percentage is particularly important when taken alone. Consider the C trades, which have a very impressive win ratio of 81.3 percent, but an average loss more than three times",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.710077"
}