{
  "id": "ecf94f7cc01c",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 122,
  "content": "interest rate position. A fall in interest rates will reduce its cost of borrowing, while a rise in interest rates will increase its costs. To cap the upside risk, the firm can purchase an interest rate call, thereby establishing a maximum amount it will have to pay for borrowed funds. No matter how high interest rates rise, the borrower will never have to pay more than the cap’s exercise price. An institution which lends funds at a variable interest rate has a long interest rate position. A rise in interest rates will increase its returns, while a fall in interest rates will reduce its returns. To set a floor on its downside risk, the institution can purchase an interest rate put, thereby establishing a minimum amount it will receive for loaned funds, no matter how low interest rates fall. No matter how low interest rates fall, the lender will never receive less than the floor’s exercise price. If a borrower (lender) simultaneously buys a cap {floor} and sells a floor (cap), he has established a collar to his position. This is simply a fence done in the interest rate market. COMPLEX HEDGING STRATEGIES Since most hedgers are not professional option traders, and have neither the time nor desire to carefully analyze option prices, simple hedging strategies involving the pur- chase or sale of single options are the most widely used. However, if one is willing to do a more detailed analysis of options, it is possible to construct a wide variety of hedging 266 Chapter 13 strategies which involve both volatility and directional considerations. In order to do this, a hedger must be familiar with both volatility and its impact on option values, and the delta as a measure of directional risk. The hedger can then combine his knowledge of options with the practical considerations of hedging. As a first step in choosing a strategy, a hedger might consider the following: 1. Does the hedge need to offer protection against a “worst case” scenario? 2. How much of the current directional risk should the hedge eliminate? 3. What additional risks is the hedger willing to accept? A hedger who needs disaster insurance in order to protect against a “worst case” scenario only has a choice of which option(s) to buy. Even so, he still needs to decide which exercise price to purchase and how many options. For example, suppose a hedger has a long position in a certain underlying contract currently trading at 100. Suppose also that the hedger decides to buy a put because he needs to limit the downside risk to some known and fixed amount. Which put should he buy? Suppose the hedger has determined that options are generally overpriced (implied volatility is too high). Clearly, any option purchase will be to the hedgers’ disadvantage. If his sole purpose is to hedge his downside risk without regard to upside profit potential, he ought to avoid options and hedge himself in the futures or forward market. If, however, he still wants upside profit potential, he must ask himself how much of a long position he wants to retain. For example, he might be willing to retain 50% of his current long position. This simply means that he has to purchase puts with a total delta of -50. He can do this by purchasing one at-the-money put with a delta of -50, or several out-of-the-money puts whose deltas add up to —50. But in a high implied volatility market one usually tries to buy as few options as possible and sell as many options as possible. (This is analogous to constructing a ratio vertical spread.) Hence, purchasing one put with a delta of —50 will be less costly, theoretically, than purchasing several options with a total delta of -50. If the hedger wants to eliminate even more of the directional risk, say 75%, under these circumstances he would be better off purchasing one put with a delta of -75. All other factors being equal, in a high implied volatility market a hedger should buy as few options as possible and sell as many options as possible. Conversely, in a low implted volatility market a hedger should buy as many options as possible and sell as few options as possible. This means that if all options are overpriced (implied volatility is too high}, and the hedger decides he is willing to accept the unlimited downside risk that goes with the sale of a covered call, in theory he ought to sell as many calls as possible to reach his hedging objectives. If he is trying to hedge 50% of his long underlying position, he can do a ratio write by selling several out-of-the-money calls with a total delta of 50, rather than selling a single at-the-money call with a delta of 50. There is an additional problem if one sells several calls against a single long underlying position. Now the hedger not only has the unlimited downside risk which Hedging with Options 267 goes with a covered call position, but he also has unlimited upside risk because he has sold more calls than he can cover with the underlying. If the market moves up far enough, he will be assigned on all the calls. Most hedgers want to restrict their unlimited risk to one direction, usually the direction of their natural position. A hedger with a long underlying position may be willing to accept unlimited downside risk, but he is probably unwilling to accept unlimited upside risk. A hedger with a short underlying position may be willing to accept unlimited upside risk, but he is probably unwilling to accept unlimited downside risk. A hedger who constructs a position with unlimited risk in either direction is presumably taking a volatility position. There is nothing wrong with this, since volatility trading can be highly profitable. But a true hedger ought not lose sight of what his ultimate goal is: to protect an existing position, and to Keep the cost of this protection",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.440929"
}