{
  "id": "3dbd1ab5a3a3",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 78,
  "content": "any special instructions which accompany the order. Unless a trader knows exactly what current market conditions are, or has a great deal of confidence in the broker who will be handling the order, it is always a good practice to submit specific instructions with the order as to how it is to be filled. Additionally, when one considers all the information that must be communicated with a spread order (the expiration months, the exercise prices, the type of options, whether the order is a buy or sell, the ratio), it is easy to see Volatility Spreads 171 Figure 8-23a FUTURES ORDER Account Number Broker Memo $ABCDEFGHIJKLMNOPQRSTUVWXYZ23456789%S BUY SELL 25 Crude O11 JantAC 125 Gude oil feb. 190 2u <— an indication of the —» my . prices the broker should look at [x | £20 Credit AN or None spread ratio spread price how incorrect information might inadvertently be transmitted with the order. For this reason, it is also a good practice to recheck all orders before submitting them for execution. Option trading can be difficult enough without the additional problems of miscommunication. Chapter 8 Figure 8—23b BY/SL | C \\(p) GTC 7_- oT san APR FEB MAY 1O IOEX e425 142 VOL STOCK on ee EX PX PREM ByS1)| c (P}S+= 4 JAN APR ° . ea UN ) | 20 IOEX LS SHUI0 134 VOL STOCK oon Co EX PX PREM. OEX U2U-UL6 order to be executed with OEX between these prices FILLS ly 2 spread ratio \\ Point Debit spread price for each 1 by 2 ratio FULS OPEN OPEN CLOSE CUST FIRM FB/BB TAKEN BY RNR FIRM M/M ACCT# EX TIME ge D Risk Considerations Consider the prices and theoretical values shown in Figure 9-1. What categories of volatility spreads might be profitable under these conditions? By comparing prices to theoretical values, or by comparing the implied volatilities of the various options to the volatility input of 15%, we can see that all options are overpriced. Recalling the general guidelines in the last chapter, under the given conditions a trader will want to consider spreads with a negative vega: Call and Put Ratio Vertical Spreads Short Straddles and Strangles Long Butterflies Short Time Spreads Which of these categories is likely to represent the best spreading opportunity? And within each category, which specific spread might be best? CHOOSING THE BEST SPREAD For the moment, let’s focus on May options only. Having eliminated the possibility of time spreads, we will have to look for spreads in the ratio vertical category (negative gamma, negative vega). With ten different May options (five calls and five puts), it is possible to construct a wide variety of spreads which fall into this category. How can we make an intelligent decision about which spread might be best? Suppose we choose three possible strategies and try to analyze them. The three strategies which have been chosen are spreads 1, 2, and 3, shown in Figure 9-2. These are certainly not the only possible spreads, nor can we be certain that they are the best possible spreads. But in theory each spread ought to be profitable under the given market conditions, since each fits into the ratio vertical spread category: spread 1 is a short straddle, spread 2 is a call ratio vertical spread, and spread 3 is a long put butterfly. How can we evaluate the relative merits of each spread? Initially it may appear that spread 1 is best since it has the greatest theoretical edge. If the volatility estimate of 15% turns out to be correct, spread 1 will show a profit of 2.86, while spread 2 will show a profit of 1.00, and spread 3 will show a profit of only 40. But is theoretical edge our only concern? If that were true we could simply do each spread in bigger and bigger size to make the theoretical edge as large as we want. Instead of doing spread 2 at 10 x 15, we might increase the size fivefold to 50 x 75. This will 173 Chapter 9 174 prLL oOo 1900- 9°8 o- EL] 86s ecZk ool sgso0- 9°89 pe 68\" Zhb 2g LZ §=©90l° Z900- 26 9g- Lhe CES 60°41 901 6900- 26 ep pel 9P'h is 8691 801° 6900- 6 9p- 2st eZ} Zool 80l' 6900- £6 zs 29° 88\" og ph2zb €0l’ 9900- 68 Ze- hh ve’ ze9l s0l’ pg900- 68 19 02's ard 6P Os'Zt z60° 0900- 08 ge- QL 00't o7Zt 260° gs00- 08 OL zee €0'€ er Ane, eBeA eVaY. ewWey eyeq snjeA aod AyineioA eBay eey, ewe e}EG enjeA = 89d aud payduy| feojosoay paliduy| Jeapos0ayL as} sind sltvo %00'S ‘eyey ysase}u| %GL ANINEIOA ‘sAep SJL} :UoedIdxy oO} Suu! | ‘LEO :seunyng Aine peel sso’ ss00- 86 8L- 08’ 662 6681 sso’ eZ00- 86 ee ee’ 6s 2g prt 890° z2e00- Ic Bo 90'2 27 6841 890° O600- Zl le Ls\" LL 1S oe'Zt 940° e600- Eel ss Zp 6s'I 96°91 920° 6600- >'Eh bb 26 LOL os Zv9l S20 g600- fel eV 16\" SO'l 80'Zl $20° Z600- sé'él Zs orl 9s'} 6b OZ'Zb 46980\" Z800- Il 62 es ZL 6S'Z1 990° s800- 9'II OL Z20'% 6le ep AuneIoA eBeA BOUL BWWeDy eyOq anjeA = eoud Aynejon eBep_ eyYL eulwey esq snjeA sd @9Md payduyy jeoparoayt payduy feopezooyL 9s8}I0xXg Sind s11vo %00'8 ‘ayey Jsese}U| LHS AWNELOA ‘Shep gg ‘uonerdxy 0} aut) ‘09° 6p ‘seunjny Aew b-6 e1nbi4 Risk Considerations 175 Figure 9-2 Delta Position Theoretical Edge Spread 1: Short 10 May 50 calls @ 1.07 ~10x +44 10x +.15 Short 8 May 50 puts @ 1.59 -8 x -55 8x+.17 0 42.86 Spread 2: Long 10 May §1 calls @ .77 +10x +44 10x 4.18 Short 15 May 52 calls @ .53 -15x +21 15x .20 -§ +1.00 Spread 3: Long 10 May 49 puts @ 1.05 +10 x—42 10x-14 Short 20 May 50 puts @ 1.59 -20 x -65 20 x +.17 Long 10 May 51 puts @ 2.22 +10 x-68 10",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.434396"
}