{
  "id": "6176e86b0fd9",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 35,
  "content": "h ese are t h e main tas k s in t h e Before time f rame. In t h is c h a p ter, we d iscuss t h e secon d component o f t h e process, During , and the core principle of E ff ective Execu - tion wit h its associate d HVMSs an d HV As. Before we get to Eff ective Execution, however, I want to spend a little time clari - f ying t h e process o f a tra d er ’ s psyc h o l ogica l d eve l opment an d tra d ing per f ormance en h ancement. A l t h oug h we are d iscussing eac h o f t h e t h ree princip l es (Hig h ‐Qua l ity Preparation, Eff ective Execution, and Constructive Self‐Assessment) separately , and we do want to keep them lo g ically separate to help diff erentiate them in our minds, t h ey d o h ave some over l ap. Some o f t h e HV As an d especia ll y t h e HVMSs are uti l ize d in more than one time frame. The skill of mental parkin g is a g ood example. W e dis - cusse d t h is in Hi gh ‐Qua l ity Preparation as a s k i ll an d tec h nique t h at h e l ps us f ocus, f or instance, on our nig h t l y h omewor k , as we menta ll y par k ot h er d istractions suc h as watchin g TV or g oin g out to the pub. But the utility of mental parkin g isn’t limited to t h e Before tradin g activites of preparation. Mental parkin g is an HVMS that also app l ies during tra d ing in execution. W e want to menta ll y par k , f or examp l e, a tra d ing loss in the middle of the tradin g day in order to clear our mind and be able to focus 232T RADE MINDFULLY on the next tradin g opportunity . In this way , what we learn to do well in preparation will fl ow into the other components of the process and vice versa. Aside from the overlap, what will be of g reat use to the trader is to understand how the p rinci p les of Before‐During‐After work together. W e are discussing each prin-r ciple separately in order to clarify each of them for you, but it is important to under- stand how all three principles work to g ether as a process to directly enhance your trading performance. Figure 10.1 illustrates this process. It should be obvious that the activities of Hi g h-Quality Preparation will impac t our performance durin g tradin g in Eff ective Execution. For an example, a day trader engages in High-Quality Preparation activities, including developing a game plan for the next tradin g day . She notes that the market has been trendin g hi g her. From her research, she knows that dips in the mornin g often put in the lows for the day in overall up trending conditions. She develops a game plan to buy a morning pullbac k if the volume and price action have indicated a minor reaction rather than a market chan g in g into down trendin g conditions. Can you imagine how she will trade the next day if what she anticipated in h er preparation an d game p l an un f o ld s t h e next morning? S h e wi ll imme d iate l y recognize w h at is h appening, k now exact l y w h at to d o, an d act wit h con fi d ence a t t h e rig h t time b ecause s h e was we ll prepare d t h roug h h er process o f Hig h ‐Qua l ity Preparation. Preparation gives execution a strong e d ge. Once t h e tra d ing d ay is over, t h e process‐oriente d d ay tra d er engages in t h e h ig h- va l ue activities o f Constructive Se lf ‐Assessment d iscusse d in C h a p ter 11 . Per h a p s s h e l earne d somet h ing new to d ay a b out t h e mar k et or may b e somet h ing new a b out h er per f ormance. T h is new in f ormation g l eane d f rom re fl ective o b servations ma d e post‐tra d ing wi ll now in fl uence t h e way s h e prepares. Constructive Se lf ‐Assessmen t High-Quality Preparation Constructive Self-Assessment Effective Execution FIGURE 10.1 The Trading Psychology Process - .. .. 41 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 242T RADE MINDFULLY Exercise 10.1 Factors That Affect My Focus My Personal Examples Factors Example 1 Example 2 Example 3 Example 4 Market and performance situations Dull, narrow range days. It is hard to sit and do nothing. I check e‐mail or surf the web and wind up missing trades. Often, I look at markets I don’t trade to see if one is moving. I am anxious to get in. I usuall y don’t trade that well. Location of my",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "market_structure"
  ],
  "created_at": "2026-02-05T00:37:45.721779"
}