{
  "id": "955218fe8e89",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 96,
  "content": "Actual and Pro Forma P&L simply used 1 percent ﬁxed fractional risk, a stunning gain over his actual $3,158. The path of this pro forma P&L provides another, visual conﬁrmation of what we have seen clearly in the %R analysis—the trader actually did have an edge, but did not apply it very well. The lessons, in this case, are probably simple: perhaps eliminate one or two of the trading systems and consider applying the rest with a ﬁxed fractional risk approach in the next period. Control Charts Control charts are tools used in manufacturing to monitor physical processes for early signs of degradation or failure, and are an important quality control tool in diverse ﬁelds such as metalworking, electronics, and pharmaceutical manufacturing, among others. They are especially powerful in physical processes that can be tightly controlled, espe- cially with large sample sizes. For instance, an automobile part produced on an assembly line might have tolerances measured in a fraction of a human hair; some variation, within tightly deﬁned limits, is acceptable, but the production line needs a warning when prod- ucts stray outside these bounds. The same concepts can be applied to trading, with the caveat that trading results are far more variable than manufacturing applications. There are several different kinds of control charts used in manufacturing applica- tions, but I am going to propose a simpliﬁed version that traders may ﬁnd more immedi- ately applicable. Many of the assumptions of distributions made in classic control charts do not hold in trading situations. For instance, one commonly used chart in manufac- turing plots variations on both sides of an average, expecting that the variation should wander more or less freely above and below that average. The quality control manager P1: OTA JWBT634-c12 JWBT634-Grimes May 10, 2012 8:16 Printer: Hamilton Printing Becoming a Trader 395 takes note when four or ﬁve data points appear on one side of the average, and considers this to be an early warning that the process is potentially moving out of the control zone. This degree of control is very unlikely in trading, so the purpose of these charts is slightly different: to present trading results in a graphical format that displays the individual data points, a moving average, and some measure of variation. The ﬁrst of these charts is the Standard Deviation Control Chart , and is produced by the following procedure: r First, decide what the evaluation period is going to be. Many traders will ﬁnd weekly analysis to be most applicable, but day traders should do this work on each trading day. (It is also possible to do a trade-by-trade analysis rather than a chronological grouping.) r Collect a time series of individual (not cumulative) P&Ls for each period. r Choose a look-back period. The example that follows is done on daily data produced by a day trader, so a look-back period of 20 trading days, which is approximately equal to one trailing calendar month, was chosen. In practice, look-back periods of 10 to 50 are probably most useful. r For each data point, calculate a moving average of the look-back period as well as the standard deviation. Offset these by one day, so that today you are using yesterday’s average and standard deviation. This is important because a large value today will inﬂuence the average and standard deviation and, particularly for short look-back periods, will give an understated view of the variation. r For each data point, plot the raw data point as a bar, the moving average, and bands +/−N times the standard deviation. Remember, it is very unlikely that this data will be normally distributed, so the usual rules of thumb for standard deviation do not apply. Rather, the standard deviation bands are used as a visual representation of the degree of variation in the process. The example that follows uses 2.5 for N, but values of 1.5 to 3.0 may be useful. Figure 12.5 shows an example of this Standard Deviation Control Chart, based on 190 trading days of a model developing day trader’s P&L. Though there is much to be gleaned from this analysis, here are some important points to consider: A: The trader’s variation has been steadily increasing, evidenced by the expanding upper and lower bands. Note that the average (the dark black line in the middle) FIGURE 12.5 A Standard Deviation Control Chart P1: OTA JWBT634-c12 JWBT634-Grimes May 10, 2012 8:16 Printer: Hamilton Printing 396 THE INDIVIDUAL, SELF-DIRECTED TRADER has been consistently above zero, suggesting that the trader is consistently mak- ing money. In addition, winning days are much larger than losing days. This is all good. B: Something happens here. The average takes a turn down, and even crosses to the other side of zero. The trader would have been losing money during this period, but the variation also decreases. It is important to ask the right questions to un- derstand why this happened. What caused the change in the average? Are there behavioral factors at work? Did something shift in the market? Was a new trad- ing system implemented? Perhaps the trader was aware that he was not doing well and reduced trading size. The answers are not on this chart, but the chart can provoke the correct questions. C: The average recovers after a series of winning days, but there may still be prob- lems. The average is not as consistent, as it turns back down shortly after C, and there are not as many winning days above $500 as at the beginning of the chart. D: Finally, the trader’s P&L seems to be back under control, and the last part of the chart looks very much like the beginning, though the degree of variation (spread of the bands) is higher. This chart will serve the needs of most traders, but another possibility to consider is the Range Control Chart. This chart, shown in Figure 12.6, can be a useful complement to other P&L analyses. The procedure for creating this chart is simple:",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.710400"
}