{
  "id": "f42b5646cfd8",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 183,
  "content": "Calls 220 7 \\ ; 5 weeks t6 expiration \\ \\ OEX = 408.26 (406.79) | 1 ae nn 200 v 1 | \\ ; i | \\ | = \\ ! | 2 180+—~ t— 4 — re} \\ | E | o \\ | c= 11 weeks to expiration ® 1607 — Se soe ee eer Ze) Ss \\ | ° \\ | | | = | | = 140+ ation iI | OEX = 412.67 (412.89) $ oe] 2 = 120 E 100 In{ex. price/forward price)/sqrt(time) Figure 18-11d: OEX March 1993 Puts 220 in 200-+- | > 2 180 9 11 weeks tolexpiration E OEX = 396.64 (397.28) © 1604-——- > SS ‘ . . 2 “s? 1 week tojexpiration = 140 SN OEX = 418.67 (412.89) i} SS z ad 3 | 2 3 120 E 10075 weeks to expiration a OEX = 406.26 (406.79) ST — 80 | —T T i -0.3 -0.2 -0.4 0.0 0.4 0.2 0.3 in(ex. price/forward price)/sqrt(time) 418 Chapter 18 This text, like many others on options, may have left the reader with the impression that option evaluation and trading can be reduced to a series of arithmetic calculations. The science of option evaluation is an important part of any trader’s education, but mathematical models are only a tool to help the trader make decisions. Successful option trading is at least as much an art as a science, and a trader must know where science leaves off, and other intangible assets, whether intuition or market feel or experience, begin. This brings us to one final point, and perhaps the most important principle of option trading: there is no substitute for common sense. A trader who slavishly uses a model to make every trading decision is heading for disaster. Only a trader who fully understands what a model can and cannot do will be able to make the model his servant rather than his master. ** Appendix A + A Glossary of Option and Related Terminology Alt or None (AON)—An order which must be filled in its entirety or not at all. American Option—<An option which can be exercised at any time prior to expiration. Arbitrage—The purchase and sale of the same product in different markets to take advantage of a price disparity between the two markets. Asian Option—Average price option. Assignment—The process by which the seller of an option is notified of the buyer’s intention to exercise. At-the-Money—An option whose exercise price is equal to the current price of the underlying contract. On listed option exchanges the term is more commonly used to refer to the option whose exercise price is closest to the current price of the underlying contract. Automatic Exercise—The exercise by the clearing house of an in-the-money option at expiration, unless the holder of the option submits specific instructions to the contrary. Average Price Option—An option whose value at expiration is determined by the average price of the underlying instrument over some period of time. Backspread—aA spread, usually delta neutral, where more options are purchased than sold, and where all options have the same underlying contract and expire at the same time. Backwardation—A futures market where the more distant delivery months trade at a discount to the nearterm delivery months. Barrier Option—An option which will either become effective or cease to exist if the underlying instrument trades at some predetermined price prior to expiration. 419 420 Appendix A Bear Spread—Any spread which will theoretically increase in value with a deciine in the price of the underlying contract. Box—A long call and short put at one exercise price, together with a short call and long put ata different exercise price. All options must have the same underlying contract and expire at the same time. Bull Spread—Any spread which will theoretically increase in value with a rise in the price of the underlying contract. Butterfly—The sale (purchase) of two options with the same exercise price, together with the purchase (sale) of one option with a lower exercise price and one option with a higher exercise price. All options must be of the same type, have the same underlying contract, and expire at the same time, and there must be an equal increment between exercise prices. Buy/Write—The purchase of an underlying contract together with the sale of a call option on that contract. Cabinet Bid—On some exchanges, a bid smaller than the minimum increment, permissible between traders desiring to close out positions in very far out-of-the money options. Calendar Spread—A time spread. Call Option—A contract between a buyer and a seller whereby the buyer acquires the right, but not the obligation, to purchase a specified underlying contract at a fixed price on or before a specified date. The seller of the call option assumes the obligation of delivering the underlying contract should the buyer wish to exercise his option. Cap—A contract between a borrower and a lender of floating rate funds, whereby the borrower is assured of paying no more than some maximum interest rate for borrowed funds. This is analogous to a call option where the underlying instrument is an interest rate on borrowed funds. Chooser Option—A straddie where the owner must decide by some predetermined date whether to keep either the call or the put. Christmas Tree—A spread involving three exercise prices. One or more calls (puts) are purchased at the lowest (highest) exercise price and one or more calls (puts) are sold at each of the higher (lower) exercise prices. All options must expire at the same time, be of the same type, and have the same underlying contract. Class—All options of the same type with the same expiration date and same underlying instrument. A Glossary of Option and Related Terminology 421 Clearing House—The organization which guarantees the integrity of all trades made on an exchange. Clearing Member—A member firm of an exchange which is authorized by the clearing house to process trades for its customers, and which guarantees, through the collection of margin and variation monies, the",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.450478"
}