{
  "id": "c40dbcf2fa5c",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 157,
  "content": "840 —80.00 1480 short 39 NYA 260 calls 5928 ~819 214.11 -1716 short 39 NYA 260 puts 4563 -936 92.04 -1716 Totals -105 ~195 +40.35 -452 How can we interpret these sensitivities? Although the $delta of -105 indicates a preference for the market to fall rather than rise, in practice most traders would consider the position essentially $delta neutral since the preference is only very slight. In relative terms the $delta of -105 represents a position which is short only about 24% of an OEX contract (with a $delta of 440), or about 40 percent of an NYA contract (with a $delta of 260). But why does the position have a negative $gamma, positive $theta, and negative vega? The total negative $gamma of -195 seems to suggest that movement in the underlying contracts will hurt our position. If both the OEX and NYA were to move at the same rate, we can see from Figure 16-9 that this would indeed be true. But we don’t expect the OEX and the NYA to move at the same rate; we expect the NYA to move at only 87 percent the rate of the OEX. If we multiply our NYA $gamma position by .87, and then add it to our OEX $gamma position, it turns out that the total $gamma is very close to zero:° (720 + 840) — .87 x (819 + 936) = 33 This reflects the fact that we are relatively insensitive to movement in the two indexes as long as the NYA moves at 87% the rate of the OEX. 4. Ina perfectly balanced intermarket spread the total $delta, $gamma, $theta, and $vega would in fact add up to exactly zero. 5. Ibid. Intermarket Spreading 349 The same reasoning applies to our $vega position. The total negative $vega of -452 suggests that an increase in volatility will hurt our position. If the volatility of the OEX and NYA were to increase by the same amount this would be true. But if volatility rises, we expect NYA volatility to rise by only 87% of OEX volatility. If we multiply our NYA $vega position by .87, and then add it to our OEX $vega position, the total the total $vega is approximately zero:° (1500 + 1480) — .87 x (1716 + 1716} = -6 This reflects the fact that we are insensitive to changes in volatility as long as NYA volatility is 87% of OEX volatility. From these examples, we can see that the actual $gamma, $theta, and $vega positions should reflect the relative volatilities of the underlying contracts. In our example we have: total $gamma = OEX $gamma + (NYA $gamma x [NYA volatility/OEX volatility]} total $theta = OEX $theta + (NYA $theta x [NYA volatility/OEX volatility]) total $vega = OEX $vega + (NYA $vega x [NYA volatility/OEX volatility}) When we do this, we find that our intermarket spread is insensitive to price movement, to the passage of time, and to changes in volatility, as long as the NYA moves at 87% the rate of the OEX. Suppose that instead of selling at-the-money NYA straddles to offset our purchased at-the-money OEX straddles, we decided to sell NYA strangles. For example, we might establish the following $delta neutral position: buy 20 OEX 440 calls sell 69 NYA 270 calls buy 20 OEX 440 puts sell 96 NYA 250 puts Since the OEX 440 call has a $delta of 259 and the NYA 270 call has a $delta of 75, for each OEX 440 call we buy, we must sell 259/75, or approximately 3.45 NYA 270 calls. In the same way, since each OEX 440 put has a $delta of -196 and each NYA 250 put has a delta of -41, for each OEX 440 put which we buy, we must sell 196/41, or approximately 4.78 NYA 250 puts. Having purchased 20 OEX 440 straddles, to establish a $delta neutral intermarket spread we must sell 69 NYA 270 calls and 96 NYA 250 puts. The sensitivities of this position are: Position $delta $gamma $theta $vega long 20 OEX 440 calls 5180 720 -185.80 1500 long 20 OEX 440 puts -3920 840 -80.00 1480 short 69 NYA 270 calls -5175 -1242 279.45 -2691 short 96 NYA 250 puts 3936 —1248 177.60 —2688 Taking into consideration the multiplication factor of .87 for the NYA $gamma, $theta, and $vega, the total sensitivities for our spread are: 6. Ibid, 350 Chapter 16 $delta = 5180 — 3920 —- 5175 + 3936 = +21 $gamma = 720 + 840 — .87 x (1242 + 1248) = -606 $theta = -185.80 — 80.00 + .87 x (279.45 + 177.60) = +131.83 $vega = 1500 + 1480 - .87 x (2691 + 2688) =-1700 Even though the $delta position is approximately neutral, the negative $gamma, positive $theta, and negative $vega suggest that the spread will act like a short straddle: any large move in the underlying market or increase in volatility will hurt the position, and the passage of time or a decline in volatility will help the position. If we do such a spread, we are not only taking a position on the relative volatilities of the two underlying markets, we are also taking a position that the implied volatilities in the two markets are too high. What type of position would we initiate if the relative volatilities were incorrect, and at the same time the trader felt that implied volatilities were too low? In this case we would try to create a position with a positive $gamma, negative $theta, and positive $vega. For example, we might buy the OEX 425/455 strangle and sell the NYA 260 straddle: buy 20 OEX 4235 calls sell 18 NYA 260 calls buy 20 OEX 455 puts sell 14 NYA 260 puts Since the OEX 455 call has a $delta of 140 and the NYA 260 call has a $delta of 152, for each OEX 455 call we buy, we must sell 140/152, or approximately .92 NYA 260 calls. In the same",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.446512"
}