{
  "id": "732276902c97",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 32,
  "content": "the prices of these products may range freely without upper limit, often exceeding 100. They are therefore most often evaluated using a traditional pricing model, although interest rate products present other problems that may require specialized pricing models. It is possible to take an instrument such as a bond and calculate the current yield based on its price in the marketplace. If we were to take a series of prices and from these calculate a series of yields, we could also calculate the yield volatility, i.e., the volatility based on the change in yield. We might then use this number to evaluate the theoretical valte of an option on the bond, although to be consistent we would also have to specify the exercise price in terms of yield. Because it is possibie to calculate the volatility of an interest rate product using these two different methods, interest rate traders sometimes refer to yield volatility (the volatility calculated from the current yield on the instrument) versus price volatility (the volatility calculated from the price of the instrument in the marketplace). TYPES OF VOLATILITIES When traders disctiss volatility, even experienced traders may find that they are not always talking about the same thing. When a trader makes the comment that the volatility of XYZ is 25%, this statement may take on a variety of meanings. We can avoid confusion in subsequent discussions if we first define the various ways in which traders interpret volatility. Future Volatility Future volatility is what every trader would like to know, the volatility that best describes the future distribution of prices for an underlying contract. In theory it is this number to which we are referring when we speak of the volatility input into a theoretical pricing model. If a trader knows the future volatility, he knows the right “odds.” When he feeds this number into a theoretical pricing model, he can generate accurate theoretical values because he has the right probabilities. Like the casino, he may occasionally lose because of short-term bad luck. Butin the long run, with the odds on his side, a trader can be fairly certain of making a profit. Of course, traders rarely talk about the future volatility since it is impossible to know what the future holds. Historical Volatility Even though one cannot know the future, if a trader intends to use a theoretical pricing model he must try to make an intelligent guess about the future volatility. In option evaluation, as in other disciplines, a good starting point is historical data. What typically has been the volatility of this contract over some period in the past? If, over the past ten years the volatility of a contract has never been less than 10% nor greater than 30%, a guess for the future volatility of either 5% or 40% hardly makes sense. This does not 70 Chapter 4 mean that either of these extremes is impossible (in option trading the impossible always seems to happen sooner or later), but based on past performance, and in the absence of any extraordinary circumstances, a guess within the historical limits of 10% and 30% is probably more realistic than a guess outside these limits. Of course, 10% to 30% is still a huge range, but at least the historical data offers a starting point. Additional informa- tion may further narrow the estimate. Note that there are a variety of ways to calculate historical volatility, but most methods depend on choosing two parameters, the historical period over which the volatility is to be calculated, and the time interval between successive price changes. The historical period may be ten days, six months, five years, or any period the trader chooses. Longer periods tend to yield an average or characteristic volatility, while shorter periods may reveal unusual extremes in volatility. To become fully familiar with the volatility characteristics of a contract, a trader may have to examine a wide variety of historical time periods. Next, the trader must decide what intervals to use between price changes. Should he use daily price changes? Weekly changes? Monthly changes? Or perhaps he ought to consider some unusual interval, perhaps every other day, or every week and a half. Surprisingly, the interval which is chosen does not seem to greatly affect the result. Although a contract may make large daily moves, yet finish a week unchanged, this is by far the exception. A contract which is volatile from day to day is likely to be equally volatile from week to week, or month to month. This is typified by the graphs in Figure 4-8. The data points on the three graphs represent the volatility of the S&P 500 index over successive 50-day periods. For the solid line daily price changes were used, for the dotted line price changes every two days were used, and for the broken line price changes every 5 days were used. Even though the graphs occasionally diverge, for the most part they exhibit the same general volatility levels and trends. As a general rule, services which supply historical volatility data base their calcula tions on daily settlement-to-settlement price changes. If this is not the case, an explana- tion of how the volatility was calculated will usually accompany the data. If, for example, a service gave the volatility of a contract for the month of August as 21.6%, it can be assumed that the calculations were made using the daily settlement-to-settlement price changes for all the business days during that month. Historical and future volatility are sometimes referred to as realized volatility. Forecast Volatility Just as there are services which will attempt to forecast future directional moves in the price of a contract, there are also services which will attempt to forecast the future volatility of a contract. Forecasts may be for any period, but most commonly cover periods identical to the remaining life of options on the underlying contract. For an underlying contract with three months between expirations, a service might forecast volatilities for the next three,",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "fundamentals",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.427220"
}