{
  "id": "27bee42efcfe",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 88,
  "content": "mark for the uptrend . Climax Failures FIGURE 10.27 Does This Climax in Cotton Set Up a Short Trade? @SI- Daily Silver Continuous Contract (Sep11] 28.000 Feb Mar Apr l,lay @CT- Daily Cotton No. 2 Continuous Contract (Dec11] 35.00 30.00 25.00 ~ ~2.00 ------== ----- ~ ---- --- 1 00 ------ - . Jun Jul Aug Sep 133 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 326 TRADING STRATEGIES The chart in Figure 10.27 has all of the signs of a classic buying climax: it is in a mature trend, the trend has accelerated into steeper trend legs, there have been multiple thrusts above the Keltner channels, the MACD shows a glaring momentum divergence, there are numerous free bars above the upper channel, and the last bar suggests a break- down may have begun. In fact, the last bar on this chart is a standard failure test entry of the highs following a climax. Is this a good entry? FIGURE 10.28 A Parabolic Climax Can Extend Much Further Than Anyone Would Expect A failure test entry at the point of A in Figure 10.28 would have failed after reach- ing the ﬁrst target. With proper trade management, this trade would have been a scratch or a small proﬁt. However, the point here is that countertrend trades initiated in climax patterns are subject to failure, and when they do fail, they will do so through trend con- tinuation. In this case, after further consolidation, the trend continued, accelerating even more dramatically. Note that there was no other entry on this chart, not even at the ultimate collapse at B. Many traders will look at a chart like this and try to ﬁnd some way they could have entered a trade. This is a mistake. Your job as a trader is simply to trade well-researched patterns that are in alignment with the underlying tendencies of the market. There are many large moves in the market that do not offer an attractive entry point. This is one of them. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: The Anti 327 THE ANTI The Anti is a pullback variation, distinguished by its position in the overall market struc- ture. Most pullbacks come in established trends or following strong momentum moves that could lead to an extended trend. The Anti comes after a potential trend change and is an attempt to enter a new trend early in its formation. Risk management and correct proﬁt-taking plans are important for correct management of this trade. Anti 1 FIGURE 10.29 A Parabolic Expansion Sets Up a Sell Anti in First Majestic Silver Corporation (NYSE: AG) Setup A: Though not as dramatic as Figures 10.27 and 10.28, the chart in Figure 10.29 shows a small buying climax in AG. Note the multiple free bars, range expansion (large bars relative to prior history), and that this move is a radical departure from the previous trending history visible on this chart. B: After a small consolidation, prices retreat from the highs in a very sharp sell-off. This sell-off is strong evidence of a change of character and suggests that the . ontmuous Co on No 2 c • @CT(D) - Daily Cott ntract (Dec111 40.00 30.00 ~ - --~ --=--::.:Z::::::-- -- ~~ - \" ~- ~A~U;-9 ~~-~....,....,-~- ~-:..::_;,-~ - ,, , 10.00 S.o Oct ~ :•:, Nov AG- Daily F' irst Majestic s·1v 1 er Corp 18.00 16.00 14.00 12.00 134 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 328 TRADING STRATEGIES dominant group, the buyers, have at least temporarily lost control of this market. At this point, there is a much lower probability of the uptrend continuing, though markets will sometimes be able to absorb a shock like this and to continue. Entry C: The ﬁnal nail in the cofﬁn for the uptrend was the reluctant bounce here. Had the buyers been able to regain control, this move would have been much sharper and much cleaner and the stock would have quickly traded to new highs. This slow bounce is the Anti pattern, and is more likely to be a pullback preceding another leg down. The actual entry, in this case, was on a breakdown of the previous bar’s low. This entry would have been justiﬁable on the bar marked C, but it did not trigger. Stop There are two possibilities for stop location, both shown on this chart. A near stop could be placed just above the extreme of the setup bounce, while the farther stop should be above the high of the trend. There is no point putting a stop in between as there is no compensation, in the form of higher probability, for the larger loss. FIGURE 10.30 A Successful Sell Anti P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: The Anti 329 D: Though the stock recovered to close above the midpoint of the session, this strong down day in Figure 10.30 is conﬁrmation that the balance of power has shifted, and should add conﬁdence to the trade. Note also that, depending on the exact location of the entry and the stop, the ﬁrst target may have been hit on this ﬁrst downward bar. Do not expect that every one of these will be a clean",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.709160"
}