{
  "id": "8c54371e0e8b",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 16,
  "content": "Dudes, which makes an ugly, lightweight, extraordinarily comfortable, cheap slip-on shoe that started trending in Middle America. Wall Street thought that Hey Dudes was a joke and that the acquisition was a desperate move by Crocs to buy revenue growth. I knew that Hey Dudes was one of the hottest companies in the entire shoe world when Crocs acquired them. I had been following this privately held company for years, wishing I could invest in it. The Wall Street analysts that cover this sector are out of touch. They have no sense of reading consumer culture. They don’t have a clue what’s happening in the real world. The problem with Hey Dudes was that they had inadequate distribution and limited ability to expand their store locations. So, although their numbers were decent, I knew that given the proper distribution and increased stores, their sales could explode. The Crocs team knew this as well because they’re savvy. I went all in on Crocs after the stock had fallen from a high above $180 to under $50. The stock is now back over $100 only four months later. Yes, but what does TikTok have to do with this trade? 52 If I have a trading thesis that I originate by visiting the mall or some other experience in my life, it could easily be biased and therefore wrong. TikTok, with its billion participants, provides a place where I can test and validate my thesis. TikTok is how I assessed the love people had for Hey Dudes shoes. I could see the videos with people who were obsessed with the brand. I could read 500 comments with a typical post reading, “OMG, I got my husband a pair of Hey Dudes for his birthday, and now he has eight pairs.” It was almost like a cult following. Wall Street doesn’t see cultural shifts happening in Middle America. They’re looking at what happened two or three months ago. I’m looking at what’s happening today, and TikTok is my tool. How do you gauge whether the number of videos or comments you see for a product is meaningful? For example, in our original interview, you mentioned that the conversational volume for Stranger Things stayed high far longer than for any prior hit show. You had a benchmark. What is your benchmark in TikTok? How do you know if the videos and comments you see for a product are exceptional in number or enthusiasm? Great question because that’s all that matters. You have two benchmarks. One benchmark is the volume of videos relative to the past. What’s great about TikTok is that you can search the videos by timeline. So you can see whether the video view counts, likes, and comment counts are growing substantially over time. A second benchmark is to use comparisons with similar companies and to see how their counts have changed from the past. But when you spend enough time on TikTok, you get a sense of what’s meaningful and what’s not. A lot of this analysis is qualitative, not quantitative. Immersing myself in the conversation allows me to gain a deeper understanding of the tone and sincerity of the speakers, which is often the deciding factor in assessing the validity of the trade thesis. Are you using TikTok more than Twitter now? One hundred times more. Any other examples of trade ideas that came from TikTok? Another one of my big wins was lululemon. The company moved to expand into younger demographics, and no one knew whether it would work. They came up with a new product called the lululemon crossbody bag, which was sort of a fanny pack that you wore as a shoulder bag rather than around 53 the waist. It became one of the most popular products of 2022. Through TikTok, I identified early on that the product was going viral. Although the sales of the crossbody bag alone were not meaningful enough to move the needle for lululemon, the attention it brought to the brand through web traffic and foot traffic in their stores increased the sales of their other merchandise, and they had one of their strongest quarters ever. Whereas Wall Street had to wait to see this sales trend play out in the numbers to believe it, as an observation investor watching TikTok videos, I was able to surface and verify this development early on. There has never been a better platform than TikTok for uncovering things early and deciphering the world’s thoughts and behavior in real time. It’s everything I ever wished for as a social arb investor. My only question is: How long do I have before other people catch on? You would think that people would catch on quickly, but I know from experience that I have a pretty long runway—definitely years, not months. There has been talk that Congress might ban TikTok. What would you do if this happens? As an observational investor, my success is rooted in my capacity to immediately recognize shifts in consumer behavior and culture, and I have become heavily dependent on TikTok to obtain real-time insights. I am not worried about Congress banning TikTok, as the transition from social graph-based platforms such as Facebook and Instagram to content- driven social networks like TikTok will most likely continue through the emergence of new platforms. The golden age of social intelligence is not going away anytime soon. Why do you call your YouTube channel Dumb Money? “Dumb money” is how Wall Street refers to ordinary people like me. I didn’t graduate from an Ivy League school. I didn’t work for a financial firm. So, I would be considered an outsider. I’m dumb money. What prompted you to start the YouTube channel? Part of my life mission is to pull as many people as I can into the investor class. Turning ordinary people into investors is the only way to solve the wealth gap. If we are going to depend on the education system to get 54 people excited",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "fundamentals",
    "market_structure",
    "strategies",
    "crypto",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:44.180635"
}