{
  "id": "06df0b3fd7d6",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 152,
  "content": "crack spread is:! ($.54 x 42} - $19.00 = $3.68 per barrel If the refiner is satisfied with the $3.68 profit margin, he might protect his position by purchasing crude oil futures at $19.00 and selling an equal number of gasoline futures at $.5.400.? If, however, he has an opinion on the volatility of either crude oil or gasoline, and this opinion differs from the implied volatility in the option market, he can take either position in options. If he feels that implied volatility in crude oil is unusually low (high), he can take his long position by purchasing calls (selling puts). If he feels that implied volatility in gasoline is unusually low (high), he can take his short position by purchasing puts (selling calls). While most intermarket spreads consist of opposing positions in two different markets, there is no reason why an intermarket spread cannot be extended to multiple instruments. For example, some refining operations produce a combination of both gasoline and heating oil. In a typical combination 3:2:1 crack spread, from each three barrels of crude oil which the refiner purchases he expects to produce two barrels of gasoline and one barrel of heating oil. With crude oil at $19.00 per barrel, gasoline at $.5400 per gallon, and heating oil at $.5800 per gallon, the value of a3:2:1 crack spread is: ((2 x 42 x $.5400) + (1 x 42 x $.5800) — (3 x $19.00)| / 3 = $4.24 per barrel 1. Since gasoline and heating oil are quoted in cents per gallon, and a barrel contains 42 gallons, the gasoline or heating oil price must be multiplied by 42 in order to calculate its price per barrel. 2. Although this is not a $delta neutral position, since the dollars at risk in crude oil are not equal to the dollars at risk in gasoline, it is still an intermarket spread since one market is being spread off against another market. 336 Chapter 16 Again, if the refiner is satisfied with the $4.24 profit margin, he can simply buy crude oil futures and sell gasoline and heating oil futures in a 3:2:1 ratio. For each three crude oil futures which he purchases, he can sell two gasoline futures and one heating oil future. If, however, the refiner has an opinion on the volatility of any of these products, he may find it advantageous to take his long or short position in the option market rather than in the futures market. VOLATILITY RELATIONSHIPS A close price relationship between markets may also mean that the markets have similar volatility characteristics. This may enable the trader to identify mispriced options without the necessity of picking the right volatility for either market. Returning to our ABC and XYZ contracts, suppose that a trader thinks ABC will be stronger than XYZ, and wants to take a long position in ABC and a short position in XYZ. If the implied volatility of ABC is 20% and the implied volatility of XYZ is 24%, the trader might now have reason to take his position in options rather than in the underlying instruments. If the market were to rise, the trader expects ABC to go up faster than XYZ since ABC is expected to be stronger than XYZ. In the trader’s estimation, ABC ought to have a greater volatility. But the implied volatilities reflect the opposite view. The marketplace seems to believe that if both ABC and XYZ rise in price, XYZ (with its implied volatility of 24%) will rise more quickly than ABC {with its implied volatility of 20%). Clearly, the prices in the marketplace do not reflect the trader’s opinion of market conditions. The trader can take advantage of this situation by purchasing ABC calls and selling XYZ calls. Note that the trader has not made any attempt to predict the right volatility for either ABC or XYZ. He has simply made the assumption that the implied volatilities do not reflect his view of market conditions, If the trader wants to construct a $delta neutral spread he must still determine the delta of the options involved. Since the $delta, like all deltas, is sensitive to changes in volatility, it may seem that the trader will need a specific volatility to calculate the $delta. He can avoid this problem if he decides to use at-the-money options. No matter what the volatility, he knows that an at-the-money option will have a delta of approxi- mately 50. If ABC is trading at 50 and XYZ is trading at 100, he can buy ABC 50 calls with an implied volatility of 20%, and sell XYZ 100 calls with an implied volatility of 24%. If there are 70 days remaining to expiration, with interest rates at 6%, the price of the ABC 50 call would be 1.73 (a dollar price of $692) and the price of the XYZ 100 call would be 4.14 (a dollar price of $414). Since the $delta of ABC is $200 and the $delta of XYZ is $100, a typical $delta neutral spread might consist of purchasing 10 ABC 50 calls and selling 20 XYZ 50 calls. The value of such a spread at expiration is shown in Figure 16-1. In Figure 16-1 we can see that if ABC is stronger than XYZ, as the trader believes, the spread will show an ever increasing profit as ABC continues to outperform XYZ. Note that the trader will also show a profit if the market falls in both ABC and XYZ, or if ABC and XYZ move up at the same rate. This is because the trader received more for the XYZ options which he sold than he paid for the ABC options which he bought. If Intermarket Spreading 337 Figure 16-1: Long 10 ABC 50 Calls/Short 20 XYZ 100 Calls ABC moves up twice as fast as XYZ ABC moves up 33% \\ a faster than XYZ n oO g _e a oS a - a ie a a ABC moves up at the same",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.445756"
}