{
  "id": "ddba28d26465",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 84,
  "content": "above calculations we can see that spread 4 has the best volatility characteristics since its vega/theoretical edge is closest to zero. This is the same conclusion we reached from Figure 9-8, but without the necessity of doing a detailed study of each spread. Note that when we divide the sensitivity of a spread by its theoretical value, the result is independent of the size of the spread. If we had done spread 4 twice as large (40 x 60 instead of 20 x 30) this would have doubled the size of both the vega and the theoretical edge. The resulting fraction would still have been -.311. What about the risk of a large move in the price of the underlying contract? We do not need to worry about large price moves in spread 5 since its positive gamma means that a large move can only enhance the value of the position. However, we might still want to compare spreads 4 and 6 for gamma risk. Dividing the gamma by the theoretical edge we have: X Spread 4: -72.0/2.70 26.7 Spread 6: -56.0/2.90 = -193 Risk Considerations 187 We can see that spread 6 is at less risk from a large move in the price of the underlying contract because ~19.3 is closer to zero than -26.7. This confirms the conclusion from Figure 9-9, Aword of warning about this method of estimating the relative riskiness of a spread. Because an option’s sensitivities are only well defined within a narrow range, dividing the risk sensitivity by the theoretical edge offers only an estimate of the relative riskiness of a position. Consider, for example, the relative volatility risks of spreads 1, 2, and 3. Dividing the vega by the theoretical value for each spread we have: Spread 1: ~1.368/2.86 = -.478 Spread 2: -.435/3.00 = -.145 Spread 3: -.630/2.80 = 225 From these numbers it appears that spread 2 is the least risky with respect to volatility since —.1 45 is closer to zero than —.478 or —.225. But going back to Figure 9-4 we find that spread 3 actually has the highest implied volatility, and therefore the least volatility risk. Even so, this method would have at least warned us away from spread 1, which clearly has the greatest volatility risk. Sometimes, if a trader is under great pressure to make a quick decision, he may not have the time to make even a cursory analysis of relative riskiness of various spreads. In such cases, he will often have to rely on his instincts in choosing a strategy. While there is no substitute for experience, most traders quickly learn an important rule: straddles and Strangles are the riskiest of all spreads. This is true whether one buys or sells these strategies. New traders sometimes assume that the purchase of straddles and strangles is not especially risky because such strategies have limited risk. But it can be just as painful to lose money day after day when one buys a straddle or strangle and the market fails to move, as it is to lose the same amount of money all at once when one sells a straddle and the market makes a violent move. Of course, a trader who is right about volatility can reap large rewards from straddles and strangles. But an experienced trader knows that such strategies offer the least margin for error, and he will usually prefer other strategies with more desirable risk characteristics. HOW MUCH MARGIN FOR ERROR? New traders sometimes ask what is a reasonable margin for error in assessing the inputs into a theoretical pricing model, particularly when it comes to the volatility input. As is often the case, it will depend on the trader’s experience in the market in which he is trading. In some cases, 5 percentage points may be an extremely large margin for error, and the trader will feel very confident with any strategy passing such a test. In other cases, five percentage points may be almost no margin for error at all, and the trader will find that the strategy is a constant source of worry. Perhaps a better way to approach the question is to ask not what is a reasonable margin for error, but rather to ask what is the correct size in which to do a spread given a known margin for error. Practical trading considerations aside, a trader should always choose the spread with the best risk/reward characteristics. But sometimes even the 188 Chapter 9 best spread will have only a small margin for error, and consequently entail significant risk. In such cases a trader, if he wants to make a trade, ought to do so in small size. If, however, a trader can execute a spread with a very large margin for error, he ought to be willing to do the spread in much larger size. As an example, consider a trader whose best estimate of volatility in a certain market is 15%. If implied volatility is higher than 15% he will look for positions with a negative vega. If the best negative vega strategy the trader can findisa 1 x 2 ratio vertical spread with an implied volatility of 161% (only a 1%-percentage-point margin for error}, he will almost certainly keep the size of his strategy small, perhaps executing the spread only five times (5 x 10). If, however, the same spread has an implied volatility of 25% (a 10-percentage-point margin for error), and the trader has never seen volatility go that high, he may have the confidence to execute the spread in much larger size, perhaps 50 x 100.4 The size of a trader’s positions should depend on the riskiness of the positions, and this in turn depends on how much can go wrong without the strategy turning against the trader. DIVIDENDS AND INTEREST In addition to the delta, gamma, theta, and vega risks which all traders must consider, stock option traders might also have to consider the risk of changes in dividends and interest",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.435306"
}