{
  "id": "805bd20e4b3a",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 128,
  "content": "Chapter 4. If the high temperature yesterday was 25°, and we had to guess what the high temperature today would be, a guess of 30° would make more sense than a guess of 50°. Once we realize this, we might logically choose to give the greatest weight to the volatility data covering a time period closest to the life of the options in which we are interested. That is, if we are trading very long-term options, the long-term data should get the most weight. If we are trading very short-term options, the short-term data should get the most weight. And if we are trading intermediate-term options, the intermediate-term data should get the most weight. Suppose we are interested in evaluating six-month options. How should we weight our data? Since 120 (trading) days is closest to six months, we can give the 120-day data the greatest weight, and give other data correspondingly lesser weight: (15% x 24%) + (25% x 20%} + (35% x 18%} + (25% x 18%) = 19.4% Alternatively, if we are interested in 10-week options, we can give the greatest weight to the 60-day volatility data: (25% x 24%) + (35% x 20%) + (25% x 18%) + (15% x 18%) = 20.2% In the foregoing examples we used only four historical volatilities, but the more volatility data which is available, the more accurate any volatility forecast is likely to be. Not only will more data, covering different periods of time, give a better overview of the volatility characteristics of an underlying instrument, but it will enable a trader to more closely match historical volatilities to options with different amounts of time to expiration. In our example we used historical volatilities over the last 60 days and 120 days as approximations to forecast volatilities for six-month and 10-week options. Ideally, we would like historical data covering exactly a six-month period and exactly a 10-week period. The method we have described is one which many traders intuitively use to forecast volatility. It depends on identifying the typical characteristics of volatility, and then projecting a volatility over the forecasting period. Theoreticians have recently tried to take essentially the same approach to volatility forecasting, and this has led to the development of autoregressive conditional heteroskedasticity (ARCH) and generalized Volatility Revisited 281 autoregressive conditional heteroskedasticity (GARCH) volatility models. A detailed discussion of such models is beyond the scope of this text, since they can be mathemati- cally complex and are not widely used among traders. Nevertheless, an option trader should be aware that these models do exist, and that they are simply an attempt to apply the mean reverting and serial correlation characteristics of volatility to volatility forecast- ing.” , Thus far we have focused only on the historical volatility characteristics of the underlying instrument in trying to forecast a volatility. Is there any other information which might be useful? No individual trader can hope to know everything affecting price changes in an underlying contract. Perhaps there are factors which could affect the future volatility, but about which the trader is unaware. If one believes that such information is likely to be reflected in the prices of the contracts being traded, one way to ferret out additional volatility information is to look at the prices of options. In other words, a trader will want to look at the implied volatility in the marketplace to find the consensus volatility. Once he has done this, he will want to use this information in any volatility forecast he intends to make. How much weight should a trader give the implied volatility? Some traders subscribe to the efficient market principle, and believe that the implied volatility is always the best volatility forecast since it reflects all available information. Most traders believe, however, that while the implied volatility is important, it isn’t the whole story. Typically, a trader might give the implied volatility a weighting somewhere between 25% and 75% in making a volatility forecast. How much depends on the trader’s confidence in forecasting a volatility based on historical volatility data? If a trader feels very confident about his forecast, he might give the implied volatility as little as a 25% weight; if he feels uncertain about his forecast, he might give the implied volatility as much as a 75% weight. Of course, his confidence level will depend on his experience, as well as how conclusive the historical data is. For example, suppose a trader has made a volatility forecast of 20% based on historical data, and that the implied volatility is currently 24%. If the trader decides to give the implied volatility 75% of the weight, his final forecast will be: (75% x 24%) + (25% x 20%) = 23% On the other hand, if the trader decides to give the implied volatility 25% of the weight, his final forecast will be: 2. For further information on ARCH and GARCH models see: Engle, R.F., “Autoregressive Conditional Heteroskedaticity with Estimates of the Variance of United Kingdom Inflation,” Econometrica, Vol. 50, Na. 4, 1982, pages 987-1000. Bollerslev, T., “Generalized Autoregressive Conditional Heteraskedasticity,” Journal of Economics, No. 31, April 1986, pages 307-327. Bollerslev, T., “A Conditional Heteroskedastic Time Series Model for Speculative Prices and Rates of Return,” Review of Economics and Statistics, No. 69, August 1987, pages 542-547, Nelson, David B., “Conditional Heteroskedasticity in Asset Returns: A New Approach,” Econometrica, No. 59, 1991, pages 347-370 Kuberek, Robert C., “Predicting Interest Rate Volatility: A Conditional Heteroskedastic Model of Interest Rate Movements,” Journal of Fixed Income, Val. 1, No. 4, March 1992, pages 21-27. 282 Chapter 14 (25% x 24%) + (75% x 20%) = 21% Finally, if the trader decides to give the implied volatility half the weight, his final forecast will be: (50% x 24) + (50% x 20) = 22% A PRACTICAL APPROACH No matter how painstaking a trader’s method, he is likely to find that his volatility forecasts are often incorrect, and sometimes to a large degree. Given this difficulty, many traders find it easier to",
  "word_count": 1000,
  "topics": [
    "options",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.441996"
}