{
  "id": "4a9f9b6b804d",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 4,
  "content": "h e mar k et quic kl y erase d t h e mornin g rally . How did this happen? Nathan explained it later that evenin g . “I was thinkin g a t t h e time t h at it wou ld b e premature to exit suc h a g oo d tra d e. I t h ou gh t, ‘H ey, I ’m in a g reat trade and I don’t want to cut a winnin g trade short. ’ I was feelin g very g ood about my trade and I thou g ht holdin g it was the ri g ht thin g to do. I thou g ht the mar k et was o b vious ly b u ll is h an d I s h ou ld h o ld on. ” FIGURE 1.4 Nat h an ’s Long Tra d e Source: Tra d eStation T ec h no l ogies, Inc. U.S. 10--Ytu Trtas ■ ry Kole Fut ■ ttS Osi:ly Continuation C h:art 1111 '1 11 II ,,111 I' A B U.S. 10•\\'nrTrta, ■ r)' Nolt .~■ l ■ rt'-' Tndhlg Tim~ Fram~ Intra day Cllul 133\"11,0 t:M'ltt 5 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 23TRADERS’ MENTAL BLIND SPOTS N a t h an app l ie d t h e representativeness h euristic, w h ic h l e d h im to b e l ieve t h at t h e mar k et was “o b vious l y ” b u ll is h . Nat h an jumpe d to t h e conc l usion t h at t h e up move resem bl e d strong l y b u ll is h b e h avior w h en, in rea l ity , t h e mar k et was not b u ll is h . Simi l ar to Zoe ’s can dl estic k pattern, mere b u ll is h appearance d oes not necessari l y mean the market is going higher. Nathan’s intuitive mind mentally locked into the morning ra ll y an d its impression o f strengt h . He was operating wit h in a menta l bl in d spot. Wit h out f urt h er t h oug h t, h e rep l ace d h is t h oroug h nig h t l y ana l ysis wit h t h e easy question of: Did the market look bullish? Drawn to the salience of the morning ra ll y, h is intuitive min d was una bl e to d etect t h at t h is was a mere f aça d e in t h e l arger d owntren d . A l t h oug h t h e b ase rate pro b a b i l ity f avore d f urt h er d ownsi d e movement, Nat h an—as is typica l wit h representativeness—too k no notice o f w h at was pro b a bl e. Y ou mig h t b e as k ing h ow cou ld t h is h appen? A f ter a ll , Nat h an h a d d eve l ope d a game p l an to se ll t h e mar k et at E. How d i d t h at get ignore d ? Reca ll again t h e b at an d b a ll an d wi dg ets pro bl ems a b ove. Remem b er h ow quic kl y your min d came to t h e incorrect answer, an d a l so, h ow swi f t ly an d uncritica lly it was accepte d ? T h is is h ow our min d s ten d to operate w h en caug h t in a menta l bl in d spot. Our intuitive min d swiftly develops a seemin g ly reasonable answer to a problem and our deliberative mind, rather than en g a g in g in the e ff ortful task of thinkin g throu g h the problem, simply accepts what intuitive mind o ff ers. Y ou mi g ht even say that there is a little mental slei g ht‐of‐hand bein g done by the mind. Intuitive mind can’t really g rapple with a question as complex as the probabili - ties o f mar k et d irection. De l i b erative min d is equippe d to d ea l wit h t h e comp l exity FIGURE 1.5 N a t h an ’s Loss Due to Representativeness Source: Tra d eStation T ec h no l ogies, Inc. 6 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 33TRADERS’ MENTAL BLIND SPOTS TABLE 1.1 Common Cognitive Heuristics and Biases: Descriptions and Suggestions Heuristic/Bias Description Suggestions Re p resentativeness H eu ri st i c A ssuming an event is an accurate r epresentation of a class (e.g., assumin g a chart pattern represents a true directional pla y ). Especiall y c ommon in tradin g. Pa y close attention to the base rate of a trade setu p. B e a w a r e o f",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "psychology",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:45.717772"
}