{
  "id": "2a89065ad5bb",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 53,
  "content": "SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 163 FIGURE 6.9 A Breakout on the Intraday (Left Pane) Serves as an Entry into the Higher Time Frame Pattern time frame. Figure 6.9 shows an example in Dendreon Corporation (Nasdaq: DNDN) in which a breakout of resistance on the 78-minute time frame provided a good entry into the pullback on the daily chart. Taken by itself, the breakout on the 78-minute is not a compelling entry—it is a valid breakout, but it does not have any supporting factors that make it an exceptional trade. The daily chart provides context for this otherwise unimpressive breakout, and the upward momentum from the intraday time frame transi- tioned into a larger move on the daily time frame. This is a single example, but the same concept can be applied to any set of properly related time frames: 1-minute/5-minute, 10-minute/30-minute, daily/weekly, or weekly/monthly. Some traders simplify this approach to merely trading breakouts of the previous bar on the trading time frame. Over a large set of trades, this approach is hit or miss because the high of the trading time frame bar may or may not actually be an important point in the market or on the lower time frame. There is no magic to a breakout of the bar on any time frame, because the chart is simply a representation of the underlying market. In most cases, paying attention to lower time frame price action will allow for cleaner entries, but it is sometimes possible to identify clear support and resistance on DNON - 78 min Dendreon Corp 4/4 4/S 4/6 4ll 4/8 4/11 4/12 4/13 4/14 42.00 41.00 , 40.00 35.00 Apr I 42.00 41.00 40.00 ltt l 39.00 ~ , 38.00 ,' 37.00 , 76 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 165 be able to enter the same trade very many times. Why play these games when a proper stop can be set that involves less work, lower transaction costs, and better payout? Proﬁt Target The same proﬁt targets apply to all pullback trades. Comments This trade setup addresses the key issue of precisely timing the entry into the pullback pattern. In the best cases, the market will never return to the entry price and the trade will be easy and painless from that point. These cases where the trade works perfectly are a minority, but, even in other cases, the character of the move after the pullback often gives good information about the balance of buying and selling pressure in the market. This combination of a breakout trade nested within a pullback is a powerful tool for discretionary traders on all time frames. TRADING COMPLEX PULLBACKS Trade Type Trend continuation. Concept Complex pullbacks, which are pullbacks composed of two distinct coun- tertrend legs, are very common, especially in mature trends. A good understanding of these structures is important, because they will often result in losses for traders who are trading simple pullbacks. Furthermore, many of the best pullbacks—those followed by the strongest, cleanest moves—are complex pullbacks, so a comprehensive trading plan must embrace this pattern. Setup A complex pullback is a complete ABCD trend structure itself: the ﬁrst coun- tertrend leg is a lower time frame trend (counter to the higher time frame trend), fol- lowed by a retracement against the lower time frame trend (i.e., in the direction of the higher time frame trend), which is then followed by another countertrend leg. To actually trade these patterns, traders need to be aware of two distinct forms: one that shows the P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing 166 TRADING STRATEGIES FIGURE 6.10 A Complex Pullback in the EURUSD Note two clearly visible countertrend legs (AB and CD). three legs clearly and one that hides them, buried within the lower time frame structure. Figure 6.10 shows a near-perfect example of the ﬁrst type of complex consolidation that clearly shows three separate legs with an ABCD structure. There are other cases in which the structure of the complex consolidation is not as clearly visible on the trading time frame. The lower time frame will usually show the distinct trend legs, but they may not be visible on the trading time frame. For experienced traders, it is usually not necessary to explicitly examine the lower time frame, as the structure can usually be inferred from the trading time frame. At ﬁrst, it may be easiest to recognize this structure on candlestick charts because they better highlight the open- to-close direction within each period. Most candles in pullbacks will be colored against the trend that set up the pullback; that is, pullbacks in uptrends will consist of full candles (red on modern charting packages) and pullbacks in downtrends will usually be empty (green) candles. This second complex pullback pattern is one or two with-trend candles in the middle of what otherwise looks like a simple pullback. The with-trend candle or candles usually represent(s) an aborted attempt to resume the primary trend, and this Euro I US DoUar EURUS0-0•1, ~t :::: 1~ll~1lt- t----- -- - J1 -rf-- - ,~oo j '~\\ )~ \\\\ / _/ • 1' , moo 1.42000 i~? 77 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.703716"
}