{
  "id": "b6f99e8e035e",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 66,
  "content": "since it might very will expand to its full value of 5 points. If, however, there is a low probability of this occurring, and consequently a high probability that the underlying contract will finish outside the extreme exercise prices, a trader may only be willing to pay 14 or 3%, since he may very will lose his entire investment. Now we can see why a long butterfly tends to act like a ratio vertical spread. If a trader feels that the underlying contract will remain within a narrow range until expiration, he can buy a butterfly where the inside exercise price is at-the-money. If he is right, and the market does stay close to the inside exercise price, the butterfly will expand to its maximum value (Figure 8-9). A long butterfly tends to act like a ratio vertical spread since it increases in value as the underlying market sits still. In contrast, the trader who sells a butterfly wants the underlying market to move as far away from the inside exercise price as possible so that the position will expire with the underlying contract either below the lowest exercise price or above the highest exercise price. In this case, the butterfly will expire worthless and he will be able to keep the full amount he received when he sold the butterfly (Figure 8-10). A short butterfly tends to act like a backspread since it increases in value with movement in the underlying market. Why are the strategies in Figure 8-9 referred to as “long” butterflies, and the strategies in Figure 8-10 referred to as “short” butterflies? It is common practice to refer to a spread which requires an outlay of capital as a long, or purchased, spread. Ifa trader initiates a butterfly by purchasing the outside exercise prices and selling the inside exercise price, he has a position which can never be worth less than zero at expiration. The trader can therefore expect to lay out some amount of capital for the position when he initiates it. When the trader does this, he has purchased, or is “long,” the butterfly. (If a trader can initiate a long butterfly for a credit, he should do it as many times as the law will allow; he can’t lose.) When the trader sells the outside exercise prices and purchases the inside exercise price, he can expect to receive some amount of capital. He has sold, or is “short,” the butterfly. Since all butterflies are worth their maximum amount when the underlying contract is right at the inside exercise price at expiration, both a call and put butterfly with the same exercise prices and the same expiration date desire exactly the same outcome, and therefore have identical characteristics. Both the March 95/100/105 call butterfly and the March 95/100/105 put butterfly will be worth a maximum of 5 with the underlying contract right at 100 at expiration, and a minimum value of zero with the underlying contract below 95 or above 105. If both butterflies are not trading at the 148 Chapter 8 same price, there is a sure profit opportunity available by purchasing the cheaper and selling the more expensive.2 Ifa trader foresees a quiet market, why might he choose a long butterfly over some other type of strategy, for example a short straddle? An important characteristic of a butterfly is its limited risk. Ifa trader initiates a long butterfly in the belief that the market is unlikely to move very far from the current price, the most he can lose if he is wrong is the amount he laid out to purchase the butterfly. On the other hand, if a trader sells a straddle and the market makes a large move, his potential risk is unlimited. Regardless of theoretical considerations, some traders are not comfortable with the possibility of unlimited risk. If given the choice between purchasing butterflies and selling straddles, they will prefer the former strategy to the latter. Of course the straddle, while riskier, also has greater profit potential. If a trader intends to purchase butterflies but wants a potential profit commensurate with that of a short straddle, he will have to trade butterflies in much greater size. A trader who is considering the sale of 25 straddles might decide instead to buy 100 butterflies (100 x 200 x 100). While trading 100 spreads may appear riskier than trading 25 spreads, 100 butterflies may in fact be much less risky than 25 straddles because of the risk characteristics associated with a butterfly. A trader should never confuse size and risk. Risk often depends on the characteristics of the strategy, not on the size in which the strategy is executed. TIME SPREAD (also referred to as a calendar spread or horizontal spread) If all options in a spread expire at the same time, the value of the spread is simply a function of the underlying price at expiration. If, however, the spread consists of options which expire at different times, the value of the spread cannot be determined until both options expire. The spread’s value depends not only on where the underlying market is when the short-term option expires, but also on what will happen between that time and the time when the long-term option expires. Time spreads, sometimes referred to as calendar spreads or horizontal spreads,? consist of opposing positions which expire in different months. The most common type of time spread consists of opposing positions in two options of the same type (either both calls or both puts) where both options have the same exercise price. When the long-term option is purchased and the short-term option is sold, a trader is long the time spread; when the short-term option is purchased and the long-term option is sold, the trader is short the time spread. Since a long-term option will have more time value, and therefore a higher price than a short-term option, this is consistent with the practice of referring to any spread which is executed at a debit (credit)",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.432439"
}