{
  "id": "7280fc0680a2",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 32,
  "content": "the market to recover back above the trend line, and then to buy with a stop just under the low of the bar that broke the trend line. It is always important to ask why a pattern should work. In this case, there is a good explanation. The little spike beyond the short-term trend line is a buying or selling climax on lower time frames, so it is a natural exhaustion point for the countertrend move. Fur- thermore, there will be traders who exit their positions when those trend lines are bro- ken, and they will be forced to chase the market to get back in. Remember that trapped traders drive some of the best trades, and that traders can be as effectively trapped out of positions as in. The key to the success of this pattern is that the market should not spend much time outside the trend line. (The deﬁnition of “much time” depends on the time frame—if weekly bars, probably not more than two days. If daily bars, then probably not more than a few hours. But on a 1-minute chart, we would want to see prices back above the trend line in less than 30 seconds.) @KC(O) - Daily Coffee C Conmuous Contract [Jul11J '11 Apr 44 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 92 MARKET STRUCTURE Rate of Trend Markets rarely trend at one simple, consistent rate. It is very common to see a trend line broken and for the original trend to hold, albeit at a more shallow slope. This is one reason why naively trading on breaks of trend lines can be frustrating; these breaks are often simply moves into another degree, level, or rate of trend. Figure 3.40 shows trend lines redrawn to deﬁne the new rate of trend. This often has to be done many times in extended trends, leaving a characteristic fan of trend lines. It is also possible for a market to deﬁne a new, steeper trend. A common spot where this can occur is on a break beyond a parallel trend line, but this can also happen at any point in a trend if a catalyst further tips the supply/demand imbalance. In Figure 3.41, Cotton futures slowly ramp into a trend that eventually ends in a parabolic climax, and ever-steeper trend lines must be drawn to contain the new trend. These greatly accelerated trends will eventually reach rates that are unsustainable, as they often end in minor climax moves. At some point, trend lines will be more or less vertical, and it is important to avoid attaching too much signiﬁcance to a break of a nearly vertical trend FIGURE 3.40 A Fan of Trend Lines as the Intraday Russell 2000 Exchange-Traded Fund (ETF) (IWM) Finds New Rates of Trend on Small Breaks of the Trend Line IWM - 78 min iShares Russel 2000 Index Tr 74.00 72.00 70.00 68.00 66.00 64.00 62.00 60.00 2/5 2/9 2/16 2/22 Mar 313 315 319 3115 3119 3125 Apr 416 418 4114 4120 4/26 4/30 45 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 93 FIGURE 3.41 Steepening Trend Lines Are Needed to Deﬁne the Accelerating Trend in Cotton Futures line. They are still useful from the standpoint that they do deﬁne the rate of the trend, but they are also broken easily and with impunity. However, if these trend lines are marking parabolic markets, it is important to be responsive to the possibility of a dramatic col- lapse. Trend lines may not be the ideal tools to trade in these areas, but they can point out important structures and areas to watch. Character of Trend Legs One important question for discretionary traders to consider is how to weigh objective and subjective elements in technical analysis. Some things are simple and clear, which is one reason that many traders focus on indicators: Price is above the moving average, or it is not. The MACD histogram is higher than it was yesterday, or it is not. In each of these cases, there could not be much room for debate. However, when we start talking about things like character of moves or judging the conviction behind such moves, we are on shakier ground. Two analysts could look at the same chart and the same set of data, and come to different conclusions, and the same analyst might even make a different @CT- Oaiy Cotton No. 2 Continuous Contract [Jul11] 200.00 180.00 120.00 100.00 80.00 60.00 Oct '11 Apr 46 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing CHAPTER 4 On Trading Ranges The heavy is the root of the light. The unmoved is the source of all movement. —Daodejing (ca. 6 BCE) P rice action in trends is often not that difﬁcult to read, as there are a number of patterns that give insight into the integrity of the trend at any moment; trading ranges are more complicated because price action",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.700245"
}