{
  "id": "bc0692eff1b3",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 185,
  "content": "delivery of a fixed amount of a commodity at a predetermined price on some future date. All profits and losses are realized immediately, and result ina cash credit or debit based on daily changes in the settlement price of the contract. Futures-Type Settlement—A settlement procedure used by commodity exchanges whereby an initial margin deposit is made, but under which no immediate cash payment is made by the buyer to the seller. Cash settlement takes place at the end of each trading day based on the difference between the current day’s settlement price and the previous day’s settlement price or the original trade price. Gamma (T)—The sensitivity of an option’s delta to a change in the price of the underlying contract. Good ’til Cancelled (GTC)—An order to be held by a broker until it can either be executed or is cancelled by the customer. Guts—A strangle where both the call and the put are in-the-money. Haircut—On equity option exchanges, money deposited by a trader with the clearing house to ensure the integrity of his trades. This is similar to a margin requirement on a commodity exchange. Hedge Ratio—Delta Hedger—A trader who enters the market with the specific intent of protecting an existing position in an underlying contract. Horizontal Spread—A time spread. 424 Appendix A Immediate or Cancel (IOC)—An order which will automatically be cancelled if it is not filled immediately. An IOC order need not be filled in its entirety. Implied Volatility—Assuming all other inputs are known, the volatility which would have to be input into a theoretical pricing model in order to yield a theoretical value identical to the price of the option in the marketplace. In-Option—A type of barrier option which becomes effective only if the underlying instrument trades at some predetermined price prior to expiration. In-Price—The price at which the underlying instrument must trade before an in-option becomes effective. In-the-Money—A call (put) option whose exercise price is lower (higher) than the current price of the underlying contract. Index Arbitrage—One of several strategies attempting to take advantage of the relative mispricing of options, futures contracts, or the physical stocks underlying a stock index. Intermarket Spread—A spread consisting of opposing market positions in two differ- ent underlying securities or commodities, or their derivative products. Intrinsic Value—The amount by which an option is in-the-money. Out-of-the-money options have no intrinsic value. Iron Butterfly—A long (short) straddle, together with a short (long) strangle. All options must expire at the same time and have the same underlying contract. Jelly Roll (Roll)—A long call and short put with one expiration date, together with a short call and long put with a different expiration date. All four options must have the same exercise price and same underlying stock or commodity. Kappa (K)—Vega. Knock Out Option—An out-option Ladder—A Christmas tree. Long-Term Equity Anticipation Security (LEAPS)—A long-term (usually more than one year) exchange traded equity option. Leg—One side of a spread position. Limit—The maximum allowable price movement over some time period for an exchange traded contract. Limit Order—An order to be executed at a specified price or better. A Glossary of Option and Related Terminology 425 Local—An independent trader on a commodity exchange. Locals perform functions similar to market makers on stock and stock option exchanges. Locked Market—A market where trading has been halted because prices have reached their limit. Long—A position resulting from the purchase of a contract. The term is also used to describe a position which will theoretically increase (decrease] in value should the price of the underlying contract rise (fall). Note that a long (short) put position is a short (long) market position. Long Premium—A position which will theoretically increase in value should the underlying contract make a large move in either direction. The position will theoreti- cally decrease in value should the underlying market sit still. Long Ratio Spread—A backspread. Look Back Option—An option whose exercise price will be equal to either the lowest price of the underlying instrument, in the case of a call, or the highest price of the underlying instrument, in the case of a put, over the life of the option. Margin-—Money deposited by a trader with the clearing house to ensure the integrity of his trades. Market Maker—An independent trader or trading firm which stands ready to buy or sell contracts in a designated market. Market makers perform duties similar to locals on commodity exchanges, the primary difference being that a market maker is obligated to make a two-sided (bid and ask) market in his designated contract. Market If Touched (MIT)}—A contingency order which becomes a market order if the contract trades at or beyond a specified price. Market On Close (MOC)—An order to be executed at the current market price as near as possible to the close of that day’s trading. Market Order—An order to be executed immediately at the current market price. Naked—A long (short) market position with no offsetting short (long) market position. Neutral Spread—A spread which is delta neutral. A spread may also be lot neutral, where the total number of long contracts and short contracts of the same type are equal. Not Held—aAn order submitted to a broker, but over which the broker has discretion as to when and how the order is executed. Omega (Q2)—The Greek letter sometimes used to denote an option’s elasticity. 426 Appendix A One Cancels the Other (OCO)—Two orders submitted simultaneously, either of which may be executed. If one order is executed, the other is automatically cancelled. Order Book Official (OBO)——An exchange official responsible for executing market or limit orders for public customers. Out-of-the-Money-—An option which currently has no intrinsic value. A call (put) is out-of-the-money if its exercise price is more (less) than the current price of the underlying contract. Out-Option—A type of barrier option which is deemed to have expired if the underlying instrument trades at some predetermined price prior to expiration. Out-Price—The price at which the underlying instrument must trade before an out option is deemed to have expired. Out-trade-——A trade which cannot be processed",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.450859"
}