{
  "id": "9183b722339b",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 27,
  "content": "calculateReturns(adjcls, 1) # daily returns excessRet <- ret - 0.04/252 # excess returns: assume annualized risk free rate is 4% Chan800064_c06.indd 118 6/7/2021 2:06:03 PM 57 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Money and Risk Management 119 Note that following the Kelly formula requires you to continu- ously adjust your capital allocation as your equity changes so that it remains optimal. Based on the SPY example (Example 6.2), let’s say you followed the Kelly formula and bought a portfolio worth $252,800. The next day, disaster struck, and you lost 10 percent on SPY. So now your portfolio is worth only $227,520, and your equity is now only $74,720. What should you do now? Kelly’s criterion will dictate that you immediately reduce the size of your portfolio to $188,892. Why? Because the optimal leverage of 2.528 times the cur- rent equity of $74,720 is $188,892. As a practical procedure, this continuous updating of the capi- tal allocation should occur at least once at the end of each trading day. In addition to updating the capital allocation, one should also periodically update F * itself by recalculating the most recent trail- ing mean return and standard deviation. What should the lookback period be, and how often do you need to update these inputs to the Kelly formula? These depend on the average holding period of your strategy. If you hold your positions for only one day or so, then as a # annualized mean excess returns M <- 252*colMeans(excessRet, na.rm = TRUE) # c(0.143479780597111, 0.0560305170502084, -0.0073464585163155) # annualized covariance matrix C<- 252*cov(excessRet, use = \"pairwise.complete.obs\") # 0.11305722 0.01986547 0.01825486 # 0.01986547 0.04263365 0.02689284 # 0.01825486 0.02689284 0.04196684 # Kelly optimal leverage F <- solve(C) %*% M # 1.240554 # 1.992328 # -1.991381 # Maximum annualized compounded growth rate g <- 0.04+t(F) %*% C %*% F/2 # 0.1921276 # Sharpe ratio of portfolio S <- sqrt(t(F) %*% C %*% F) # 0.5515933 Chan800064_c06.indd 119 6/7/2021 2:06:03 PM 58 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Money and Risk Management 125 lookback period, your Kelly leverage will be driven to zero.) This is preferable to abruptly shutting down a model because of a large drawdown (see my discussion of the psychological pressure to shut down models prematurely in the following section on psychological preparedness). Software Risk Software risk refers to the case where the automated trading system that generates trades every day actually does not faithfully reflect your backtest model. This happens because of the omnipresent soft- ware bugs. I discussed the way to eliminate such software errors in Chapter 5: you should compare the trades generated by your auto- mated trading system with the theoretical trades generated by your backtest system to ensure that they are the same. Natural Disaster Risk Finally, physical or natural disasters can happen, which can cause big losses, and they don’t have to be anything dramatic like earth- quakes or tsunami. What if your internet connection went down before you could enter a hedging position? What if your power went down in the middle of transmitting a trade? The different methods of preventing physical disasters from causing major disruptions to your trading can be found in the section on physical infrastructure in Chapter 5. PSYCHOLOGICAL PREPAREDNESS It may seem strange that a book on quantitative trading would include a section on psychological preparedness. After all, isn’t quantitative trading supposed to liberate us from our emotions and let the computer make all the trading decisions in a disciplined manner? If only it were this easy: human traders who are not psy- chologically prepared will often override their automated trading Chan800064_c06.indd 125 6/7/2021 2:06:03 PM Money and Risk Management 127 assumes that we have a large number of “gamblers” (read: traders) playing a risky game, and as long as the average return is positive, the economist suggests that this risky game is worthwhile, even if some of these gamblers may be ruined. However, when you are the trader, it is rational to avoid ruin at all cost, no matter what return the “average” trader enjoys. This contrast between the ensemble average (across different traders) and the time series average (over a long time horizon for a single trader) is a profound mathematical observation by the physicists Ole-Peters and Nobel laureate Murray Gell-Mann. See Box 6.1 for more details. BOX 6.1 LOSS AVERSION IS NOT A BEHAVIORAL BIAS* In his famous book Thinking, Fast and Slow, the Nobel laureate Daniel Kah- neman (2011) described one common example of a behavioral finance bias: “You are offered a gamble on the toss of a [fair] coin. If the coin shows tails, you lose $100. If the coin shows heads, you win $110. Is this gamble attractive? Would you accept it?” (I have modified the numbers to be more realistic in a financial market setting, but otherwise it is a direct quote.) Experiments show that most people would not accept this gamble, even though the expected gain is $5. This is the so-called “loss aversion” behavioral bias, and is considered irrational. Kahneman went on to write that “professional risk takers” (read “traders”) are more willing to act ration- ally and accept this gamble. It turns out that the loss-averse “layman” is the one acting rationally here. It is true that if we have infinite capital, and can play infinitely many rounds of this game simultaneously, we should expect a $5 gain per round. But trading isn’t like that. We",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.608106"
}