{
  "id": "2ef5cd1ca379",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 19,
  "content": "made on my put hedge earlier in the month enabled me to be more aggressive, and I progressively added to my longs through March. So, I was already heavily long by the time the market bottomed in late March. How did your net long position at that market bottom compare with your normal net long position? I was about 80% net long, which is above the top end of my usual range of 40%–70%. This year [2022], the market is down over 20% year-to-date, but you are down only about 6%. How did you keep your losses so contained? During the first half year, I did as poorly as the market, but I have done much better since then. There were several reasons for the better performance. I took some profits on the summer rally. I also had a takeover stock that was a big winner, and my long biotech portfolio did well despite the market weakness. Are there any trades that stand out since our original interview? The technology stocks I bought during the March 2020 crash were a major contributor to the 54% gain I had that year. An out-of-the-money call option position on JD.com, a stock we discussed in our last interview, was a huge winner. 61 Pavel Krejčí The Bellhop Who Beat the Pros Three years later I remember you live in a small village, and I’m just curious, do people know you were in the book? No, not here. I think people here don’t even know what I do and would have no idea what I am talking about if I told them. But I got so many contacts through the internet. The book changed my life. How did it change your life? For 15 years, I worked alone at home and didn’t speak about trading with anybody. After the book came out, I connected with people from the U.S., China, France, and all over the world. Most of these people asked me to help them trade, which was very difficult because I spent so much time answering questions that it interfered with my trading. But some of these contacts developed into friendships and some into business or potential business. By “business,” do you mean managing money? Yes. Two things are different about managing money and trading your own account. First, you have to trade much larger, and second, you’re managing other people’s money. Did you find those changes to be difficult? Yes, it is difficult to take a larger position on every trade. It takes some time. It’s not something that can be done immediately. 62 Difficult mentally? Because I think, given the liquidity of the stocks you trade, you could do any size you want. Yes, mentally. It’s not a liquidity problem because the stocks I trade are very liquid. Although your losses have remained very well contained, with maximum drawdowns each year in single digits, your return levels have been lower, averaging only a little over 10% during the past three years since our original interview. Was there a reason for your lower returns? I didn’t trade for almost half the year in 2021. I had Covid and was hospitalized. I’m very happy I survived, but it was a difficult period. Also, my daughter was born two years ago. The responsibility of having a kid changed me mentally. It made me more cautious about taking risks. Were the lower returns then due to these personal factors and not because the markets were more challenging? The markets were also less favorable for my strategy. My strategy does not work as well when the markets are extremely volatile. Is that because if there are wide market swings that can dominate the stock-specific influences you trade on? Exactly. There are periods when the volatility of all stocks is more influential than individual stock earnings reports, which is what I trade on. Were there any trades that were particularly memorable during the past few years? Like always, my trades are very boring. I didn’t have any huge winners or losers. My losses are restrained because I only hold positions for the day, which also limits my profits. Did you change anything in your trading over the last few years? During the past year, I have started to trade stocks from the short side to make it possible to find more opportunities. Before that, I only took long positions. Is the strategy different for shorts than for longs? 63 It is analogous in that shorts are also placed after earnings reports. Also, similar to longs, I place the trade at the opening and liquidate it the same day. There are differences, though. I don’t search for strong stocks. Instead, I search for weak stocks with poor earnings and disappointing guidance for the next quarter or year. That implies that if you are going short, the stock is already gapping lower. Basically, you are selling weakness, anticipating more weakness. Yes, the stocks I sell are usually down 7% or more on the open. I am just going with the trend. How does the success of the short positions compare with the long positions? There have been far fewer short position trades, but the success rate has been even better than for longs. Maybe that is because I am more selective in shorting stocks. I found a method that seems to work well. So shorting is something that I want to focus more on. Another benefit of trading the short side, which is relevant now that I am managing money, is that the liquidity on the open is higher when stocks are down after an earnings report than when they are up. Why didn’t you trade the short side before? When I started trading, I also traded from the short side until 2009, when shorts stopped working because of the massive uptrend. I stopped taking short trades because they kept losing money. I said, “OK, I don’t know how to short. I just have to accept it.” Are you",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:44.181032"
}