{
  "id": "e25ae8752aa6",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 144,
  "content": "What matters is that the marketplace believes that the market will change, and that all contracts are priced accordingly. In such a case, the trader must exercise those options which, given the perceived change in the underlying price, now have a value less than parity, and replace them with other contracts which are not limited by parity constraints, There is clearly an additional early exercise value associated with cash index options, a value which does not result from the usual early exercise considerations of dividends or interest. This value arises because under some circumstances a trader can exercise index options and replace them with other instruments at more favorable prices. How much is this replacement value worth? The answer depends on the probability of some significant event occurring between the time the index is fixed and the close of trading in other instruments linked to the index: stocks, futures, and options. Itis doubtful that anyone really knows how to quantify that probability, and traders tend to regard the possibility of a significant event occurring as a phantom variable. No one knows how to evaluate it, but everyone agrees that it exists. The extra early exercise value resulting from this phantom variable is most evident in the trading of boxes in an index option market. Suppose we are interested in buying a 420/430 box (buy the 420 call and 430 put, sell the 420 put and 430 call). If the box is made up of European options where early exercise is not a possibility, the value of the box is simply the 10-point difference between exercise prices less the carrying cost on 10 points to expiration. If there are four weeks to expiration and interest rates are 6%, the value of the box is approximately: 10.00 — (28/365 x 6% x 10.00) = 9.95 If these are American options there will be some early exercise value attached to them because of dividend and interest considerations. The extra value will be greatest for the 420 call and 430 put, so the value of the box will be slightly greater than 9.95. Using a binomial model, and given a normal dividend payout, we might find that a 10-point box in the S&P 100 (OEX) market has a value of approximately 10.05. Yet such boxes in the 5. For simplicity, we ignore the likelihood that the trader who continues to hold a spread position will make adjustments to his delta position as a result of the movement in the underlying index. 320 Chapter 15 S&P 100 market often trade for as much as 1014 to 103. The additional amount over expected theoretical value is the value the marketplace places on the possibility of early exercise after the index has been fixed at the end of the day. If the right of early exercise can represent an additional reward to the holder of a stock index option, then the possibility of early assignment must represent an additional risk to the seller of such an option. Indeed, the risk to the seller of an index option may seem even greater than the reward to the buyer. The seller is not only at the mercy of the buyer in terms of when the option will be exercised; he may not even find out that he has been assigned until it is too late to take protective action. The problem for the seller is that index options are settied in cash, and cash does not carry a delta value. When a trader is assigned in a normal stock option market, the assignment may result in a loss to the trader in terms of dividends or interest costs, but at least it does not upset his delta position. If the stock option is deeply enough in-the-money to be exercised, it probably has a delta very close to 100. When the option is exercised, the 100 deltas associated with the option disappear, but they are immedi- ately replaced with the 100 deltas associated with the stock contract. But when a trader is assigned on an in-the-money stock index option, not only does assignment cause a negative cash flow, but the deltas associated with the assigned options completely disappear. If the trader knows immediately that he has been assigned, he might be able to do something to rebalance his delta position. Unfortunately, exercise notices are processed overnight, so the trader will not find out that he has been assigned until the next trading day. If he is short deeply in-the-money index options and is assigned, the following day he may find himself with a big positive or negative delta position, perhaps much bigger than he would like. If the market moves substantially on the opening, the trader could find himself with severe losses before he ever has a chance to take any defensive action. Synthetic Relationships Suppose a stock is trading at 100. With two months to expiration, interest rates at 6%, and no dividend expected prior to expiration, what should be the relationship between the 100 call and the 100 put? If we ignore the possibility of early exercise, we know from the synthetic relationship in Chapter 11 that the call price should exceed the put price by approximately the carrying costs on the exercise price of 100: call price — put price = exercise price — stock price + carrying costs Since the carrying costs on the exercise price are 100 x 6% x 2/12 = 1.00 we know that the call should be 1.00 more expensive than the put. If the put is trading for 4.00, the call should be trading for 5.00. Suppose that the stock is trading for 100 and the put 4.00, but the call is actually trading for 4.25. What should a trader do? Regardless of the trader’s opinion about volatility, it’s clear that the call is .75 too cheap with respect to the put. A trader familiar with synthetic relationships will attempt to take advantage of this relative mispricing by Stock Index Futures",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.444505"
}