{
  "id": "c3801b271e66",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 47,
  "content": "of Zero in Figures 6-4 through 6-21. 100 Chapter 6 Figure 6-4: Call Theoretical Value vs. Underlying Price 30 Time = 60 days Volatility = 20% 257 / g 207 a o > 2 fa) ® ” & 100 a 110.” 80 85 90 95 100 105 10 11 120 Underlying Price Figure 6-5: Put Theoretical Value vs. Underlying Price 3075 Time = 60 days | 25 . Volatility = 20% @ 20+. 6 ~ > ~110 8 *. 2 154 2 Q MS 0 = * Je F105 ~ 90 ~ n a 04 — T TT T a ee _ 80 85 90 95 100 105 110 11 120 Underlying Price Option Values and Changing Market Conditions 10! the underlying falls, puts gain value. For this reason, puts always have negative deltas, ranging from zero for far out-of-the-money puts to -100 for deeply in-the-money puts. Just like a call delta, a put’s delta is a measure of the rate of change in the put’s value with respect to a change in the price of the underlying, but the negative sign indicates that the change will be in the opposite direction of the underlying market. A put with a delta of -10 can be expected to change its value at 10% of the rate of the underlying, but in the opposite direction. If the underlying moves up (down) .50, the put can be expected to lose (gain) .05 in value. At-the-money puts will have deltas of approximately -—50, and can be expected to change their value at approximately half the rate of the underlying, but in the opposite direction. Hedge Ratio As discussed in Chapter 5, if we wish to hedge an option position against the underlying contract, the delta tells us the proper ratio of underlying contracts to options required to establish a neutral hedge. An underlying contract always has a delta of 100, so the proper hedge ratio can be determined by dividing 100 by the option’s delta. An at-the-money option has a delta of 50, so the proper hedge ratio is 100/50, or 2/1. For every two options purchased, we need to sell one underlying contract to establish a neutral hedge. A call with a delta of 40 requires the sale of two underlying contracts for each five options purchased, since 100/40 = 5/2. Since puts have negative deltas, the purchase of puts will require us to hedge the position by purchasing underlying contracts. A put with a delta of -75 will require the purchase of three underlying contracts for each four puts purchased, since 100/75 = 4/3. Thus far, all the hedges we have looked at have consisted of options and underlying contracts. But any hedge, whether options versus underlying contracts, or options versus options, is delta neutral as long as all the deltas in the hedge add up to zero. For example, suppose we buy four calls with a delta of 50 each, and ten puts with a delta of —20 each. Our position is delta neutral since (+4 x +50) + (+10 x—20) = 0. A position can be highly complex, consisting of underlying contracts, calls, and puts, with different exercise prices and expiration dates, but as long as the deltas add up to approximately zero we say that the position is delta neutral. Theoretical or Equivalent Underlying Position Many option traders come to the option market after trading in the underlying instruments. Futures option traders often start their careers by trading futures contracts; stock option traders often start by trading stock. If a trader has become accustomed to evaluating his risk in terms of the number of underlying contracts bought or sold (either futures contracts or shares of stock), he can use the delta to equate the directional risk of an option position with a position of similar size in the underlying market. Since an underlying contract always has a delta of 100, each 100 deltas in an option position represents a theoretical position equivalent to one underlying contract. A trader who owns an option with a delta of 50 is long, or controls, approximately % of an underlying contract. If he owns ten such contracts, he is long 500 deltas or, in equivalent terms, five underlying contracts. If the underlying is a futures contract, he is 102 Chapter 6 theoretically long five such contracts. If the underlying is a stock contract consisting of 100 shares of stock, he is theoretically long 500 shares of stock. The trader has a similar theoretical position if he sells 20 puts with a delta of -25 each, since -20 x -25 = +500, It is important to emphasize the theoretical aspect of the delta interpretation as an equivalent to an underlying position. An option is not simply a surrogate for an underlying position. An actual underlying position is almost exclusively sensitive to directional moves in the underlying market. An option position, while also sensitive to directional moves, is also sensitive to other changes in market conditions. An option trader who looks only at his delta position may be ignoring other risks which could have a far greater impact on his option position. He must realize that the delta represents an equivalent underlying position only under very narrowly defined market conditions. The reader may have already noted that our three interpretations of delta—the hedge ratio, the rate of change in the theoretical value, and the equivalent underlying position—are all essentially the same. How a trader interprets a delta position depends primarily on his trading strategy. For example, suppose a trader has a delta position of +500. If the trader intends to maintain a delta neutral position, he must sell five underlying contracts (the hedge ratio interpretation). However, if he believes the market will rise and wants to maintain his delta position, he knows that in theory he is long five underlying contracts (the equivalent underlying position interpretation). And finally, if he does maintain his delta position of +500, the value of his position will change at",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.429625"
}