{
  "id": "d33418361dae",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 113,
  "content": "band. fundamental Traditionally, technical analysis is the discipline of understanding market movements based on information contained in the price changes themselves. Funda- mental analysis is the discipline of using ﬁnancial statements, economic data, or other information to try to determine what the fair value for an asset should be. futile traders A term coined by Larry Harris to describe traders who do not make money in markets, and who have no hope of doing so. Harris speculates that one reason they cannot understand the difference between their expectations and their results could be that they are “of limited mental capacity.” good till canceled (GTC) A qualiﬁer attached to an order to indicate that it should not be canceled at the end of the current trading session. A good till canceled order may not work indeﬁnitely; some brokers cancel these at speciﬁc times (e.g., end of quarter). handle A term used to describe the whole numbers in futures markets. For instance, a move from 1,038.00 to 1,040.00 in the S&P 500 futures is a two-handle move. The equiva- lent term in stocks is a point. hedging A term with many meanings, but generally to hedge means to take positions to protect against risks in another instrument. For instance, buying a put option is a classic hedging strategy for long positions. Proper hedging is trivial and can be expensive. high and tight ﬂags A speciﬁc type of ﬂag that holds near the high of a sharp up move (or near the low of a sharp decline) that often suggests strong buying (or selling) pressure behind the move. These often lead to sharp continuation. higher time frame (HTF) The highest time frame in a normal lower/trading/higher time frames scheme. Time frames are typically related to each other by a factor between 3 and 5. 181 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing 432 GLOSSARY high-frequency trading (HFT) algorithms Computer programs that rapidly execute or- ders, either for their own proﬁt or to ﬁll orders for clients. histogram chart A type of chart that is useful for visualizing probability distributions. Events are placed into bins, and the height of those bins is graphed to show the shape of the distribution. historical volatility Annualized standard deviation of returns. A common measure of volatility. hit the bid Vernacular for selling (whether initiating a short or selling an existing long position) to the price on the bid. This is usually done when a trader needs to sell quickly, because she could possibly have gotten a better (higher) price by putting offers in rather than hitting the bid. holding A term used to describe a market that is unable to trade beyond a speciﬁc level or point in the market, or to the action of that level on the market. See failing. illusion of control A term that describes a person’s assessment of his own skill at a task that offers random reward. If the person appears to have some inﬂuence on the process, he will rate his contribution to the outcome as more important, even if there is no actual connection (e.g., a disconnected button that does nothing). impulse move In technical analysis, a strong movement in the market, usually sharp and in one direction. Also called a momentum move. independent variable In regression analysis, the variable(s) that is/are assumed to cause changes in the other variable. indicator variable A variable that assumes the value of 0 or 1 depending on some con- dition. For instance, an indicator variable could assume the value of 1 if today’s close is higher than the previous day’s, or 0 otherwise. Averaging this variable across the data set would then give the percentage of days that closed up. inefﬁcient traders In Larry Harris’s words: “Inefﬁcient traders lack the skills, analytic resources, and access to information to trade proﬁtably. They may do everything that proﬁtable traders do, but they do not do it well enough to trade proﬁtably.” interfaces The areas between trends, trading ranges, or trends in the opposite direction. These areas can be difﬁcult to read, but they offer some attractive trading opportunities if the risks can be properly managed. interquartile range (IQR) A nonparametric measure of dispersion calculated by taking the difference of the third and ﬁrst quartiles. Also called the middle 50 because half (50 percent) of the data set’s values will fall in this range. Kelly criterion A position-sizing plan designed to maximize equity growth if some sim- plifying assumptions hold. Violations of these assumptions can have catastrophic conse- quences, and violations are common in actual trading. If you choose to use a Kelly-style position-sizing scheme, make sure you understand the issues involved. Keltner channels Originally invented by Chester Keltner, these bands were drawn around a 10-day simple moving average of the typical price, and offset by a 10-day mov- ing average of the bars’ ranges. Various modiﬁcations exist today. last print The most recent transaction price in a market. May update very rapidly during the time the market is open. The last print of the trading session may not be the closing print in many markets. 182 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing Glossary 433 limit orders A type of order to buy or sell with a price limit attached. The order will",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "fundamentals",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:53.713092"
}