{
  "id": "40ad5f5df598",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 101,
  "content": "She will make money if A goes up and B goes down, if they both go up but A goes up more, or even if they both decline as long as B declines more. The key is that the percentage change of A must be greater than the percentage change of B (assuming an equal-weighted position) from the time the trade is entered. Conversely, if the trader felt the spread was too wide, she could short the spread by doing the reverse of this transaction. This just scratches the surface of these complex, multileg transactions, which exist in and between all markets in virtually unlimited combinations. The message here is that much of the buying and selling we observe in markets may be part of spread trades like this. In this case, we might see the trader buying Asset A and assume she was bullish on it, when in fact, she does not care if it goes up or down—all she cares about is the spread relationship. Spreads can be created between different asset classes, regional markets, or international markets, and these trades can even be initiated with different timings on each leg. Do not assume that buying is always bullish and selling is always bearish; there may be much more going on behind the scenes. 153 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp01 JWBT634-Grimes May 11, 2012 8:31 Printer: Hamilton Printing 404 APPENDIX A: TRADING PRIMER CHARTS The most basic language of the market is price changes, perhaps with associated volume. In the case of XYZ, we might see 500 shares done at 50.00, 300 @ 50.03, 500 @ 50.04, and so on. (A more complete record would include a time stamp and whether the order was executed on the bid, on the offer, or in between.) This record is sometimes referred to as the “prints on the tape” in memory of the old-style ticker tape machines, which really did print prices on paper tape. A very active instrument can “print” hundreds or thousands of trades in a single minute, so a trader would quickly become lost without some reference of historical activity. A chart of these price changes is the natural solution, and many discretionary traders ﬁnd that charts present market information in a way that is both intuitive and useful. Tick Charts The most primitive type of chart would simply be the information in the prints plotted on a graph with price on the y-axis and trade number on the x-axis. The chart in Figure A.1 FIGURE A.1 A Single-Tick Chart of AAPL AAPL - 1 Tick Bar Apple Inc 354.00 353.90 353.70 353.60 353.50 353.40 353.30 353.20 9:30 154 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp01 JWBT634-Grimes May 11, 2012 8:31 Printer: Hamilton Printing Appendix A: Trading Primer 405 is a single-tick chart of the market’s opening for Apple, Inc. (Nasdaq: AAPL) on 7/12/2011 (trade numbers not shown). The single-tick chart is interesting from an intellectual per- spective because it is the most fundamental language of the market—every single trade, every transaction that hits the consolidated tape, is displayed on the chart. From a prac- tical perspective, a single-tick chart is not very useful, for the simple reason that it is difﬁcult to ﬁt much trading history on a single chart. This AAPL chart shows only the ﬁrst 30 seconds of the trading day. In an extremely active stock, it is even possible that less than a single second’s trading could ﬁt in the same space; it is not possible for the human eye and brain to process this information in a meaningful manner. The obvious solution is to aggregate many ticks into a single space on the chart. When this is done, we refer to the chart by how many ticks (trades) are put together into a single space on the x-axis. In Figure A.2, each bar represents 25 individual trades, and, now, approximately ﬁve and a half minutes of activity ﬁt on the same chart space. It is important to remember that the x-axis is not scaled to time. This is one of the main advantages of aggregate tick charts: as the market becomes more or less active the x-axis expands or contracts to accommodate the activity. In many cases, this can FIGURE A.2 A 25-Tick Chart of AAPL AAPL - 25 Tock Bar Apple Inc 354.60 354.40 354.20 354.00 353.80 353.60 353.40 353.20 9:30 9:31 9:32 9:33 9:34 9:35 155 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp01 JWBT634-Grimes May 11, 2012 8:31 Printer: Hamilton Printing 406 APPENDIX A: TRADING PRIMER FIGURE A.3 Comparison of Bar and Candlestick Charts create some advantages over simple time-scaled charts by making readable patterns out of very illiquid or extremely volatile markets. Bars and Candles Once we start aggregating trades on the x-axis, a graphical device is needed to explain the activity in that space. One logical solution is simply to plot a vertical bar, with the top and bottom of the bar representing the high and low extremes reached during the period (right panel in Figure A.3). Traders",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "market_structure",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.711187"
}