{
  "id": "721786512069",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 55,
  "content": "per- haps with the expectation that a stronger move could develop from a complex consoli- dation. You might be justiﬁed in taking less of your position off at your ﬁrst proﬁt target, and trying to press more size for a larger move compared to a simple pullback. If you decide to do this, weigh the beneﬁts of having simple rules (e.g., take one-third of your position off at the previous swing) that enforce discipline and consistency against any incremental gains from a more complex approach. Comments One important issue not yet considered is that these complex pullbacks often come following losing trades in simple pullbacks. This creates a risk management question that must be considered. Assume you want to risk $10,000 on each trade, and you just booked a $10,000 loss on a simple pullback, which, a few days later, is clearly developing into a complex pullback. What now? There are many possible answers, but it is important to have a clear plan before this situation is encountered. Risk manage- ment scenarios deserve careful consideration, planning, and maybe even quantitative modeling—these are not decisions to be made on the ﬂy. @SB-Daily Sugar No. 11 Continuous Contract [Oct11) 114.00 ~I~\\\\ \"oo ~ ,~, ' .- 1200 10.00 I ~I ' -.___ ~ rw_lr, 900 '~~, ',,_ ' ~~I.__ J._)' ,oo ~ 1 1~ ~,1~~ ' 00 6.00 ~~ 0.80 (\\ ~---·- .. --··· ···- ··--- ••• ---···· ··-----~-2 0.20 7:v~~~v .--· -••.• --·· -0.40 May Jun Jul Aug / ! trade is often justified. 79 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing 170 TRADING STRATEGIES THE ANTI Enter Short Trade Type Trend termination. Concept This trade is a very speciﬁc pullback variation that attempts to enter the ﬁrst pullback after a potential trend change. Setup There are two setup conditions for this trade. The ﬁrst is that the market must have made a pattern that suggests the current trend could be terminating. Many of these patterns were discussed in Chapters 3 and 5: loss of momentum on successive thrusts, an extremely overextended market on the higher time frame, some type of double top or bottom formation where the market is unable to make a continuation, or perhaps a failure test. The second requirement is that the market then makes a move that shows a distinct change of character, such as a shift of momentum against the old trend. In the case of an uptrend, a downswing would emerge that was much stronger than previous downswings. This move would likely register a new momentum low on momentum indi- cators, suggesting further that the integrity of the uptrend had been challenged. This is the setup sequence, and both parts are important: the initial market structure that pro- vides justiﬁcation for potential countertrend trades, followed by a shift of momentum that shows that the dominant trend players have lost control of the market. Trigger The actual entry for this trade is in the ﬁrst pullback following the strong countertrend price movement. For example, imagine a market that has been in an up- trend and then puts in a sharp downward spike (countertrend to the uptrend). The next bounce following that spike is potentially the ﬁrst pullback in a new downtrend; this trade represents an attempt to reverse, or at least to create a signiﬁcant pause in the pre- existing uptrend. Price action and evolving market structure must be carefully monitored in the pullback for warning signs that the pullback could fail and that the original trend may still be intact. This structure is a pullback and, to a great extent, can be traded like any other pullback. What distinguishes this pullback is its position in the evolving market P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing 172 TRADING STRATEGIES original trend) is more likely. Monitor the market carefully for action in the neighborhood of the MMO. If it breaks, there is the possibility that you have just caught a major trend reversal. If, however, it holds and there is no continued countertrend momentum (and the pattern suggests a complex consolidation), be very protective of any remaining proﬁts in the position. Figure 6.14 shows an example of a sell Anti on the 30-minute chart of SPY. Consider every element of this trade carefully: The market had been in an extended uptrend and gapped above the upper channel at A, indicating a potential climax and overextension. This was the ﬁrst warning of a potential trend change. At B, a strong countertrend leg developed, longer in both price and time than previous upswings. This down leg showed a distinct change of character and suggested that the bulls might have lost control, at least for a moment. The momentum indicator conﬁrmed, marking a signiﬁcant new low (relative to its recent history) at B1. Point C marked a controlled pullback, and it is at this point we can begin to assess the balance of buyers and sellers in this market. It is entirely possible that the drop at B will be erased and the market will explode to new highs, but the clue will be price action at point C. If, as in this case, the upward movement is weak, the probabilities favor another leg down as a natural reaction to B. This is a FIGURE 6.14 A Sell Anti on 30-Minute SPY Bars SPY - 30 min S&P Dep Receipts B A 137.00 __ J ,-- ,, .. ·- ' C --.- --- 135.50 136.50 136.00 D 135.00 134.50 134.00 133.50 133.00 ~ 81 0.60 ::;,:·--··---- ~ --···---~ ·-z=:::::::.s--A-- ___ 0.20 - V •••• . ......... '---\" ................................................. ~ . -0. 20 4/25 4126",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.704027"
}