{
  "id": "bb3edf33c9d8",
  "source": "Inside_The_Black_Box.pdf",
  "source_type": "pdf",
  "title": "Inside The Black Box",
  "chunk_index": 1,
  "content": "Transaction Cost Function 21 Size of Trade Cost of Trade Quadratic Transaction Cost True Transaction Cost EXHIBIT 5.4 Quadratic Transaction Cost Function 22 Alpha Model Risk Model Transaction Cost Model Portfolio Construction Model Execution Model Data Research EXHIBIT 5.5 Schematic of the Black Box 23 EXHIBIT 6.1 A Simple Equal Risk Weighted Portfolio Equal Weight (%) Volatility (%) Volatility-Adjusted Weight (%) GOOG 50 2.5 39 XOM 50 2.0 61 24 –1.0 –1 .0 –1 .00 –0.75 –0.50 –0.25 0.00 0.25 0.50 0.75 1 .00 –0.5 –0.50.0 0.0 0.5 0.5 1.0 1.0 0.6 1 .00 0.6 0.4 0.2 0.0 –0.2 –0.4 –0.6 0.75 0.50 0.25 0.00 –0.25 –0.50 –0.75 –1 .00 Equal weight Equal risk Max Sharpe Long-only 0.4 0.2 –0.2 –0.4 –0.6 0.0 CVX CVX NFLX NFLX Sharpe ratio EXHIBIT 6.2 Visual Representations of the Search Space for an Optimization 25 S&P 500 Index Rolling 20-Day Volatility, 2000–2008 Date 0% 1% 2% 3% 4% 5% 6% 1/31/00 6/30/00 11/30/00 4/30/01 9/30/01 2/28/02 7/31/02 12/31/02 5/31/03 10/31/03 3/31/04 8/31/04 1/31/05 6/30/05 11/30/05 4/30/06 9/30/06 2/28/07 7/31/07 12/31/07 5/31/08 10/31/08 Daily Volatility (%) EXHIBIT 6.3 Historical S&P 500 Volatility 26 1/1984–8/2008 (Weekly returns) — 0.10 0.20 0.30 0.40 0.50 0.60 0.70 1/3/1985 1/3/1987 1/3/1989 1/3/1991 1/3/1993 1/3/1995 1/3/1997 1/3/1999 1/3/2001 1/3/2003 1/3/2005 1/3/2007 Date Correlation EXHIBIT 6.4 Rolling Yearly Correlation Between S&P 500 and Nikkei 225 27 Rolling One-Y ear Correlation December 2019 to December 2023 1 0.8 0.6 0.4 0.2 0 –0.2 –0.4 12/6/2019 12/6/2020 r (NFX,XOM) r (XOM, CVX) 12/6/2021 12/6/2022 EXHIBIT 6.5 Correlation Over Time Between Similar and Dissimilar Instruments 28 1.00 0.75 0.50 0.25 0.00 NFLX NFLX –0.25 –0.50 –0.75 –1 .00 CVX CVX –1 .00 –0.75 –0.50 0.0 0.2 0.4 0.6 0.8 1.0–0.25 0.00 0.25 0.50 0.75 1 .00 Equal weight Equal risk Max Sharpe Equal weight Equal risk Max SharpeLong-only 0.6 1.0 0.60 0.58 0.56 0.54 0.52 0.50 0.48 0.46 0.8 0.6 0.4 0.2 0.0 0.4 0.2 0.0 –0.2 –0.4 –0.6 EXHIBIT 6.6 Visual Representation of Constraining the Search Space for an Optimization 29 ◄ ■ 0.300.25 RETURN 0.200.150.100.050.00 0.00 0.02 0.04 RISK 0.06 0.08 0.10 100% SPY Maximum Return Portfolio (Volatility = 6.0%) Equally-Weighted Portfolio Tangency Portfolio Minimum Variance Portfolio 100% IEF 100% GLD 100% EFA 0.12 EXHIBIT 6.7 The Efficient Frontier. Source: Adapted from Daniela Hanicova, “Markowitz Model,” www.quantpedia.com/markowitz- model 30 , , , , , , , , , / , , ,, , , , , , • • • • • Alpha Model Risk Model Transaction Cost Model Portfolio Construction Model Execution Model Data Research EXHIBIT 6.8 Schematic of the Black Box 31 Alpha Model Risk Model Transaction Cost Model Portfolio Construction Model Execution Model Data Research EXHIBIT 7.1 Schematic of the Black Box 32 Types of Data Price-Related Fundamental In-houseM eta Volume Flows/Sentiment Related Pricesi Broker Data Price Price Order Book Value Volume Quality Filings Filings Analysts/Agencies Transcripts/Recordings SatelliteW eather Opportunistic / Tacticalii Satellite Covid legend category item or source Notes i. the prices of related instruments, for example, options on the same underlying instrument, or price action of correlated instruments. ii. these are historical examples. iii. healthcare data are a newer area, not really available yet, and questionably included in this category. iv. we mean the mapping of a given instrument to the underlying asset. For example, there may be many bonds issued by a single issuer, but they all need to be mapped back to that issuer. Brexit Election Social Media Web Sales Pricing Ads Physical locationAnalyst/Professional Web traffic Weather GPS/Mobile Behavior Transactions Credit Healthcareiii Geo Sentiment B2B Consumer Web scrape Exchange Supply/Demand Growth Trades Time-stamps Latencies Security Master Root-mappingiv Classifications EXHIBIT 8.1 A Taxonomy of Data 33 I] 9.650 9.625 9.600 9.575 9.550 9.525 9.500 9.475 9.450 9.425 9.400 9.375 9.350 9.325 08.00 09.00 10.00 11.00 12.00 13.00 14.00 15.00 16.00 EXHIBIT 8.2 September 2008 Mexican Peso Futures Contract on July 15, 2008 34 116.0 115.9 115.8 115.7 115.6 115.5 115.4 115.3 115.2 115.1 115.0 114.9 114.8 114.7 114.6 114.5 114.4 114.3 114.2 114.1 114.0 03.000 4.00 05.00 06.000 7 .00 08.00 09.00 10.00 11.00 12.00 13.00 14.00 15.00 16.00 17.00 EXHIBIT 8.3 June 2008 German Bund Futures Contract on March 28, 2008 35 Alpha Model Risk Model Transaction Cost Model Portfolio Construction Model Execution Model Data Research EXHIBIT 8.4 Schematic of the Black Box 36 – 1,000 2,000 3,000 4,000 5,000 6,000 7,000 8,000 9,000 5/31/825/31/835/31/845/31/855/31/865/31/875/31/885/31/895/31/905/31/915/31/925/31/935/31/945/31/955/31/965/31/975/31/985/31/995/31/00 Cumulative Profits ($1,000 Invested) Date EXHIBIT 9.1 Back-Tested Cumulative Profits of the S&P 500 Strategy 37 R2 = 0.0085 –25% –20% –15% –10% –5% 0% 5% 10% 15% 15105–(5)(10)(15) Signal (Negative = Short, Positive = Long) Return of S&P 500 on the Next Day EXHIBIT 9.2 R2 of the S&P 500 Strategy 38 . . • d' . . –0.04% –0.02% 0.00% 0.02% 0.04% 0.06% 0.08% 0.10% 0.12% 0.14% 1.900.300.02(0.19)(2.35) Strategy Signal (Negative = Short, Positive = Long) S&P Return on the Next Day EXHIBIT 9.3 Quintile Study of S&P 500 Strategy’s Signals vs. S&P 500 Returns 39 MSFT versus S&P 500, with Cumulative Analyst Estimate Revisions, March–October 2006 80 85 90 95 100 105 3/31/2006 4/30/2006 5/31/2006 6/30/2006 7/31/2006 8/31/2006 9/30/2006 10/31/2006 MSFT versus S&P 500 –7 –6 –5 –4 –3 –2 –1 0 1 Cumulative Rating Change Index of MSFT versus S&P 500 (Rising Values Indicate MSFT Outperformance of S&P) Cumulative Changes in Analyst Recommendation Level Date EXHIBIT 9.4 Illustration of Time Decay of Alpha 40 Outcome as a Function of Parameter Value (1.5) (1.0) (0.5) – 0.5 1.0 1.5 2.0 2.5 3.0 91 81 71 61 51 41 31 21 11 1 Parameter Value Goodness of Outcome D CB A EXHIBIT 9.5 Choosing the Right Parameter V alues 41 EXHIBIT 9.6 Overfitting (Type I Error) vs Underfitting (Type II Error) Images/ Shutterstock; skynesher/Getty Images 42 Type I Error overfitting Type II Error You're not pregnant! underfitting EXHIBIT 9.7 Determining the Correct Balance Between Overfitting (Type I Error) vs Underfitting (Type II Error) 43 ~ low abundance of alpha high ➔ Alpha Model Risk Model Transaction Cost Model",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:47.095717"
}