{
  "id": "1605bf52a732",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 98,
  "content": "the actual underlying contract. On the other hand, if we want to take a short underlying position, we will prefer to sell the underlying contract synthetically by selling the call and purchasing the put. If we do this, we are selling a contract which is only worth 2.00 for 2.25. The reader may have noted that the synthetic and real markets will be the same when the time value of the call and the time value of the put are identical. In our example, the synthetic and real markets are identical when the June 100 call and the June 100 put both have the same amount of time value. If this is not true, there is always a synthetic position which is either too cheap or too expensive with respect to its real equivalent. The three-sided relationship between a call, a put, and its underlying contract means that we can always express the value of any one of these contracts in terms of the other two: underlying price = call price — put price + exercise price call price = underlying price + put price — exercise price put price = call price — underlying price + exercise price This three-sided relationship is sometimes referred to as put-call parity. Option Arbitrage 217 CONVERSIONS AND REVERSALS If we take a synthetic long or short underlying position, our primary concern, as with an actual underlying position, is the direction of the market. If the market moves in our favor, we expect to show a profit; if it moves against us, we expect to show a loss, If we execute the synthetic at favorable prices we may gain more or lose less, but it is still primarily the direction of the market in which we are interested. Suppose, as before, the underlying contract is trading at 102.00, the June 100 call is trading at 5.10, and the June 100 put is trading at 2.85. The synthetic market should be 2.00 (underlying price less the exercise price}, but is actually 2.25. If we wanted to take a short position in the underlying market, we would certainly prefer to do so synthetically (sell the call, buy the put). Suppose we are not interested in taking a directional position. Is there any way we can profit from the difference in price between the real and synthetic markets? When a trader identifies two contracts which are essentially the same but which are trading at different prices, the natural course is to execute an arbitrage by purchasing the cheaper contract and selling the more expensive. Since the synthetic position and its real equivalent are essentially the same, and since they are trading at different prices (2.25 vs. 2.00}, an option trader might try to purchase the cheaper contract (the underlying contract) and sell the more expensive (the synthetic equivalent}. That is, he might try to purchase the underlying contract for 102.00, and simultaneously sell the call for 5.10 and buy the put for 2.85. The cash flows from these transactions are: Transaction Cash flow underlying purchase —102.00 call sale +5.10 put purchase —2.85 exercise or assignment (at 100} at expiration +100.00 total +.25 No matter what happens in the underlying market, the underlying position will do exactly .25 better than the synthetic position. The entire position will therefore show a profit of .25, regardless of movement in the underlying market. This is shown in Figure 11-2. The foregoing position, where the purchase of an underlying contract is offset by the sale of a synthetic position, is known as a conversion. The opposite position, where the sale of an underlying contract is offset by the purchase of a synthetic position, is known as a reverse conversion or, more commonly, a reversal. A reversal would be profitable if the underlying contract were trading at 102.00, and the difference between the prices of the June 100 call and June 100 put were less than 2.00. For example, with the June 100 call at 4.90 and the June 100 put at 3.05, the synthetic price is 1.85. By purchasing the synthetic at 1.85 (buy the call at 4.90, sell the put at 3.05), and selling the underlying contract at 102.00, the reverse conversion would lock in a profit of .15. This is shown in Figure 11-3. 218 Chapter 11 Figure 11-2 3 NN short a 100 call at 5.10 Pa 24 SN long a 100 put at 2.85 on ms . a“ (synthetic short) —- s uv ~ combined positions (conversion) ~. s NA S an 8 ~ < > B g4——-—— — — we a - e N. oO s ” ~ -174 a Ss . . a NN long an underlying NN “24 oe contract at 102.00 NN a -3 T T T T T 99 100 101 102 103 104 105 Underlying Price Summarizing: conversion = long underlying + synthetic short underlying = _ long underlying + short call + long put reversal = short underlying + synthetic long underlying = short underlying + long call + short put As before, we assume that the call and the put have the same exercise price and expiration date. Conversions and reversals are classified as arbitrage strategies because of their similarity to traditional arbitrage. Typically, an arbitrageur will attempt to simultane- ously buy and sell the same items in different markets to take advantage of price discrepancies between the two markets. He might, for example, buy gold in New York for $389 per ounce, and sell it in London for $392 per ounce. The profit margin of $3, while small, is secure since the risk of a trade in one market is almost immediately offset by an identical but opposing trade in another market. Unlike a speculator, who usually hopes to make a large profit on a small number of trades, an arbitrageur hopes to make a small profit on a large number of trades. An arbitrageur is willing to do much greater size than the speculator because the risk is",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals"
  ],
  "created_at": "2026-02-05T08:09:54.437344"
}