{
  "id": "f10d18cec543",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 61,
  "content": "OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 192 TRADING STRATEGIES FIGURE 7.2 The Three Moving Averages Indicate Three Diﬀerent Trends at This Spot shows, this tool is very dependent on the length of the moving average chosen; in this diagram, the three averages each suggest different trends at the same spot. This is not a problem, for the market can actually be in an uptrend, downtrend, and trading range at the same time—it depends on what time frame is being considered—but the trader must understand these issues. Again, it is not necessary to use this as a mechanical tool—for instance, by executing only at the precise points where the line shifts slopes. A trader making decisions based off price structure will almost always ﬁnd entries before they are conﬁrmed by a moving average. Avoid Markets in Equilibrium Markets are usually in equilibrium, and at those times markets are efﬁcient in the academic sense—random walks prevail. There is no consistent edge possible in such an environment; it is not an exaggeration to say that the essence of technical analysis is to identify markets that have a temporary imbalance of buying and selling pressure, and to limit our trading to those environments . One way to identify markets in equilibrium is that they tend to stay close to an average price (moving average), which represents a rough area of consensus. If the market continues to trade around that average, chopping back and forth on both sides of it, it is probably best to move on and to look for better trading opportunities. This might seem like common sense, but a rule like this can keep traders from making multiple attempts at trading a ﬂat market. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 193 FIGURE 7.3 Avoid Trading Markets That Chop Back and Forth on Both Sides of an Intermediate- Term Moving Average To be sure, nothing works all the time. Even random walk markets will show signiﬁ- cant departures from moving averages; a signiﬁcant move away from a moving average is not, in itself, sufﬁcient evidence to declare that a tradable buying and selling imbalance exists. However, the absence of that condition virtually guarantees that an imbalance does not exist, and markets that remain close to intermediate-term moving averages almost always present challenging trading environments with no signiﬁcant edge. Fig- ure 7.3 shows a period where Consolidated Edison, Inc. (NYSE: ED) traded back and forth around a moving average with no clear trades to either direction. For most traders, simply avoiding this type of price action can add to the bottom line, as many small losing trades will be eliminated. As a Reference for Trading Pullbacks Expecting a moving average to truly pro- vide support and resistance is probably misguided, but there is a valid way to use moving averages as a crutch for trading pullbacks. Markets typically move by an alternation of momentum moves and consolidations, and it is usually a bad idea to initiate a trade when the market is overextended either to the upside or the downside in a momentum move. In almost all cases, it is better to wait for the market to work off this condition and to return to a short-term state of balance before entering in the pullback. It might seem to be a joke, but using a moving average like this “keeps you from doing something stupid” Apr Jul Oct ED - 5 min Consoidaled Edison 53,90 53,80 53,70 53.60 53,20 53.10 12:00 14:00 5117 12:00 14:00 5118 12:00 88 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 194 TRADING STRATEGIES FIGURE 7.4 Using a Moving Average as a Reference for Buying Pullbacks Do not buy when price is far away from the average. (i.e., buying or shorting an overextended market). A simple but effective trading rule could be instituted that simply prevents you from buying or selling pullbacks that are far away from a moving average, assuming that far away has been precisely deﬁned. It is also worth considering that a moving average is a good reference in a normal trend; very strong trends may not pull back as much. In general, it makes sense to build a trading plan that ﬁrst addresses the most common situations that will be encountered, dealing with more extraordinary trending environments later. Figure 7.4 shows an example of some possible pullback entries at a moving average. Trade management and context are important, as there is no inherent edge to simply executing a trade at the moving average. Slope of a Moving Average as a Trend Indicator The slope of a moving average is another subjective application that does not test out well in quantitative testing, but it can be useful as a scanning tool or as a cue for the developing discretionary trader. The concept is that the moving average’s slope can give conﬁrmation of trend direction, with the time frame of the trend roughly corresponding to the time frame of the moving average. Longer-term (100-period or more) moving averages will address longer-term trends, while very short-term (less than 10-period) moving averages will give indications for the shortest intervals on the chart. An important point is that an attentive trader will almost always be able to identify inﬂection points based on price structure long before P1: OTA JWBT634-c07 JWBT634-Grimes May 10,",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options"
  ],
  "created_at": "2026-02-05T00:37:53.704957"
}