{
  "id": "637e6cd09d66",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 44,
  "content": "lower than the price at which the previous trade took place (a down-tick]. A short sale is always permitted at a price higher than the price at which the previous trade took place (an up-tick), Finally, a short sale may take place at the same price at which the previous trade took place if the previous trade took place on an up-tick (also an up-tick). The up-tick rule was instituted following the market crash of 1929, with the intent of preventing a similar crash by prohibiting the sale, at continuously lower prices, of stock not actually owned. Below are ten consecutive trade prices (reading from left to right) for a stock with the accompanying ticks (a positive sign for an up-tick; a negative sign for a down-tick}. 48Y2 +48%% +485 -48Y2 485% -481/4 -481/4 +4858 +4850 +485 Not only might a short sale not be possible because of the up-tick rule, but many brokerage firms which execute short sales of stock for their customers do not pay full interest on the proceeds from a short sale. This can further distort the interest component used in a theoretical pricing model. Taking one last look at our examples, what enabled us to make a profit approxi- mately equal to that predicted by the theoretical pricing model? A simple way of interpreting the results is to realize that, according to the model, the option’s cash flow can be replicated through the adjustment process. If we know the conditions of an option contract and the characteristics of the underlying contract, we can replicate the characteristics of the option, and therefore replicate the cash flow resulting from a position in the option, through an adjustment process in the underlying contract. In our examples, because we knew the exact market conditions which would prevail over the life of the options (primarily, this means knowing volatility), we knew we could replicate the option by continuously calculating the delta and taking an appropriate offsetting position in the underlying contract. According to the model, at expiration the total cash flow from this dynamic hedge should exactiy equal the value of the option. But in our examples we either bought the option at less than theoretical value (our futures option example} or sold the option at more than theoretical value (our stock option example}. Since the cash flow from the adjustment process exactly replicated the option’s theoretical value, we were left with a profit equal to the difference between the option’s price and its theoretical value. 94 Chapter 5 This type of option replication, using the cash flow from continuous hedging in the underlying contract, is the basis for many strategies which make use of option charac- teristics but do not actually involve options. We will discuss the best known of these strategies, portfolio insurance, in Chapter 13. a 6 & Option Values and Changing Market Conditions Every trader who enters the marketplace must balance two opposing considerations, reward and risk. A trader hopes that his analysis of market conditions is correct, and that this will lead to profitable trading strategies. But no intelligent trader can afford to ignore the possibility of error. If he is wrong, and market conditions change in a way that adversely affects his position, how badly might the trader get hurt? A trader who fails to consider the risks associated with his position is certain to have a short and unhappy career. Consider the trader who goes into the marketplace and purchases a futures contract. What is he worried about? Obviously he is worried that the market will fall. Indeed, anyone who takes a position in an underlying contract has only one real concern, that the market will move in the wrong direction. If a trader has a long position, he is at risk from a decline in the market; if he has a short position, he is at risk from a rise in the market. Unfortunately, the risks with which an option trader must deal are not one-dimen- sional. A wide variety of forces can affect an option’s value. If a trader uses a theoretical pricing model to evaluate options, any of the inputs into the model can represent a risk since there is always a chance that the inputs have been incorrectly estimated. Even if the trader has correctly estimated current market conditions, it’s possible that over time conditions will change in a way that will adversely affect the value of his option position. Because of the many forces affecting an option’s value, prices can change in ways which may surprise even the most experienced trader. Since decisions must often be made quickly, and sometimes without the aid of a computer, much of an option trader’s education consists of learning how changing market conditions are likely to change an option’s value and the risks associated with an option position. First, let’s consider the general effects of changing market conditions on an option’s value. These changes are summarized in Figure 6-1. As the price of the underlying rises or falls, options are more or less likely to finish in-the-money, and their values rise and fall accordingly. As volatility rises, extreme outcomes in the underlying contract become more likely, and this increases an option’s value. As volatility falls, or as time to expiration grows shorter, extreme outcomes become less likely, and this reduces an option’s value. 95 96 Chapter 6 Figure 6-1: The Effect of Changing Market Conditions on an Option’s Theoretical Value lf... Call values will... Put values will... The price of the underlying contract rises rise fall The price of the underlying contract falls fall rise Volatility rises rise rise Volatility falls fall fall Time passes fall” fall * In some unusual cases it may be possible for an option to rise in value as time passes. The circumstances which can cause this will be discussed later. Note that we have not considered the effect of changes in interest rates on option values. Since interest rates affect options differently depending on the underlying",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.429166"
}