{
  "id": "0bd01003c399",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 93,
  "content": "must decide which specific spread is best. That is, he must decide which exercise prices to use. A common approach is to focus on the at-the-money options. If a trader does this, he will have the following choices: Bull call spread: buy anin-themoneycall or buy an at-themoney call sell an at-the-money call sell an out-of-the-money Bear call spread: buyanatthemoneycall or buy an out-of-the-money call sell an in-the-money call sell an at-the-money call Bull put spread: buyanat-the-moneyput or buy an out-of-the-money put sell an in-the-money put sell an at-the-money put Bear put spread: buy anin-the-money put or buy an at-the-money put sell an at-the-money put sell an out-of-the-money put With four different bull spreads and four different bear spreads available, how can the trader choose the spread which represents the best value? One way to do this is to use a theoretical pricing model to evaluate several different vertical spreads. This has been done in Figure 10-4 for six different options on an underlying futures contract: an in-the-money, at-the-money, and out-of-the-money call, and an in-the-money, at-the- 206 Chapter 10 Figure 10-3 As the exercise prices become further apart, a vertical spread takes on greater bullish or bearish characteristics. es 7 —— jo a an slightly bullish / moderately bullish / —<_—_—- en ry builish money, and out-of-the-money put. The assumptions include an underlying price of 100, 12 weeks to expiration, a volatility estimate of 20%, and an interest rate of 8%. Suppose we are interested in doing a bull call spread. Two possibilities are to buy a 95 call and sell a 100 call, or buy a 100 call and sell a 105 call. The spreads and their theoretical values are: Spread Theoretical Value , Delta 95/100 call spread 2.87 +20 100/105 call spread 1.88 +20 Figure 10-4 Futures price = 100; Time = 12 weeks; Volatility = 20%; Interest = 8.00% Theoretical Option Value Delta Gamma Theta Vega 95 calf 6.63 71 3.4 —.017 16 100 call 3.76 51 41 —.022 19 105 call 1.88 31 3.7 —.020 17 95 put 1.72 -27 3.4 -.019 16 100 put 3.76 47 4.1 —.022 19 105 put , 6.79 -67 3.7 -.019 17 Bull and Bear Spreads 207 With both spreads having the same delta of +20, it may appear that the 100/105 spread is a better value since it is likely to be less expensive. But should this be the sole determinant in choosing a strategy? As in all spreads, the option trader’s goal is to create a position with positive theoretical edge, by either purchasing high value at a low price, or selling low value at a high price. In order to achieve this goal we need to know not only the theoretical values of the spreads, but also the prices of the spreads in the marketplace. From an option trader’s point of view, the relative prices of options in the marketplace is usually represented by the implied volatility. We know the value of the spreads based on our volatility input of 20%. What might be the prices of the spreads if implied volatility in the option market is something other than 20%? We can answer the question by using a theoretical pricing model with the same underlying price, time to expiration, and interest rate, but with volatilities lower and higher than 20%. This has been done in Figure 10-5 using volatilities of 16% and 24%, along with our estimated volatility of 20%. Going back to our bull call spread, suppose implied volatility is lower than our estimate of 20%, say 16%. We can see that the price of the 95/100 spread will be approximately 3.01, while the price of the 100/105 spread will be approximately 1.78. We have two choices: we can pay 3.01 for a spread that is worth 2.87 (the 95/100 spread}, or we can pay 1.78 for a spread that is worth 1.88 (the 100/105 spread). Clearly, we will prefer the 100/105 spread since it will result in a positive theoretical edge of .10. If we were to buy the 95/100 spread we would end up with a negative theoretical edge of .14. Now suppose implied volatility is higher than our estimate of 20%, say 24%. We can see that the price of the 95/100 spread will be approximately 2.77, while the price of the 100/105 spread will be approximately 1.94. Again, we have two choices: we can pay 2.77 for a spread that is worth 2.87 (the 95/100 spread), or we can pay 1.94 fora spread that is worth 1.88 (the 100/105 spread). Now we will prefer the 95/100 spread since it will result in a positive theoretical edge of .10. The 100/105 spread would result in a negative theoretical edge of .06. Figure 10-5 95 95/100 100 100/105 105 Volatility Call Spread Call Spread Call 16% 6.02 3.01 3.01 1.78 1.23 20% 6.63 (71) 2.87 (20) 3.76 (51) 1.88 (20) 2.57 (31) 24% 7.28 2.77 4.51 1.94 2.57 95 95/100 100 100/105 105 Volatility Put Spread Put Spread Put 16% 1.11 1.90 3.01 3.13 6.14 20% 1.72 (-27) 2.04 (20) 3.76 (-47) 3.03 (20) 6.79 (-67) 24% 2.37 2.14 4.51 2.97 7.48 208 Chapter 10 What’s happening here? Even though both spreads have the same delta values, under one set of circumstances we seem to prefer the 95/100 spread, while under different circumstances we seem to prefer the 100/105 spread. The reason becomes clear if we recall one of the characteristics of option evaluation introduced in Chapter 6: If we consider three options, an in-the-money, at-the-money, and out-of: the-money option which are identical except for their exercise prices, the at-the-money option is always the most sensitive in total points to a change in volatility. This means that when all options appear overpriced because we believe implied volatility is too high, in total points the at-the-money option will be the most overpriced. When all options appear underpriced because we believe implied volatility is too low, in total points the at-the-money option will be the most",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.436591"
}