{
  "id": "2f4aeae16344",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 32,
  "content": "we select the three trading parameters (GDX_weight, entry threshold, and lookback) that maximize cumulative in-sample return over the three-dimensional parameter grid using exhaustive search. (Gradient-based optimization did not work due to multiple local maxima.) We use that fixed set of three optimal trading parameters to specify the strategy out-of-sample on the test set. With conditional, parameter optimization, the set of trading param- eters used each day depends on a predictive machine-learning model trained on the train set. This model will predict the future one-day return of our trading strategy, given the trading parameters and other market conditions. Since the trading parameters can be varied at will (i.e., they are control variables), we can predict a different future return for many sets of trading parameters each day, and select the optimal set that predicts the highest future return. That optimal parameter set will be used for the trading strategy for the next day. This step is taken after the current day’s market close and before the market open of the next day. In addition to the three trading parameters, the predictors (or “fea- tures”) for input to our machine learning model are eight technical indica- tors obtained from the Technical Analysis Python library: Bollinger Bands Z-score, Money Flow, Force Index, Donchian Channel, Average True Range, Awesome Oscillator, and Average Directional Index. We choose these indi- cators to represent the market conditions. Each indicator actually produces 2 × 7 features, since we apply them to each of the ETFs GLD and GDX price Chan800064_c07.indd 141 6/7/2021 7:16:53 AM 66 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 142 QUANTITATIVE TRADING series, and each was computed using seven different lookback windows: 50,100, 200, 400, 800, 1600, and 3200 minutes. (Note: This is not the same as the trading parameter “lookback” described earlier.) Hence, there are a total of 3 + 8 × 2 × 7 = 115 features used in predicting the future one- day return of the strategy. But because there are 5 × 10 × 8 = 400 combi- nations of the three trading parameters, each trading day comes with 400 rows of training data that looks something like the table below (labels are not displayed): GDX_ weight entry_ threshold look back Z-score- GLD(50) Z-score- GDX(50) Money-Flow- GLD(50) Money-Flow- GDX(50) . . . 2 0.2 30 0.123 0.456 1.23 4.56 . . . 2 0.2 60 0.123 0.456 1.23 4.56 . . . 2 0.2 90 0.123 0.456 1.23 4.56 . . . . . . 4 5 240 0.123 0.456 1.23 4.56 . . . 4 5 360 0.123 0.456 1.23 4.56 . . . 4 5 720 0.123 0.456 1.23 4.56 After the machine learning model is trained, we can use it for live pre- dictions and trading. Each trading day after the market closes, we prepare an input vector, which is structured like one row of the table above, popu- lated with one particular set of the trading parameters and the current values of the technical indicators, and use the machine learning model to predict the trading strategy’s return on the next day. We do that 400 times, varying the trading parameters, but obviously not the technical indica- tors’ values, and find out which trading parameter set predicts the high- est return. We adopt that optimal set for the trading strategy next day. In mathematical terms, GDX_weight_optimal, entry_threshold_optimal, lookback_optimmal argmax GDX_weight, entry_threshold, lookback pred … iict GDX_weight, entry_threshold, lookback, technical indicaators 3 where predict is the predictive function available from our machine learn- ing website predictnow.ai’s API, which uses random forest with boosting as the training algorithm. The sample Python Jupyter notebook code frag- ment for training a model and using it for predictions is displayed here. (The code won’t work unless you sign up for a trial with predictnow.ai.) Chan800064_c07.indd 142 6/7/2021 7:16:54 AM 67 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 143 # TO BEGIN ANY WORK WITH PREDICTNOW.AI CLIENT, WE START BY IMPORTING AND CREATING A CLASS INSTANCE from predictnow.pdapi import PredictNowClient import pandas as pd api_key = \"%KeyProvidedToEachOfOurSubscriber\" api_host = \"http://12.34.567.890:1000\" # our SaaS server username = \"helloWorld\" email = \"helloWorld@yourmail.com\" client = PredictNowClient(api_host,api_key) # You will need to edit this input dataset file path and labelname! file_path = 'my_amazing_features.xlsx' labelname = 'Next_day_strategy_return' import os # FANTASTIC JOB! NOW YOUR PREDICTNOW.AI CLIENT HAS BEEN SETUP. # For classification problems #params = {'timeseries': 'yes', 'type': 'classification', 'feature_selection': 'shap', 'anal- ysis': 'none', 'boost': 'gbdt', 'testsize': '0.2', 'weights': 'no', 'eda': 'yes', 'prob_calib': 'no', 'mode': 'train'} # For regression problems, suitable for CPO params = {'timeseries': 'yes', 'type': 'regression', 'feature_selection': 'none', 'analysis': 'none', 'boost': 'gbdt', 'testsize': '0.2', 'weights': 'no', 'eda': 'yes', 'prob_calib': 'no', 'mode': 'train'} # LET'S CREATE THE MODEL BY SENDING THE PARAMETERS TO PREDICTNOW.AI response = client.create_model( username=username, # only letters, numbers, or underscores model_name=\"test1\", params=params, ) # LET'S LOAD UP THE FILE TO PANDAS IN THE LOCAL ENVIRONMENT from pandas import read_csv # If you have the Excel file, replace read_csv with read_excel from pandas import read_excel df = read_excel(file_path, engine=\"openpyxl\") # Same here df.name = \"testdataframe\" # Optional, but recommended response = client.train( model_name=\"test1\", input_df=df, Chan800064_c07.indd 143 6/7/2021 7:16:54 AM 68 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:43.608837"
}