{
  "id": "3af38394e665",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 13,
  "content": "impact on your equity this past year? If there is one thing that I wish I had done differently this year, it is how I managed my position in Amazon. Amazon was a multiyear trade. As you 45 know, most of my trades last weeks or months, not years. Amazon was a super-cycle trade that the market never appreciated until one day it woke up and realized that cloud computing is everything. I had millions of profits in that trade, and I decided I wouldn’t exit the position because I didn’t want to take the tax hit. Amazon is down 55% or 60% this year, and this legacy position is the most significant negative contributor to my account this year. I obviously would have been better off taking the 23% tax hit. So, if it weren’t for the tax consideration, you would have been out of the position. Oh, of course. Well, then, there is another way of looking at it. Maybe the tax consideration also kept you in for a good part of the advance before Amazon reached its high. You probably would have gotten out well before the ultimate high. That’s fair. You’re right. What was your trading experience during the Covid bear market? It was exhilarating. I felt that everything I had ever done had prepared me for what happened in 2020. It was the biggest year of my life. I made over $20 million in profits on an account that started the year near $7 million. It all started with Covid, or the coronavirus, which was what it was called then. The second I got the first word of the coronavirus in China, I started translating Chinese blogs and newspapers into English. It didn’t take long for me to see that something big was happening. I was so confused because it seemed inevitable that this virus brewing in China would become a global pandemic. It was clear to anyone who understood how viruses work that this outcome was unavoidable. And I thought that the degree to which the coronavirus did damage almost didn’t matter because the threat of it alone would be catastrophic for global markets. I was looking at what appeared to be the most severe global threat in my life. It was a train that couldn’t be stopped. I could not understand why global markets weren’t reacting to it. How did you first learn of the coronavirus? It was a story you could find that no one was talking about. But it was not hard to find the story. I don’t remember where I saw it first, but it was probably some headline. And as you know, when I see something, I don’t just go on with my day. Everything I see, I stop and ask myself, “Is this meaningful? 46 Can it significantly impact public markets in any way?” If it does, then I have to start my research process. So that is what I did. I quickly concluded that the coronavirus was an unstoppable threat to world financial markets. Did the fact that the markets weren’t reacting give you any pause? I was stunned, absolutely stunned. I had 100% conviction, not 99%. What’s crazy is that it is usually difficult for me to feel strongly about something that is apparent. I was thinking, “How on earth could people not see something this large?” It’s quite easy to understand how I can see something that is trending on TikTok in a demographic that is far removed from Wall Street and know that my competition on Wall Street doesn’t see it. But to see something big and obvious and then have the entire financial community brush it off was wild to me, and it still is to this day. Can you explain this behavior? I could explain it this way: It is difficult for people to wrap their heads around extreme anomalies or believe in them until they are right in front of their faces. I believe if there was news that a large asteroid was going to hit the earth—I’m not talking about an end-of-the-world situation, but big enough to cause catastrophic destruction—there would be a good time window to trade on it. I think people would be unable to accept that truth without time to process it. We experienced a similar situation in 2008. Some people saw the impending financial crisis as clear as day, but the market was unwilling to believe it until it couldn’t be ignored. That historical precedent assured me that the market could ignore something big and obvious. But unlike in 2008, when a financial asset—securitized mortgages—triggered the crisis, financial institutions had no control over the situation with Covid. What trades did you take to benefit from the impending pandemic you anticipated? I had a straightforward trading strategy: I went leveraged short on the market as a whole, as well as travel and casino stocks. The reason why I picked those sectors is obvious. If you have a pandemic, the thing that should get hit the hardest is travel. And what other sector would have to close down completely? The answer is casinos. If you’re in the middle of a 47 pandemic, you can’t fly to Vegas to sit at a card table next to somebody. So, I went short the market and a combination of airline, cruise, and casino stocks. When you say “leveraged short,” do you mean options? Yes, as my primary short position, I bought weekly puts in the stock indexes and the stocks I wanted to be short. I got my ass kicked for 2½ weeks. I bought weekly options because I wanted to maximize my position. At the time, I had about $7 million in my account. Each week that passed with nothing happening, I lost a couple of hundred thousand dollars as the options expired worthless. I bought the weekly options again and again. I couldn’t stop. But I was getting nervous, wondering how much longer I could keep taking these significant",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:44.180164"
}