{
  "id": "d8c61b1637eb",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 112,
  "content": "point which we would not have 2. On the day a stock gives up its dividend, prices are typically disseminated with the dividend already deducted from the stock’s price. Hence, a 100-point stock which gives up a 2-point dividend overnight and opens the next day at 98 would be deemed to have opened unchanged since the 2-point drop in its price results from the dividend payout, not from any change in investor demand. Early Exercise of American Options 245 collected through exercise of the call. Therefore, our third choice, selling the call and buying the stock, is the optimum choice. Since the only reason a trader would ever consider exercising astock option call early is to receive the dividend, ifa stock pays no dividend there is no reason to exercise a call early. If the stock does pay a dividend, the only time a trader ought to consider early exercise is the day before the stock goes ex-dividend. At no other time in its life is a stock option call an early exercise candidate. We noted that in an American (exercise) market an option should never trade at less than parity. Is the same true in a European (exercise) market? In our example of the 90 call and stock at 100, with an expected two-point dividend, the call price will clearly drop when the stock goes ex-dividend. If the option cannot be turned into stock through exercise prior to the ex-dividend date, the option is clearly going to lose value. Ifit has very little time value, the amount it will lose when the dividend is given up may make the option worth less than parity. In our example, if the option expires in two weeks with interest rates at 8% and a volatility of 20%, the European value of the 90 call is approximately 81/4. This is 13/4 under parity, due to the fact that a call option, no matter how deeply in-the-money, does not carry with it the right to the dividend. Only ownership of the stock carries that right. Early Exercise of Puts for Interest As we did with a stock option call, we can express a stock option put’s value in terms of its components: put value = intrinsic value — interest rate value + volatility value + dividend value In the case of a put, the only component that affects its value negatively is the interest rate component. If the negative effects of interest rates are greater than the positive effects of volatility and dividends, it might be possible for a put, if it is European, to be worth less than parity. Consider this situation: Stock price = 100, Time to expiration = 8 weeks, Volatility = 20% Interest rate = 8.00%, Dividend = 0 With these assumptions, the value of a 110 call is approximately .70. Using the put/call parity relationship, we can calculate the value of the 110 put: put value = call value + exercise price — stock price — carrying costs The carrying costs on the exercise price of 110 are: 110 x 56/365 x 8% = 1.35 The European put value is therefore: .70 + 110-100 - 1.35 = 9.35 Since the 110 put is only worth 9.35 if we hold it to expiration, but is worth 10 points if we exercise it today, the option is apparentiy worth more dead (exercised) than alive 246 Chapter 12 (unexercised). When we exercise the 100 put we get to sell stock at 110, and we can earn interest on this 110-point credit to expiration. Whereas a stock option call can only be an early exercise candidate on the day prior to the stock’s ex-dividend date, a stock option put can become an early exercise candidate anytime the interest which can be earned through the sale of the stock at the exercise price is sufficiently large. Determining exactly when this happens is a difficult problem, but if the stock pays a dividend it is most likely to occur on the day after the stock goes ex-dividend. Since a put is a substitute for a short stock position, one of the advantages of holding a put is to avoid paying the dividend. Hence, a trader will almost always want to hold the put through the ex-dividend date. Then, if the interest considerations are sufficient, the trader will exercise his put. In an American (early exercise) market no put option can be trading at less than parity. Otherwise there is an immediate arbitrage opportunity available by purchasing the stock, purchasing the put, and immediately exercising the put. The profit will be equal to the amount by which the put is trading at less than parity. This is not necessarily true in a European (no early exercise) market, where the option must be carried to expiration. In our example of the 110 put where the theoretical value derived from the call price was 9.35 (.65 less than parity), the market in the European 110 put might be 91%-914. A market maker is willing to sell the option at 914 (14 less than parity) because he can hedge himself by selling stock, and he will be confident in the knowledge that he will not be required to buy back the stock until expiration. The interest he earns on tha otack tn ayniratinn uzill mara than nffeat the amniunt he will Inca hy calling the nut Le OLULA LU CAPUAUUIL Will LUIUIe Uldli ULIDCL LID GLIUULIL LIC VV Ik Mot Wy oCiiuig UIC PUL below parity. Conditions for Early Exercise If given the chance, there are clearly reasons why a trader might want to exercise an American option early. In the case of futures options, when the option is subject to stock-type settlement, the trader is trying to capture the interest on the option’s intrinsic value. In the case of stock option calls, he is trying to capture the dividend which the stock pays. In the case of stock option puts, he is trying to capture the interest on",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.439424"
}