{
  "id": "c7553ba99b2f",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 47,
  "content": "warning sign, and simply avoid trading in these areas. Last Gasp There is a trading rule that says, only half in jest, that the market will always do whatever will hurt the greatest number of traders. Part of this is subjective—we all use humor to deal with losses at times—but there also is a reality here, driven by that core tendency of markets to seek volume and activity. After an extended run-up followed by a well- recognized topping formation (e.g., head and shoulders or double top), there will likely be many traders who short in anticipation of a trend reversal with stops just beyond the recent highs. In addition, there will be traders who think they are smarter than the market, and who will be playing for trend continuation at these points. They too will buy, either on stops or with contingent orders when the market violates the previous high. Regardless of the reason behind the buying, there is almost always a lot of latent buying pressure waiting just beyond the previous highs. The moment of truth comes as soon as the market probes that area, stops are elected, and the initial buying dries up. Are there larger buyers there, waiting to bid the market higher with commitment, or was the whole move a fake-out? If the latter, this will be obvious as prices fall back below the previous highs and many of the shorts who were stopped out will reestablish (selling pressure). Trapped longs will eventually have to sell as well, whether they were holding established positions or entered on the breakout. The result of all of this selling pressure is that the market ﬁnally reverses and downside momentum develops as selling leads to more selling. This is a special case of a failure test at the highs of an old trend, and, in the right context, is an extremely reliable trend termination pattern. The actual “last gasp” pattern is nothing more than a Wyckoff upthrust, but the key is that it is preceded by sufﬁcient consolidation to set up the potential for another trend leg up; the pattern draws its power P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing 142 MARKET STRUCTURE FIGURE 5.15 Two Upthrusts in Disney Cap an Uptrend from the failure of that potential. (It is exactly reversed for a downtrend—i.e., a spring after a long-enough consolidation that the market appeared to be primed to break down.) Traders who recognize this pattern early can establish short positions at advantageous prices or at least can aggressively limit damage on long positions. Figure 5.15 shows a fairly brutal example in Walt Disney Company (NYSE: DIS): after a gap up and a short consolidation, the stock put in an upthrust at the highs. After consolidating again for nearly a quarter, another upthrust back above the level decisively ended any hopes for another easy trend leg up and the market gapped open lower the next day. Trend Change Without Warning Sometimes the absence of a pattern is a pattern in itself. Trends are powerful forces in markets, and it is very rare to see one stop and turn with no warning. Strong trends usually require time and substantial price action to reverse, so with-trend traders are usually rewarded for being somewhat stubborn in their exits. With a winning trend trade, it often pays to give it a little more room, or even to add to the position as it ﬂuctuates against the trend. This is normal, but there are cases in which a market makes a stunning reversal into a trend in the opposite direction without any warning. DIS-Da., a., Disney (Walt) Co II ,, , , , f '. 111, 11t11jllll1 Oct 11 .litl ,·. Apr .......... 44.00 43.00 42.00 1;11tt· 41.00 It •o.oo I 3s.oo 38.00 37.00 36.00 35.00 34.00 33.00 32.00 2.00 1.00 0.00 1.00 66 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing 144 MARKET STRUCTURE and failed trend reversals. In both cases, prices continue to move in the direction of the trend, but the difference is that, in a failed trend reversal, traders may have been encour- aged to enter countertrend positions in anticipation of the trend change. An example of this might be if a well-watched index or commodity puts in a large-scale head and shoul- ders pattern. The media will be discussing the obvious pattern for weeks, some large traders and funds will establish countertrend positions, and many small traders will join the party. If this trend does not reverse, if the trend reversal fails, these traders will be forced to adjust their positions, and their activity will add fuel to the ﬁre as the original trend continues on. Another much more common example is the complex pullback. The second countertrend leg of this pullback will be viewed by some market participants as a legitimate trend reversal. When it becomes obvious they are wrong, their efforts to adjust their positions add momentum to the other side. It is probably not necessary to study these failed trend reversals in detail, because, at some level, they are just a type of trend continuation. Realize that they derive their power from potentially trapped traders who were aggressively anticipating trend reversal (see Figure 5.16). Anytime too many people are leaning in the same direction, the market is vulnerable to an outsized move in the opposite direction. FIGURE 5.16 Failed Breakdown (Arrow) Leads to a Retest of Highs with the Possibility of Contin- uation into Another Trend Leg VHC - Daily V,metx Holding Corp ~IJ ··pi .. _ l l11,!-·4 ·-... l!¼h, ·-- jlt lllit1tlh1 - - tti\\;nl« .---......_., 111 '11 Apr 30.00 I",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "market_structure",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.702753"
}