{
  "id": "200d754e404d",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 45,
  "content": "Changing Market Conditions on an Option’s Theoretical Value lf... Call values will... Put values will... The price of the underlying contract rises rise fall The price of the underlying contract falls fall rise Volatility rises rise rise Volatility falls fall fall Time passes fall” fall * In some unusual cases it may be possible for an option to rise in value as time passes. The circumstances which can cause this will be discussed later. Note that we have not considered the effect of changes in interest rates on option values. Since interest rates affect options differently depending on the underlying instrument and the settlement procedure, it is not possible to generalize about the effect of changing interest rates, However, we can logically deduce the effect of changing interest rates on option values by thinking of a call as a substitute for purchasing the underlying contract, and a put as a substitute for selling the underlying contract. For example, suppose we want to purchase a certain stock. The alternative is to purchase a call option. If interest rates are high, we will prefer the cal! since the outright purchase of stock requires a much larger cash outlay, and therefore a greater carrying cost. On the other hand, if interest rates are low, the carrying cost associated with stock is not as ereat, and calls become a less attractive alternative to purchasing the stock. Hence, rising interest rates cause stock option calls to rise in value, and falling interest rates cause stock option calls to fall in value. The effect is just the opposite for stock option puts. If we are considering the sale of stock, the alternative is the purchase of a put. In a high interest rate environment the sale of stock will be more desirable since the cash credit resulting from the sale will earn greater interest. In a low interest rate environment puts become more attractive since the earnings on any cash credit resulting from the sale of stock is reduced. Hence, rising interest rates cause stock option puts to fallin value, and falling interest rates cause stock option puts to rise in value. The situation is more complex when it comes to options on foreign currencies because a trader must deal with two interest rates, a domestic rate and a foreign rate. The effect of changes in domestic interest rates will be the same as the effect on stock options: a call will avoid the cash outlay required to purchase the currency, and a put will forego the cash credit resulting from the sale of the currency. However, the effect of a change in the foreign interest rate will be just the opposite. If foreign interest rates are high, rather than purchase a call one will always prefer to purchase the currency outright in order to earn the higher interest rate. Hence, higher (lower) foreign interest rates lead to lower (higher) call values. But if foreign rates are high, a put becomes a Option Values and Changing Market Conditions 97 more desirable alternative to selling the foreign currency since one will want to continue to earn a high rate on the foreign currency. Hence, higher (lower) foreign interest rates lead to higher (lower) put values. Stock and foreign currency options are always assumed to be subject to stock-type settlement (immediate cash payment for the option). But the settlement procedure for options on futures contracts may vary, depending on the exchange. Sometimes such options are settled like stock and sometimes they are settled like futures. While there is no catrying cost associated with a futures contract, there will be a carrying cost associated with an option if it is subject to stock-type settlement. In such a case, option values will fall when interest rates are high (the option becomes a less desirable altemnative to a position in the futures contract} and rise when interest rates are low (the option becomes a more desirable alternative to a futures position). The effect, however, will be small since the value of the option, unless it is very deeply in-the-money, is small relative to the value of the underlying contract. Futures options are therefore much less sensitive to changes in interest rates than options on stocks and foreign currencies. When futures options are subject to futures-type settlement, changes in interest rates have no effect at all on option values since there is no carrying cost associated with either the underlying contract or the option. The general effects of a change in interest rates are shown in Figure 6-2. In each case, the reader can intuitively arrive at the correct conclusion if he asks himself whether a call (put) is a better or worse substitute for the outright purchase (sale) of the underlying contract. The dividend which is expected to be paid on stock during the life of a stock option may also affect the value of the option. In a simple sense, we can equate a dividend payment with the foreign interest rate on a currency option. If we own the foreign currency we can earn interest on it. In the same way, if we own the stock we will receive whatever dividend is paid on the stock, If dividends increase, we will prefer to take a long position by purchasing the stock rather than purchasing a call. The call therefore becomes a less desirable alternative to owning the stock. In the case of puts, if dividends increase we will prefer to take a short position by purchasing a put rather than selling the stock, since the sale of the stock will result in the loss of the dividend. Hence, rising dividends will cause stock option calls (puts) to fall (rise) in value, and falling dividends will cause stock option calls (puts) to rise (fall) in value. This is summarized in Figure 6-3. We can generalize about the effects of changing market conditions on the value of options, but we must still consider the magnitude of the changes. Will the changes be",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.429317"
}