{
  "id": "986f2ec96811",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 89,
  "content": "trading activity in such markets, but the bid/ask spread is much wider, resulting in greater theoretical edge each time a trade is made. Of course, any mistake can be a problem with which the trader will have to live for a long time. However, an experienced trader is expected to keep his mistakes to a minimum. The most liquid options in any market are those which are short-term and which are either at- or slightly out-of-the-money. Such options always have the narrowest bid/ask spread, and there are usually traders willing to buty or sell large numbers of these contracts. As a trader moves to longer term options, or to options which are more deeply in-the-money, he finds that the bid/ask spread begins to widen, and there are fewer and fewer traders interested in these contracts. While at-the-money short-term options are constantly traded, deeply in-the-money long-term options may not trade for weeks ata time. In addition to the liquidity of an option market, a trader should also give some thought to the liquidity of the underlying market. If a trader has an option position and wants to make an adjustment, he may find it difficult to do if the option market is illiquid. If the underlying market is liquid, he will at least he be able to make his adjustment in that market with relative ease. The most dangerous market in which to trade is one where both the options and the underlying contract are inactively traded. Only the most experienced and knowledgeable traders should enter such markets. End-of-day volume figures and bid/ask spreads in S&P 500 index options traded at the Chicago Board Options Exchange on July 9, 1993 are shown in Figure 9-15. Note the lower volume and wider bid/ask spread for back month and deeply in-the-money options, versus front month and at- and out-of-the-money options. o Gugsi| ou 0 ee m1e r) rALe 02 r) zz \"AleY 5 Buysi ou 0 VAT ZLt 0 wLb BLb 0 YLb OIL s Buyjsi| ou ) Serb *AbL 9 yet MEL €z yet ML Buysi) ou ) Yel LL vel 46 %6 OL %9 %9 0g vel *Avh ZL 6 %s O&l ZL %9 Zee’ = %E we Buijsi| ou 8 Sl %9 O19 Seb tp ger'k 84h i Bunsy ou 9zh %S %AS Se6 %e “Ae gelz % % 0 %6 %6 SLL'L ¥ ye o0e %e HY oel't = % Burs! ou 1 we € ceri lb Yt Ze6 % ly % %9 %9 ozs %z %z os} = l z % ol, 001 %9 84S 008 Het Ah 0 1 lp, ele 8094 Buys! ou Ol Me} l OL oly olf 0 oly Bugsi ou ) we z@ oot =& 6, 6op OY Buysi ou Ses “AE 7A zsh vel Sal LOE % oly, Buysi ou 1 %S S SSL. KE Ye oog 89% 9% os ras Yr lz HL Bd. 992 %G 84S Eror %i “Ab Suysi| ou 91 it 8401 0S *%48 %eb 16g hb Sep Bugsi| ou I vt KEL sov'c 4 bt zes'z 48 %e ft) “ve %e% 0 Ygt Shh r) 9 8St gse pL MEL Buijsi| ou 00g HweY %lz ) *A02 eet ) \"481 ah 0 %0E %6z ot %9% 2% S% r) XY Se ave 0 yee see ) 296 24G6 ) Le Of ) 62 *A8% 0 %e~ = dz euinjoA SV pia eunjoA Sy PI eunjoA SY PI eunjoA =4sSV = PIA suondo s2quisseg suondo sequiajdas suondo jsnbny suondo Ajnr 198 ind OLb ind Sop ind o9¢ ind scp ind ost ind Spy ind Orr qnd ser ind oe ind szp ind oz Ireo OL¢ Ire SOF 1129 O94 \\f89 SSP 89 OS¢ eo Spy IWe9 OPP Ife9 SE Ed OF Wed S2p eo Oy Li'Sbp ye Xepu] 00S ABS (FO9D) suoydo xepuy COS AVS E66) ‘6 Aine SL-6 einBi4 & 10 % Bull and Bear Spreads While delta neutral strategies are perhaps the most popular among active option traders, many traders prefer to trade with a bullish or bearish perspective in the underlying instrument. The trader who wishes to take a directional position in the underlying instrument has the choice of doing so in either the instrument itself, buying or selling a futures contract or stock, or in the option market. If he chooses the option market, the trader has the opportunity to integrate option pricing theory into a bull or bear strategy in order to take advantage of theoretically mispriced options. NAKED POSITIONS Since the purchase of calls or the sale of puts will create a positive delta position, and the sale of calls or purchase of puts will create a negative delta position, we can always take a directional position in a market by taking an appropriate naked position in either calls or puts. If all options are overpriced (high implied volatility], we might sell puts to create a bullish position, or sell calls to create a bearish position. If all options are underpriced (low implied volatility), we might buy calls to create a bullish position, or buy puts to create a bearish position. The problem with this approach is that, as with all non-hedged positions, there is very little margin for error. If we purchase options, we will lose money not only if the market moves in the wrong direction, but also if the market fails to move enough in our favor to offset the time premium in the option. If we sell options, we face the prospect of unlimited risk if the market moves violently against us. An experienced trader will always look for a way to improve the risk/reward characteristics of his position by looking for positions with the greatest possible margin for error. This philosophy applies no less to directional strategies than to volatility strategies. In directional strategies, as in volatility strategies, this can often be done by finding an appropriate spread. BULL AND BEAR RATIO SPREADS If a trader believes that implied volatility is too high, one sensible strategy is",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.435969"
}