{
  "id": "b52c1c81e6e2",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 25,
  "content": "the ability to do what is necessary for the trade even while experienc - in g unwanted thou g hts and feelin g s. The most important mental skill to develop in this re g ard is mindfulness. Keep in mind that mindfulness is not practiced to “fi x” or eliminate unwanted thoughts and feelings. That just brings us back to the struggle and playin g a fruitless tu g ‐of‐war with our mind, a distraction at best. Mindful acceptin g of unwanted thou g hts and feelin g s is acknowled g in g them, makin g room for them without struggling or buying into them, and then putting your attention onto whatever important tradin g task is at hand. Practicin g mindful acceptance of undesired thou g hts TABLE 8.1 Relationships between Mindful Acceptance, Attention, Actions, and Consequences Mindful Acceptance Unwanted Thoughts and Feelings Attention Actions Consequences Y es De f use an d accept t h em, r ea l ize t h ey are jus t t emporary , ma k e room f or t h e m R e m a in s o n t h e tas k or t h e tra de D o n e in the s ervice o f your t ra d ing or t ra de Long‐term goa l s more l i k e l y to b e ac h ieve d No Don’t acce p t them, re m a in f use d a nd b e li e v e t he y are intolerable and/or enduring, see k t o get rid of the m S hifts from tas k o r t r a d e to in te rn a l state ; trader di st r acted Do n e to re d uce o r e limin ate di sco mf o r t L on g ‐term g oals will not be ac hi e v ed 189ACCEPTANCE AND COMMITTED TRADING put stu d y participants t h rou gh a h i ghl y stress f u l exercise t h at e l evate d bl oo d pressure and heart rate in all participants. Those participants who refl ected on and affi rmed t h eir persona l va l ues b e f ore t h e stress test, h owever, h a d si g ni fi cant l y l ower cortiso l res p onses t h an p artici p ants w h o d i d not. Cortiso l is t h e stress h ormone we d iscusse d in Chapter 2 that becomes tri gg ered in response to stressful situations and helps ac - tivate the fi g ht‐fl i g ht response. Affi rmin g our values helps to buff er us a g ainst stress. T h in k a b out w h at matters most to you an d t h e k in d o f tra d er you want to b e . W h a t are t h e qua l ities an d c h aracteristics you want to possess as a tra d er? Russ Harris, t h e Australian physician and expert in acceptance and commitment psycholo g y we me t ear l ier, suggests you t h in k a b out your va l ues b y a dd ressing t h ese important ques- tions: I f not h ing cou ld h o ld you b ac k f rom b eing t h e tra d er you rea ll y want to b e, w h at wou ld t h at l oo k l i k e? Remem b er, not h ing can stop you. How d o you rea ll y want to be and act as a trader? Use Exercise 8.2 to answer these q uestions. A f ter t h in k ing a b out t h is, consi d er t h at you actua ll y h ave b ecome t h e k in d o f trader you want to be and have traded this way over the next ten years. At the end of that ten y ear period, a journalist writes a stor y on y ou as a trader. What would the writer say about you? What would the journalist say are three or four of your greates t qualities? Play the role of the journalist and provide the answers on the form. The point of these exercises is that you want to know and live what g ives your trading meaning. Y ou want to live a valued trading life. At the end of ten years, you don’t want the journalist to say , “W ell, to sum it all up, this trader was very , very g ood at avoidin g uncomfortable thou g hts and feelin g s.” In a very real way , it comes down to a basic, fundamental, and crucial choice, as out - lined by Wilson and Murrell. 3 I paraphrase them and apply their words to tradin g here: On the one hand, y ou can have the choice of no fear or anxiet y . Y ou won’t have trading stress or uncomfortable feelings or unwanted trad - in g thou g hts. In fact, you can have no further tradin g losses and never Exercise 8.2 Finding My Trading Values Part 1: If nothing could hold you back from being the trader you really want to be, what would that look like? How do you really want to be and act as a trader? Part 2: After a decade of living and trading as you describe in Part 1, write about what sort of trader you have been. Imagine you are a reporter writing an article on yourself. Describe",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "fundamentals"
  ],
  "created_at": "2026-02-05T00:37:45.720409"
}