{
  "id": "6b60afaf049a",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 15,
  "content": "I wasn’t going to invest in these companies while the market was in freefall. I was prepared to go all in on these long trades in a way that I had never done before, but I was not going to flip from my short positions to long positions until after the market had made a turn. I knew precisely what stocks I was going to trade. I was mentally prepared, so no research had to be done. Exactly two days after the market bottomed, I exited all my short positions and went leveraged long. How did you know this two-day rebound was the beginning of a major reversal instead of a minor blip correction in a continuing bear market? I didn’t care about the market as a whole so much as the fact that the rebound would start to change the thinking about where the opportunities were right then. I knew that even if the market saw some renewed selling, the what’s next mentality of Wall Street would come into play. There was an inevitability in these trades. You could not debate the fact Amazon, Peloton, and Shopify were not just going to be strong, but were going to see the very best months in their histories. There was also a new reality with the advent of government stimulus. We went from the world is falling apart to the government is going to save us. So, I went all in on what I would call the stay-at-home trades. Then I had the great outdoor trades investing in bicycle, boat, and RV companies. Everything I do hinges upon changes in consumer behavior, and we have never seen a time of change in consumer behavior that comes close to what we saw in 2020. The world’s consumers changed everything about their lives. 50 They changed the way they shopped. They changed the way they traveled. Knowing what I do, I should have had the best year of my trading career, and I did. I turned my account of less than $7 million at the start of the year into nearly $30 million by year-end. I had 30 monster trades, and every one of them was the most obvious trade in the world. What are people doing? They are stuck at home, so they are shopping online, which has obvious implications for Amazon and Shopify, which we talked about. Home entertainment becomes crucial, which is great for Netflix. Although people are no longer flying or staying in hotels, they can rent an Airbnb with their family members. They can drive to their destination, but not everyone owns a car, so rental cars became huge. There was a small company in Canada that owned Schwinn bicycles. Has there ever been a time in history when more people wanted to bicycle? That company went up 10×. Every kid is doing school from home. They all need a printer and, even more importantly, printer cartridges, so Hewlett- Packard had some of their best quarters ever. Suddenly, people need a good computer camera because the whole world is on Zoom. Could you even write a better script for Logitech? How did you know when to abandon the ship? It was the same methodology I told you about in our original interview. I invest early before people see the consumer trend I identify and exit when we reach information parity. It isn’t always black-and-white. It’s not like nobody knew about this yesterday, and everybody knows about it today. Over time, more and more people start to notice what is happening and write comments on web boards and Twitter. “Hey, I noticed that web cameras are sold out everywhere. Could this be a positive sign for Logitech?” When I start seeing regular people talking about the idea, analysts writing about it, and companies crushing earnings, I know we are at information parity, and I exit. Has there been any significant change in your methodology since our original interview? Yes, the emergence of TikTok was a game-changer for me. There are over a billion people on TikTok from every walk of life, and they are making videos about every single facet of life. In the comment section of those 51 videos, thousands of people talk about what they are doing, what they are feeling, and what they are buying. TikTok allows me to read shifts in consumer culture and behavior in real time. TikTok is a platform where people share what they’re excited about. I have never been more enthusiastic as an observational investor. I think the next five years will be the best years of my trading career, excluding 2020, which we talked about earlier. Were you able to adapt your software to search TikTok? No. Then how do you do a search on an app with a billion users? Easily. There is a search bar in TikTok, and you can search for any keyword or combination of keywords that you want, the same way that I used to do this on Twitter. You can then see the difference in videos made about that subject two months ago, six months ago, or a year ago compared with the videos made about it this week or this month. Can you give me an example of a trade that was influenced by TikTok? One of my best trades this year [2022] was Crocs (symbol: CROX). Crocs bought a company called Hey Dudes, which makes an ugly, lightweight, extraordinarily comfortable, cheap slip-on shoe that started trending in Middle America. Wall Street thought that Hey Dudes was a joke and that the acquisition was a desperate move by Crocs to buy revenue growth. I knew that Hey Dudes was one of the hottest companies in the entire shoe world when Crocs acquired them. I had been following this privately held company for years, wishing I could invest in it. The Wall Street analysts that cover this sector are out of touch. They have no sense of reading consumer culture. They don’t have a",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:44.180496"
}