{
  "id": "3acfb9d620ec",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 19,
  "content": "h as reac h e d wee kl y resistance, a d ay tra d e is h e ld . Tr a d er t h in k s, “ T h is mar k et is rea ll y strong. T h ere is more money t o b e ma d e f rom t h is tra d e. ” F ocus is on t h e sa l ience o f t h e r ecent move. Tra d er b e l ieves t h e m in d’ s ta l e t h at t h is wi ll continue b ecause it l oo k s so strong. Tra d er is k een l y aware o f h ig h er time f rame resistance, w h ic h is t h e tra d e ’ s o bj ective. W h en t h e mar k e t reac h es t h at resistance, tra d e is cl ose d. Tra d er notes t h at t h e move up h as b een strong an d d oes h ave t h oug h ts it may continue h ig h er, b ut tra d er a l so k nows t h e pro b a b i l ities f avor c l osing t h e tra d e at resistance. A tra d e h as gone b a d . Instea d of ta k ing t h e l oss, t h e stop is c ance ll e d . Tr a d er l oo k s to exit on a ra ll y to avoi d a l oss . F ocus is on avoi d ing a l oss. Tra d er f ee l s t h at a l oss is unaccepta bl e. T ra d er b e l ieves t h e min d’ s story t h a t a ra ll y wi ll b ai l out t h e tra d e . Tr a d er no w locked in to a bad t r ade wi th emotions erupting an d a ll energy ch anne l e d to ma k e b rea k ‐even . T h e mar k et h as proven your ana l ysis wrong. Tra d e is c l ose d at its stop f or a l oss. Tra d er turns attention towar d reeva l uating t h e mar k et . Tr ade r does n ’t l i ke losses a n d feels t h e sting o f t h is one. Nonet h e l ess, it is accepte d as a part o f t h e pro b a b i l ity pro f i l e f or t h e tra d e setup. Because t h e l oss is d ea lt wit h quic kl y , attention is f ree to r etu rn to the m a r ket a n d n e w t r ade opportun i t i es. TABLE 6.1 (Continued) 24 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 138TRADE MINDF U LLY menta l wor k out. Do t h is routine l y an d you can b ui ld strong menta l musc l e. Ot h er - wise, you are at t h e mercy o f an untraine d an d i ll ‐equippe d min d . ■ Applying Mindfulness to Your Trading Min df u l ness is simp l e, t h oug h it is not easy to d o consistent l y . Because it is so un - comp l icate d , it can b e easy to d iscount. Some may won d er, “How can somet h ing so basic as mindfulness actually work?” Thin g s don’t have to be complex to create signi fi cant b ene fi t. An d a l t h oug h simp l e on t h e sur f ace, t h ere is a l ot going on un- d erneat h t h e sur f ace t h at wi ll b e h e l p f u l f or tra d ers to un d erstan d . T h ere are severa l interre l ate d processes at wor k in min df u l ness. Fran k Gar d ner an d Ze ll a Moore re- view these p rocesses in terms of human p erformance and Britta Hölzel, Sara Lazar, an d t h eir researc h team l oo k at t h em f rom t h e scienti fi c l enses o f psyc h o l ogy an d neura l imagery . So t h at you wi ll h ave a t h oroug h un d erstan d ing o f min df u l ness an d appreciate t h at a l t h oug h it is a simp l e practice, it is nonet h e l ess a power f u l one t h a t can change your trading and you as a trader, we briefl y discuss these processes and relate them to tradin g as we conclude this chapter. T able 6.2 provides a summary o f these processes and how they enhance tradin g performance. TABLE 6.2 How",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "psychology",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:45.719573"
}