{
  "id": "5dc367535a9a",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 120,
  "content": "a form of papertrading. weak form EMH A form of the EMH that holds that information contained in past prices cannot be used to predict future prices. If this form of EMH is true, then the discipline of technical analysis is invalid. whipsaws The tendency for many technical tools, systems, or indicators to accumulate many small losses while markets chop back and forth in trading ranges. For many of these systems, whipsaws are an unavoidable fact of life and must be offset by proﬁts from trending markets. z-score Also called a standard score, normal score, or a z-value: the number of standard deviations above or below a mean that a variable lies. 192 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-biblio JWBT634-Grimes April 27, 2012 18:15 Printer: Hamilton Printing Bibliography Acar, Emmanuel, and Robert Toffel. “Highs and Lows: Times of the Day in the Currency CME Market.” In Financial Markets Tick by Tick, edited by Pierre Lequeux. New York: John Wiley & Sons, 1999. Brock, William, Joseph Lakonishok, and Blake LeBaron. “Simple Technical Trading Rules and the Stochastic Properties of Stock Returns.” Journal of Finance 47, no. 5 (December 1992): 1731–1764. Brooks, Al. Reading Price Charts Bar by Bar: The Technical Analysis of Price Action for the Serious Trader. Hoboken, NJ: John Wiley & Sons, 2009. Bruguier, Antoine Jean, Steven R. Quartz, and Peter L. Bossaerts. “Exploring the Nature of ‘Trader Intuition.’ ” Journal of Finance 65, no. 5 (October 2010): 1703–1723; Swiss Finance Institute Research Paper No. 10-02. Available at SSRN: http://ssrn.com/abstract=1530263. Campbell, John Y., Andrew W. Lo, and A. Craig MacKinlay. The Econometrics of Financial Markets. Princeton, NJ: Princeton University Press, 1996. Collins, Bruce M., and Frank J. Fabozzi. “A Method for Measuring Transaction Costs.” Financial Analysts Journal 47, no. 2 (March–April 1991): 27–36, 44. Conover, W. J. Practical Nonparametric Statistics. New York: John Wiley & Sons, 1998. Crabel, Toby. Day Trading with Short Term Price Patterns and Opening Range Breakout . Greenville, SC: Trader’s Press, 1990. Cs´ıkszentmih´alyi, Mih´aly. Finding Flow. New York: HarperCollins, 1997. Cs´ıkszentmih´alyi, M., S. Abuhamdeh, and J. Nakamura. “Flow.” In Handbook of Competence and Motivation, edited by A. Elliot, 598–698. New York: Guilford Press, 2005. DeMark, Thomas R. New Market Timing Techniques: Innovative Studies in Market Rhythm & Price Exhaustion. New York: John Wiley & Sons, 1997. Dimson, Elroy, Paul Marsh, and Mike Staunton. Triumph of the Optimists: 101 Years of Global Investment Returns. Princeton, NJ: Princeton University Press, 2002. Douglas, Mark. Trading in the Zone: Master the Market with Conﬁdence, Discipline and a Winning Attitude. Upper Saddle River, NJ: Prentice Hall Press, 2001. Drummond, Charles. Charles Drummond on Advanced P&L. Self-published, 1980. Edwards, Robert D., and John Magee.Technical Analysis of Stock Trends, 4th ed. Springﬁeld, MA: J. Magee, 1964 (orig. pub. 1948). Ehlers, John F. Cybernetic Analysis for Stocks and Futures: Cutting-Edge DSP Technology to Improve Your Trading. Hoboken, NJ: John Wiley & Sons, 2004. 443 193 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-biblio JWBT634-Grimes April 27, 2012 18:15 Printer: Hamilton Printing 444 BIBLIOGRAPHY Elder, Alexander. Trading for a Living: Psychology, Trading Tactics, Money Management. New York: John Wiley & Sons, 1993. Faith, Curtis. Way of the Turtle: The Secret Methods That Turned Ordinary People into Legendary Traders. New York: McGraw-Hill, 2007. Fama, Eugene F., and Kenneth R. French. “The Capital Asset Pricing Model: Theory and Evidence.” Journal of Economic Perspectives 18, no. 3 (Summer 2004): 24–46. Feller, William. An Introduction to Probability Theory and Its Applications. New York: John Wiley & Sons, 1951. Fisher, Mark B. The Logical Trader: Applying a Method to the Madness. Hoboken, NJ: John Wiley & Sons, 2002. Grossman, S., and J. Stiglitz. “On the Impossibility of Informationally Efﬁcient Markets.” American Economic Review 70 (1980): 393–408. Harris, Larry. Trading and Exchanges: Market Microstructure for Practitioners. New York: Oxford University Press, 2002. Hintze, Jerry L., and Ray D. Nelson. “Violin Plots: A Box Plot-Density Trace Synergism.” American Statistician 52, no. 2 (1998): 181–184. Jung, C. G. Psychology and Alchemy. Vol. 12 of Collected Works of C. G. Jung . Princeton, NJ: Princeton University Press, 1980. Kelly, J. L., Jr. “A New Interpretation of Information Rate.” Bell System Technical Journal 35 (1956): 917–926. Kirkpatrick, Charles D., II. Technical Analysis: The Complete Resource for Financial Market Technicians. Upper Saddle River, NJ: FT Press, 2006. Langer, E. J. “The Illusion of Control.” Journal of Personality and Social Psychology 32, no. 2 (1975): 311–328. Lo, Andrew. “Reconciling Efﬁcient Markets with Behavioral Finance: The Adaptive Markets Hypothesis.” Journal of Investment Consulting , forthcoming. Lo, Andrew W., and A. Craig MacKinlay. A Non-Random Walk Down Wall Street. Princeton, NJ: Princeton University Press, 1999. Lucas, Robert E., Jr. “Asset Prices in an Exchange Economy.” Econometrica 46, no. 6 (1978): 1429–1445. Malkiel, Burton G. “The Efﬁcient Market Hypothesis and Its Critics.” Journal of Economic Perspectives 17, no. 1 (2003): 59–82. Mandelbrot, Beno ˆıt, and Richard L. Hudson. The Misbehavior of Markets: A Fractal View of Financial Turbulence. New York: Basic Books, 2006. Mauboussin, Michael J. “Untangling Skill and Luck: How to Think about Outcomes—Past, Present and Future.” Maboussin on Strategy, Legg Mason Capital Management, July 2010. Miles, Jeremy, and Mark Shevlin. Applying Regression and Correlation: A Guide for Students and Researchers. Thousand Oaks, CA: Sage Publications, 2000. Niederhoffer, Victor. The Education of a Speculator. New York: John Wiley & Sons, 1998. Plummer, Tony. Forecasting Financial Markets: The Psychology of Successful Investing, 6th",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:53.714148"
}