{
  "id": "8dfcc8417b12",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 46,
  "content": "case of puts, if dividends increase we will prefer to take a short position by purchasing a put rather than selling the stock, since the sale of the stock will result in the loss of the dividend. Hence, rising dividends will cause stock option calls (puts) to fall (rise) in value, and falling dividends will cause stock option calls (puts) to rise (fall) in value. This is summarized in Figure 6-3. We can generalize about the effects of changing market conditions on the value of options, but we must still consider the magnitude of the changes. Will the changes be large or small, representing either a major or minor risk, or something in between? Fortunately, along with the theoretical value, pricing models also generate several other numbers which enable a trader to assess not only the direction of the change, but also the relative magnitude of the change. While these numbers will not answer all our questions concerning changing market conditions, they will help us to better assess the risks associated with both individual and complex option positions. Chapter 6 98 (ajqeaydde jou) (a\\qeoydde jou) (ajqeodde jou) (ajqeoydde you) ONjeA Ul [fet onjeA ui esu (ajqeordde jou) (a\\qeoydde you) ej sayey yso10qUy uBjolol 3] (a|qeoydde jou) (a|qeordde jou) (ajqeordde jou) (ajqeoydde you) OnjeA ul esu One ut} [fet (a|qeoydde jou) (a)qeoy|dde jou) esly SoJey 38919}Uj ubjol04 J] peBueyoun ulewel peBueyoun ulewe anjea ul esu anjen ul esu anjeA Ul esu Onfea Ut jfe} an|BA Ul es ONIeA ui |e} lea sayey yous zu; ofsewog jj peGBueyoun uiewas pesueyoun ujeweal ON|eA ul He} ONjeA ul {IE} ONjeA Ut {TeI enjeA ul esti ON|BA ut [Teh enjeA ul esu asi Sayey ysaso}U] opsawog JI (juawenjes edAy seunjn}) \"+ IM JoR1]UOD SEIN\\N} B UO sjNd (juawetjes edAy seunjny) \"HIM JORIUOD SauNjn} & UO s}]eD (juawalyes adAj 400}s) \"HIM JORIUOSD SAININ} & UO s}nd QUelUaes adA) YOO}s) “** HIM JORIUOS SeINjnj B UO SIjeO ++ Him KQUeUNO UBleloj B UO S]Nd \"* + WIM AQuauino UBle10} B UO SsI1ezD \"+ * [IM yoo}s UO SN \"7\" IM YOOJS UO SIFED 3S040} Uj sonjep uondo uo seyey jso9}u] HuiBueys jo yoey3 EYL :7-9 eanbi4 Option Values and Changing Market Conditions 99 Figure 6-3: The Effect of Changing Dividends on Stock Options If... Call values will... Put values will... The dividend is increased fall rise The dividend is decreased rise fall THE DELTA We touched on the delta (A) in the last chapter as needed to determine the number of underlying contracts to option contracts required to establish a neutral hedge. The delta has several other interpretations, any of which may be useful to a trader. Rate of Change Figure 6-4! shows what happens to the theoretical value of a call as the price of the underlying contract changes. Under some conditions, when the call is very deeply in-the-money, its value changes at a rate almost identical to that of the underlying. If the underlying price moves up or down one point, the call’s value will change by an equal amount. Under other conditions, when the call is far out-of-the-money, its value may change only slightly, even with a large change in the price of the underlying. The delta is a measure of how an option’s value changes with respect to a change in the price of the underlying contract. In theory, an option can never gain or lose value more quickly than the underlying, so the delta of a call always has an upper bound of 100. (Again, we will retain the common practice of writing the delta without the decimal point. Hence, a delta of 1.00 will be written as 100. This is sometimes referred to as the percent format.} An option with a delta of 100 will move up or down one full point for each full point move up or down in the price of the underlying. It is moving at 100% of the rate of the underlying. In theory, a call also cannot move in the opposite direction of the underlying market, so the delta of a call has a lower bound of zero. A cal! with a delta of zero will move negligibly, even if the underlying contract makes a relatively large move. Most calls, of course, will have deltas somewhere between zero and 100 and will move at a slower rate than the underlying. A call with a delta of 25 can be expected to change its value at 25% of the rate of the underlying. If the underlying rises (falls) 1.00, the option can be expected to rise (fall) .25. A call with a delta of 75 can be expected to change its value at 75% of the rate of the underlying, If the underlying rises (falls) .60, the option can be expected to gain (lose) .45 in value. Call options which are at-the-money have delta values close to 50. They rise or fall in value at just about half the rate of the underlying. Thus far our discussion of deltas has focused only on calls. Puts have characteristics similar to calls, except that put values move in the opposite direction of the underlying market. In Figure 6-5 we can see that when the underlying rises, puts lose value; when 1. In order to generalize characteristics of the option sensitivities, which in most cases are similar regardless of the type of underlying instrument, we assume an interest rate of Zero in Figures 6-4 through 6-21. 100 Chapter 6 Figure 6-4: Call Theoretical Value vs. Underlying Price 30 Time = 60 days Volatility = 20% 257 / g 207 a o > 2 fa) ® ” & 100 a 110.” 80 85 90 95 100 105 10 11 120 Underlying Price Figure 6-5: Put Theoretical Value vs. Underlying Price 3075 Time = 60 days | 25 . Volatility = 20% @ 20+. 6 ~ > ~110 8 *. 2 154 2 Q MS 0 = * Je F105 ~ 90 ~ n a 04 — T TT T a",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.429466"
}