{
  "id": "04c1ad2bb4b0",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 167,
  "content": "volatility will help (hurt} the position. The position acts like a long straddle with the underlying close to 50, but it acts like a long time spread with the underlying close to 46 or 53. This is typical of how difficult it can sometimes be to classify complex positions. If the position is large enough, even small changes in market conditions can cause the position to change its characteristics radically. Note that if one were to look only at the delta and gamma, it might seem that the best thing which could happen to this trader would be a swift decline in the underlying market (negative delta, positive gamma). If, however, the decline is too violent, with the market falling five or six points, the trader will have to consider his net contract position. All calls will collapse to zero, but the net total of 46 puts which he is short will begin to act like long futures. These will be partially offset by the 22 futures which he is actually short. But the result will be a position which is net long 24 contracts, leaving the trader with unlimited downside risk. Of course, a violent upside move will never be a problem since the trader has an upside contract position which is net long 29 contracts (long 51 calls, short 22 futures). Position Analysis 377 Figure 17-6a 200 1505 at May expiration 100 507 5 weeks to May expiration (current) theoretical profit & loss -504 -100~ 2 weeks to May expiration -150 40 T 42 44 46 + 48 — 50 T — $2 54 56 BA May futures price 60 Figure 17-6b 200 4 150 | current volatility volatility increases 25% (May= 15%, July=16%) (May= 18.75%, July=20%) 100-54 oO 8 a 604 va a vA ° i L —_ | 3 < fs} - a é a volatility declines 25% (May=11.25%, July=12%) -150 T T T T T T T T T 40 42 44 46 48 50 $2 54 56 58 60 May futures price 378 Chapter 17 Figure 17-6c 150 i at May expiration | | 100- | 5 weeks to May expiration (current) oS 3 5 504 | Ss £ C 2 3 a s 0 ® me} -507 c 2 weeks to May expiration -t00 ——— T T™ T T T T T T 40 42 44 46 48 50 52 64 56 58 May futures price 60 Figure 17-6d 30 current volatility (May= 15%, July= 16%) delta position (hundreds) -to4 20-1 volatility declines 25% (May= 1.25%, July=12%) volatility increases 25% (May=18,75%, July=20%) 40 42 44 46 T T T T T 50 52 64 56 58 May futures price 60 Position Analysis 379 Figure 17-6e 50 T 40- i 30+ 5 weeks to May expiration (current) 20- gamma position (hundreds) -205 1 week to May expiration -40 TT —T T T iT T T T ms 40 42 44 46 48 50 $2 54 56 58 60 May futures price Figure 17-6f 20 . current volatility (May= 15%, July= 16%) 155 107 ‘ volatility increases 25% i (May= 8.75%, July=20%) gamma position (hundreds) “154 ‘ i volatility declines 25% % ° (May= 11.25%, July= 12%) -20 +t T T T T T —T T T 40 42 44 46 48 50 62 54 56 58 60 May futures price 380 Chapter 17 Figure 17-6 also gives the implied delta for the individual options as well as for the total position. This can sometimes be a useful number because a trader may want to take into consideration current market conditions when deciding how to hedge his position. In this example there is little difference between the trader’s presumed delta position (-253) and his implied delta position (-242). But this is not always the case. If the trader’s volatility assumption is dramatically different than the implied volatility in the marketplace, the presumed delta position might be significantly different than the implied delta position. Since no one can be sure what the right volatility is, no trader can be sure that his delta calculations are correct. Given this uncertainty, it is not uncommon among traders to hedge a position somewhere between the trader’s own delta and the implied delta. If, for example, a trader calculated his delta position as +600, but found that the implied delta was +200, he might treat the position as if it had a delta of +400. If he wanted to get delta neutral, the trader might sell four underlying contracts. We made the assumption that the spread between the July and May futures contracts will remain constant at .45. What will happen if the spread begins to widen or narrow? The total delta of —252 indicates that the trader would like a decline in the market. With a July delta of -635 and a May delta of +382, the trader would prefer July to go down faster than May. The ideal would be for July futures to decline and at the same time for May futures to rise, but any narrowing of the July/May spread should help the position. In futures equivalents, we might describe the position as being roughly short three July/May futures spreads, and short an additional 2! July futures. Finally, we might want to analyze a total position which consists of contracts which are not directly related, but which have somewhat similar characteristics. For example, suppose we have the ratio vertical call spread presented at the beginning of this chapter: ABC stock price = 99.00; = Time to June expiration = 7 weeks Volatility= 20%; Interestrate=6%; Dividend =0 Option Option Option Option Position Price Th. Val. Delta Imp. Vol. long 10 June 95 calls 6.25 5.82 76 23.7 short 30 June 105 calls 1.63 1.08 26 24.5 At the same time, suppose we also have a long strangle in a different stock: XYZ stock price = 62.00; = Time to July expiration = 11 weeks Volatility = 23%; Interest rate = 6%; Dividend = .50 in 8 weeks",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.447999"
}