{
  "id": "2adc4e8c1be0",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 88,
  "content": "on presumed directional moves in the underlying market. A trader might, for example, be a trend follower, adhering to the philosophy that “the trend is your friend.” Or he might be a contrarian, preferring to “buy weakness, sell strength.” Traders often try to incorporate their personal trading styles into their option strategies. One way to do this is to consider beforehand the adjustments which will be required for a certain strategy if the underlying market begins to move. For example, suppose a trader sells straddles in such a way that he is initially delta neutral. Such spreads have a negative gamma, so that as the market moves higher his delta position is getting shorter, and as the market moves lower his delta position is getting longer. If this trader likes to trade against the trend, he will avoid adjustments as much as possible because his position is automatically trading against the trend. Whichever way the market moves, the position always wants a retracement of this movement. On the other hand, a trader who sells the same straddles but prefers to trade with the trend will adjust at every opportunity. In order to remain delta neutral, he will be forced to buy underlying contracts as the market rises and sell underlying contracts as the market falls. The opposite is true for a trader who buys straddles. He has a positive gamma position, so that as the market rises his delta is becoming longer, and as the market falls his delta is becoming shorter. If this trader likes to trade with the trend, he will want to 196 Chapter 9 adjust as little is possible in the belief that the market is likely to continue in the same direction. However, if he prefers to trade against the trend, he will want to adjust as often as possible. Every adjustment will represent a profit opportunity if the market does in fact reverse direction. A trader with a negative gamma is always adjusting with the trend of the underlying market. A trader with a positive gamma is always adjusting against the trend of the underlying market. If a trader prefers to trade with the trend or against the trend, he should choose a strategy and an adjustment process that is appropriate to his preference. A trader who prefers to trade with the trend can choose a strategy with a positive gamma together with less frequent adjustments, or a strategy with a negative gamma with more frequent adjustments. A trader who prefers to trade against the trend can choose a strategy with a negative gamma together with less frequent adjustments, or a Strategy with a positive gamma with more frequent adjustments. The purely theoretical trader will not have to worry about this since for him there is no such thing as a trend. However, for most traders old habits, such as trading with or against the trend, die hard, LIQUIDITY As long as a trader has an open option position it represents a risk. Even if the risk is limited to the current value of the options, by leaving the position open the trader is risking the loss of that value. If he wants to eliminate the risk, he will have to take some action which will in effect close out the position. Sometimes this can be done through early exercise, or by taking advantage of an opposing position to create an arbitrage. More often, however, in order to close out an open position a trader will be required go into the marketplace and buy in any short options and sell out any long options. An important consideration in deciding whether to enter into a trade is often the ease with which the trader can reverse the trade. Liquid option markets, where there are many buyers and sellers, are much less risky than illiquid markets, where there are few buyers and sellers. In the same way, a spread which consists of very liquid options is much less risky than a spread which consists of one or more illiquid options. If a trader is considering entering into a spread where the options are illiquid, he ought to ask himself whether he is willing to live with that position until expiration. If the market is very illiquid, that may be the only time he will be able to get out of the position at anything resembling a fair price. If the spread consists of long-term options, say nine months, the trader may find himself married to the position for better or worse, in sickness and in health, for the next nine months. If he is unwilling to commit his capital for that period, perhaps he should avoid the position. Since there is greater risk associated with a long-term investment than with a short-term investment, a trader who does decide to take a position in long-term options ought to expect greater potential profit in the form of larger theoretical edge. New traders are often advised to begin trading in liquid markets. If a new trader does make an error resulting in a losing trade, in a liquid market he will be able to keep his loss to a minimum because he will be able to exit the trade with relative ease. On Risk Considerations 197 the other hand, an experienced trader, especially a market maker, will often prefer to deal in less liquid markets. There may be less trading activity in such markets, but the bid/ask spread is much wider, resulting in greater theoretical edge each time a trade is made. Of course, any mistake can be a problem with which the trader will have to live for a long time. However, an experienced trader is expected to keep his mistakes to a minimum. The most liquid options in any market are those which are short-term and which are either at- or slightly out-of-the-money. Such options always have the narrowest bid/ask spread, and there are usually traders willing to buty or sell large numbers of these contracts. As",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.435831"
}