{
  "id": "ff3abc013229",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 54,
  "content": "packages) and pullbacks in downtrends will usually be empty (green) candles. This second complex pullback pattern is one or two with-trend candles in the middle of what otherwise looks like a simple pullback. The with-trend candle or candles usually represent(s) an aborted attempt to resume the primary trend, and this Euro I US DoUar EURUS0-0•1, ~t :::: 1~ll~1lt- t----- -- - J1 -rf-- - ,~oo j '~\\ )~ \\\\ / _/ • 1' , moo 1.42000 i~? 77 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 167 FIGURE 6.11 What Appears to Be a Simple Pullback on the Daily Chart of EURUSD Resolves into a Complex Consolidation on the 120-Minute Time Frame (Inset) usually hints at a complex pullback hiding under the trading time frame structure. Since some traders will treat moves out of complex pullbacks differently than those out of simple pullbacks, it is important to be able to discern this subtle cue. Figures 6.11 and 6.12 show examples of hidden complex pullbacks. In a sense, complex pullbacks are nothing more than a category of pullbacks, so all of the conditions for other pullback trades apply here, with one modiﬁcation. It is usually a good idea to avoid pullbacks after conditions that could indicate a buying or selling climax. We have looked at these parabolic expansions and have seen that they frequently cap trends, so it does not make sense to enter with-trend pullbacks after such a move. Conﬁrmation of the end of the trend is very strong countertrend momentum following such a condition, but market structure can unfold in another way: Rather than shifting into an immediate change of trend, the market can also consolidate and work off the overextension through a more extended consolidation. Normal (simple) pullbacks do this, as they give the market time to pause and digest each trend leg. In the case of a more serious overextension, a larger consolidation is usually required if the trend EURUSD - Daily Euro/ US Dollar ~ A 0.02000 u .. ------ ------------- ~ ---A ---~---~ -- 0.00500 7\"\"V VV - .,.. ._,.. V \\ -0.01000 '11 Feb Mar Apr May 78 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing 168 TRADING STRATEGIES FIGURE 6.12 A Hidden Complex Pullback in Sugar Futures This would be a clear complex pullback on an intraday time frame. is going to continue, and these longer consolidations often take the form of complex consolidations. If you see a condition that would normally eliminate the possibility of a pullback (e.g., a buying or selling climax), a with-trend trade may still be possible following a complex consolidation in that same area. It is often easier to evaluate the integrity of the trend on the higher time frame, as the trading time frame complex consolidation will usually be a simple consolidation on the higher time frame. Figure 6.13 shows one way a complex consolidation can provide a potential entry after a small buying climax. Trigger Either of the two triggers already discussed for pullbacks—entering at sup- port or on a breakout—are valid for complex consolidations. The support play, espe- cially if backed up by a momentum shift on the lower time frame, is easier in complex consolidations than in simple consolidations because the stop is more clearly established due to the termination of the second pullback leg. In addition, both countertrend legs of the pullback tend to be similar lengths, so it is often possible to predict the general area where the second leg will stop using a measured move objective (AB = CD). (This is a P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 169 Do not buy this pullback after a vertical, climactic move. But, if the market is able to hold together in a complex consolidation, a pullback Yes ? FIGURE 6.13 Complex Pullbacks Can Provide Entries Where Simple Pullbacks Should Be Avoided guideline for trends in general, but the market tends to respect this principle even more strongly in pullbacks.) Stop Another advantage of complex consolidations is that the stop level is more clearly deﬁned. In simple consolidations, it is usually a bad idea to set a stop just un- derneath (for a long position) the consolidation area, but in complex pullbacks this is often an excellent risk point. There certainly are variations of complex pullbacks that have three or more pullbacks, each of which would result in another stop-out, but they are uncommon. The movements out of those also tend to be less reliable, so it does not make sense to make these a focus in the trading plan. Proﬁt Target The same proﬁt targets apply to complex as to simple pullbacks, per- haps with the expectation that a stronger move could develop from a complex consoli- dation. You might be justiﬁed in taking less of your position off at your ﬁrst proﬁt target, and trying to press more size for a larger move compared to a simple pullback. If you decide to do this, weigh the beneﬁts of having simple rules (e.g., take one-third of your position off at the previous swing) that enforce discipline and consistency against any incremental gains from a more complex approach. Comments One important issue not yet considered is that these complex pullbacks often come following",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.703881"
}