{
  "id": "d181bf9a7eae",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 64,
  "content": "Well-trending markets tend to be controlled, with more or less proportional actions and reactions. Another way this standard pattern can break down is for a market to make an extremely sharp move through one side of the band that is immediately reversed and then spikes clear through the other band. (See Figure 7.10.) As a general rule of thumb, whenever a market makes a sharp move in one direc- tion immediately followed by an equally sharp move in the other direction, the normal expectation should be for that market to spend some time consolidating and oscillating in a series of smaller swings around a central price. This will usually result in a chart pattern that looks something like the classic triangle pattern. Remember that a big move FIGURE 7.10 A Spike through the Upper Band Immediately Followed by a Spike through the Lower Band Usually Leads to a Triangle-Type Consolidation—Avoid This Environment GS - Daly Goldman Sachs Group 250.00 160.00 Jul Oct 93 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 204 TRADING STRATEGIES FIGURE 7.11 New Extremes on the MACD Precede New Price Extremes FIGURE 7.12 The MACD In a More Complex Environment XLF - Weekly • I S-'r Fund S&P Sci Financio \"\" • • S00 Sep 2011 • E rnru S&P ESU11 -S\"\"' - 13'. 14'.00 94 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 205 accompanied by at least marginal new lows on the MACD, but it is clear that the charac- ter of the market has changed somewhat. Though there may have been money short- ing into retracements following these two points, they are not examples of the best possible trades. Fast Line Behavior in Climax Consolidations or pullbacks following climaxes are not high-probability trades for trend continuation. Reversals or long, extended consoli- dations are more likely following these points. Though it is not always possible to distin- guish a climax from good strength or weakness, it is important to keep this consideration in mind. If an extremely large momentum move emerges that is out of all proportion to the recent history of the market, be very careful of entering retracements. This is a case where the details of the mathematical construction of the MACD become signiﬁcant. It is an unbounded indicator, so extreme market conditions can push it to theoretically inﬁ- nite levels. In these extreme situations, the indicator will rescale so that recent history is highly compressed in a tight wiggly line. Rather than trying to read any signiﬁcance into that line, accept that it shows that the market has made such an extreme move that the indicator should be disregarded. Figure 7.13 shows this principle in action on a daily chart of Silver futures. After pressing to new highs, the market collapsed in a very sharp sell-off at point A. Note FIGURE 7.13 It Is Important to Understand the MACD’s Reaction to a Climax P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 206 TRADING STRATEGIES that the MACD fast line deﬁnitely made a signiﬁcant new low, but this was clearly a climactic condition. Naive application of the MACD might have had a trader entering short in the ﬁrst bounce off those lows, and a disciplined proﬁt-taking plan would actually have locked in some proﬁts in this case. The point is clear: this is not a reliable pattern to short. Consider also that a bounded indicator (e.g., stochastics) would simply have gone to the boundary and stayed there, rather than making this dramatic pop. Traders who use the MACD on intraday charts will see these types of distortions frequently if the markets they trade have large overnight gaps. It is usually best to disregard the indicator until the market has settled down and more normal momentum conditions emerge. Fast Line Divergence If the best pullbacks are preceded by the MACD fast line making a signiﬁcant new high (or low in the case of a downtrend), then it follows logically that pullbacks that are not set up by a new high or low on the MACD are less likely to have good continuation. This is the concept of momentum divergence: a market makes a new high in prices that is not accompanied by a new high on the indicator, and vice versa to the downside. Figure 7.14 shows clean momentum divergences in Wheat futures. At A, price pushes to a new high, but the MACD fast line is clearly lower. At point B, prices FIGURE 7.14 Momentum Divergences in Wheat Futures @St-Oaiy Silver Continuous Contract [Sep11) '11 Feb Mar Apr • us Contract [Sep11) • Wheat Cont11uo @W /21 It jl 928 19(-- ~---- ~ 992 960 '! ~ ,~ I C _ -- 0.00 Feb Apr May Jun 95 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 207 drive to a dramatic new low (selling climax?), and the MACD barely moves below the previous",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology"
  ],
  "created_at": "2026-02-05T00:37:53.705405"
}