{
  "id": "2c9636289fad",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 7,
  "content": "is required to pay the seller the full amount. If the stock rises to $60 per share, the owner of the stock will show a profit of $10 per share, or a total profit of $1,000. Even so, he won’t be able to actually spend this $1,000 profit until he formally liquidates the position by selling his 100 shares at $60 per share. This type of settlement procedure, where purchase requires full and immediate payment, and where profits or losses are unrealized until the position is liquidated, is known as stock-type settlement. In contrast to stock-type settlement, futures-type settlement requires no initial cash payment from the buyer to the seller. Moreover, all profits or losses are immediately realized, even if the position is not liquidated. If a trader buys a gold futures contract covering 100 ounces of gold for $450 per ounce, the full value of the contract is $45,000. The buyer, however, is not required to pay the seller the full $45,000 value of the contract. The buyer does not have to pay any money at all. He is only required to deposit with the clearing house some amount of good-faith margin. At the end of each trading day both the buyer and the seller will immediately realize any profits or losses resulting from movementin the price of the gold futures contract. If gold rises from $450 to $470 per ounce, $2,000 ($20 x 100) will be credited to the buyer’s account, and he will have immediate use of these funds even if he does not liquidate the position. Of course, if the price of gold drops to $430 per ounce, he will realize an immediate loss The Language of Options I] of $2,000. If he does not have sufficient funds in his account to cover this loss, the clearing house will issue a variation call. There is an important distinction between a margin call and a variation call. A margin call is issued by the clearing house to ensure that a trader can fulfill future financial obligations should the market move against him. Margin calls can be met with funds which, even though deposited at the clearing house, still belong to the trader and consequently can earn interest for the trader. A variation call is issued in order to fulfill current financial obligations in the form of realized losses. A variation call must be met with a cash payment which is immediately deducted from a trader’s account. If a trader has deposited securities with the clearing house as margin and receives a variation call, he must either deposit the additional variation amount in cash, or the clearing house will sell the securities in his account to generate enough cash to meet the variation call. If the remaining securities and cash in the account is not sufficient to meet the current margin requirements, the trader may be forced to liquidate his position. We make this very important distinction between stock- and futures-type settle- ment because some options are settled like stock and some options are settled like futures. It is important for a trader to know which he is trading. Currently all exchange-traded options in the United States, whether options on stock, futures, indices, or foreign currencies, are settled like stock. Options must be paid for immedi- ately and in full, and profits or losses are unrealized until the position is liquidated. In stock option markets this is both logical and consistent, since both the underlying contract and options on that contract are settled using identical procedures. However, on U.S. futures options markets, the underlying contract is settled one way (futures-type settlement) while the options are settled in a different way (stock-type settlement). This can sometimes cause problems when a trader has bought or sold an option to hedge a futures position. Even if the profits from the option position exactly offset the losses from the futures position, the profits from the option position, because the options are settled like stock, are only paper profits. On the other hand, the losses from the futures position Will require an immediate cash outlay to cover a variation call. If a trader is unaware of the different settlement procedures, he can occasionally find himself with unexpected cash flow problems. The settlement situation on many exchanges outside the U.S. has been simplified by making option and underlying settlement procedures identical. If the underlying is Subject to stock-type settlement, then so are the options on the underlying. If the underlying is subject to futures-type settlement, then so are the options. Under this Method a trader is unlikely to get a surprise variation call on a position which he thinks 1S well hedged. Before concluding this chapter, it will be useful to define the terms Jongand short as they are used in option trading versus their use in trading an underlying contract. In 4 long underlying position a trader will profit if prices rise and lose if prices fall. In a short underlying position a trader will profit if prices fall and lose if prices rise. There is a tendency to carry this terminology over into the option market by referring to any Position which will profit from a rise in the price of the underlying contract as a long Position, and any position which will profit from a fall in price as a short position. 12 Chapter | More generally, however, the terms long and short refer to the purchase or sale of a contract, and this is the sense in which we apply these terms to option trading. A trader who has purchased an option is long the option, and a trader who has sold the option is short. There is no confusion when we refer to a long call position because the trader who is longa call also has a long market position. Calls will, in theory, rise in value if the underlying market rises. But a long put position is a short market position. A trader who has purchased a put",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.423258"
}