{
  "id": "eb61179d17c6",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 116,
  "content": "to be, he will only break even. But for each call which goes unexercised the trader will profit by the amount of the dividend. Dividend plays were much more common in the early days of option trading when the market was less sophisticated and many options which should have been exercised were not. As markets have become more efficient, only a professional trader, with very low transaction costs, can afford to take advantage of such a possibility. Even then, he may find that he is assigned on the great majority of the calls he has sold. 252 Chapter 12 A trader can execute a similar type of interest play by selling stock and simultane- ously selling deeply in-the-money puts. Now, instead of profiting by the amount of the dividend, the trader will profit by the amount of the interest he can earn on the exercise price (the proceeds of the stock sale and the put sale combined). This profit will continue to accrue as long as the puts remain unexercised. If the puts are exercised, the trader does no worse than break even. Again, only a professional trader, with his low transaction costs, is likely to employ such a strategy. If options are subject to stock-type settlement, an interest play can also be done in the futures option market by either purchasing a futures contract and simultaneously selling a deeply in-the- money call, or selling a futures contract and simultaneously selling a deeply in-the-money put. If the option is deeply enough in-the- money, it ought to be exercised early. If, however, the option remains unexercised, the trader will continue to earn interest on the proceeds from the option sale. Since the amount on which the trader will earn interest is the difference between the exercise price and futures price, this will not be as profitable as a similar strategy in the stock option market, where the trader will earn interest on the exercise price. Still, if the transaction costs are low enough, it may be worth doing, A variation on dividend and interest plays can also be executed using deeply in-the-money vertical spreads. For example, suppose a stock is trading at 100 with the ex-dividend date approaching If both the 80 and 85 calls are deeply enough in-the- money to be early exercise candidates, a trader might try to purchase the 80/85 call vertical spread for five points. If he does so, he will exercise his 80 call in order to collect the dividend, and at the same time hope not to be assigned on the 85 call. Oddly, if both the 80 and 85 calls are early exercise candidates, the trader should also be willing to sell the 80/85 call vertical for five points. If he does so, he will exercise his 85 call in order to collect the dividend, and at the same time hope not to be assigned on the 80 call. In other words, a professional trader might logically make a market under these circumstances of 5 bid/5 ask. He is willing to buy or sell the 80/85 call vertical at five points. He intends to immediately exercise whichever call he buys, while hoping not be assigned on the call which he sells. The possibility of early exercise can also have an impact on arbitrage strategies. For example, suppose a stock option trader executes a reverse conversion: buy a call sell a put sell stock If he executes this strategy at what he believes to be profitable prices, part of his profit will come from the interest he expects to earn on the sale of the stock. But what will happen if the stock price begins to fall, and in fact falls so far that the trader is assigned on the put? This will eliminate the interest earnings, since he will be required to buy back the stock. Of course, he can still sell the call and take in some cash. But if the value of the call is insufficient to offset the interest loss, the trader may find that his profitable reversal has in fact become unprofitable. Early Exercise of American Options 253 The trader in our example is worried about being assigned on his put. If the market drops there will be a greater likelihood of assignment; if the market rises there will be a lesser likelihood of assignment. Since the trader prefers the market to rise, he must be delta long. This is confirmed by the following delta values: Stock price = 100; Time to expiration = 3 months; Volatility = 25% Interest rate = 8.00%; Dividend = 0 European European American American Option Value Deita Value Delta 100 call 5.97 58.8 5.97 58.8 100 put 4.00 —-41.2 4.20 ~44.0 If these are European options, the total delta of the reversal is: +58.8 +41.2 -100 =0 If, however, the options are American, the total delta is: +58.8 +44.0 ~100 = +2.8 The positive delta of 2.8 reflects a slight preference for the market to rise so that the trader will avoid being assigned on the put. For a similar reason, if the trader executes a conversion (sell call, buy put, buy stock), he is 2.8 deltas short. He wants the stock to fall so that he can exercise his put early and thereby avoid the interest costs of carrying a long stock position. Because the desirability of early exercise, and therefore the likelihood of early exercise, can increase or decrease as the underlying market rises or falls, conversions and reversals using American options are not delta neutral. While these strategies may be unbalanced by only two or three deltas, the fact that they are often done in large size can result in an additional risk that the trader cannot afford to ignore. This also applies to boxes and jelly rolls, which are simply combinations of conversions and reversals. Consider these option values: Stock price = 100; Volatility = 25%; Interest rate = 8.00%; Dividend = 0 Time to expiration: March = 3 months,",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.440031"
}