{
  "id": "a67bcd235ab8",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 8,
  "content": "the ECB rate announcement on December 15. The ECB surprised markets with a notable hawkish shift. At the rate announcement, a lot of information is published all at once, which often leads to volatility on the release. I quickly noticed that the ECB language regarding rate hikes, which included such terms as “significantly further” and “sufficiently restrictive,” signaled a marked change from its previous month’s statement. The ECB was telling the market that rates were too low and much more work was needed to bring inflation back down to its target. Also, inflation projections were very high. I sold the German 10-year Bund and the Euro Stoxx 50, taking maximum risk. There was some initial volatility to sit through as the market tried to digest all the information that poured out on the announcement. Both markets went the wrong way initially. But I knew it was a hawkish shift, and I could handle the downside risk of the trade. I expected that, soon 29 enough, the market would reconnect to the fundamentals and reverse lower. The Bund started moving lower soon afterward, but the Euro Stoxx 50 took some time. I was patient, and eventually, the Euro Stoxx turned down as well. It’s difficult when a leveraged position instantly goes offside, but certain events come with added volatility risk, which you need to incorporate into how you manage a trade. The ECB press conference was due to begin 30 minutes after the rate announcement. Based on all the information I had, I felt the only possible outcome would be further hawkish rhetoric from Christine Lagarde [President of the European Central Bank]. The Bund had rebounded off its low on profit-taking going into the press conference. I decided to double down on my short position and hold it into the press conference rather than trying to hit hawkish rhetoric later. I expected other traders would be waiting for the press conference to act, leading to a lot of volatility on every word Lagarde spoke. So, I wanted to be positioned ahead of that. This secondary trade worked out great. As expected, the market sold off into the press conference, and I was pre-positioned for all the hawkish rhetoric to come, and insulated from any short-term volatility against my position. There was a final trade that represented good risk/reward for me. At the press conference, Lagarde said, “Our staff projections that embed and incorporate the market expectations of our terminal rate, do not certainly allow a return to the 2% inflation target that we have in a timely manner. So more needs to be done, and as a result, new market expectations will, hopefully, be embedded in future staff projections.” She was telling us the implied market rate was too low and needed to be higher. It was the type of news headline that I knew would accelerate the market downmove. I was still short the Bund and it had already sold off a lot. So, I went short the Schatz [German 2-year note]. I took partial profits when the various markets approached the maximum price moves I expected for a day like that. I scaled out of more of the position in the ensuing few days. I still hold a portion of my Euro Stoxx 50 short position because our research suggests further downside in the stock market. If my target is reached on that final partial position, the total return for the trades I implemented on the ECB announcement day would be over 100%. 30 Daljit Dhaliwal Know Your Edge Three years later I understand you started managing money this year. How has that gone? It has gone well, but it has also been a learning experience. I discovered a difference in how I managed risk versus an institutional investor’s view of risk. I never looked at my NAV [net asset value] because it included open profits. I never considered open profits as my money until I closed the trade and took money off the table. I didn’t care too much if there was a big downside variance in my open P&L because my risk was always fixed. I had my stops in place, and I knew my worst case in getting out. I always thought of risk control in terms of adverse price movement from my entry level, not the surrender of open gains. There was a Fed meeting in May 2022. I thought the Eurodollars were oversold and that the market had already more than priced in any potential hikes by the Fed. I was long Eurodollars in size going into that meeting. The market took the Fed comments as being hawkish, whereas I thought they were dovish. I was up quite a bit on the trade by that time, and I didn’t want to get out. The market moved lower, and by the next morning, my NAV was down over 3%. My risk protocol says I should get out once I am down more than 2%, which institutional money defines as a decline from peak equity. As I explained, I never looked at it that way when trading my own money. So, I wanted to stay long Eurodollars. It was a tough call, but I got out at a price that proved to be near the day’s low. Then, throughout May and into June, Eurodollars rallied to my original target. It would have been my most profitable trade of the year. That was a frustrating experience for me. 31 So, you only got out of the trade because you were managing money? Yes. I felt obligated to adhere to the risk guidelines I had told the investor. Is the fact that your daily loss could be due to a surrender of open profits something you didn’t think about when you told the investor your protocol? Yes, that’s right. Did that episode prompt you to change anything in the way in which you communicate to investors? Yes, I spoke to the investing firm, and they were more than",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "strategies",
    "crypto",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.179447"
}