{
  "id": "675ddd083b57",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 7,
  "content": "epchan. com/book, with “sharperatio” as both username and password. You can easily modify this code to download as many tickers as you like. Chan800064_c03.indd 38 6/7/2021 2:04:48 PM 9 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Backtesting 39 there is an elegant and very readable little book by Jonathan Regen- stein (Regenstein, 2018) called Reproducible Finance with R. Example 3.1: Using R to Retrieve Yahoo! Finance Data Following is an example of using R to retrieve a stock’s historical price information from Yahoo! Finance. This program file example3_1.R is avail- able for download from epchan.com/book, with “sharperatio” as both username and password. Just save it to your local folder and run in RStudio. (Installation of required packages is included. Once they are installed, you can comment out the install.packages lines.) # tidyverse contains the packages tidyr, ggplot2, dplyr, # readr, purrr and tibble install.packages(\"tidyverse\") install.packages(\"lubridate\") install.packages(\"readxl\") install.packages(\"highcharter\") install.packages(\"tidyquant\") install.packages(\"timetk\") install.packages(\"tibbletime\") install.packages(\"quantmod\") install.packages(\"PerformanceAnalytics\") install.packages(\"scales\") library(tidyverse) library(lubridate) library(readxl) library(highcharter) library(tidyquant) library(timetk) library(tibbletime) library(quantmod) library(PerformanceAnalytics) library(scales) symbols <- c(\"SPY\",\"EFA\", \"IJS\", \"EEM\",\"AGG\") prices <- getSymbols(symbols, src = 'yahoo', from = \"2012-12-31\", to = \"2017-12-31\", auto.assign = TRUE, warnings = FALSE) print(SPY) You can easily modify this code to download as many tickers as you like. Chan800064_c03.indd 39 6/7/2021 2:04:48 PM 10 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 40 QUANTITATIVE TRADING QuantConnect QuantConnect is a web-based algorithmic trading platform provid- ing research, backtesting, and live trading tools to support strategy creation in C# or Python. It also provides some 400TB of financial and alternative data. The open-source engine (called LEAN) takes into account trade fills, slippage, margin, transaction costs, and bid– ask spread to provide realistic backtest results. As of this writing, the platform supports seven asset classes; equities, equity-options, forex, CFD, crypto, futures, and future-options. QuantConnect allows users to seamlessly transition from backtesting to live trad- ing with no code changes. This is important to ensure that what you backtested is exactly what you will be trading. Blueshift Blueshift is an integrated platform for research, backtest, and trad- ing offered by QuantInsti. As of this writing, it offers live trading in the United States, India, and FX markets, and it includes min- ute-level data free-of-cost across these markets. (I am sure that by the time you are reading this, it will be offering many more mar - kets.) You can develop your investment or trading strategy in either a Python programming environment or a visual (nonprogramming interface) builder. Moving a strategy from backtesting to live trading is a turnkey operation, ensuring that what you backtested is exactly what you will be trading. FINDING AND USING HISTORICAL DATABASES If you have a strategy in mind that requires a specific type of histori- cal data, the first thing to do is to search for that type of data. You will be surprised how many free or low-cost historical databases are available on the internet for many types of data. (For example, try the search phrase “free historical intraday futures data.”) Table 3.1 includes a number of the databases that I have found useful over the years, most of them either free or very low cost. I have deliberately Chan800064_c03.indd 40 6/7/2021 2:04:48 PM Backtesting 41 left out the expensive databases from Bloomberg, Dow Jones, FactSet, Thomson Reuters, or Tick Data. Though they have almost every type of data imaginable for purchase, these data vendors cater mostly to more established institutions and are typically not in the price range of individuals or startup institutions. While finding sources of data on the internet is even easier than finding prospective strategies, there are a number of issues and pit- falls with many of these databases that I will discuss later in this sec- tion. These issues apply mostly to stock and exchange-traded fund (ETF) data only. Here are the most important ones. Are the Data Split and Dividend Adjusted? When a company had its stocks split N to 1 with an ex-date of T , all the prices before T need to be multiplied by 1/N . N is usually 2, but can be a fraction like 0.5 as well. When N is smaller than 1, it is TABLE 3.1 Historical Databases for Backtesting Source Pros Cons Daily Stock Data finance.yahoo.com Free. Split/dividend adjusted. Has survivorship bias. Can download only one symbol at a time. Sharadar.com Survivorship bias free. Algoseek.com Rent, don’t buy, tick data! Enriched with identifiers and tags. Moderately priced. CSIdata.com Low cost. Source of Yahoo! and Google’s historical data. Software enables download of multiple symbols. Has survivorship bias, though delisted stocks’ history can be purchased. CRSP .com Survivorship bias free. Expensive. Updated only once a month. Daily Futures Data Algoseek.com (See above.) CSIdata.com (See above.) Intraday Stock / Futures Data Algoseek.com (See above.) Tickdata.com Institutional quality. Expensive. Daily / Intraday Forex Data Interactive Brokers Free if you have an account. Chan800064_c03.indd 41 6/7/2021 2:04:49 PM 42 QUANTITATIVE TRADING called a reverse split. Similarly, when a company issued a dividend $d per share with an ex-date of T, all the prices before T need to be multiplied by the number (Close(T – 1) – d)/Close(T – 1), where Close(T – 1) is the closing price of the trading day before T. Notice that I adjust the historical prices by a multiplier instead of sub- tracting $d so that the historical daily returns will remain the same pre- and post-adjustment. This is the way Yahoo! Finance adjusts its historical data, and is the",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "market_structure",
    "strategies",
    "crypto",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.604368"
}