{
  "id": "504842bedff9",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 17,
  "content": "Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing PART II Market Structure 16 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing CHAPTER 3 On Trends Don’t ﬁght forces, use them. —R. Buckminster Fuller M arket movements can create a bewildering number of patterns and variations of patterns. Simple structures take on different meanings depending on context, and patterns sometimes develop and resolve in unexpected ways. Add to this the complexities of the interactions of multiple time frames and related markets, and we end up with a seemingly inﬁnite number of possibilities. The human mind needs some kind of structure to help process information, so various solutions have been proposed by differ- ent schools of technical analysis. The classic chart patterns (head and shoulders, double top, pennant, ﬂag, wedge, etc.) are one attempt at providing structure. Other solutions have been proposed, ranging from in-depth quantitative analysis to the various schools of wave and cycle analysis; these, and many other approaches, work for some traders. All of these offer valuable perspectives, but let us turn our attention to a simple, robust framework that focuses on the fundamental price structures created by price trends. THE FUNDAMENTAL PATTERN What I am presenting here is not new; I owe a tremendous debt to the authors and traders who have come before me. No signiﬁcant intellectual construct emerges ex nihilo—anything of value rests on a foundation built by someone else. In the case of trend structure, Tony Plummer (2010) has written about the basic trend pattern, which he calls the “price pulse,” with clarity and in-depth. This simple, fundamental trend pat- tern is found at the core of even elaborate methodologies, like Gann or Elliott, when they are stripped to bare essentials. This pattern, very simply, is how markets move , and 49 P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 50 MARKET STRUCTURE A B C DA B C D FIGURE 3.1 The Fundamental Trend Pattern: Impulse, Retracement, Impulse in an Uptrend and a Downtrend it is a profoundly powerful concept. The fundamental pattern of market movement on all time frames is this: a movement in one direction, a countertrend retracement in the other direction, and another leg in the original direction. Visually, these movements are often labeled with letters, as in Figure 3.1. This is a very rough schematic structure, but it is a powerful pattern that repeats on all time frames. Whether we look at trends spanning decades or seconds, we will ﬁnd this same impulse, retracement, impulse structure, though the psychological signiﬁcance of the pattern will vary depending on the time frame. It is also reasonable to ask why this structure should exist at all, and there are several possible answers. Put yourself in the shoes of a trader who has to buy a signiﬁcant amount of an asset in a very short time. Your primary objective is to get the order done without having a large impact on prices. How might this best be done? The best option in most cases is to buy a little bit, wait so that you don’t move the market too much, then buy some more, and repeat until the order is completely ﬁlled. This is how good execution traders work large orders. Smart traders (or smart algo- rithms) will judge how to plan their buying by the market’s response to their orders. In this way, they are judging the supply or the selling conviction hanging over the market. A single trader executing an order in a market otherwise composed of pure noise traders would create some variation of this price pattern by trying to ﬁll a buy order through this natural process. There must be a ﬁrm theoretical foundation for anything in the market; you should be able to clearly articulate why something should be the way it is. Market prices are the result of buyers and sellers negotiating for prices, nothing more and nothing less. We do not need to invoke some mystical force to create the patterns we see in the markets; they are simply the result of buyers and sellers ﬁnding prices in a competitive environment. This is also why the fundamental structures in the markets have not changed since an- tiquity. Some of the earliest written records we have are price records from Phoenician merchants, which paint a story of price movements very similar to those we see today, albeit on a much slower scale. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 51 FIGURE 3.2 Each Trend Leg Breaks Down into a Three-Legged Structure on the Next Lower Time Frame Fractal Markets A fractal is a type of pattern in which the parts resemble the whole (see Mandelbrot and Hudson 2006). Markets are fractal in nature, meaning that essentially the same patterns appear on all time frames: Patterns on single-tick charts combine to form 1-minute bars. The patterns on the 1-minute bars are the same as those on the single-tick bars, and they combine to form the patterns on 5-minute bars. (The time frames are a convenient but unavoidably arbitrary structure.) This pattern building continues all the way to daily, weekly, monthly, and yearly patterns, which all contain essentially the same patterns. Figure 3.2 shows a schematic example of how this might play out in the market. Each trend leg is an impulse, retracement, impulse pattern, and each of those legs also breaks down into the same pattern on the lower time frame. Though only three levels are shown on the diagram, this structure theoretically extends down to the one-tick level. Furthermore, the entire",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.697739"
}