{
  "id": "9b71741c94de",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 78,
  "content": "but be sure that consequences are actually low. Common. effect of many Consider the of these in the aggregate. FIGURE 9.3 Probability/Consequence Risk Grid 116 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing Risk Management 287 FIGURE 9.4 Daily Chart of PG During the 2010 Flash Crash instance, the cost of fully hedging a complex portfolio with options can easily run over 10 percent on an annualized basis. With that kind of haircut, you have to ask yourself just how good you think you are. Can you hedge, beat the hedge hurdle, and still make enough to make the venture worth your time? Not likely. When most traders talk about tail risk, they refer to the kind of events that can put a trader out of business, but remember that tail events are not always bad. Sometimes the trader may be positioned on the right side of the surprise move, and it turns out to be a gift. Though some traders have tried, it is very difﬁcult to structure strategies designed speciﬁcally to take advantage of these events, because they are so infrequent and volatile. Even if you are fortunate enough to be on the right side of such a move, there is no guarantee that you will ﬁnd adequate liquidity to exit at a proﬁt. Correlation Correlation is a major concern in portfolio design and analysis, but also may have a larger than expected impact on an active trader holding a handful of positions. Though correlation is usually considered in the context of longer-term portfolios, correlation risk PG - Daily Procter & Gamble l _____ ,,,.- I 11111111 Ji1J!tJIU1U1ri1 -- µ!ti 64.00 µIll\\ 11 1 ,1 _. -• -• 11 1!1111rl1 - _ 11 Jr1i1Vtnr---,v\\h- u __ 1µ1v ----.....;___---... i - 62.00 1 I lf 60.00 ,1. t ••' 58.00 '10 Apr 56.00 54.00 52.00 50.00 48.00 46.00 44.00 42.00 40.00 117 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing Risk Management 289 FIGURE 9.5 A Margin Hike in Weekly Silver Futures Breaks an Already Overextended Trend large price movement, and sometimes these margin changes can break the back of an es- tablished trend. Figure 9.5 shows the effect of several margin hikes for Silver futures on the trend in mid-2011. Intuitively, you might expect that such a margin increase would be insigniﬁcant, but it can force liquidation and bring large-scale selling pressure into the market. The Hunt brothers’ silver ﬁasco in the early 1980s is one of the best-known examples, but there have been many others as the regulatory environment continually evolves in response to the actions of traders and investors. In equities, there are frequent restrictions on shorting that may cause actual trad- ing results to diverge from theoretical tests, and there have even been examples where shorting has been banned altogether for a group of stocks or entire regions. In early 2011, some of the cutting edges of regulatory coverage are the issues surrounding HFTs, algo- rithmic trading programs, and the prevalence of computer-assisted trading programs that seek to capture the liquidity rebates across electronic communication networks (ECNs). It is quite likely that some regulatory move in the next few years will signiﬁcantly alter the market microstructure and force traders to adapt. It has also been fairly common to see trades broken in some environments. For in- stance, there are always traders who buy into large declines like the 2010 Flash Crash, @SI - Weekly Silver Continuous Contract 45.000 40.000 35.000 30.000 25.000 20.000 15.000 10.000 '09 '10 '11 118 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing CHAPTER 10 Trade Examples The main part of intellectual education is not the acquisition of facts but learning how to make facts live. —Oliver Wendell Holmes T his chapter presents several examples of the trading patterns and ideas in this book applied to real-world market scenarios. Keep in mind that these examples reﬂect my trading style, which is a pure swing trader’s approach that can be summarized as follows: r Understanding bigger picture money ﬂows between markets. In stocks this might mean understanding the difference in performance between domestic and foreign indexes, and then understanding which sectors offer the most attractive opportuni- ties. This concept can be adapted to other asset classes as well, but the key is to start from a high-level perspective and to work top-down. r Waiting for precise patterns that indicate the presence of an imbalance. These pat- terns also give risk points (stop levels) for each position. r Executing trades to position with the statistical tendency behind that pattern. r Managing the risk in the trade appropriately, perhaps adjusting the position as the trade develops. r In almost all cases, I am playing for one clean swing in the market. The last part of that is particularly important: a swing trader’s job is to take money out of one swing, usually the next swing, in the market. Swing traders do not enter posi-",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.707641"
}