{
  "id": "9adb24740253",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 112,
  "content": "© Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing 430 GLOSSARY discretionary trading A style of trading that allows varying degrees of human input in trading decisions. distribution The opposite of accumulation; traditionally, a price area where holders of an asset are seen to be selling their inventory carefully, so as to avoid causing prices to break down. In practice, often taken as a sign of impending price weakness. drawdown In trading system design or application, the amount lost from the high-water mark for the system/account. This is an underutilized measure of risk. economically signiﬁcant Statistical signiﬁcance is a reasonably well-understood subject, but there can be patterns that are statistically signiﬁcant without being economically signiﬁcant. For instance, perhaps a pattern shows a very consistent edge, but it would be impossible to capture that edge because it is smaller than transaction costs. It is often difﬁcult to truly evaluate economic signiﬁcance because costs will vary from ﬁrm to ﬁrm and from trader to trader—what might not be economically signiﬁcant to one trader could be a steady income for another. Efﬁciency Ratio (ER) A measure developed by Perry Kaufman also known as the Fractal Efﬁciency Ratio, the Efﬁciency Ratio varies from 0 to 1 and is a measure of price move- ment compared to noise in the market. If price moves in an unbroken line for the period, the ER would be 1. If price returns to unchanged after moving away from the starting price, the ER would be 0. efﬁcient markets hypothesis (EMH) Perhaps the cornerstone of academic thinking about markets, the EMH essentially says that all available information is immediately incorpo- rated into asset prices, and that there is no edge available to traders doing analysis based on that information. The EMH is a useful theoretical construct, but rests on a number of assumptions that are severely violated in practice. excess return In general, the return of an asset or system minus the risk-free rate. (The most common proxy for risk-free rate is a Treasury instrument of similar duration to the investment’s holding period.) In many of the tests in this book, excess return is used in a slightly different context: the mean return of a signal group (deﬁned as having the entry condition to be studied) over the baseline return for the control group. execution risk A risk of trading in which the actual prices received for executions may differ from backtested results. In practice, liquidity conditions, execution skill, and trad- ing size are primary contributors to this risk. exhaustion See climax. expectancy or expected value Mathematically, the expected payout of a scenario that has several possible outcomes is the sum of the probability of each outcome occurring times their payoffs. exponential moving average (EMA) A type of moving average that weights recent data more heavily than past data. extension In trend analysis, the third leg of the impulse-retracement-impulse unit that comprises the basic trend structure. Gauging the strength of the extension leg is one of the main ways to judge strength of the trend. fading A general term for styles of trading that seek to trade against the direction of price movements. A trader fading an uptrend, for instance, would be shorting into that uptrend. 180 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing Glossary 431 failing Usually used in reference to a support or resistance level, meaning that the level is failing to contain prices. This term, and holding, are more often used to describe dy- namic price action than static market structure. See holding. failure test A type of trade in which price penetrates previous support or resistance, and then fails to continue beyond that level. This is a potentially volatile trade, but it also offers very clear risk points and proﬁt targets. fast Fourier transforms (FFTs) A mathematical technique for ﬁnding cycles in data. Fibonacci ratios The idea that ratios derived from the so-called Fibonacci series {1, 2, 3, 5, 8, ... } describe price movements in ﬁnancial markets. ﬁrst-order pivots A pivot high is a bar that is preceded and followed by lower highs; a pivot low has higher lows before and after. These pivot points are called ﬁrst-order pivots to differentiate them from more signiﬁcant pivots in the market structure. ﬁxed fractional risk A position-sizing plan that seeks to always risk a consistent fraction of the account’s value (also called “equity” or “net liq”) on each trade. ﬂag Another term for a pullback or consolidation in a trend. ﬂow A term coined by Mihaly Cs ´ıkszentmih ´alyi to describe the state reached by elite performers in many disciplines in which the performer’s mental capacity is completely absorbed in the task. Flow is a characteristic of top-level performance. free bars Bars that are entirely outside bands or channels set on price charts—that is, with the low of the bar above the upper band or the high below the lower band. fundamental Traditionally, technical analysis is the discipline of understanding market movements based on information contained in the price changes themselves. Funda- mental analysis is the discipline of using ﬁnancial statements, economic data, or other information to try to determine what the fair value for an asset should be. futile traders A term coined by Larry Harris to describe traders who do not make money in markets, and who have no hope of doing so. Harris speculates that one reason they cannot understand the difference between their expectations and their results could be that they are “of limited mental capacity.”",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:53.712960"
}