{
  "id": "8bbaf5f1ac01",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 51,
  "content": "10 15 20 25 30 35 40 Volatility (%) saw in Chapter 4 that the mean of the distribution assumed in most theoretical pricing models is the forward price (the break-even price] for the underlying contract. In our present case, the forward price is the current stock price of $100 plus the $5 carrying costs over the five-month holding period. The 105 call is therefore the one which the model interprets as being at-the-money, and hence will have a delta of 50. Depending on the type of underlying contract, under extreme interest rate conditions or with a great deal of time remaining to expiration, options can have deltas decidedly different from what we might instinctively surmise. Just as a delta neutral option position can become unbalanced through movement in the underlying contract, it can also become unbalanced through the passage of time or through changes in volatility. No trader knows for certain whether he is delta neutral because he can’t be certain about the accuracy of the inputs into the theoretical pricing model. The delta value depends, among other factors, on the volatility assumption. And volatility is just that, an assumption. A trader who sells four calls, each with a delta of 25, and buys one underlying contract, might believe that he is delta neutral. But in order to arrive at a call delta of 25 the trader is required to feed some volatility into a theoretical pricing model. If he subsequently decides that his original volatility assump- tion was too low, and he now raises it, we can see in Figure 6-13 that the call delta will rise towards 50. Using his new volatility assumption the delta of the call might be 35, and instead of being delta neutral, the trader is now 40 deltas short. All he did to unbalance his delta position was to change his assumptions about market conditions. Option Values and Changing Market Conditions 111 Nothing in the foregoing discussion invalidates the concept of delta neutrality, which is still an important one. However, a trader must realize that a delta neutral position depends on an estimate of market conditions, both current and future, and there is no guarantee that this estimate will be correct. As he changes his assumptions about market conditions, he must constantly change his trading strategies to fit these new assumptions. Delta neutral trading is only one aspect of this principle. THE THETA The effect of a change in time to expiration on the theoretical values of calls and puts ts shown in Figures 6-15 and 6-16. Note that all options, both calls and puts, lose value as expiration approaches. The theta(®), or time decay factor, is the rate at which an option loses value as time passes. It is usually expressed in points lost per day, when all other conditions remain the same. An option with a theta of .05 will lose .05 in value for each day that passes with no change in other market conditions. If the option is worth 2.75 today, then tomorrow it will be worth 2.70. The day after that, it will be worth 2.65. Time runs in only one direction and, technically, the theta is a positive number. However, as a convenient notation, and to remind the user that the theta represents a loss in the option’s value as time passes, it is sometimes written as a negative number, This is the convention which will be followed in this text. Therefore, the theta of an option which loses .05 per day will be written as -.05. Consequently, a long option position will always have a negative theta, and a short option position will always have a positive theta. Note that this is just the opposite of the gamma, where a long option position has a positive gamma, and a short option position has a negative gamma. As a general principle, an option position will have a gamma and theta of opposite signs. Moreover, the relative size of the gamma and theta will correlate. A large positive gamma goes hand in hand with a large negative theta, while a large negative gamma goes hand in hand with a large positive theta. We saw that as expiration approaches, the gamma of an at-the-money option becomes increasingly large. The same is also true of the theta. As we get closer to expiration the rate at which an option decays begins to accelerate. If the option is exactly at-the-money, its theta at the moment of expiration becomes infinitely large. Every option position is a tradeoff between market movement and time decay. If price movement in the underlying contract will help a trader (positive gamma), the passage of time will hurt (negative theta). And vice versa. The trader can’t have it both ways. Either he wants the market to move, or he wants it to sit still. This opposing effect can be seen in Figure 6-9 (gamma vs. time to expiration) and Figure 6-17 (theta vs. time to expiration). As the gamma becomes large, so does the theta. Just as a large negative gamma represents a high degree of risk with respect to market movement, a large negative theta represents a high degree of risk with respect to the passage of time. Is it ever possible for an option to have a positive theta such that if nothing changes the option will be worth more tomorrow than it is today? When futures options are subject to stock-type settlement, as they currently are in the United States, the carrying cost on a deeply in-the-money option, either a call or a put, can, under some circum- 112 Chapter 6 Figure 6-15: Call Theoretical Value vs. Time to Expiration 12 90 10+ 3 8 Underlying Price = 100 G nvina > Volatility = 20% , gy ee : eee s 100 en se / ne . | 10 ee | : : T T 0 20 40 60 80 100 120 140 160 180 200 Time to Expiration (days) Figure 6-16: Put Theoretical",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.430236"
}