{
  "id": "089680ff41a4",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 154,
  "content": "to have very similar volatilities, put he finds that the implied volatility of ABC options, at 20%, is markedly different than the implied volatility of XYZ options, at 25%. If the trader also believes that one market will outperform the other, he might take a position by purchasing calls (puts) in one market and selling calls (puts} in the other market. But suppose the trader has no opinion on the relative strengths of the two markets. His only opinion is that options in one market are too cheap or expensive in relation to options in the other market. He simply wants to be long volatility in one market and short volatility in the other. What can he do? Suppose the trader purchases ABC calls and sells XYZ calls. If he is right about volatility and both markets move in the same direction, he will always show some profit (Figure 16-1}. But his profit will be greatest when ABC and XYZ rise in price. In the same way, if the trader purchases ABC puts and sells XYZ puts, he will always show Figure 16-3: Long 21 ABC 55 Calls/Short 12 XYZ 95 Calls ABC moves up 33% faster than XYZ, or moves if down 33% slower than XYZ yf = / ABC moves up twice as fast as XYZ, or moves down half as fast as XYZ av ABC and XYZ move up and down at the same rate a T T T T T a T T T T T T T T T T T T 40 41 42 43 44 #45 46 #47 #48 #49 «#50 51 52 53 54 55 56 57 58 59 60 ABC Price 340 Chapter 16 Figure 16-4: Short 21 ABC 45 Puts/Long 12 XYZ 105 Puts ABC moves up twice as fast as XYZ, or moves down half as fast as XYZ Profit & Loss ABC and XYZ move up and down at the same rate ABC moves up 33% faster than XYZ, or moves down 33% slower than XYZ T T TT TT T T T T T T T T T T T T 1 40 41 42 43 44 #45 46 47 #48 #49 #50 51 52 53 54 55 56 57 58 59 60 ABC Price some profit (Figure 16-2), But now his profit will be greatest when ABC and XYZ fall in price. A trader who has only a volatility opinion can combine these strategies to create an intermarket spread which is based solely on the assumption of a mispriced volatility relationship between the two markets. That is, the trader can buy straddles or strangles in one market and sell straddles or strangles in the other market. Since the trader is not taking a position on what the correct volatility is for ABC or for XYZ, but rather on the relative volatility between the two markets, he can’t determine the exact delta for the options. The easiest way to solve this problem is to focus on at-the-money straddles. Regardless of the correct volatility, he knows that at-the-money options have deltas of approximately 50. Suppose the trader decides to buy 20 ABC 50 straddles. How many XYZ 100 straddles should he sell if he wants the value of the total position to be dependent only on the volatility relationship between the two markets? The trader can think of his position as an ABC/XYZ call spread, combined with an ABC/XYZ put spread. Since ABC has a $delta of $200, the trader’s total $delta position in ABC 50 calls is: 20 x $200 x .50 = $2000 The $delta of XYZ is $100, so each XYZ call has a $delta of $100 x .50 = $50. The correct number of XYZ calls to sell is therefore: $2,000 / $50 = 40 Intermarket Spreading 34] The arithmetic is essentially the same for ABC and XYZ puts, each having a delta of —50. If the trader buys 10 ABC 50 puts, his $delta position is: 10 x $200 x -.50 = -$2000 With the $delta for the XYZ 100 put of -$50 we need to sell 40 XYZ 100 puts to balance the 20 ABC 50 puts which we purchased. The complete position is: long 20 ABC 50 calls short 40 XYZ 100 calls long 20 ABC 50 puts short 40 XYZ 100 puts The value of this position at expiration is shown in Figure 16-5. Note in Figure 16-5 that if ABC and XYZ move at the same rate, the position will always show a profit equal to the excess premium received for XYZ options (implied volatility = 25%) over the premium paid for ABC options (implied volatility = 20%). Suppose the implied volatilities of 20% for ABC and 25% for XYZ turn out to be correct. This means that XYZ will move 25% faster than ABC since 25/20 = 1.25. If this happens we can see from Figure 16-5 that the spread will now act like a short straddle, showing its maximum value if the market sits still and showing a loss if the market makes a big move. If the trader believes that XYZ will move faster than ABC, as indicated by the implied volatilities, he might alter the ratio. If XYZ does have a volatility 25% greater than ABC, the trader can rebalance the spread by purchasing 25% more ABC straddles than he originally intended. Instead of purchasing 20 ABC straddles he can purchase 25 ABC straddles. The effect of doing the spread in this new ratio is shown in Figure 16-6. We can see from Figure 16-6 that in the new size of 25 x 40 the spread breaks even if XYZ does move 25% faster than ABC. But the position acts like a long straddle if ABC and XYZ move at the same rate. In the new size of 25 x 40 the volatility difference between the two contracts has become a factor in determining the correct ratio. Originally, the trader balanced his spread based on",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.446068"
}