{
  "id": "c8148b6930df",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 70,
  "content": "marginal highs, and eventually rolled over into a trading range at the beginning of 2011. The sell-off found support at a previous swing low (visible on the weekly chart in the right pane), and the subsequent move off that low was a strong uptrend on the daily chart. In this case, resistance eventually failed and the market continued much higher, but this is not the point. The point is that the daily chart showed a clean, strong uptrend off the support level deﬁned by the weekly FIGURE 7.29 A Clean Daily Uptrend While the Weekly Chart Is in a Trading Range P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 225 FIGURE 7.30 Another Example of a Lower Time Frame Trend While the Higher Time Frame Is in a Trading Range trading range. Even if you are a trader who avoids markets in trading ranges, be aware that there may be opportunities in those markets on other time frames. For another example of this concept, look at the EURUSD, pictured in Figure 7.30. The weekly chart was clearly in a trading range, while the daily chart shows a strong downtrend off the test of resistance in July. Some of the best and cleanest trends come within higher time frame consolidation areas. This is an important and often misunder- stood element of price action that will repay careful study. Timing Entries from Lower Time Frames Remember the general three-time-frame structure: there is the time frame actually being traded (the trading time frame), and a higher and a lower time frame relative to that trading time frame. This is a somewhat arbitrary structure, but it is important for traders to deﬁne their intentions and the relevant time frames clearly. It is difﬁcult to isolate cross-time-frame inﬂuences because, in reality, these ﬂow both ways. The higher time frame (relative to the trading time frame) usually can suggest which trades are more likely to reach their targets and which are more likely to fail; the bigger-picture context provided by the higher time frame can be a valuable layer of information. In contrast, lower time frames are usually used in two ways: to time precise entries into trading time @GC- DailyG old Continuous Contract 1,150.00 Feb Mar '11 EURUSO - Daily Euro I US Doler j \"''\"\" . w.... ____.L..__ j j 11 I i ~ !II . ,_ f ,.· .• ,.,oo ~ : (~i ,/· ::: , 000 3000 / , . 1.46000 .4-4000 000 42000 ~____Loooo Jun Jul 106 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c08 JWBT634-Grimes May 10, 2012 7:48 Printer: Hamilton Printing CHAPTER 8 Trade Management Choices are the hinges of destiny. —Pythagoras T rade management is what you do after you get into the trade. These decisions are complicated because they deal both with mathematical realities and with trader psychology. One thing that you’ll often hear is that it’s your responsibility, as the trader, to ﬁnd your own right way to trade. The implication is that basically anything works; you just have to make some choices from the giant menu of possibilities, ex- periment until they feel right, and then stick with them. There is some truth here, in that any rule set must be matched to the trader’s personality and psychological makeup, but there is also a very important point that goes unsaid: it is exceedingly difﬁcult to ﬁnd an edge in the market. You must understand the impact of every decision and every adjustment. Consider the simple case of a speciﬁc trading pattern that has an edge in predicting a small directional movement over the next few bars. Traders A and B decide to trade this pattern, but they both realize the importance of adapting it to their personalities. Let’s simplify the problem they face, and consider only the choices in exiting at a proﬁt and exiting at a loss, and furthermore restrict the options for those two conditions to “large” and “small.” If we were trading our theoretical random walk market, these choices would not matter because the probability of winning would adjust to maintain zero expectancy (remember, no edge is ever possible in a random walk market), but the situation is differ- ent if the trading signal actually has predictive value in real markets—trading signals that have predictive value generally see that value limited to a speciﬁc time horizon and mag- nitude. This is fairly intuitive. No one would expect a signal on an intraday time frame to reliably have an impact many months out. In this theoretical example, assume that the signal is good for only a few bars following the entry. 231 P1: OTA JWBT634-c08 JWBT634-Grimes May 10, 2012 7:48 Printer: Hamilton Printing 234 TRADING STRATEGIES FIGURE 8.1 Two Stop Levels for a Long Position Entered on the Last Candle of the Chart the ATR, but it is also possible to judge it from a visual inspection of the chart for this purpose.) r If buying against a sloppy support area with many shadows below, the only stop that makes sense is beyond the most extreme low. Furthermore, it is entirely possible that the stop will be hit on a drop to an even more extreme low. If this happens and you are stopped out of the position on a fakeout, it is necessary to rebuy with a new stop beyond the new, lowest extreme. r In practice, if you are concerned about the particular market for some reason—for instance, an impending report or something else that could generate excessive volatility—you may want to have smaller size on the trade. One way to accomplish this is to set the initial stop farther away. This is",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.706368"
}