{
  "id": "df84a0ae5519",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 8,
  "content": "k in g h i gh f requency win rate/ l ow f requency l oss rate. Cutting winning trades shor t Crowding stops or moving them away from approachin g price . Ta k in g unp l anne d tra d es an d d ou bl in g d own to ma k e up f or a l oss. Avoi d ing tra d es . Trimming position size a f ter a l oss. M issing O ut “T h e mar k et is moving wit h out me! ” “I misse d t h e l ast setup l i k e t h is; I won ’t miss t h is one. ” “I ’ve g ot to g et in h ere, I can ’t miss th is tra d e .” Jumping into unp l anne d tra d es. Enterin g tra d e too soon . O versizin g position . L eaving M oney on t h e Ta ble “I can ma k e rea l money on t h is tra d e. ” “T h e l ast tra d e ran f ar, so I ’m h o ld ing th is one .” “I ’m on a h ot strea k; l et ’s increase size an d ma k e some serious money . ” Ho ld ing tra d es f ar too l ong. Neg l ecting pro f it target o b jectives. Ignoring mar k et signs to c l ose tra d e . O versizing position . - ~---------- 9 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 45STRONG EMOTIONS IN TRADING s h ort or p l ace stops too c l ose, b ecause you f ear l oss or f ear b ein g wron g . It is impor- tant to assess your tra d in g an d i d enti f y erratic tra d in g actions t h at may b e cause d b y f ear. T h e i d ea h ere is to s h ine l i gh t on t h e issue so you b ecome aware o f it. Tra d in g out o f awareness wi ll k eep y ou stuc k in t h e same patterns. As we d iscuss l ater in t h is chapter, erratic tradin g actions do serve a purpose, but it is not a purpose that serves your tradin g . If your tradin g is erratic or overly infl uenced by the emotions of fear an d anxiety , you can use t h e f o ll owing exercise to h e l p you b ecome c l ear on t h e k in d of fear that a ff ects your trading and how it does so. Exercise 2.1 asks you to identify and record personal erratic tradin g behavior you f requent l y experience. Recor d t h ese un d er How Y ou Act. Y ou can use t h e examp l es o f erratic tra d ing b e h avior l iste d in T a bl e 2.1 as a gui d e, an d a dd any ot h ers you experience t h at are unique to you. Next, write d own your t h oug h ts—t h ings your min d is te ll ing you about the market or your trade. Then, determine the type of fear you are experienc - ing. Y ou mig h t fi n d t h is exercise b est to d o w h i l e tra d ing or just a f ter tra d ing. I f you d o it later you may miss important data. Our memory tends to be selective about things like this, so it is best to fi ll in the form as close to the event as y ou are able. Also, it will Exercise 2.1 Becoming Aware of Fear and Other Strong Emotions How You Act What Your Mind Tells You Emotion (if fear, note type of fear) 10 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 49STRONG EMOTIONS IN TRADING down move. Later, when the market did rebound, I was kickin g mysel f as t h ey a ll ra ll ie d smart l y. T h en, I starte d d ay tra d in g ! I ’m not a d ay t ra d er; I k new t h at, b ut I tra d e d . I too k positions in t h e S&P f utures. None o f t h ose tra d es wor k e d . I was very tense an d anxious a ll t h e time. I couldn’t sleep at ni g ht. All I thou g ht about was the market and the losses. It was a ni g htmare. In the end, somethin g g ood did come out of it. T h at was t h e rea l ization o f h ow important my investment process is t o my wor k . W h en I was tra d ing, I h a d no process. I was essentia ll",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:45.718245"
}