{
  "id": "9920a062d648",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 8,
  "content": "and short refer to the purchase or sale of a contract, and this is the sense in which we apply these terms to option trading. A trader who has purchased an option is long the option, and a trader who has sold the option is short. There is no confusion when we refer to a long call position because the trader who is longa call also has a long market position. Calls will, in theory, rise in value if the underlying market rises. But a long put position is a short market position. A trader who has purchased a put wants the underlying market to decline because a put will theoretically increase in value as the market declines. Throughout the text, whenever there is the possibility of confusion, an attempt will be made to distinguish between a long or short market position versus a long or short option position. ge 2 & Elementary Strategies The trader who enters an option market for the first time may find himself subjected to a form of “contract shock.” Unlike a trader in equities or futures, whose choices are limited to a small number of instruments, an option trader must often deal with a pewildering assortment of contracts. With at least three different expiration months, with each month having several different exercise prices, and with both calls and puts available at each exercise price, it is not unusual for an option trader to be faced with as many as 40 different contracts. Even if we eliminate the inactively traded options, a new trader may still have to deal with 15 or 20 different options. With so many choices available, a trader needs some logical method of deciding which options actually represent profit opportunities. Which should he buy? Which should he sell? Which should he avoid altogether? The choices are so numerous that many prospective option traders give up in frustration. For the trader who does persevere, a certain logic in the pricing of options begins to emerge. As he becomes familiar with this logic, he can begin to formulate potentially profitable strategies. Initially he will concentrate on the purchase or sale of individual options. From there he will go on to combination strategies. Eventually he will become comfortable with complex strategies involving several different contracts. How might a beginning trader assess an option’s value? One simple method depends on guessing where the underlying contract will be at expiration. If an option position is held to expiration, the option will be worth either zero, if it is at- or out-of-the-money, or intrinsic value (parity), if it is in-the-money. The purchase of an option will be profitable if its trade price is less than its value at expiration. The sale of aN option will be profitable if its trade price is greater than its value at expiration. SIMPLE BUY AND SELL STRATEGIES For example, suppose the following options are available with two months remaining tO expiration, and the underlying contract trading at 99.00: 85 90 95 100 105 110 115 Calls 14.05 9.35 5.50 2.70 1.15 45 20 Puts .10 45 1.55 3.70 7.10 11.35 = 16.10 Suppose we believe that the underlying contract will rise to at least 108 by expiration, We might then purchase a 100 call for 2.70. If we are correct, and the Contract does in fact end at 108, our profit at expiration will be the option’s intrinsic 13 14 Chapter 2 value of 8.00 less the 2.70 we originally paid, or 5.30. Given the above prices, if the underlying market rises to 108 by expiration we will show a profit if we purchase any call with an exercise price less than 110. The intrinsic value of each of these options at expiration will be greater than its current price in the marketplace. What about the 110 and 115 calls? If we believe that 108.00 is a reasonable upside goal for the underlying contract, but consider it unlikely that the price will rise above 110, then we will prefer to be sellers of the 110 and 115 calls. If we sell the 110 call for .45 and the underlying contract never rises above 110.00, the 110 call will expire worthless and we will get to keep the full premium of .45. We can also sell the 115 call for .20, giving us an additional 5 point margin for error. If the underlying contract never rises above 115.00, the 115 call will expire worthless and we will get to keep the full premium of .20, We can use the same approach to assess the potential profit from the purchase or sale of a put. As with a call, a put’s intrinsic value at expiration must be greater than its trade price in order for the purchase of a put to be profitable. If the underlying contract rises to 108.00 by expiration, any put with an exercise price of 105 or less will be worthless. If we sell any of these puts, we will profit by the full amount of the premium. If we sell the 110 or 115 puts, they will not be totally worthless at expiration because, with the underlying contract at 108.00, they will have intrinsic values of 2.00 and 7.00, respectively, However, this will still be less than their trade prices of 11.35 and 16.10. We will show a profit of 9.35 from the sale of the 110 put and 9.10 from the sale of the 115 put. As we change our assumptions about the likely price of the underlying contract at expiration, we alter the likely profit or loss from any option position. If, instead of rising to 108.00, the underlying contract actually rises to 120.00, the purchase of the 100 call for 2.70 will result in a profit of 17.30 rather than 5.30. On the other hand, if the underlying contract falls to 90.00, the purchase of the 100 call will result in the loss of the full premium of 2.70. In the latter case, if we",
  "word_count": 1000,
  "topics": [
    "options"
  ],
  "created_at": "2026-02-05T08:09:54.423441"
}