{
  "id": "91da18cf4002",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 114,
  "content": "trading session may not be the closing print in many markets. 182 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing Glossary 433 limit orders A type of order to buy or sell with a price limit attached. The order will be executed only at the limit or at a more favorable price (i.e., limit buy orders will be ﬁlled at or under the limit price, and limit sell orders at or above the limit). linear regression A mathematical technique for modeling the relationship between a set of variables. linearly scaled charts Price charts in which the y-axis (vertical axis) is scaled so that equidistant ticks are equal-sized price movements. log scale chart Price chart with the y-axis scaled so that equidistant tick marks on that axis are the same percentage distance apart. long-term investors Typically, individuals or ﬁrms that buy assets intending to hold them for multiple quarters or years. As a general rule (and one that is not entirely cor- rect), these players tend to be more focused on fundamental analysis than on technical factors. lower time frame (LTF) In the standard three time frames scheme, the lowest time frame, below the trading time frame. Most traders use the LTF to time entries and to manage risk rather than for idea generation and analysis. markdown The classic Wyckoff market stage following distribution, corresponding to a downtrend in modern terminology. marketable limit orders Limit orders placed on the wrong side of the market. In other words, marketable buy limit orders will be placed above the offer. These orders will immediately execute at the offer, as would a market order. However, if they remove sufﬁcient liquidity from the book to drive prices higher, they will not be ﬁlled higher than the limit price. This order offers a compromise between urgency of execution and protection from adverse ﬁlls. See market orders. market makers A set of market participants who, generally, are mandated to always be willing to buy and sell an asset in order to maintain an orderly market. Historically, many of these were ﬂoor traders, but this function is now generally fulﬁlled by computers and algorithms. Note that market makers have discretion to set the distance between their bids and offers, and they adjust this in response to market conditions. market orders A type of order that will be executed immediately, theoretically at the best possible price. In most markets, customers have no recourse in the event of a bad ﬁll on a market order, so these should be used with caution. Nearly all traders will ﬁnd marketable limit orders to be preferable. market structure The patterns of prices as revealed by swings connecting important pivot highs and lows. Skilled analysts and traders can use market structure to understand the balance of buying and selling pressure, and sometimes to derive an edge for the future direction and/or volatility conditions. markup In Wyckoff’s terminology, the market stage following accumulation, corre- sponding to an uptrend in modern terminology. mean A measure of central tendency. In practice, this is what most people mean when they say “average”: the sum of the values in a data set divided by the number of elements in that set. mean reversion The tendency for markets to reverse large movements and to come back to a middle or average value. This does not necessarily mean that markets will pull 183 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing 434 GLOSSARY back to moving averages. Different markets display different degrees of mean reversion at different points in the market cycle. mean-reverting See mean reversion. measured move objective (MMO) A technique used to set an approximate price target for a swing out of consolidation, based on the assumption that future volatility will resemble past volatility. This, and all other ratio-based measures, is better used as a guide than a precise target. measures of dispersion Measures such as standard deviation, variance, range, and IQR that describe how data points spread out from a central value or set of values in a prob- ability distribution. median A measure of central tendency. If a data set is ordered from smallest to largest, the median is the middle value in the set. If there is an even number of data points, the median is between the middle two points, and is the mean of those two points. Micro Trendlines A term used by Al Brooks to describe very small, short-term trend lines usually drawn between two to ﬁve bars. Modern Portfolio Theory (MPT) A mathematical concept that deals with diversiﬁcation and risk in a portfolio context, seeking to maximize portfolio return for a given unit of risk. The term modern in the name is a misnomer, because MPT comes from work Harry Markowitz did in the 1950s. modiﬁed MACD indicator The moving average convergence/divergence (MACD) is a standard technical indicator. This book advocates the use of a simpliﬁed, modiﬁed MACD based on 3/10/16-period moving averages. momentum divergence There are several variations of this technical tool, but most of them look for a new high or low in price (relative to its recent history) that is not ac- companied by a new high or low on a momentum indicator, such as the MACD. The assumption is that there was less conviction behind the move, so it",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure"
  ],
  "created_at": "2026-02-05T00:37:53.713248"
}