{
  "id": "25ab6402ef09",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 49,
  "content": "has a short gamma position. For example, suppose an at-the-money call, with a delta of 50, and an at-the money put, with a delta of -5O, both have gammas of 5. If the underlying contract rises one point, we add the gamma of 5 to the call delta of 50, to get the new delta of 55. To get the new put delta if the underlying contract rises one point we also add the gamma of 5 to the put delta of -50 to get the new delta of -45. This corresponds to our intuition 2. When the delta is expressed in the decimal format (0 to 1.00), the gamma is expressed In the same format. 3. If interest rates are zero, as they are assumed to be In Figures 6-6 and 6-7, the gamma of calls and puts with the same exercise price will be identical. If interest rates are not zero, and there is a possibility of early exercise, the gammas may differ slightly. 104 Chapter 6 Figure 6-6: Call Delta vs. Underlying Price 100- 90+ 80- 70- 607 507 Delta 40- Time = 60 days Volatility = 20% 90 100 é 110 80 ’ “ “ ° 1 0- ” a a oa a L a ot _- — pepe | | 100 105 Underlying Price 80 110 115 120 Figure 6-7: Put Delta vs. Underlying Price 0 Time = 60 days Volatility = 20% -104 -207 -307 -40- 90 -50- Delta -60- -80- -90+ ; a “ 400 pn 80 100 Underlying Price 105 t T 110 115 120 Option Values and Changing Market Conditions 105 that as the underlying price rises, at-the-money calls move into-the-money and at-the- money puts move out-of-the-money. If the underlying contract falls one full point, in both cases we subtract the gamma, giving the call a delta of 45 (50-5), and the put a delta of -55 (-50—5}. Now the call is moving out-of-the-money and the put is moving into-the-money. We know that an underlying contract has a delta of 100. But what is the gamma associated with an underlying contract? Since the gamma is the rate of change in the delta, and the delta of an underlying contract is always 100, the gamma must he zero. The gamma is a measure of how fast an option changes its directional charac- teristics, acting more or less like an actual underlying position. Since directional risk is always important, the gamma is an important risk measurement. Indeed, an option position can change its directional risk dramatically, even if a trader takes no action in the marketplace. A large gamma number, whether positive or negative, indicates a high degree of risk; a low gamma number indicates a low degree of risk. Every option trader learns to look carefully not only at current directional risk (the delta), but also at how that directional risk will change if the underlying market begins to move (the gamma}. Consider a trader who sells ten calls with a delta of 30 each. He is short 300 deltas (-10 x 30}, equivalent in theory to being short three underlying contracts. If this trader is accustomed to dealing in lots of five underlying contracts or less, he is, for the moment, within his normal risk limits. If the market rises ten points and he considers only his original delta position of -300, he may assume that he is still, in theory, short the same three underlying contracts. But what if the initial gamma of each call was 6? Then, for each point rise in the underlying contract, each call will gain 6 deltas. When the underlying rises ten points, each call will gain 60 deltas, for a total delta of 90 each. The trader’s directional risk has now increased by a factor of three. Instead of the initial delta of -300, the delta position is now -900, well beyond his normal risk limits. A large gamma can sometimes overwhelm the inexperienced trader. New traders are well advised to avoid large gamma positions, particularly negative ones, because of the speed with which such positions can change. Even experienced traders occasionally take on gamma positions which are too risky. This was dramatically demonstrated in the collapse of the Volume Investors clearing firm on the COMEX in the spring of 1985. Several traders, all clearing their trades through the same firm, built up extremely large negative gamma positions by selling large numbers of out-of-the-money gold options. In the past this had been a very profitable strategy, since the gold market had been relatively quiet with low volatility. But on this occasion the market made a violent upward move, leaving the traders, who had originally been delta neutral, short thou- sands of deltas in a rapidly rising market. The losses sustained by the traders not only led to the collapse of the clearing firm, but also to a crisis in the COMEX’s clearing association. The incident might have been avoided had someone, either the traders themselves, the clearing firm, or the clearing association, realized that the large negative gamma position represented an unacceptable risk. Most firms which trade options or clear option trades for their customers now have risk managers responsible for identify- ing such dangerous positions. 106 Chapter 6 The gamma can also help a trader maintain a delta neutral position by enabling him to make a quick estimate of how the delta is changing. Suppose a trader has a delta position of +500 prior to the opening of the market. If he wishes to be delta neutral he knows that he will have to sell 500 deltas on the opening. He can accomplish this by selling five underlying contracts. But suppose that his gamma position is +100 and the market is expected to open two points higher. If it does in fact open two points higher his delta position will no longer be +500, but +700 since he will become 100 deltas longer for each point rise in the underlying. He now knows",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.429918"
}