{
  "id": "602ca02b584f",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 174,
  "content": "the delta of the 100 straddle was much more sensitive to a change in the price of the underlying contract. With nine months to expiration the 100 call and put have a gamma of only 2.2. But with one day to expiration they have a gamma of 38.1. In the latter situation, with such a high negative gamma, any movement will undoubtedly be very painful. The trader could reduce some of the damage if he were able to adjust the position by purchasing futures as the market moved upward. But a gap is an instanta- neous move; there is no opportunity to adjust. The very high gamma, combined with an inability to make any adjustment, is what makes the gap so devastating. Options have the unique characteristic of automatically, and continuously, rehedg- ing themselves by changing their deltas as the price of the underlying contract changes. It is this characteristic which buyers of options are paying for. A trader who uses a theoretical pricing model attempts to take advantage of a mispriced option by estab- Figure 18-4 Implied Volatility = 20%; interest Rate = 6% 9 months to explration 1 day to expiration Futures Futures Futures Futures at 100 at 105 at 100 at 105 100 call price 6.59 9.41 42 5.00 100 put price 6.59 4.63 42 ) 100 straddle price 13.18 14.04 84 5.00 8. For simplicity, we assume that there is no change in implied volatility after the gap. Admittedly, this is unlikely to be the case. Models and the Real World 397 lishing a delta neutral hedge against the underlying, and then manually performing the rehedging process himself over the life of the option. This was the basis for the examples in Chapter 5. If amodel assumes, as most do, that prices follow a diffusion process, the model assumes that one can continuously maintain a delta neutral hedge. But when the market gaps, the assumptions on which the model is based are violated. Consequently, the values generated by the model are rendered invalid. This problem extends to any application which attempts to replicate option characteristics through a continuous rehedging in the underlying market. The proponents of portfolio insurance suffered their greatest setbacks on October 19 and 20, 1987, when the market made several large gap moves. Because of the gaps, the portfolio insurers were unable to make continuous delta adjustments to their positions. As a consequence, they found that the cost of protection offered by portfolio insurance was much greater than they had ever expected. Since traditional pricing models make an unrealistic assumption about how prices change, perhaps a model which makes a more realistic assumption would yield more accurate theoretical values. Theoreticians tend to agree that underlying contracts in most markets follow a combination of both a diffusion process and a jump process. Most of the time prices change smoothly and continuously, with no gaps. Every now and then, however, a gap will occur, instantaneously sending the price to a new level. From there prices will again follow a smooth diffusion process until another gap occurs. If one could generate a underlying price distribution which resulted from this jump-diffusion process, and feed this distribution into a theoretical pricing model, the model should give more accurate values. A Variation of the Black-Scholes model which assumes that the underlying contract follows a jump-diffusion process has in fact been developed. If used correctly, this jump-diffusion model does give values which are probably more accurate than tradi- tional Black-Scholes values.” Unfortunately, the model is considerably more complex mathematically than the traditional Black-Scholes model. Moreover, in addition to the five customary inputs, the model also requires two new inputs: the average size of a jump in the underlying market, and the frequency with which such jumps are likely to occur. Unless the user can accurately estimate these new inputs, the values generated by a jump-diffusion model may be no better, and might be worse, than those generated by a traditional model. Most traders take the view that whatever weaknesses are encountered in a traditional model can be best offset through intelligent decision making based on actual trading experience, rather than through the use of a more complex jump-diffusion model. Since a gap in the market will have its greatest effect on a high gamma option, and since at-the-money options close to expiration have the highest gamma, it is these options which are likely to be mispriced by a traditional theoretical pricing model with its continuous diffusion process. The closer one gets to expiration, the more suspect 7. Information on the jurnp-diffusion model can be found in most advanced texts on option theory. For additional information see: Merton, Robert, “Option Pricing when Underlying Stock Returns are Discontinous,” Journal of Financial Economics, Volume 3, March 1976, pages 125-144. Beckers, Stan, “A Note on Estimating the Parameters in the Jump-Diffusion Model of Stock Returns,” Journal of Financial and Quantitative Analysis, March 1981, pages 127-140, 398 Chapter 18 model-generated values become. Consequently, traders pay less and less attention to model-generated values as expiration approaches. It is common practice among floor traders on option exchanges to take with them to the trading floor sheets with theoretical values to enable them to make markets which are consistent with a theoretical pricing model. But as expiration approaches traders are more likely to discard their sheets because the values on the sheets become less reliable. With only one or two days to expiration, most traders simply make decisions based on experience and intuition. While this is perhaps unscientific, it sometimes makes better sense than trading from model-generated values when the model is known to be incorrect. AS a result of the gaps which occur in the real world, both a trader’s experience and empirical evidence seem to indicate that a traditional model, with its built-in diffusion assumption, tends to undervalue at-the-money options as expiration ap- proaches. From a risk standpoint, this means that it can be very dangerous to sell a large number of at-the-money options close to",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.449047"
}