{
  "id": "83aacb1dcc4b",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 177,
  "content": "that the actual frequency distribution is similar to the normal distribution, but there are some Clear differences. Because the bars representing the small price changes rise above the normal distribution curve, there seem to be more small price changes than one would expect from a true normal distribution. There are also several large price changes, or outliers, which rise above the extreme tails of the normal distribution. These outliers seem to indicate that there are more large moves in our frequency distribution than one would expect from a true normal distribution. Finally, in the midsections, between the peak of the distribution and the extreme tails, there seem to be fewer occurrences than one would expect. One might at first surmise that differences in Figure 18-5a between the S&P 500 frequency distribution and the true normal distribution are either unique to the S&P 500, or an aberration of the five-year period in question. It turns out, however, that price 402 Chapter 18 change distributions for almost all underlying markets exhibit characteristics which are very similar to our S&P 500 distribution. There are usually more days with small moves, more days with large moves, and fewer days with intermediate moves than are predicted by a true normal distribution. These differences between the real world and a theoretical distribution can also be seen in Figures 18-5b and 18-5c, the distribution of price changes for German Bonds and soybeans over the same five-year period. SKEWNESS AND KURTOSIS Distributions such as those in Figures 18-5a, 18-Sb, and 18-5c are approximately normal, but still differ from a true normal distribution. If one is trying to make decisions based on the characteristics of a distribution, it might be useful to know how the actual distribution differs from the normal. A perfectly normal distribution can be fully described by its mean and standard deviation. But two other numbers, the skewness and kurtosis, are often used to describe the extent of the difference between an actual frequency distribution and a true normal distribution. The skewness of a distribution (Figure 1 8-6a} can be thought of as the lopsidedness of the distribution, or the extent to which one tail is longer than the other tail.? If a distribution is positively skewed, the right-hand tail is longer than the left-hand tail. If Figure 18-5b: German Bonds, Percent Daily Price Changes 1989-1993 225 Total number of days = 1261 Largest upward move = +2.323 % Largest downward move = -1.930 % Mean = +.0038 % Standard deviation = .3265 % Annulaized volatility = 5.183 % Skewness = -.009 Kurtosis = 6.473 2007 175- 150-4 125-4 100- normal distribution Occurrences 754 5075 255 T T T TOT TT TT TF -1.5 -1.0 -.5 ie) +.5 +1.0 +1.5 +2.0 9. The calculation of skewness and kurtosis can be found in Appendix B. Models and the Real World 403 Figure 18-5c: Soybeans, Percent Daily Changes 1989-1993 150 4256- Total number of days = 1262 Largest upward move = +7.75 % Largest downward move = -7.12 % Mean = -.020 % Standard deviation = 1.202 % 1005 Annulaized volatility = 19.084 % 75+ normal distribution Occurrences 50-4 25-4 Skewness = +.152 Kurtosis = +4.606 +2 +4 +6 Figure 18-6a: Skewness Positive Skewness (longer right tail) Negative Skewness (longer left tail) 404 Chapter 18 the distribution is negatively skewed, the left-hand tail is longer than the right-hand tail. A true normal distribution has a skewness of zero. The frequency distributions in Figures 18-5a (S&P 500) and 18-5b (German Bonds) are slightly negatively skewed, while the distribution in Figure 18-5c (soybeans) is slightly positively skewed. The kurtosis of a distribution (Figure 18-6b} is the extent to which the peak of the distribution is unusually tall and pointed, or low and flat. A distribution with a positive Kurtosis has a tall, pointed peak (/eptokurtic), while a distribution with a negative kurtosis has a low, flat peak ( platykurtic). A perfectly normal distribution has a kurtosis of zero (mesokurtic). Note that a distribution with a low standard deviation also has a pointed peak, just as a distribution with positive kurtosis. But a distribution with a low standard deviation also has narrow tails, while a distribution with a positive kurtosis has long tails. A positive kurtosis distribution is also narrower, or squeezed inward, in the midsection between its peak and tails. The frequency distributions in Figures 18-5a, 18-5b, and 18-5c exhibit the same positive kurtosis, as do almost all underlying markets. They have higher peaks (more days with small moves), more elongated tails (more days with big moves}, and narrower midsections (fewer days with intermediate moves) than are predicted by a true normal distribution. Figure 18-6b: Kurtosis Positive Kurtosis (leptokurtic) Neutral Kurtosis (mesokurtic) i \\ Negative Kurtosis (platykurtic) Models and the Real World 405 VOLATILITY SKEWS There are clearly real problems associated with the use of a traditional theoretical pricing model. Markets are not frictionless; prices do not always follow a diffusion process; volatility may vary over the life of an option; the real world may not look like a lognormal distribution. With all these weaknesses, one might wonder whether theoretical pricing models have any practical value at all. In fact, most traders have found that pricing models, while clearly not perfect, are an invaluable tool for making decisions in the option market. While models don’t always work perfectiy, they have proven to be far better than any other method of evaluating options. Still, a trader who wants to make the best possible decisions cannot afford to ignore the problems associated with a theoretical pricing model. Consequently, a trader who uses a pricing model might look for a way to reduce the potential errors resulting from these weaknesses. Initially, one might simply look for a better theoretical pricing model. If such a model exists, then it will certainly be worth replacing the old model with the new one. But “better” is a relative term. A model might be better in the sense that it gives slightly more accurate theoretical values. But",
  "word_count": 1000,
  "topics": [
    "options"
  ],
  "created_at": "2026-02-05T08:09:54.449564"
}