{
  "id": "b354de38731f",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 29,
  "content": "64 Chapter 4 a normal distribution of possible prices, then the 110 call and the 90 put, both being 10% out-of-the-money, ought to have identical theoretical values. But under the lognormal assumption in the Black-Scholes Model, the 110 call will always have a greater value than the 90 put. In absolute terms, the lognormal distribution assumption allows for greater upside price movement than downside price movement. Conse- quently, the 110 call will have a greater possibility of price appreciation than the 90 put. Finally, the lognormal assumption built into the Black-Scholes Model overcomes the logical problem we initially posed. If we were to allow for the possibility of unlimited upside price movement of an underlying instrument, a normal distribution assumption would force us to allow for unlimited downside movement. This would require us to accept the possibility of negative prices for the underlying instrument, clearly not a possibility for most optionable instruments. A lognormal distribution, however, does allow for open ended upside prices (the logarithm of +o0 is +00}, while bounding downside prices by zero (the logarithm of — is zero). This is a more realistic repre- sentation of how prices are actually distributed in the real world. A more complete discussion of logarithmic price changes and probability calcula- tions can be found in Appendix B. We can now summarize the most important assumptions governing price move- ment in the Black-Scholes Model: 1. Changes in the price of an underlying instrument are random and cannot be artificially manipulated, nor is it possible to predict beforehand the direction in which prices will move. 2. The percent changes in the price of an underlying instrument are normally distributed. 3. Because the percent changes in the price of the underlying instrument are assumed to be continuously compounded, the prices of the underlying instru- ment at expiration will be lognormally distributed. 4, The mean of the lognormal distribution will be located at the forward price of the underlying contract. The first of these assumptions may meet with resistance from some traders. Technical analysts believe that by looking at past price activity it is possible to predict the future direction of prices. One can chart support and resistance points, double tops and bottoms, head and shoulders, and many similar formations which are believed to predict future price trends. We leave debate on this question to others. The important point here is that the Black-Scholes Model makes the assumption that price changes are random and that their direction cannot be predicted. This does not mean that there is no predictive requirement in using the Black-Scholes Model. However, price prediction 1. Ofcourse, this is only theory. There is no law that says the price of the 90 put in the marketplace cannot be greater than the price of the 110 call. Volatility 65 will focus on the magnitude of the price changes, rather than on the direction of changes. As we shall see later, there is also good reason to question the third assumption, that prices are lognormally distributed at expiration. This may be a reasonable assump- tion for some markets, but a very poor assumption for other markets. Again, the important point here is for the trader who uses a theoretical pricing model to understand the assumptions on which the theoretical values are based. He can then make his own decision, based on his knowledge of a particular market, as to whether these assump- tions, and hence the theoretical values generated by the model, are likely to be accurate. DAILY AND WEEKLY STANDARD DEVIATIONS AS an annual standard deviation, we know what the volatility tells us about the likely price movement of a contract over a one-year period. However, this is a period of time longer than the life of most listed options. We might want to know what a volatility tells us about price changes over a shorter period of time, for example over a month, or a week, or a day. An important characteristic of volatility is that it is proportional to the square root of time. As a result of this, we can approximate a volatility over some period of time shorter than a year by dividing the annual volatility by the square root of the number of trading periods in a year. Suppose we are interested in a daily volatility. While it would take a logarithmic calculation to give us an exact daily volatility, if we ignore the relatively minor effect of continuous compounding over such a short period of time, it is possible to make an estimate of daily volatility. First we must determine the number of daily trading periods in a year. That is, if we look at prices at the end of every day, how many times a year can prices change? If we restrict ourselves to exchange traded options, even though there are 365 days in a year, prices cannot really change on weekends or holidays, This leaves us with about 256 trading days during the year.2 Since the square root of 256 is 16, to approximate a daily volatility we can divide the annual volatility by 16. Going back to our futures contract trading at 100 with a volatility of 20%, what is a one standard deviation price change over a day’s time? 20%/16 = 114%, so a one Standard deviation daily price change is 11%4% x 100 = 1.25. We expect to see a price change of 1.25 or less approximately two trading days out of every three, and a price change of 2.50 or less approximately 19 trading days out of every 20. Only one day in 20 would we expect to see a price change of more than 2.50, We can do the same type of calculation for a weekly standard deviation. Now we Must ask how many times per year prices can change if we look at prices once a week. Unlike trading days, we don’t have “holiday” weeks, so we must make our calculations using all 52 trading weeks in a year.",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options"
  ],
  "created_at": "2026-02-05T08:09:54.426745"
}