{
  "id": "6c58969357ac",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 36,
  "content": "Printing 110 MARKET STRUCTURE FIGURE 4.10 Price Rejection in the AUDJPY watch for trend termination patterns on lower time frames when one of these patterns is underway. Multiple Tests This is not to say that price will touch the level once, never to re- turn. It is certainly possible for a level to have multiple tests, and it can be difﬁcult to read the balance of buying and selling conviction on these subsequent tests. Each test actually weakens the level because price should not be able to return to the level if it is going to hold. If there is genuine demand at a level, why did buyers not chase prices higher? Why are we back here? Those are the questions you need to ask. Tradi- tional technical analysis tells us that a level is more valid the more times it is tested, but I believe that this is one of those pieces of the conventional wisdom that is ab- solutely wrong. If a level is going to hold, it should be tested once, twice, or maybe three times, and then there should be a move away from the level backed by strong con- viction. If price is able to return to the level three or more times, probabilities begin to shift in favor of the level breaking. Traders make a critical mistake when they buy in front of the same support level multiple times, because the conﬁdence that comes - 111 11111h:/ _11 ___ 11lt~------l- ✓ I I AUDJPY - Daily Aust Dollar/ Japanese Yen I so.ooo }I:::: 82.000 80.000 78.000 76.000 74.000 Oct '11 Apr 53 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing On Trading Ranges 111 FIGURE 4.11 Multiple Tests of Support in RIMM Precede a Failure with earlier successes leads to the temptation to increase position size. This is a recipe for disaster. Levels can be tested multiple times and still hold, but you should be very suspicious of them after two tests. Ideally, the key is that we need to see renewed price rejection on each of the tests. If we do not see this, if price returns to the level and there is not enough conviction to push price away from the level, this is much more indicative of the level failing. If the market is able to go quiet and dull at or near the level, this is of- ten a harbinger of impending failure. Figure 4.11 shows a 78-minute chart of Research in Motion Limited (Nasdaq: RIMM). (78-minute charts divide the U.S. trading session for equities into ﬁve equal periods. Traders using hourly charts will always have a bar that is longer or shorter than the others.) Traders buying support should have been suspicious on the third test of the level; there was no justiﬁcation for holding or initiating posi- tions on any subsequent tests of this level. The selling began in earnest once the level was decisively violated. A useful tool for traders developing a sense of price action around support and resis- tance levels is a very short-term (2- or 3-period) lower time frame moving average. The only purpose of the moving average in this case is to smooth out the smallest ﬂuctuations RIMM - 78 min Research In Motion 1.00 - 1.00 S/16 5/17 S/18 S/19 5120 S/23 5124 5125 S/26 5127 5/31 Jun 612 613 6/6 6/7 6/8 619 6/10 54 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing 112 MARKET STRUCTURE FIGURE 4.12 Price Rejection at Support in prices in order to highlight the overall intent behind the moves. Though it is possible to use a similar technique on the trading time frame, dropping down to the lower time frame, at least for the purposes of study and learning, will help to build intuition about what kind of price action can generate structures seen on the trading time frame. Fig- ure 4.12 shows a 2-period moving average on 15-minute price bars of Goldman Sachs Group, Inc. (NYSE: GS). The price bars have been ghosted to better highlight the action of the moving average as the market comes into a potential support area marked near the bottom of the chart. (This level is based on price structure not visible off the left edge of the chart.) Note that the moving average comes near the level and is violently turned away at A. Figure 4.13 shows another example, in this case where GS came up against a resis- tance level. Note that the initial price rejection, at A, was weak and had no conviction. Price quickly found itself back up against the level, and consolidated there for many bars at B. This is not what we should see if a level is going to hold, and price did eventually break through at C. Study these patterns well, at ﬁrst with the aid of a moving average as in Figures 4.12 and 4.13, and then without. If a support or resistance will hold or fail, price rejection will usually tell the tale. GS - 1 S min Goldman Sachs Group 167.00 166.00 165.00 164.00 163.00 162.00 161.00 160.00 159.00 158.00 8/28 8131 Sep 12:00 912 12:00 9/3 12:00 9/4 12:00 9/8 12:00 55 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "risk_management"
  ],
  "created_at": "2026-02-05T00:37:53.700946"
}