{
  "id": "cfb6f85dfeff",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 6,
  "content": "for 40 years! T h e b est anti d ote to re d uce ju d gment errors d ue to cognitive h euristics an d b iases accor d ing to Danie l Ka h neman an d h is co ll eague Gary K l ein is t h roug h t h e d eve l op - ment of expertise. Even traders who are true masters and appear to rely on hi g hly re fi ne d intuition in rea d ing t h e mar k ets an d ma k ing tra d es are app l ying h ar d ‐won tra d ing an d c h art‐rea d ing s k i ll s. T h e more s k i ll e d one b ecomes at rea d ing mar k ets an d managing tra d es un d er varying mar k et con d itions, t h e f ewer t h e tra d ing errors due to heuristics and biases, and, of course, the better the tradin g results. This re - quires a protracte d perio d o f experience in w h ic h specia l f orms o f practice are car - ried out with clear, immediate feedback on p erformance. For a technical trader, this means a len g thy period of trainin g throu g h simulation or paper tradin g and a g radual immersion into actual trading so that trading knowledge, skills, and abilities are ac - quired, developed, and consolidated. In Part 3 of this book, we cover a proven ap - proach for personal development and improvement as a trader, and in Chapter 11 we examine how expertise and mastery is developed through the psychological science of deliberate practice and how to specifi cally apply it to your trainin g and expert skill ac q uisition and develo p ment. ■ Note 1. Shane Frederick, “Cognitive Refl ection and Decision Making,” Journal of Economic Perspectives 19 ( 2005 ) : 2 7 . - ~---------- 7 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 35 If you picked up this book and are reading it, it is very likely that you have ex- perienced strong emotions in your trading and have struggled with them. It is also very likely that these strong feelings have caused erratic trading actions. You have had losses or missed profi ts because you acted too soon, acted inap- propriately, or failed to act at all. Strong emotions have affected your trading. You may have put extra effort into your trading to try to overcome this prob- lem, learning more about technical analysis and maybe trading psychology. But that doesn’t seem to matter. When you get into a trade you almost immediately feel your nerves rise. Your attention rivets onto price action; you feel like you are living or dying on every tick. Soon, your heart is racing and your muscles become tense. Your discomfort is palpable. If your trade is in a little profi t, you r mind is urging you to get out now—at least you will have a profi t, it says. Cer- tainly, you cannot have a loss. You might struggle a little longer and try to hold onto the trade, but your mind becomes insistent: “Get out NOW!” And, you do. You feel relief. Whew! All that tension is over. And, you made a small profi t. The relief feels good. Then, a few minutes later the market takes off and runs several points in your direction. A sizable profi t was forfeited because you were mentally and emotionally hijacked. How many times have you repeated this or similar experiences? You promise yourself you will chan ge but fail to follow through w ith your p lan. Fear, or anot her stron g emot ion, gets t he better o f you—every t ime. You wonder if there is a better way. Yes, there is a better way. The fi rst step in learning how to deal with and overcome the erratic trading behavior caused by strong emotions is to help you bring clarity to your experiences so that you understand them on a deeper level than you do now. Let’s get started. Strong Emotion s in Trading CHAPTER 2 36 T RADE MINDF U LLY C opin g wit h f ear an d anxiety is a si g ni fi cant c h a ll en g e f or many tra d ers. Even among those traders who say they don’t struggle too much with fear or anxiety when tradin g , virtually everyone is interested in developin g more confi dence and re d ucin g t h e tra d in g ‐re l ate d f ear an d stress t h at t h ey d o experience. Stocks, Futures and Options Magazine polled its retail tradin g readership on emotions in tradin g . The ma g azine asked a strai g htforward question: Which emotion is the toug h est f or you to contro l w h en tra d ing? It l iste d f ear, gree d , an d h ope as possi bl e responses. As Figure 2.1 s h ows, t h e response was revea l ing. Tra d ers overw h e l ming l y endorsed fear as the most di ffi cult emotion to control when tradin g . It was cited a b out twice as f requent l y as eit h er gree d or h ope. Fear is a very common an d f re -",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:45.718032"
}