{
  "id": "51d787d6298f",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 151,
  "content": "calls long 10 ABC 45 calls / short 16 XYZ futures long 10 ABC 50 calls / long 20 XYZ 100 puts short 30 ABC 45 puts / long 40 XYZ 95 puts long 35 ABC 55 calls / short 20 XYZ 95 calls 334 Chapter 16 Each of these spreads is essentially balanced, because our $delta position in ABC options is exactly offset by an opposing $delta position in XYZ. Since we are always long ABC deltas and short XYZ deltas, for small movements in the underlying contracts, each spread will be profitable as long as ABC is stronger than XYZ. Why would a trader consider taking a position in options rather than the underlying instrument? When a trader considers an option’s theoretical value, in a sense he is comparing the option’s value to the value of the underlying instrument. That is why the correct use of an option’s theoretical value requires us to establish a hedge against the underlying instrument. If options are underpriced compared to theoretical value, a trader will want to buy options rather than take an equivalent position in the underlying instrument; if options are overpriced compared to theoretical value, a trader will want to sell options rather than take an equivalent position in the underlying instrument. From an option trader’s point of view, the determination of whether options are overpriced or underpriced depends on one’s opinion of volatility. If implied volatility is low compared to a trader’s forecast, options are underpriced; if implied volatility is high, options are overpriced. An option trader will prefer to take a position in the option market rather than in the underlying instrument if he believes that implied volatility is too low or too high. In our example, if a trader is in agreement with the implied volatility in both ABC and XYZ options, there is nothing to be gained by taking an option position rather than a position in the underlying instrument. Suppose, however, that implied volatility in ABC options is 22% but the trader believes that 24% is a more reasonable volatility. Now options are underpriced. If the trader wants to take a long position in ABC as part of his spread, he will be better off doing so by purchasing ABC calls. He will not only have his intermarket spread, but will, at the same time, be creating a position with a positive theoretical edge. On the other hand, if the trader believes that 20% is a reasonable volatility for ABC options, but implied volatility is 22%, the trader will be better off selling ABC puts. The sale of overpriced puts will create a long position in the ABC market while also creating a positive theoretical edge. A trader can take the same approach in the XYZ market. If he wants to take a short position in XYZ as part of his intermarket spread, and believes implied volatility in XYZ options is fairly priced, he can simply sell the underlying XYZ contract. Alternatively, if he believes implied volatility is too low, he can buy puts; if he believes implied volatility is too high, he can sell calls. What types of markets lend themselves to intermarket spreading? Since a trader who enters into an intermarket spread makes the assumption that there is a relationship between the markets involved, the important question for most traders is the closeness of that relationship. A trader is much more likely to construct an intermarket spread in markets which have similar characteristics, or where the markets are driven by the same forces, than in those where no apparent similarity exists. While a trader might find it difficult to identify a relationship between corn and Deutschemarks, he might very well find a relationship between corn and soybeans, or between Deutschemarks and Swiss Francs. In the same way, he might not find a relationship between gold and the stock of General Motors Corp., but he might find a relationship between gold and silver, or Intermarket Spreading 335 between General Motors Corp. stock and Ford Motor Co. stock. Clearly, some instru- ments are more closely related than others. The closer the relationship, the more such instruments lend themselves to intermarket spreading. AN INTERMARKET HEDGE Because intermarket spreading is most common in markets with close relationships, it is not surprising that among the most common markets for intermarket spreading are those where one or more products are derived from some other product. For example, since both heating oil and gasoline are derived from crude oil one would expect price movements in these three markets to be closely correlated. If demand rises for heating oil or gasoline, forcing up the price of these products, then the price of crude oil is also likely to rise. Similarly, if the supply of crude oil is disrupted and prices consequently rise, then the price of gasoline and heating oil is also likely to rise. Refiners who purchase crude oil and refine it into gasoline and heating oil are often sensitive to the value of crack spreads, the spread between the price of crude oil and its derivative products. For example, a refiner who purchases crude oil and refines it into gasoline is concerned that the price of crude oil will rise and that the price of gasoline will fall. If crude oil is at $19.00 per barrel and gasoline at $.5400 per gallon, the price of a simple crude oil/gasoline crack spread is:! ($.54 x 42} - $19.00 = $3.68 per barrel If the refiner is satisfied with the $3.68 profit margin, he might protect his position by purchasing crude oil futures at $19.00 and selling an equal number of gasoline futures at $.5.400.? If, however, he has an opinion on the volatility of either crude oil or gasoline, and this opinion differs from the implied volatility in the option market, he can take either position in options. If he feels that implied volatility in crude oil is unusually low (high), he can take his long position by purchasing calls",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.445606"
}