{
  "id": "72b7b0fd1866",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 20,
  "content": "the credits and debits will exactly cancel out. The calculation of a forward price depends on the characteristics of the contract as well as market conditions. In the case of a stock, the considerations are the price of the 3. Thetrader can also earn interest on the dividend from the time he receives it until the end of the holding period. Since this will usually be a very small amount in relation to the other factors, we will ignore it. Introduction to Theoretical Pricing Models 43 stock, the length of the holding period, interest rates, and dividends. In the case of a futures contract, the situation is much simpler. A futures contract requires no initial cash outlay, since it is subject to futures-type settlement. Moreover, a futures contract does not pay dividends. This means that the forward price of a futures contract in an arbitrage-free market is simply the current price of the futures contract. If a trader buys a futures contract at $100, the break even price for the contract at the end of the holding period is $100. Going back to our very simple pricing model, we might make the assumption that the underlying market is arbitrage-free,4 that there is no money to be made from trading the underlying contract. The expected return must then be equal to the difference between the current price of the underlying market and its forward price. In the case of stock, the expected return will be carrying costs less dividends. In the case of futures, the expected return will be zero. Even if we assume an arbitrage-free market in the underlying, with appropriate probabilities associated with each price outcome, we still have one major problem. In our simplified model there were only five possible price outcomes, while in the real world there are an infinite number of possibilities. To enable our model to more closely approximate real world conditions we will have to construct a probability line with every possible price outcome and its associated probability. This may seem an impossible task, but it is the basis for all theoretical pricing models. We can now summarize the necessary steps in developing a model: 1. Propose a series of possible prices at expiration for the underlying contract 2. Assign an appropriate probability to each possible price 3. Maintain an arbitrage-free underlying market 4 From the prices and probabilities in steps 1, 2, and 3, calculate the expected return for the option 5. From the option’s expected return, deduct the carrying cost If we can accomplish all this, we will finally have a theoretical value from which we can begin to trade. Prior to 1973, evaluation of options required the solution of complex mathematical equations. Since such methods were slow and tedious, a trader who tried to use them quickly found that profit opportunities disappeared faster than the evaluation methods could identify them. In 1973, concurrent with the opening of the Chicago Board Options Exchange, Fischer Black and Myron Scholes introduced the first practical theoretical pricing model for options. The Black-Scholes Model, with its relatively simple arithmetic and limited number of inputs, most of which were easily observable, proved an ideal tool for traders in the newly opened U.S. option market. Although other Models have since been introduced to overcome some of its original deficiencies, the Black-Scholes Model remains the most widely used of all option pricing models. 4. We need not necessarily assume an arbitrage free underlying market. But we shall see that this is an important assumption in most theoretical pricing models. 44 Chapter 3 In its original form, the Black-Scholes Model was intended to evaluate European options (no early exercise permitted) on non-dividend paying stocks. Shortly after its introduction, realizing that most stocks do pay dividends, Black and Scholes added a dividend component. In 1976, Fischer Black made slight modifications to the model to allow for the evaluation of options on futures contracts. And in 1983, Mark Garman and Steven Kohlhagen made several other modifications to allow for the evaluation of options on foreign currencies.° The futures version and the foreign currency version are known officially as the Black Model and the Garman-Kohlhagen Model, respectively. But the evaluation method in each version, whether the original Black-Scholes Model for stock options, the Black Model for futures options, or the Garman-Kohihagen Model for foreign currency options, is so similar that they have all come to be known as simply the Black-Scholes Model. The various forms of the model differ primarily in how they calculate the forward price of the underlying contract, and an option trader will simply choose the form appropriate to the underlying instrument. The great majority of options currently traded are American options, carrying with them the right of early exercise. For this reason, it may seem that the Black-Scholes model, with its assumption of no early exercise, is poorly suited for use in most markets. However, the Black-Scholes Model has proven so easy to use that many traders do not believe the more accurate values derived from an American option pricing model, which allows for the possibility of early exercise, is worth the additional effort. In some markets, particularly futures options markets, the additional early exercise value is so small that there is virtually no difference between values obtained from the Black- Scholes model and values obtained from an American pricing model. Due to its widespread use and its importance in the development of other pricing models, we will for the moment restrict ourselves to a discussion of the Black-Scholes model and its various forms. In later chapters we will consider the question of early exercise. We will also look at alternative methods for pricing options when we question some of the basic assumptions in the Black-Scholes Model. The reasoning which led to the development of the Black-Scholes Model depends on the five steps we listed earlier in this chapter when we proposed a simple method for evaluating options. Black and Scholes worked originally with call values, but put values",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "market_structure",
    "crypto",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.425301"
}