{
  "id": "b765e02cf45c",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 37,
  "content": "if a level is going to hold, and price did eventually break through at C. Study these patterns well, at ﬁrst with the aid of a moving average as in Figures 4.12 and 4.13, and then without. If a support or resistance will hold or fail, price rejection will usually tell the tale. GS - 1 S min Goldman Sachs Group 167.00 166.00 165.00 164.00 163.00 162.00 161.00 160.00 159.00 158.00 8/28 8131 Sep 12:00 912 12:00 9/3 12:00 9/4 12:00 9/8 12:00 55 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing On Trading Ranges 113 FIGURE 4.13 No Price Rejection at Resistance Consolidation leads to a break of the level. Last, it is worth mentioning that there is a third possibility for price action around po- tential support and resistance areas, which is no action at all. The market may approach a level and trade through it with no pause or unusual price action; the anticipated level simply was not there, and, if we have not planned for the possibility that the level simply does not exist, it is easy to be taken by surprise. Plan for every possibility and actively work to reduce potential surprises that can unbalance you and lead to poor decisions. TRADING RANGES AS FUNCTIONAL STRUCTURES Markets tend to alternate between trending periods and trading ranges. In trends, prices continue moving in the same direction. Because these trends are driven by an imbalance of buying or selling pressure, price movements are somewhat persistent and more pre- dictable in terms of direction, magnitude, and timing. Trading ranges are directionless areas where the market is in relative equilibrium. In these spots, price action is much GS - 1 S min Goldman Sachs Group 180.00 178.00 176.00 174.00 172.00 170.00 168.00 166.00 164.00 9/8 12:00 9/9 12:00 9/10 9/11 9/14 9/15 9/16 9/17 56 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing On Trading Ranges 115 FIGURE 4.14 The Weekly Chart (Right) Clariﬁes an Otherwise Unreadable Situation on the Daily Chart (Left) Figure 4.15 shows the S&P 500 Cash index again, this time at the highs in early 2010. The weekly was overextended, and daily price action suggested a certain lack of conviction at the highs. Again, to show that this isn’t hindsight analysis, here is what I wrote in my morning report on April 26, 2010, the point marked A on the daily chart: “The market [may be] vulnerable so that when a shock ﬁnally does hit, the effect may be out of all reasonable proportion. This is why we are focusing attention on ﬁnding a good spot to enter a countertrend trade. ... Today, we have a potential trade setup in the S&P 500 index. If the index closes below the previous YTD high ... we will be short.” This turned out to be the exact high of the market for many months, and we were fortunate to cover the last of that short a few days later, near the lows on the day of the Flash Crash. It is also worth mentioning that there are many cases in which it is not so simple to make a directional call. Though we have just looked at several good examples, realize that they are best-case situations. Sometimes it is not possible to make any kind of di- rectional call, and traders have no justiﬁcation for taking a position. In these cases it is appropriate to stay ﬂat (to have no position) and to wait for further clariﬁcation before making a trade. 1,400.00 1,300.00 1,200.00 1,100.00 '·,,,_ 1,000.00 800.00 Oct Nov Dec Oct '09 57 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing 116 MARKET STRUCTURE FIGURE 4.15 A Potential Reversal on the Weekly Gives a Downward Bias to the Trading Range on the Daily Volatility Conditions in Trading Ranges I believe it is counterproductive to catalog too many variations of patterns within trading ranges, due to the random nature of price action within these ranges. The Edwards and Magee crowd will recognize more than a dozen variations of trading ranges, but, to me, they are all the same. They all fulﬁll one of two functions in the higher time frame, and they are all noisy patterns roughly bounded by support and resistance. Why clutter a sim- ple model with unnecessary variations, qualiﬁcations, and conditions? Visually, the most important factor in distinguishing between different types of ranges is what is happening with the edges of the range. Is the range contained by parallel lines, are the edges con- verging, or are they expanding? Each of these may have some subtle differences, with some effect on the expected resolution of the patterns. Parallel Ranges: The Box The simplest range is one that trades between parallel prices in a box formation; volatility is relatively constant for the duration of the range. On the lower time frame, we will see trends (it is a little-known fact that many of the best",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.701108"
}