{
  "id": "34035b9cb92d",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 119,
  "content": "market moves adversely, the hedger is insulated from any loss beyond the exercise price. The difference between the exercise price and the current price of the underlying is analogous to the deductible portion of an insurance policy. And the price of the option is analogous to the premium which one has to pay for the insurance policy. For example, suppose an American firm expects to take delivery of DM 1,000,000 worth of German goods in six months. If the contract requires payment in Deutsche- marks at the time of delivery, the American firm has automatically acquired a short position in Deutschemarks against U.S. dollars. If the Deutschemark rises against the dollar, the goods will cost more in dollars; if the Deutschemark falls against the dollar, the goods will cost less. If the Deutschemark is currently trading at .60 (60¢ per DM) and remains there for the next six months, the cost to the American firm will be $600,000. If, however, at delivery the Deutschemark has risen to .70 {70¢ per dollar), the cost to the American firm will be $700,000. The American firm can offset the risk it has acquired by purchasing a call option on Deutschemarks, for example a .64 call. If the firm wants an exact hedge, the underlying contract will be DM 1,000,000, and the option will have an expiration date correspond- ing to the date of delivery of the goods. If the value of the Deutschemark begins to rise against the U.S. dollar, the firm will have to pay a higher price than expected when it takes delivery of the goods in six months. But the price it will have to pay for Deutschemarks can never be greater than .64, If the price of Deutschemarks is greater than .64 at expiration, the firm will simply exercise its call, effectively purchasing Deutschemarks at .64. If the price of Deutschemarks is less than .64 at expiration, the firm will let the option expire worthless since it will be cheaper to purchase Deutsche- marks in the open market. A hedger who chooses to purchase a call to protect a short position, or a put to protect a long position, has risk limited by the exercise price of the option. At the same time, the hedger still maintains open-ended profit potential. If the underlying market moves in the hedger’s favor, he can let the option expire and take advantage of the enhanced value of his position in the open market. If, in our example, the Deutschemark were to fall to .55 at the time of delivery, the firm would simply let the .64 call expire unexercised. At the same time, the firm would purchase DM 1,000,000 for $550,000, resulting in an unexpected windfall of $150,000. There is a cost involved in buying insurance in the form of a protective call or put, namely the price of the option. The cost of the insurance is commensurate with the Hedging with Options 259 amount of protection afforded by the option. If the price of a six-month .64 call is .0075 (3/4¢), the firm will pay an extra $7,500 (.0075 x 1,000,000) no matter what happens. A call option with a higher exercise price will cost less, but it also offers less protection in the form of an additional deductible amount. If the firm chooses to purchase a .66 call trading at .0025 ('/4¢), the cost for this insurance will only be $2,500 (.0025 x 1,000,000). But the firm will have to bear any loss up to a Deutschemark price of .66. Only above .66 is the firm fully protected. In the same way, a lower exercise price call will offer additional protection, but at a higher price. A .62 call will protect the firm against any rise above .62, but if the price of the call is .015 (1!¢), the purchase of this protection will add an additional $15,000 (.015 x 1,000,000) to the final costs. The cost of purchasing a protective option and the insurance afforded by the strategy is shown in Figures 13-1 (protective call) and 13-2 (protective put). Since each strategy combines an underlying position with an option position, it follows from Chapter 11 that the resulting protected position is a synthetic option: short underlying + long call = long put long underlying + long put = long call Ahedger who buys a call to protect a short underlying position has effectively purchased a put at the same exercise price. A hedger who buys a put to protect a long underlying position has effectively purchased a call. In our example, if the firm purchases a .64 call to protect a short Deutschemark position, the result is identical to owning a .64 put. Figure 13-1: A Protective Call ‘v short an underlying position va buy a protective call a a combined position oN 260 Chapter 13 Figure 13-2: A Protective Put “ “ ~<—-_ > < , ’ buy a protective put 4 . 4 oe combined position “4 Which protective option should a hedger buy? That depends on the amount of risk the hedger is willing to bear, something which each market participant must determine individually. One thing is certain. There will always be a cost associated with the purchase of a protective option. If the insurance afforded by the option enables the hedger to protect his financial position, the cost may be worthwhile. COVERED WRITES While the purchase of a protective option offers a limited and known risk, a hedger might be willing to accept more risk in return for some other advantage. Instead of purchasing an option to protect an existing position, a hedger might consider selling, or writing, an option against the position. This strategy does not offer the limited risk afforded by the purchase of a protective option but, in its favor, the strategy results in a cash credit rather than a debit. This credit offers some, though not unlimited, protection against an adverse move in the underlying market. Consider a fund manager whose portfolio",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.440491"
}