{
  "id": "babbf4820a1f",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 182,
  "content": "and offers. If the market maker finds himself with a large positive gamma position and wants to sell options to cut back on the risk associated with the position, he can shift the skew slightly downward. This will have the effect of lowering his bids and offers on all options. If the market maker finds himself short a large number of out-of-the-money calls or puts, he can adjust his skew by raising the wings. This will have the effect of raising his bids and offers on out-of-the-money options. The Bund options in our example form what is probably the most common skew shape, a smile which is approximately symmetrical. But this is not always the case. Skews can be symmetrical or asymmetrical, and they can reflect inflated or defiated implied volatilities across exercise prices, depending on how the marketplace sees the possibility, and consequences, of various moves in the underlying market. In addition, in stock index markets, because it is not always possible to take advantage of a mispriced arbitrage relationship (see Chapter 15), calls and puts with the same exercise prices do not necessarily trade at the same implied volatility. For this reason, many traders in stock index markets prefer to evaluate call and put skews separately. As an example, Figures 18-11a and 18-11b represent the implied volatilities of March 1993 OEX calls and puts with different amounts of time remaining to expira- Models and the Real Wortd 415 Figure 18-11a: OEX March 1993 Calls Implied Volatility (%) Exercise Price 307 254 5 weeks to expiration OEX = 406.26 + week to expiration 20-7 OEX= w1e67T 15 > 10-7 oe + 5 T as Tt T 360 370 3B0 390 400 410 420 430 Figure 18-11b: OEX March 1993 Puts Implied Volatility (%) 30>-—_ \\ | / 1 i} | i aan i i tow. tS. weeks to expiration 2s ~ + OEX = 406.26 (406.78) | 7 1 | i) n ! i | | i i i 1 | - | 1 week to expiration Se | ! aa | OEX = 412.67 (412.89) 1 = i} Exercise Price | pL 410 ee ne eo 4 1 an OEX = 396.64 (097.28) ! | ' \\ 5 | + + 360 370 3B0 390 400 410 420 430 416 Chapter 18 tion.!2 Note the extreme inflation of downside exercise prices, both for calls and puts. While it may not be possible to determine exactly what is causing the skew to have this particular shape (it may indicate that the marketplace believes stock markets go down faster than they go up—as witness October 1987—r it may reflect the fact that stock index options are often used to hedge long stock portfolios), the marketplace seems to be giving greater relative value to lower exercise prices. A trader who wanted to use the marketplace’s relative evaluation might try to integrate the skew into his theoretical pricing model. As before, we might try to generalize the skew by expressing each exercise price in terms of a logarithmic relationship to the underlying index price. Stock index prices, like stock prices, are assumed to be lognormally distributed around the forward price of the index, i.e., the current index price plus carrying costs less dividends. It therefore makes sense to express the exercise price in relation to the forward price rather than to the index price: in(exercise price/forward price) / Vtime This has been done in Figures 18-1 1c and 18-11d. (The forward price of the OEX is in parenthesis.) While there are clearly some differences between volatility skews in Figures 18-11c and 18-11d, there is considerably more consistency than one would expect from Figures 18-{1a and 18-11b. If a trader wanted to find functions, one for calls and one for puts, by which the skews could be expressed, he could use these functions to analyze a position under a wide variety of market conditions. It is only in the last several years that traders have begun to appreciate the importance of volatility skews, both as an evaluation tool and as a risk management consideration. This section is intended not as a solution to all the problems that traders encounter in analyzing and using volatility skews, but as an introduction to how traders approach the problem. Each trader as he gains more experience must decide how best to deal with the volatility skew, given the characteristics of the market in which he is dealing, as well as his ultimate goal in that market. A FINAL THOUGHT Because the use of a theoretical pricing model requires a trader to make so many different decisions, both with respect to the inputs into the model and the degree to which the assumptions on which the model is based are likely to be accurate, the new option trader may feel that making the right decisions is simply a matter of luck. While luck undoubtedly plays a role in the short run, in the long run those traders who are willing to put in the effort required to understand how models work always seem to come out ahead. Experienced traders know that using a model, with all its problems, is still the best way to evaluate options and manage risk. 12. Because of the possibility of early exercise, the Cox-Ross-Rubenstein model was used to calculate OEX implied volatilities. Models and the Real World 417 Figure 18-11¢c: OEX March 1993 Calls 220 7 \\ ; 5 weeks t6 expiration \\ \\ OEX = 408.26 (406.79) | 1 ae nn 200 v 1 | \\ ; i | \\ | = \\ ! | 2 180+—~ t— 4 — re} \\ | E | o \\ | c= 11 weeks to expiration ® 1607 — Se soe ee eer Ze) Ss \\ | ° \\ | | | = | | = 140+ ation iI | OEX = 412.67 (412.89) $ oe] 2 = 120 E 100 In{ex. price/forward price)/sqrt(time) Figure 18-11d: OEX March 1993 Puts 220 in 200-+- | >",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.450314"
}