{
  "id": "e05d21bde4a3",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 45,
  "content": "economic needs rather than speculations. One of the most intuitive commodity seasonal trades is the gasoline future trade: Simply buy the gasoline future contract that expires in May near the middle of April, and sell it by the end of April. This trade has been profitable for 19 of the last 21 years, as of 2015, the last 9 of which are out of sample (see the sidebar for details). It appears that one can always depend on approaching sum- mer driving seasons in North America to drive up gasoline futures prices in the spring. topN <- round(length(prevYearSortIdx)/10) # buy stocks with top decile of returns, and sell stocks of bot- tom decile positions[m-1, prevYearSortIdx[1:topN]] <- -1 positions[m-1, prevYearSortIdx[(length(prevYearSort Idx)-topN+1):length(prevYearSortIdx)]] <- 1 } ret <- rowSums(backshift(1, positions)*monret, na.rm = TRUE)/rowSums(abs(backshift(1, positions)), na.rm=TRUE) ret <- ret[-(1:13)] avgannret <- 12*mean(ret, na.rm = TRUE) avgannret # -0.01139674 sharpe <- sqrt(12)*mean(ret, na.rm = TRUE)/sd(ret, na.rm=TRUE) sharpe # -0.1095098 A SEASONAL TRADE IN GASOLINE FUTURES Whenever the summer driving season comes up, it should not surprise us that gasoline futures prices will be rising seasonally. The only question for the trader is: which month contract to buy, and to hold for what period? After scanning the literature, the best trade I have found so far is one where we buy one May contract of RB (the unleaded gasoline futures trading on the New York Chan800064_c07.indd 183 6/7/2021 7:16:59 AM 184 QUANTITATIVE TRADING Mercantile Exchange [NYMEX]) at the close of April 13 (or the following trading day if it is a holiday), and sell it at the close of April 25 (or the previous trading day if it is a holiday). Historically, we would have realized a profit every year since 1995. Here is the annual profit and loss (P&L) and maximum drawdown (measured from day 1, the entry point) experienced by this position (the 2007– 2015 numbers are out-of-sample results): Year P&L in $ Maximum Drawdown in $ 1995 1,037 0 1996 1,638 −2,226 1997 227 −664 1998 118 0 1999 197 −588 2000 735 −1,198 2001 1,562 −304 2002 315 −935 2003 1,449 −2,300 2004 361 −1,819 2005 6,985 −830 2006 890 −4,150 2007* 4,322 −5,279 2008* 9,740 −1,156 2009* −890 −4,167 2010* 1,840 −3,251 2011* 3,381 −2,298 2012* −7,997 −8,742 2013* 2,276 −2,573 2014* 1,541 −814 2015* 8,539 −1,753 * Out-of-sample results. For those who desire less risk, you can buy the mini gasoline futures QU at NYMEX, which trade at half the size of RB, though it is illiquid. This research has been inspired by the monthly seasonal trades published by Paul Kavanaugh who published at PFGBest. Even though the trades were profitable, the futures broker PFGBest was shut down in 2012 since it embez- zled client money. You can read up on this and other seasonal futures patterns in Fielden (2006) or Toepke (2004.) Chan800064_c07.indd 184 6/7/2021 7:16:59 AM Special Topics in Quantitative Trading 183 In contrast to equity seasonal strategies, commodity futures’ seasonal strategies are alive and well. That is perhaps because sea- sonal demand for certain commodities is driven by “real” economic needs rather than speculations. One of the most intuitive commodity seasonal trades is the gasoline future trade: Simply buy the gasoline future contract that expires in May near the middle of April, and sell it by the end of April. This trade has been profitable for 19 of the last 21 years, as of 2015, the last 9 of which are out of sample (see the sidebar for details). It appears that one can always depend on approaching sum- mer driving seasons in North America to drive up gasoline futures prices in the spring. topN <- round(length(prevYearSortIdx)/10) # buy stocks with top decile of returns, and sell stocks of bot- tom decile positions[m-1, prevYearSortIdx[1:topN]] <- -1 positions[m-1, prevYearSortIdx[(length(prevYearSort Idx)-topN+1):length(prevYearSortIdx)]] <- 1 } ret <- rowSums(backshift(1, positions)*monret, na.rm = TRUE)/rowSums(abs(backshift(1, positions)), na.rm=TRUE) ret <- ret[-(1:13)] avgannret <- 12*mean(ret, na.rm = TRUE) avgannret # -0.01139674 sharpe <- sqrt(12)*mean(ret, na.rm = TRUE)/sd(ret, na.rm=TRUE) sharpe # -0.1095098 A SEASONAL TRADE IN GASOLINE FUTURES Whenever the summer driving season comes up, it should not surprise us that gasoline futures prices will be rising seasonally. The only question for the trader is: which month contract to buy, and to hold for what period? After scanning the literature, the best trade I have found so far is one where we buy one May contract of RB (the unleaded gasoline futures trading on the New York Chan800064_c07.indd 183 6/7/2021 7:16:59 AM 99 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 185 Besides demand for gasoline, natural gas demand also goes up as summer approaches due to increasing demand from power generators to provide electricity for air conditioning. Hence, another commodity seasonal trade that has been profitable for 13 consecutive years as of this writing is the natural gas trade: Buy the natural gas futures contract that expires in June near the end of February, and sell it by the middle of April. (Again, see sidebar for details.) A SEASONAL TRADE IN NATURAL GAS FUTURES The summer season is also when natural gas demand goes up due to the increasing demand from power generators to provide electricity for air con- ditioning. This suggests a seasonal trade in natural gas where we long a June contract of NYMEX natural gas futures (Symbol: NG) at the close of February 25 (or the following trading day if it is a holiday), and exit this position on April 15 (or the previous trading day if it is a holiday). This trade has been profitable for 14 consecutive years at of this writing. Here is the annual P&L and maximum drawdown of this trade. (The 2007–2015 numbers are out-of- sample",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:43.611095"
}