{
  "id": "d920cff9cf1c",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 116,
  "content": "rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing 436 GLOSSARY overbought/oversold indicators A class of technical indicators that try to identify mar- kets that have moved too far in one direction and are poised for reversal. These indica- tors could provide entries for mean-reversion trades, but careful testing is needed. pairs strategies A term usually reserved for spread trades between different stocks. See spread trading. paper trading A tool sometimes used by developing traders that involves placing trades in a simulated environment. (The term does not imply literal use of pencil and paper.) Paper trading has limited utility because it cannot replicate the psychological challenges of having money at risk. Parabolic SAR A trading system originally developed by Welles Wilder that was designed to always be in the market, reversing long or short according to signals generated from price movements. (SAR stands for stop and reverse.) path-dependent Refers to a scenario that can have different values or outcomes depend- ing on decisions or outcomes at different steps in the process. pay the offer A term that means to buy an asset directly at the offered price, without attempting to bid for a lower (better) price. Market orders should equivalently pay the offer, but there is the danger of large and uncontrolled slippage. per-unit risk The difference between the entry and exit price on a trade, or the risk to be taken on one unit (share, contract, etc.) of the instrument. pivot high or pivot low See ﬁrst-order pivot. pivot points See ﬁrst-order pivot. point and ﬁgure charts A charting technique, mostly obsolete, that charts reversals from pivot points. The x-axis is not scaled for any ﬁxed unit; rather, it moves forward when the speciﬁed reversal from the pivot has occurred. This was a technique historically used by ﬂoor traders that still ﬁnds some applications in computerized trading. population In statistical testing, usually considered to be the set of all possible events or items with the characteristic being studied. The population is usually unseen and un- knowable, so the central problem of inferential statistics is to try to understand the char- acteristics of the population based on samples taken from that population. positive expectancy See expectancy or expected value . A positive expected value sug- gests that a trader is likely to make a proﬁt over a large enough sample size of trades, provided there is good execution and the expected value is larger than transaction costs. post hoc From the Latin term meaning “after this.” Refers to events usually deﬁned after the analysis or experiment is concluded. preceding trend leg In the impulse/consolidation/impulse framework, this is the initial trend leg that sets up the consolidation. price action A term that refers to a formalized understanding of how prices move. Price action is usually most visible on lower time frames, and price action creates market struc- ture. In the terminology of a certain subset of retail traders, “price action trading” refers to trading without any indicators or moving averages, but this is mostly a meaningless distinction. 186 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing Glossary 437 price rejection The characteristic pattern of support and resistance holding: price makes an immediate (in the context of the time frame) and sharp move away from the level. The absence of price rejection suggests a higher probability of the level breaking. proﬁt target Some technical systems set proﬁt targets for part or all of the position. In general, traders using systems like this should develop the discipline of entering their proﬁt-taking orders as soon as the trade is initiated. proper pyramids Pyramids that start with the largest number of units they will ever have at a level. These strategies can usually endure volatility at the end of a trend much better than reverse pyramids. pullback A general term for a consolidation pattern in a trend. Many of the traditional distinctions of technical analysis (ﬂag, pennant, box, etc.) are not meaningful, as all pull- back patterns can be traded according to similar rules. pyramiding plans Plans for adding additional units to a trade once the trade has moved a speciﬁc distance into proﬁt. random walk hypothesis (RWH) A theory that says that asset prices can be described by random walks. Various forms and dimensions of random walks exist. In practice, the RWH seems to hold reasonably well for some assets and some time frames. range The high-low of a bar or trading session. range expansion A term to indicate more directional movement in markets. A market undergoing a range expansion phase will probably trend in one direction, the range of bars will probably expand, and measures of volatility will increase on some time frames. real trend line (RTL) A technique for drawing a trend line that marks the important inﬂections in trends, usually best-suited to application on longer time frames. relative strength A term used to describe relative price movements between markets. Skilled traders and analysts can ﬁnd clues to institutional conviction and large-scale money ﬂows in relative strength. Relative Strength Index (RSI) A technical indicator that seeks to identify overbought or oversold markets by measuring the relative distribution of up and down closes. Note that it does not measure relative strength, nor is it an index. resistance A term attached to price areas that may provide a barrier to advancing prices, or areas where sufﬁcient supply may exist to stop prices. resistive force See motive force. retracement Another general term for consolidation, pullback, or a",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.713585"
}