{
  "id": "44f72b5d1fc3",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 3,
  "content": "e MSCI European Monetary Union Index. She saw the weekly Bullish En g ulfi n g Candle pattern in late June and went l ong. Y ou can see w h at s h e h a d seen in Figure 1.1 . S h e anticipate d a continua - tion of the weekly uptrend, which looked stron g to her. Zoe noted that every bullish en g ulfi n g pattern in this uptrend worked well. Thus, she expected a winnin g trade FIGURE 1.1 Zoe ’ s W ee kl y C h art Depicting an Uptren d Source: Tra d eStation T ec h no l ogies, Inc. EZU Weekly Chart 42.00 40.00 38.00 36.00 34.00 32.00 30.00 28.00 Apr Jul Oct 201 1 Apr Jul Bullish Engulfing Pattern r-- 1 1111 111 ii i11' 1 1( 1 1, / 3 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 15TRADERS’ MENTAL BLIND SPOTS that would take price and her tradin g account to new hi g hs. Shortly after takin g t h e tra d e, h owever, s h e b ecame d espon d ent. A l most imme d iate ly , t h e mar k et f e ll below her stop and she suff ered a loss. Zoe couldn’t understand why this happened. “Everyt h in g , ” s h e sai d , “loo k e d per f ect. ” But everythin g wasn’t perfect. Steppin g up a time frame to the monthly chart, we see that this hi g her time period had recently produced a Dark Cloud Cover tha t cause d t h is mar k et to f a ll b e l ow t h e 2009 h ig h just a f ew wee k s b e f ore s h e entere d h er tra d e. Figure 1.2 d epicts t h is vita l mont hl y d ata. Zoe ’s min d d i d n ’t ta k e t h is in - formation into consideration. Zoe f ocuse d on l y on t h e wee kl y c h art wit h its b u ll is h can dl e pattern. T o h er min d , t h e can dl estic k unquestiona bl y appeare d as anot h er strong signa l in t h e uptren d . Note t h at Zoe c h ose to answer t h e easy question: Is t h is a b u ll is h engu lfi ng pattern? O f course, the answer is yes. The more di ffi cult and more important question—wha t FIGURE 1.2 Hig h er Time Frame Dar k C l ou d Cover Pattern Source: Tra d eStation T ec h no l ogies, Inc. EZU Monthly Chart 65.00 60.00 55.00 50.00 45.00 40.00 35.00 30.00 25.00 20.00 Jul 2007 Jul 2008 Jul 2009 Jul 2010 Jul 201 1 Dark Cloud Cover 2009 High 4 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 21TRADERS’ MENTAL BLIND SPOTS FIGURE 1.3 Higher Time Frames Show W eakness in 10‐Y ear U.S. Treasury Futures Source: T radeStation T echnologies, Inc. 22T RADE MINDF U LLY this level, at least for the moment, and the market was showing some strength tha t morning. At D h e to ld h imse lf , “I f t h e mar k et b egins to ra ll y f rom h ere, I wi ll go l ong. ” It d i d start to ra ll y an d h e went l ong (at t h e arrow). T h e mar k et t h en move d briskly higher. His tra d e was a pro f ita bl e one, an d Nat h an was h appy . But t h en h e ran into trou bl e. In h is min d , t h e mar k et h a d a strong response f rom h o ld ing t h e l ows a t A an d B. “C l ear l y, t h ere was aggressive b uying on t h e ra ll y [ f rom D to E]. T h e mar k et is very strong, ” h e t h oug h t. Nat h an d eci d e d to h o ld t h e tra d e. But h o ld- in g the lon g trade was a poor decision. Fi g ure 1.5 shows what happened. The pro f it ma d e on h is l on g tra d e was wipe d out as t h e mar k et quic kl y erase d t h e mornin g rally . How did this happen? Nathan explained it later that evenin g . “I was thinkin g a t t h e time t h at it wou ld b e premature to exit suc h a g oo d tra d e. I t h ou gh t, ‘H ey, I ’m in a g reat trade and I don’t want to cut a winnin g trade short. ’ I was feelin g very g ood about my trade and I thou g",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "risk_management",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:45.717638"
}