{
  "id": "654a6514b1fa",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 48,
  "content": "underlying position—are all essentially the same. How a trader interprets a delta position depends primarily on his trading strategy. For example, suppose a trader has a delta position of +500. If the trader intends to maintain a delta neutral position, he must sell five underlying contracts (the hedge ratio interpretation). However, if he believes the market will rise and wants to maintain his delta position, he knows that in theory he is long five underlying contracts (the equivalent underlying position interpretation). And finally, if he does maintain his delta position of +500, the value of his position will change at five times the rate, or 500%, of the underlying market (the rate of change interpretation). Even though a trader may interpret the delta differently at different times, each interpretation is mathematically the same. There is one other interpretation of the delta which is perhaps of less practical use but may still be worth mentioning. If we ignore the sign of the delta (positive for calls, negative for puts), the delta is approximately equal to the probability that the option will finish in-the-money. A call with a delta of 25, or a put with a delta of -25, has approximately a 25% chance of finishing in-the-money. A call with a delta of 75, ora put with a delta of -75, has approximately a 75% chance of finishing in-the-money. As an option’s delta moves closer to 100, or -100 for puts, the option becomes more and more likely to finish in-the-money. As the delta moves closer to zero, the option becomes less and less likely to finish in-the-money. We can also see why at-the-money options have deltas close to 50. If we assume that price changes are random, there is half a chance that the market will rise (the option goes into-the-money), and half a chance that the market will fall (the option goes out-of-the money). Of course, the delta is only an approximation of the probability since interest rate considerations and, in the case of stock options, dividends, may distort this interpreta- tion. Moreover, most option strategies depend not only on whether an option finishes in-the-money, but by how much. Ifa trader sells an option with a delta of 10 in the belief that the option will expire worthless nine times out of ten, he may indeed be correct. But if on the tenth time he loses an amount greater than the total premium he took in the nine times the option expired worthless, the trade will result in a negative expected return. In option trading the primary consideration is not always how often a strategy Option Values and Changing Market Conditions 103 wins or loses, but also how much it wins or loses. Every experienced trader is willing to accept several small losses if he can occasionally offset these with one big win. THE GAMMA In discussing the delta, we noted that under some circumstances, when the option is far out-of-the-money, its delta is close to zero. At other times, when the option is deeply in-the-money, its delta is close to 100 (-100 for puts). We can logically conclude that as the underlying price changes, the delta of an option must also be changing, As the underlying price rises, call deltas move towards 100 and put deltas move towards zero; as the underlying price falls, call deltas move towards zero and put deltas move towards —100. This effect is shown in Figures 6-6 and 6-7. The gamma (T), sometimes referred to as the curvature of an option, is the rate at which an option’s delta changes as the price of the underlying changes. The gamma is usually expressed in deltas gained or lost per one point change in the underlying, with the delta increasing by the amount of the gamma when the underlying rises, and falling by the amount of the gamma when the underlying falls. If an option has a gamma of 5,2 for each point rise (fall) in the price of the underlying, the option will gain (lose) 5 deltas. If the option originally had a delta of 25, and the underlying moves up (down) one full point, then the new delta of the option will be 30 (20). If the underlying moves up (down) another point, the new delta will be 35 (15). Note that Figures 6-6 and 6-7 seem to be identical, even though the former represents call gammas and the latter put gammas. This can only mean that both calls and puts with the same exercise price and the same amount of time to expiration have the same curvature.* This may at first seem odd, but it becomes logical when we remember that zero is greater than —50 in the same way that —50 is greater than —100. Negative numbers become more positive (or less negative} as one moves towards zero. Therefore, both calls and puts must have positive gammas. This often confuses the new trader since, through his use of the delta, he is accustomed to associating positive numbers with calls and negative numbers with puts. But regardless of whether we are working with calls or puts, we always add the gamma to the old delta as the underlying rises, and subtract the gamma from the old delta as the underlying falls. When a trader is long options, whether calls or puts, he has a long gamma position. When he is short options, he has a short gamma position. For example, suppose an at-the-money call, with a delta of 50, and an at-the money put, with a delta of -5O, both have gammas of 5. If the underlying contract rises one point, we add the gamma of 5 to the call delta of 50, to get the new delta of 55. To get the new put delta if the underlying contract rises one point we also add the gamma of 5 to the put delta of -50 to get the new delta of -45. This corresponds to our intuition 2. When the delta is",
  "word_count": 1000,
  "topics": [
    "options",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.429783"
}