{
  "id": "db5fb62bda66",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 24,
  "content": "t h ier. ” Suc h b e l ie f s natura lly l ea d to the eff orts of stru gg lin g with stress and tryin g to g et rid of it. 30 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 181ACCEPTANCE AND COMMITTED TRADING Exercise 8.1 Minor Decisions That Impact My Trading Situation Feelings Thoughts Consequences Example 1: Sleeping later than normal Felt tired “I can sleep a little longer; it won’t really matter.” Couldn’t revise game plan to incorporate overnight data. Missed a great trade. Felt rushed all morning. Example 2: Skipped simulation/ practice trading. Watched TV instead. Lethargic, bored “Paper trading w ithout real money on the line isn’t real trading. I can skip this.” Nothing immediately, but long term, I’m not doing my best to develop my skills. t h is occurs. T h is wi ll h e l p you d eve l op greater awareness o f w h ere you are f ee d ing t h e ti g er on t h e minor issues so t h at you can ta k e steps to ma k e t h e ri gh t d ecisions. Simply puttin g awareness to your tendencies can have a positive eff ect. Buildin g the h a bi t o f mindf u l a w a r e n ess wh e n a v o id a n ce s i tuat i o n s occu r a nd a l so t h e h a bi t o f min df u l acceptance b y ma k in g room f or t h ese t h ou gh ts an d f ee l in g s wit h out b e l iev- in g them as truth, or g ivin g in to them, or stru gg lin g with them will be an importan t step toward y our development as a mentall y skilled trader. Skills developed practic- in g min df u l acceptance o f minor events wi ll h e l p b ui ld t h e menta l musc l e to b etter handle more challen g in g tradin g events. Be particularly mindful of the thin g s you say ✓ 31 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 182T RADE MINDFULLY to ta lk yourse lf out o f d oing w h at ’s important. It wi ll give you specia l insig h t into h ow we easi l y an d seam l ess l y b e l ieve w h at our min d is te ll in g us. There is little di ff erence between fusin g with “I had a tou g h day , I’ll skip doin g my charts” and “I better take these profi ts quickly and avoid a loss.” Developin g ex - cellence in tradin g requires that we have a clear mind. W e don’t want to work on autopilot; instead we want to be mindful. W e are lookin g to ferret out instances w h ere we a l most unconscious l y sa b otage our b etter interests b y min dl ess l y l istening to w h at our min d s are te ll ing us. Again, we aren ’t l oo k ing to engage in a tug‐o f ‐war with our mind; we simply want to be aware of our self‐talk, recall what is most im - portant to us, an d ma k e room f or w h atever d isagreea bl e t h oug h ts an d f ee l ings arise as we turn our attention to t h e tas k s we k now h ave h ig h va l ue an d are important over t h e l ong h au l , suc h as reviewing our tra d es f or t h e d ay, k eeping our tra d ing journa l , or preparin g for the next day’s tradin g . Acceptin g a little privation or facin g a little di ffi culty in the service of your trading is associated with achieving your goals and values. T able 8.1 shows this relationship in a graphic format. At this point, traders should understand that avoidin g these important tasks be - cause it is less e ff ortful and more comfortable to do so is clearly related to immediate personal contentment, but does nothin g for their tradin g . Avoidance derails tradin g g oals and personal development as a trader. A bi g part of the mental g ame for traders is developing the ability to do what is necessary for the trade even while experienc - in g unwanted thou g hts and feelin g s. The most important mental skill to develop in this re g ard is mindfulness. Keep in mind that mindfulness is not practiced to “fi x” or eliminate unwanted thoughts and feelings. That just brings us back to the struggle and playin g a fruitless tu g ‐of‐war with our mind, a distraction at best. Mindful acceptin g of unwanted thou g hts and feelin g s is acknowled g in g them, makin g room for",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:45.720275"
}