{
  "id": "c60d2e069096",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 44,
  "content": "failure out of the wrong side of the pullback formation, indicating a complete failure of conviction outside the breakout level. For instance, assume that FIGURE 5.7 Consolidation Outside the Prebreakout Range Is Usually Constructive @S- Daily Soybeans Continuous Contract [Jul11) ·11 Feb Mar Apr May Jun ;t( I , ----------- , I 63 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing Interfaces between Trends and Ranges 133 sellers are able to force a breakout below an important support level and hold the market in a consolidation below that level. If they give up or fail, buyers will step in aggressively and bid the market back above support, which will show on price charts as a few large bars with good momentum breaking out of the top of the smaller consolidation. This is not what we should have seen if the sellers had enough strength to push the market lower. The presence of sharp momentum against the direction of the pullback is a reality that all market participants will be forced to acknowledge, and can often lead to a sizable move back below the breakout level. Failure Pullback If sharp momentum emerges against the breakout, conﬁrming the breakout failure, the ﬁrst pullback is probably tradable against the direction of the break- out. As this pattern describes what comes after the best failure patterns, it is not actually useful in making decisions at the time of the breakout. However, if you ﬁnd yourself hold- ing a position against this pattern as it develops, a large loss is probably looming around the corner. If you have no position, this pattern may offer a reasonable spot for a scalp or a short-term trade against the breakout, but it certainly should be a warning to get out of Dodge if you are holding on to a losing breakout trade. This may be slightly confusing, so see Figure 5.8 for clariﬁcation. Point A shows a typical breakout, and at point B the market is consolidating in a standard breakout pullback. At this point, you would be fully justiﬁed in holding a long position as long as the lower time frame price action is judged to be favorable. However, C marks a classic breakout pullback failure, as sharp downside momentum breaks out of the bottom of the pullback. Now, think back to trading pullback trades—one of the strongest conditions setting up good pullback trades is that they are preceded by good momentum. In this case, the move following point C is on very strong downward momentum (against the direction of the breakout), and the ensuing trend leg is longer and steeper than previous downtrends. Shorting into the pullback at D is a good trade based just on that criterion, but, in this case, it is further motivated by the failure of the breakout level at A. When price turns down after this pullback at D, there may be some panic as the last trapped longs scramble for the exits. A B C D FIGURE 5.8 The Pullback Marked D Often Oﬀers an Excellent Trade Following a Breakout Pullback Failure at C P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing Interfaces between Trends and Ranges 135 A FIGURE 5.9 Trends May Terminate into Trading Ranges When Pullbacks Become Ranges lead to sharper countertrend momentum due to trapped traders who entered on the false breakout. Again, the common thread tying these scenarios together is that there is a lack of conviction beyond the previous trend extreme, the market ﬁnds equilibrium as supply and demand balance, and a period of sideways trading activity follows. Figure 5.10 shows an example of a failure test at the previous high in an uptrend that ended the trend. Last, pullbacks may fail via the failure pullback sequence: sharp countertrend mo- mentum; a small pullback, which often sets up a good trade; and then another strong counter (the original trend) thrust. In this case, the move out of the failure pullback often exhausts itself somewhere close to the measured move objective (MMO), thus deﬁning the initial extreme of the new trading range. Figure 5.11 shows a road map for this type of action. The swing marked A is the conﬁrmation that the trend had decisively ended, at least for the time being. The common pattern tying all of these transitions from trend to trading range is a failed pullback, and this point is important: trends fail when pullbacks fail. This is why it is so critical for all technical traders, whether they trade with the trend, countertrend, in ranges, or on breakouts of those ranges, to be familiar with the patterns associated with pullbacks and their failure. The point of a trading methodology is not to predict the future, but to understand the forces at work in the market at any time, their rela- tive balance, and the most likely resolution of emerging price structures. When some- thing changes, and this happens frequently, a good trading methodology will embrace A FIGURE 5.10 A Failure Test at the Previous Pivot Extreme May Be a Catalyst for the Market to Transition to a Trading Range P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing Interfaces between Trends and Ranges 135 A FIGURE 5.9 Trends May Terminate into Trading Ranges When Pullbacks Become Ranges lead to sharper countertrend momentum due to trapped traders who entered on the false breakout. Again, the common thread tying these scenarios together is that there is a lack of conviction beyond the previous trend extreme, the market ﬁnds equilibrium as supply and demand balance, and a period of sideways trading activity follows. Figure 5.10 shows an example of",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.702299"
}