{
  "id": "242d8d4f423a",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 60,
  "content": "supporting context. Good trading is nothing more than the disciplined application of a few relatively simple fundamental building blocks. Trigger Conceptually, this is the most problematic of the trade setups because we have to strike a balance between waiting for conﬁrmation that the breakout has failed while still getting a good trade location. In terms of actual execution, the breakout fail- ure is nothing more than a failed pullback. Breakout traders need to understand that the pullback pattern is a critical building block for these trades, and it is important to understand the patterns that suggest pullbacks failing and continuing. GS - Daily Goldman Sachs Group A 17S.00 B Mil ~, ' __ !/ --,,,_,_ - I 170.00 }~-... _ J.Jf • ~ ~r \"\"\" __ // ,~,j ,~ ... 15S.00 111 I~. _1! ...-• • • , .... ,,--,.~!,·}t~-/ T i.~ 14S.OO ~----- Q ~--- 6 A 200 ,.- ---~ -~ ---- , c;,c:s------;;;~ • V ~ -- ---- -2.00 Oct Nov Dec '11 Feb 86 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing CHAPTER 7 Tools for Conﬁrmation There are in fact four very signiﬁcant stumbling blocks in the way of grasping the truth ... namely, the example of weak and unworthy authority, longstanding custom, the feeling of the ignorant crowd, and the hiding of our own ignorance while making a display of our apparent knowledge. —Roger Bacon I s more information always better? Some traders, when they are considering a trade, will use multiple indicators and analytical tools, solicit opinions from other traders, and even consider elements such as fundamentals that do not really have a bearing on their time frame. This approach can lead to “paralysis by analysis” as so many fac- tors are considered, with so many conﬂicting points of view, that the trader simply does not know what to do. The justiﬁcation offered for this approach is that an ofﬁcer on a battleﬁeld would want every possible piece of information, wouldn’t he? Perhaps not. It might be better for the decision maker to have processed intelligence from veriﬁed and trusted sources that has already been ﬁltered from the massive ﬂow of raw infor- mation. In trading, the equivalent is to focus on a few simple tools that are completely understood—depth of information, rather than breadth. It is critical that traders understand the subtleties of every tool they use. They should know how they react in every possible market environment, and furthermore, must un- derstand the complex interactions between multiple tools. This may lead to an approach that disregards a lot of information that many traders assume to be useful, but, for in- stance, why would you use indicators that do not add to your analysis? Why would you listen to news that is old news and is already fully priced into the market? Why would you try to guess how complex fundamental factors might inﬂuence the price if you do not have the skills to fully understand those fundamentals? Why would you solicit opinions from traders who may trade with completely different styles and may be less competent 189 P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 191 and do not pass simple statistical tests. People will claim that certain averages are impor- tant because “hedge funds buy there,” “everyone watches those averages,” or “it becomes a self-fulﬁlling prophecy,” but it is extremely difﬁcult to support these claims with quanti- tative tests. Tests of statistical tendencies around moving averages fail to ﬁnd that any av- erage is objectively better than another, or in fact, that there is any veriﬁable edge around these averages at all. Regardless, there are practical ways to use these tools in trading. As a Trend Indicator One potentially useful application of moving averages is to use them as conﬁrming trend indicators. For instance, when scanning many charts, a quick glance at a moving average—which summarizes the price structure, smoothes out the bumps, and highlights the overall trend—can give a quick read on the overall market structure. There are two broad ways to use moving averages as trend indicators, which can be used separately or combined. The ﬁrst is very simple: when price spends a lot of time on one side of a moving average, this suggests the market is trending in that direction; see Figure 7.1 for an example. Note that price may occasionally dip to the average, or even cross a bit to the other side, but it remains mostly above the average. The second idea, which is closely related, is that a moving average will slope in the direction of the trend. A ﬂat moving average is more indicative of a trading range, while up-sloping and down-sloping averages suggest uptrends and downtrends. As Figure 7.2 FIGURE 7.1 Price Mostly on One Side of a Moving Average Suggests a Trend in That Direction @SB - Daily Sugar No. 11 Continuous Contract [Jul11] 22.00 20.00 18.00 16.00 14.00 12.00 Oct '11 87 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 192 TRADING STRATEGIES FIGURE 7.2 The Three Moving Averages Indicate Three Diﬀerent Trends at This Spot shows, this tool is very dependent on the length of the moving average chosen; in this diagram, the three averages each suggest different trends at the same spot.",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "fundamentals",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.704777"
}