{
  "id": "9cc7a416856b",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 34,
  "content": "concrete plans are made. Having a game plan not just prepares you for tradin g , but helps keep you mentally fresh as well. This completes our discussion of the fi rst component of Charlie Maher’s three ‐ part Before‐During‐After trading process. T able 9.2 summarizes the mental domainsr (HVMSs) and several of the Hi g h‐Value Actions encompassed in the Before principle of High‐Quality Preparation. The next exercise provides a basic set of questions you can ask yourself that are specifi c to the HV AMS of Hi g h‐Quality Preparation. When TABLE 9.2 High‐Value Mental Skills and Some High‐Value Actions of High‐Quality Preparation Before: High‐Quality Preparation High‐Value Mental Skill Examples of High‐Value Actions Perspectiv e Personal Awareness Se lf -Motivation Menta l Discip l in e Write a tra d ing p l a n Role clarificatio n Practice/simu l ation tra d in g Researc h Stud y market behavio r Identif y developmental needs Create and work on developmental goal s Develop a game plan before the trading day or wee k Mentall y park distraction s Dail y missio n Maintain a dail y practice of mindfulnes s Locate areas where potential trades ma y occur in advanc e Commit to and maintain high effort in following the Before-During- After trading processr 39 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 230TRADE MINDF U LLY answering these, be objectively honest in your answers. Rate yourself on each ques - t ion a g ainst a scale of 1 to 6 with 6 representin g your performance in that domain at the hi g hest level and superior in all respects; 4 bein g satisfactory with minor in - consistencies; and below 3 indicating inconsistency and a developmental need. Use th ese questions to assess your process an d per f ormance in t h e Before menta l d omains o f Hig h ‐Qua l ity Preparation an d w h ere you mig h t nee d to ma k e a d justments. For ratings o f 5 or 6, consi d er t h ese menta l strong points an d continue to d o w h at you h ave b een d oing in t h is area. W or k to re d uce inconsistencies f or t h ose areas you h ave rate d 3 or 4. Ma k e l ow ratings o f 1 or 2 into d eve l opmenta l goa l s using t h e SMART g oa l f ramewor k to b egin serious wor k on t h e process o f Hig h ‐Qua l ity Preparation! In t h e next c h apters, we d etai l t h e remaining two components o f t h e tra d ing process — During and After —and their mental domains along with their associated rr h ig h -va l ue tra d ing activities. Exercise 9.3 Mental Skills Inventory: High-Quality Preparation Mental Domain Rating Perspective I maintain a balanced perspective between trading and the other important roles in my life. I am able to mentally park non‐trading–related concerns while I am trading. I have a strong understanding of how I trade the markets which is refl ected in my written trading plan. I understand and act in concert with the laws of probability in trading, especially the idea that my trading edge will play out over a large number of trades. Personal Awareness I am clear on my strong points and my limitations in the mental, technical, money management, and other important areas of my trading. Self-Motivation I set and achieve goals with respect to my performance and development as a trader. For my current limitations, I have developmental goals framed as SMART goals. I focus on my trading process more than my trading results. Mental Discipline I follow my trading plan, understand how my willpower can be strengthened and depleted, and take steps to preserve and increase my mental discipline. I create a game plan for my trading. 40 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 231 The Trading Psychology Process: g Eff ective Execution CHAPTER 10 I n C h apter 9 , we b egan d iscussing t h e process o f psyc h o l ogica l d eve l opment an d p er f ormance en h ancement wit h t h e Before‐During‐After framework developed byr sport psyc h o l ogist C h ar l ie Ma h er. W e f ocuse d on t h e menta l d omains (HVMSs) an d h ig h -va l ue actions (HV As) associate d wit h t h e princip l e o f Hig h ‐Qua l ity Prepara - tion. T h ese are t h e main tas k s in t h e Before time f rame. In t h is c h a p ter, we d iscuss t h e secon d component o f t h e process, During , and the core principle of E ff ective Execu - tion wit h its associate d HVMSs an d HV As. Before we get to Eff ective Execution, however, I want to spend a little time clari - f ying t h e process o f a tra d er ’ s psyc h o l",
  "word_count": 1000,
  "topics": [
    "psychology",
    "risk_management"
  ],
  "created_at": "2026-02-05T00:37:45.721650"
}