{
  "id": "f446e2b1cf7e",
  "source": "Thinking_In_Bets.pdf",
  "source_type": "pdf",
  "title": "Thinking In Bets",
  "chunk_index": 0,
  "content": "Copyright © 2018 by Annie Duke Thinking in Bets MAKING SMARTER DECISIONS WHEN YOU DON’T HAVE ALL THE FACTS ANNIE DUKE PORTFOLIO/ PENGUIN 9780735216358_ThinkingIn_TX.indd iii 12/1/17 1:24 AM9780735216358_ThinkingIn_TX.indd ii 12/1/17 1:24 AM Supplemental Graphics Thinking in Bets MAKING SMARTER DECISIONS WHEN YOU DON’T HAVE ALL THE FACTS ANNIE DUKE PORTFOLIO/ PENGUIN 9780735216358_ThinkingIn_TX.indd iii 12/1/17 1:24 AM9780735216358_ThinkingIn_TX.indd ii 12/1/17 1:24 AM L IFE Is P OKER , N OT C HE ss 15 MÜLLER- Ly ER ILLU s ION Which of these three lines is longest? Our brain sends us the signal that the second line is the longest, but you can see from adding the measurement lines that they are the same length. We can measure the lines to confirm they are the same length, but we can’t make ourselves unsee the illusion. What we can do is look for practical work- arounds, like car - rying around a ruler and knowing when to use it to check against how your brain processes what you see. It turns out that poker is a great place to find practical strategies to get the execution of our decisions to align better with our goals. Understanding how poker players think can help us deal with the decision challenges that 9780735216358_ThinkingIn_TX.indd 14 12/1/17 1:24 AM 9780735216358_ThinkingIn_TX.indd 15 12/1/17 1:24 AM < > >>---------c< < < B ET TO L EARN : F IELDING THE U NFOLDING F UTURE 79 to him.” There is a big difference between getting experience and becoming an expert. That difference lies in the ability to identify when the outcomes of our decisions have something to teach us and what that lesson might be. Any decision, whether it’s putting $2 on Count de Change at the racetrack or telling your kids they can eat whatever they want, is a bet on what will likely create the most favorable future for us. The future we have bet on unfolds as a series of outcomes. We bet on staying up late to watch the end of a football game and we sleep through our alarm, wake up tired, get to work late, and get reprimanded by the boss. Or we stay up late and any of the myriad other outcomes follows, including waking up perfectly on time and making it to work early. Whichever future actually unfolds, when we decide to stay up late to see the end of the game, we are making a bet that we will be happier in the future for having seen the final play. We bet on moving to Des Moines and we find our dream job, meet the love of our life, and take up yoga. Or, like John Hennigan, we move there, hate it within two days, and have to buy our way home for $15,000. We bet on firing a division president or calling a pass play, and the future unfolds as it does. We can represent this like so: As the future unfolds into a set of outcomes, we are faced with another decision: Why did something happen the way it did? How we figure out what— if anything— we should learn from an outcome becomes another bet. As outcomes come our way, figuring out whether those outcomes were caused mainly by luck BET (sET OF OUTCOMEs)BELIEF BETTING ON A FUTURE 9780735216358_ThinkingIn_TX.indd 78 12/1/17 1:24 AM 9780735216358_ThinkingIn_TX.indd 79 12/1/17 1:24 AM 80 THINKING IN BET s or whether they were the predictable result of particular deci- sions we made is a bet of great consequence. If we determine our decisions drove the outcome, we can feed the data we get follow - ing those decisions back into belief formation and updating, cre - ating a learning loop: We have the opportunity to learn from the way the future unfolds to improve our beliefs and decisions going forward. The more evidence we get from experience, the less uncertainty we have about our beliefs and choices. Actively using outcomes to examine our beliefs and bets closes the feedback loop, reducing uncertainty. This is the heavy lifting of how we learn. Ideally, our beliefs and our bets improve with time as we learn from experience. Ideally, the more information we have, the better we get at making decisions about which possible future to bet on. Ideally, as we learn from experience we get better at assessing the likelihood of a particular outcome given any deci- sion, making our predictions about the future more accurate. As you may have guessed, when it comes to how we process experi- ence, “ideally” doesn’t always apply. Learning might proceed in a more ideal way if life were more like chess than poker. The connection between outcome quality and decision quality would be clearer because there would be less uncertainty. The challenge is that any single outcome can happen BET BET 2OUTCOMEBELIEF LEARNING LOOP 1 9780735216358_ThinkingIn_TX.indd 80 12/1/17 1:24 AM 84 THINKING IN BET s (luck). I can lose a hand of poker because I made poor decisions, applying the skill elements of the game poorly, or because the other player got lucky. Chalk up an outcome to skill, and we take credit for the re - sult. Chalk up an outcome to luck, and it wasn’t in our control. For any outcome, we are faced with this initial sorting decision. That decision is a bet on whether the outcome belongs in the “luck” bucket or the “skill” bucket. This is where Nick the Greek went wrong. We can update the learning loop to represent this like so: Think about this like we are an outfielder catching a fly ball with runners on base. Fielders have to make in - the- moment game decisions about where to throw the ball: hit the cutoff man, throw behind a base runner, throw out an advancing base run- ner. Where the outfielder throws after fielding the ball is a bet. We make similar bets about where to “throw” an outcome: into the “skill bucket” (in our control) or the “luck bucket” (out -",
  "word_count": 1000,
  "topics": [
    "options"
  ],
  "created_at": "2026-02-05T00:37:47.321379"
}