{
  "id": "9a63ee805afb",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 25,
  "content": "recall getting was for a labor economist position at a shockingly low salary. So, I placed a short position-wanted ad in the New York Times, which read: M.A. Economics, Brown University, seeking analytical position. I got about 15 responses to that ad, but only one turned out to be a legitimate job interview. What were the others? Well, I followed up on one. The caller said he saw my ad and thought I might be a good fit for their company. “What exactly is the position?” I asked. He gave me some vague response. “Is this a sales position?” I asked. “We have sales positions but have a managerial position in mind for you. We’re having a company meeting on Tuesday night, and we would like you to come in.” 76 I expected a conference room meeting where several company members would interview me. Driving to the meeting, I noticed the location seemed odd. It was just off a particularly ugly section of the New Jersey Turnpike. As I pulled up to the address, I discovered it was a hotel, which seemed even odder. I walked in and saw signs with arrows pointing to the company event. I was met by a glib guy with a big smile, wearing a flashy suit. He ushered me into a large meeting room with seats set up for hundreds of people. In the front, there were displays with a variety of cleaning products. I was shocked and was ready to leave, but he implored me to stay. The event began with a film about the company narrated by a recognized actor—Sebastian Cabot, if I remember correctly—in a move that was obviously intended to lend credibility to the company. The film told the story of the invention of the product. There was a dramatization of a chemist who had an accident falling off a ladder. While lying in the hospital bed, he thought about how he could make his wife’s life easier, leading to the invention of the company’s original cleaning product. This inspiring film was followed by a talk by a used-car-sales-type speaker who told us how he made hundreds of thousands of dollars in his spare time, showing a slide of the fancy sports car he had just bought with his profits. So, this was a multilevel marketing pitch. Yes, it was a pyramid selling scheme, although I knew nothing about this type of operation at the time. They wanted you to invest thousands of dollars to buy their product line, and then you could recruit other people to sell the products and get a cut of their commissions. After this experience, I recognized and rejected all the other similar calls. But, as I said, there was one legitimate job interview offer call. It was from Irwin Shisko, the Commodity Research Director for Reynolds Securities. He wanted to interview me for a commodity analyst job. How did the interview go? I only remember one question, because my answer was embarrassingly awful. Shisko asked me rather legitimately if I knew anything about commodities. 77 Back in those days, universities had few, if any, investment courses, let alone a course on commodity markets. I was totally ignorant. “Not really,” I answered. “Something like gold?” I said, in a tone that was somewhere between a hesitant answer and a question. But, even though I knew nothing, I must have said something in that interview that at least intrigued him because I was invited to participate in the next stage of the interview process. At the time, Shisko wrote a weekly column for Barron’s, which I believe was called “Commodities Corner.” He asked each candidate interviewing for the job to write a column on a specific commodity, which he would use as a source of material for his column. I was assigned the copper market. Of course, I knew nothing about the copper market. This was way before the internet, so you had to go to the library to do any serious research. I spent a week at the Grand Army Plaza library, which is Brooklyn’s version of the New York Public Library in Manhattan, reading anything I could find on the copper market, which included years’ worth of various periodicals, ranging from annual to daily. At the end of the week, I wrote a four-page article and submitted it. I got the job. I later found out from a broker in the office who became a close friend of mine that there were four candidates for the job, including me, and that Shisko had passed around the four articles to all the brokers in the office, asking for their feedback. Everyone said, “Pick this guy,” referring to my article. So, I wrote my way into my first job, which was the beginning of a long career. Many years later, I found a copy of that article while cleaning out papers in my office. I was surprised. It was actually fairly decent. You couldn’t tell it was written by a complete novice. What was the office like? There was a large main office in which all the brokers sat facing a huge commodity quote board. The quote board was constantly clicking and clacking as the commodity prices changed. It was a very active atmosphere, primarily because of the dominance of the quote board, but also because of all the broker phone calls happening in the same space. My office, which I shared with Shisko, was on the side, separated from the main office 78 space by a glass partition. From my desk, I could see both the board and the brokers. What was your reaction on the first day on the job? I was intrigued. Serendipitously, that first day also proved pivotal in laying the seeds for the first Market Wizards book and, by implication, the entire series. The commodity research department consisted of the director, Irwin Shisko, and two analysts—one in the New York office and the other in the Chicago office. I was hired",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.181950"
}