{
  "id": "942667200f31",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 85,
  "content": "of 25% (a 10-percentage-point margin for error), and the trader has never seen volatility go that high, he may have the confidence to execute the spread in much larger size, perhaps 50 x 100.4 The size of a trader’s positions should depend on the riskiness of the positions, and this in turn depends on how much can go wrong without the strategy turning against the trader. DIVIDENDS AND INTEREST In addition to the delta, gamma, theta, and vega risks which all traders must consider, stock option traders might also have to consider the risk of changes in dividends and interest rates.> This is especially true of time spreads, since options with different expirations react differently to changes in these inputs. Consider the evaluation table for stock options shown in Figure 9-11. With implied volatilities well below the forecast of 27%, it makes sense to look for spreads with positive vegas, Suppose we focus on four possible spreads shown in Figure 9-12. Spreads 7 and 8 are long time spreads, while spreads 9 and 10 are diagonal spreads. What are the relative merits of each spread? As with ail option spreads, we have to consider a variety of risks. Note that in the evaluation table in Figure 9-11 we used an interest rate of 8%. Suppose we believe that interest rates are likely to rise sharply in the near future. How might these spreads react to rising interest rates? We can see from Figure 9-13 that spreads 7 and 9 will be hurt by rising interest rates, while spreads 8 and 10 will be helped. If a rise in interest rates is our primary concern, we might focus on spreads 8 and 10, regardless of any desirable vega or gamma characteristics associated with spreads 7 and 9. If we focus on spreads 8 and 10, we will still want to consider the volatility risk. We can do a cursory comparison of this risk by dividing the vega by the theoretical edge. From this we find: Spread 8: 1.380/6,45 | = 214 Spread 10; = 2.774/6.14 = 452 4, Size, of course, is relative. To a well capitalized, experienced trader even 50 x 100 may be a small trade. 5. Futures options can also be affected by changes in interest rates since a change in interest rates will affect the forward price of the underlying futures contract. Unlike stocks, factors other than Interest rates, such as short term supply and demand, can also affect these contracts. 189 ge2 zee. 6600- =e Zo 6r'OL %6 9'E2 eee g9c0- 2 Be 60'y *AE sol Zee eye zelo- v2 os- er %9 sez €pz z6ec0- vs os ses S ool L'b2 ez sblo- 2% 6e- 667 “vy bbe geez g6c0- FS 19 228 %L sé Anneroa eBeA BOUL eWWeD eHeq = eNIRA ood AeA eBeA eyOUL eUUeD eeG = enIePA = 89H @0ud poduy yeopesooyL perdu feopesoeyL @s019x4 slfnd si1vo anne eve ezloslo- —ssCé 2l- Ly’? x8 Sz ez oseO- = SE 82 69°} %l sol ove gk 6-z9z0-—s BE sg- Zs Yeb eps ISk’ O&vO\"- ge Sb 6c'€ Ye ool L'¢2 Zl 46lez0- —s OE 9e- 992 \"Ae 0'Ss2 Zbl gehO- = VE v9 6L'S S g6 Aymeron eBeq eIOUL eed e119Q = ONIPA sold «ANINEIOA eBeqj eeu, eWWeD eed =—enfeA = 8H e9d poyduy yeoposooyuL poyduy feopesooyy ~ es]o10xXa] sind si1vo HOUVIN skep 61} pue shep gz Ul gz’ | ‘puapiaiq payedxy ‘%00'8 ‘}SOJ9}UI ‘LZ OUNE ‘%LS YOIEW, -AUINEIOA ‘shep Zp} eunr ‘skep 9g YoeW ‘oul, ‘24 86 ‘Ud YICNS LL-6 oanbiy Risk Considerations Chapter 9 190 plLLiar v9r0—- Oy'st be+ ert’ x Ol- 9Er0'— X OL- gE x Ol- v9+ X Ol- C&S X St+ 89c0\"— x BL t+ cx Sl+ ge+ x Bit See t+ g6r0'+ ge se- Gh X OL- 24920°— x Ol- se xol- SS~ x O- Eo X Git SvlLo-—x Gt+ OSX Gtt+ 66-x<Gtt ose’ }+ oL00'+ Old Slt GE X St—- OEPO— x SI- ge x St- Spt x Gt- eba x Stt+ 2620'— x SE + vex Stt+ OSt X GE + Gloct oore'+ gce— gZ- obl’ x Go- -820\"— x Ge- QE X Ge- 9e- x Ge- 0\" X Got SVLO— x Got ee X Get 6&- x Gat UOTySodg UuoT}SOd UOo}YISOg uonisodg eBon eyoul ewer eyed vy or 6Z-xoOl el+xesl og'9+ Ze’—X Ob gg'+ x Gt Sv'ot ov x St se+ xt Sigt by X Ge 89+ x Se e6py feapesoouy s]}20 S6 YIeW OL— sffeo sol eunr ett snd 0o} yey O}- sind gg eunr Si+ S{fB29 COL YOIRW Si- s]/eo OOL eunP Spt sind ¢6 yoreW sz— sind g6 eunr set 701 peeuds ‘6 peeids 7g peeids ‘ZL peaids Zt-6 eanBry Risk Considerations 191 Figure 9-13 30 el spread 7 spread 8 (long put time spread) (long call time spread) 207 ” . 3S 154 ae a 6 104 A ON _e® ‘ & — as = spread 9 ae 4 4 id ee mm oe spread 10 = 5*| (diagonal put spread) ee (diagonal call spread) a ao — re) aw eS £ 0 ae ae 6. -104 -1 5 T T T T T 1 0.00 2.00 4.00 6.00 8.00 10.00 12.00 Interest Rate (%) If volatility risk is our second concern, then spread 8 is probably best because its vega divided by theoretical edge is much smaller than that of spread 10. Suppose, however, that we are more concerned with a large move in the underlying stock than with a decline in volatility. Now we can see that spread 10 is best because its positive gamma means that a large move in the price of the underlying stock can only work to our advantage. As always, the choice of strategies will require us to make some judgements as to what risks we are willing to accept, and to what degree. Finally, let’s look at our spreads with respect to a change in dividends. In our evaluation table we assumed a quarterly dividend of 1.25. Suppose we believe that the",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.435415"
}