{
  "id": "25cf5eefdbde",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 87,
  "content": "x +30) = +220 If the trader now decides to make an adjustment he has three basic choices: 1. sell underlying contracts 2. sell calls 3. buy puts Which method is best? All other considerations being equal, whenever a trader makes an adjustment he should do so with the intention of improving the risk/reward characteristics of the 194 Chapter 9 position. If the trader decides to adjust his delta position by purchasing puts, he also reduces his other risks since the gamma, theta, and vega associated with the put purchase are opposite in sign to the gamma, theta, and vega associated with his existing short strangle position. Unfortunately, all other considerations may not be equal. Since implied volatility can remain high or low for long periods of time, it is quite likely that if all options were overpriced when the trader initiated his position, they will still be overpriced when he goes back into the market to make his adjustment. Even though the purchase of puts to become delta neutral will reduce his other risks, such an adjustment will also have the effect of reducing the theoretical edge. On the other hand, if all options are overpriced and the trader decides to sell additional calls to reduce the delta, the sale of the overpriced calls will have the effect of increasing the theoretical edge. If the trader decides that adding to his theoretical edge is of primary importance he may decide to sell seven more 105 calls, leaving him approximately delta neutral since (-20 x -41) + (-27 x +30) = +10 Now suppose several more days pass and the market has rebounded to 101.50, with new delta values for the 95 put and 105 call of -26 and +40. The position delta is Now (-20 x -26) + (-27 x +40} = -560 Again, if the trader wants to adjust he is faced with three choices: buy underlying contracts, buy calls, or sell puts. Assuming that all options are still overpriced and that the trader wants to continue to increase his theoretical edge, he may decide to sell an additional 22 of the 95 puts. The total delta position is (-d2 x -26) + (-27 x +40) = +12 Tt should be clear what will result from these adjustments. If all options remain overpriced and the trader is always intent on increasing his theoretical edge, he will continue to make whatever adjustments are necessary by continuously selling over- priced options. This method of adjusting may indeed result in the greatest profit to the trader. But notice what is happening. The strangle, which the trader was initially prepared to sell 20 times, has now increased in size to 42 x 27. If the market now makes a violent move in either direction, the negative consequences will be greatly magnified. Unfortunately, the new trader, overly concerned with always increasing his theoretical edge, often finds himself in just such a position. If the market makes a very swift move, the trader may not survive. For this reason, a new trader who is unfamiliar with all the subtleties of an option market should avoid making adjustments which increase the size of his position. No trader can afford to ignore the effect his adjustments will have on the total risk to his position. If he has a positive (negative) gamma position, buying (selling) any additional options will increase his gamma risk. Likewise, if he has a positive (negative) vega position, buying (selling) any additional options will increase his vega risk. A trader cannot afford to sell overpriced options or buy underpriced options ad infinitum. At Risk Considerations 195 some point the size of the spread will simply become too large, and any additional theoretical edge will have to take a back seat to risk considerations. When that happens there are only two choices: decrease the size of the spread or adjust in the underlying market. A disciplined trader knows that sometimes, because of risk considerations, the best course is to reduce the size of the spread, even if it means giving up some theoretical edge. This may be hard on the trader's ego, particularly if he must personally go back into the market and either buy back options which he originally sold at a lower price, or sell out options which he originally purchased at a higher price. However, if a trader is unwilling to swallow his pride from time to time, and admit that he made a mistake, his trading career is certain to be a short one. If a trader finds that any delta adjustment in the option market that reduces his risk will also reduce his theoretical edge, and he is unwilling to give up any theoretical edge, his only recourse is to make his adjustments in the underlying market. An underlying contract has no gamma, theta, or vega, so the risks of the position will remain essentially the same. A QUESTION OF STYLE Because most option pricing models assume that movement in the underlying contract is random, an option trader who trades purely from the theoretical values generated by a model should not have any prior opinion about the direction in which the underlying market will move. In practice, however, many option traders begin their trading careers by taking positions in the underlying market, where direction is the primary considera- tion. Many traders therefore develop a style of trading based on presumed directional moves in the underlying market. A trader might, for example, be a trend follower, adhering to the philosophy that “the trend is your friend.” Or he might be a contrarian, preferring to “buy weakness, sell strength.” Traders often try to incorporate their personal trading styles into their option strategies. One way to do this is to consider beforehand the adjustments which will be required for a certain strategy if the underlying market begins to move. For example, suppose a trader sells straddles in such a way that he is initially delta neutral. Such spreads have a negative",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.435703"
}