{
  "id": "f8a3e8a1cc97",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 25,
  "content": "it gives the optimal leverage one should employ for a particular trading strategy. Interested readers can look up a simple derivation of the Kelly formula at the end of this chapter in the simple one-strategy case. Example 6.1: An Interesting Puzzle (or Why Risk Is Bad for You)1 Here is a little puzzle that may stymie many a professional trader. Sup- pose a certain stock exhibits a true (geometric) random walk, by which I mean there is a 50–50 chance that the stock is going up 1 percent or down 1 percent every minute. If you buy this stock, are you most likely—in the long run and ignoring financing costs—to make money, lose money, or be flat? Most traders will blurt out the answer “Flat!” and that is wrong. The correct answer is that you will lose money, at the rate of 0.005 percent 1This example was reproduced with corrections from my blog article “Maximizing Compounded Rate of Return,” which you can find at epchan.blogspot.com/2006/ 10/maximizing-compounded-rate-of-return.html. Chan800064_c06.indd 111 6/7/2021 2:06:02 PM 51 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Money and Risk Management 113 (or strategy), the higher the maximum growth rate of your equity (or wealth), provided you use the optimal leverage recommended by the Kelly formula. Here is the simple mathematical embodiment of this fact. Example 6.2: Calculating the Optimal Leverage Based on the Kelly Formula Let’s see an example of the Kelly formula at work. Suppose our portfo- lio consists of just a long position in SPY , the exchange-traded fund (ETF) tracking the S&P 500 index. Let’s suppose that the mean annual return of SPY is 11.23 percent, with an annualized standard deviation of 16.91 percent, and that the risk-free rate is 4 percent. Hence, the portfolio has an annual mean excess return of 7.231 percent and an annual standard deviation of 16.91 percent, giving it a Sharpe ratio of 0.4275. The optimal leverage according to the Kelly formula is f = 0.07231/0.1691 2 = 2.528. (Notice one interesting tidbit: The Kelly f is independent of time scale, so it actually does not matter whether you annualize your return and standard deviation, as opposed to the Sharpe ratio, which is time scale dependent.) Finally, the annualized compounded, levered growth rate is 13.14 percent, which includes the financing costs. You can verify these numbers yourselves by downloading the SPY daily prices from Yahoo! Finance and computing the various quantities on a spreadsheet. I did that on December 29, 2007, and my spreadsheet is available at epchan.com/book/example6_2.xls. In column H, I have com- puted the daily returns of the (adjusted) closing prices of SPY , while in row 3760 starting at column H, I have computed the (annualized) mean return of SPY , the standard deviation of SPY , the mean excess return of the port- folio, the Sharpe ratio of the portfolio, the Kelly leverage, and, finally, the compounded growth rate. The Kelly leverage of 2.528 that we computed is saying that, for this strategy, if you have $100,000 in cash to invest, and if you really believe the expected values of your returns and standard deviations, you should bor- row money to buy $252,800 worth of SPY . Furthermore, expect an annual compounded return on your $100,000 investment to be 13.14 percent. For comparison, let’s see what compounded growth rate we will get if we did not leverage our investment (see the formula in the appendix to this chapter): g = r + m – s 2/2 = 0.1123 – (0.1691)2/2 = 9.8 percent, where m is the annualized mean return and s is the annualized standard devia- tion of returns. This, and not mean annual return of 11.23 percent, is the long-term growth rate of buying SPY with cash only. Chan800064_c06.indd 113 6/7/2021 2:06:03 PM 52 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 114 QUANTITATIVE TRADING Example 6.3: Calculating the Optimal Allocation Using the Kelly Formula We pick three sector-specific ETFs and see how we should allocate capital among them to achieve the maximum growth rate for the portfolio. The three ETFs are: OIH (oil service), RKH (regional bank), and RTH (retail). The daily prices are downloaded from Yahoo! Finance and saved in epchan. com/book as OIH.xls, RKH.xls, and RTH.xls. Using MATLAB Here is the MATLAB program (epchan.com/book/example6_3.m) to retrieve these files and calculate M, C, and F *. % make sure previously defined variables are erased. clear; % read a spreadsheet named \"OIH.xls\" into MATLAB. [num1, txt1]=xlsread('OIH'); % the first column (starting from the second row) is % the trading days in format mm/dd/yyyy. tday1=txt1(2:end, 1); tday1=datestr(datenum(tday1, 'mm/dd/yyyy'), 'yyyymmdd'); % convert the format into yyyymmdd. % convert the date strings first into cell arrays % and then into numeric format. tday1=str2double(cellstr(tday1)); % the last column contains the adjusted close prices. adjcls1=num1(:, end); % read a spreadsheet named \"RKH.xls\" into MATLAB. [num2, txt2]=xlsread('RKH'); % the first column (starting from the second row) is % the trading days in format mm/dd/yyyy. tday2=txt2(2:end, 1); % convert the format into yyyymmdd. tday2=.. datestr(datenum(tday2, 'mm/dd/yyyy'), 'yyyymmdd'); % convert the date strings first into cell arrays and % then into numeric format. tday2=str2double(cellstr(tday2)); adjcls2=num2(:, end); % read a spreadsheet named \"RTH.xls\" into MATLAB. [num3, txt3]=xlsread('RTH'); % the first column (starting from the second row) is Chan800064_c06.indd 114 6/7/2021 2:06:03 PM 53 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online.",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "crypto",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.607738"
}