{
  "id": "e1dfb9c14fb4",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 29,
  "content": "effort, and I will feel good about this. I will r emind myself that the stress I feel is helping me meet the challenge o f interacting with the market and even though it feels bad, it’s w orse when the market continues to go in my direction and I’ve cut t he trade. I will strive to see my thoughts and feelings as temporary a nd only an indication of my fears, not what is actually happening in t he market. I will also strive to p ut more attention on the market and m y trade and less on my thou g hts and feelin g s, thou g h I will also le t t hem occur without fi g htin g them or runnin g from them by closin g m y trade until I reached my g oal . to orient h is attention on t h e important, h ig h -va l ue tra d ing–re l evant action h e nee d s to execute next. By anticipatin g w h at can d erai l h is p l an, h e f orti fi es h is p l an psyc h o l o g i - ca ll y an d is we ll ‐prepare d to tac kl e h is most c h a ll en g in g tra d in g situation. In T able 8.3, Priyanka identifi ed cuttin g winnin g trades short as the challen g e she would like to overcome. This is one of the most common unconstructive tradin g behaviors. Priyanka noted that persistence and maximal eff ort were values in her tra d ing. Remem b er, va l ues in d icate d irection. In Priyan k a ’ s case, persistence an d maximal e ff ort leads to success. This was her experience in sport. She would also say that there was joy for her in the e ff ort. Like many , she viewed the journey and meet - ing t h e d eman d s o f t h e journey as mattering more to h er t h an t h e d estination b ecause o f t h e ric h experiences, l earning, an d se lf ‐d eve l opment t h at t h e journey b rings. For Priyan k a, t h e journey invo l ve d an initia l goa l o f partia ll y re d ucing h er unconstructive - ----------- 34 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 200T RADE MINDFULLY d oing—especia ll y h ow we are d oing wit h our process, not getting d own on ourse l ves w h en we f a ll s h ort, an d ta k ing corrective actions b y mo d i f ying our p l an an d process are t h e component actions nee d e d to ma k e b e h aviora l c h an g e (see Exercise 8.5). It may no t b e easy , b ut it is a l so not impossi bl e. Not h in g o f va l ue comes ri gh t away . Don ’ t g ive up. Exercise 8.5, Monitorin g My Pro g ress in Overcomin g a Challen g in g Tradin g Situation, provides the format to a process with which you can monitor your pro g- ress in trans f orming c h a ll enging tra d ing situations. Y ou wou ld comp l ete t h is f orm eac h time you encounter a c h a ll enging tra d ing situation t h at you h ave d eve l ope d a plan for usin g the form in Exercise 8.4. The monitorin g process involves identify- Exercise 8.5 Monitoring My Progress in Overcoming a Challenging Trading Situation Challenging Situation: Cutting profi table trades short Actual Event : Stock trade on Monday What I did well : I did my mindfulness routine and intention, as planned. I took the trade and set the stop. Where I fell short : Moved stop too quickly and was stopped out. What caused me to fall short : I wanted to start the week with a cushion of profi t. I didn’t realize at the time that this was just another excuse to cut a profi table trade. Starting the week profi table seemed reasonable at the time. What I can do next time: Be more mindful of my thoughts. When this occurs again, I will remind myself that this is just a thought unrelated to the trade and remember that following this process is more important than the results of any individual trade. Actual Event: What I did well: Where I fell short: What caused me to fall short : What I can do next time: Actual Event: What I did well: Where I fell short: What caused me to fall short : What I can do next time: Actual Event: What I did well: Where I fell short: What caused me to fall short : What I can do next time: Actual Event: What I did well: Where I fell short: What caused me to fall short : What I can do next time: 35 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "psychology"
  ],
  "created_at": "2026-02-05T00:37:45.720938"
}