{
  "id": "23d41066f5d4",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 22,
  "content": "expiration is constantly growing shorter. However, the expiration date, like the exercise price, is fixed by the exchange and will not change. Time to expiration, like all inputs in the Black-Scholes Model, is entered as an annualized number. If we are entering raw data directly into the model we must make the appropriate annualization. With 91 days remaining to expiration, we would enter an input of .25 (91/365 = .25). With 36 days remaining, we would enter .10 (36/365 = .10). However, most option evaluation computer programs already have this transfor- mation incorporated into the software so that we need only enter the correct number of days remaining to expiration. It may seem that we have a problem in deciding what number of days to enter into the model. We need the amount of time remaining to expiration for two purposes, to calculate the interest considerations and to calculate the likelihood of movement in the underlying contract. For volatility purposes in assessing the “speed” of the market we are only interested in trading days. Only on those days can the price of the underlying contract actually change. This might lead us to drop weekends and holidays from our calculations. On the other hand, for interest rate purposes we must include every day. 6. — It js true that an exchange may adjust the exercise price of a stock option if there is a stock split. In practical terms this is not really a change in the exercise price because the exercise price retains the same relationship to the stock price. The characteristics of the option contract remain essentially unchanged. Introduction to Theoretical Pricing Models 47 If we borrow or lend money we expect the interest to accrue every day, no matter that some of the days are not business days. It turns out that this is not really a problem. In calculating the “speed” of the market we observe only the price changes that occur on business days. But we can make slight changes to this observed value and annualize the number before feeding it into the theoretical pricing model. The result is that we can feed into our model the actual number of days remaining to expiration knowing that the model will interpret the number correctly. PRICE OF THE UNDERLYING Unlike the exercise price and time to expiration, the correct price of the underlying is not always obvious. At any one time there is usually a bid price and an asked price, and it may not be clear whether we ought to use one or the other of these prices, or perhaps some price in between. We have noted that the correct use of an option’s theoretical value requires us to hedge the option position with an opposing trade in the underlying contract. Therefore the underlying price we feed into our theoretical pricing model ought to be the price at which we believe we can make the opposing trade. If we intend to purchase calls or sell puts, both of which are long market positions, we will have to hedge by selling the underlying contract. In that case we ought to use the bid price since that is the price at which we can sell the underlying. On the other hand, if we intend to sell calls or buy puts, both of which are short market positions, we will have to hedge by purchasing the underlying contract. Now we ought to use the asked price since that is the price at which we can buy the underlying. In practice, the bid and offer are constantly changing, and many traders will simply use the last trade price as the basis for theoretical evaluation. But the last trade price May not always reflect the present market. Even the settlement price quoted in a newspaper may not accurately reflect the market at the close of business. The last trade price may show 7514 for a contract, but the market at the close may have been 75% bid, 7514 offered. A trader who hoped to buy at 751/44 would have very little chance of being filled because of the difficulty of buying at the bid price. Even a purchase at some Middle price, say 75%, may be unlikely if the market is very unbalanced with many more contracts being bid for at 75!/ than offered at 75’. For all of these reasons, an experienced trader will rarely enter an option market without knowing the exact bid and offer in the underlying market. INTEREST RATES Since an option trade may result in either a cash credit or debit to a trader’s account, the interest considerations resulting from this cash flow must also play a role in option evaluation. This is a function of interest rates over the life of the option. The interest rate component plays two roles in the theoretical evaluation of options. First, it may affect the forward price of the underlying contract. If the underlying 48 Chapter 3 contract is subject to stock-type settlement, as we raise interest rates we raise the forward price, increasing the value of calls and decreasing the value of puts. Secondly, the interest rate may affect the cost of carrying the option. If the option is subject to stock-type settlement, as we raise interest rates we decrease the value of the option. In spite of the fact that the interest rate plays two roles, in most cases the same rate is applicable and we need only input one interest rate into the model. If, however, different rates are applicable, such as would be the case with foreign currency options (the foreign currency interest rate plays one role, the domestic currency interest rate plays a different role) the model will require the input of two interest rates. This is the case with the Garman-Kohlhagen version of the Black-Scholes Model. The fact that interest rates play a dual role also means that the relative importance of interest rates will vary, depending on the type of underlying instrument and",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.425589"
}