{
  "id": "fc32056dc858",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 36,
  "content": "he will certainly choose some higher volatility, perhaps 22%, for a November contract. He knows that the November contract includes the summer months, while the May contract does not. The effect of seasonal volatility on soybeans is shown in Figure 4-10. A trader who is new to options might initially question whether volatility is really that important. He has probably been pursuing directional strategies where volatility was not a consideration. It is also possible to purstte a variety of directional strategies in the option market. But if a trader has a thorough understanding of volatility, he has an additional variable with which to work. He can, in effect, approach the market from two directions instead of one. Many traders find it easier to work exclusively with Figure 4-10: Monthly Soybean Volatility (1980-1992) 60 504 40- 3074 Annulaized Volatility (%) 205 101 ee ee T T T T T Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec —™ high ~*~ mean —f&- low Courtesy of the Chicago Board of Trade. Volatility 77 volatility, rather than try to guess market direction. Moreover, volatility strategies can be extremely profitable and, when chosen intelligently, can even reduce a trader’s risk exposure. These two variables, market direction and volatility, enable an option trader to pursue many strategies not available to the pure stock or futures trader. Changing our assumptions about future volatility can have a dramatic effect on the value of options. To see this, look at the prices, theoretical values, and implied volatilities for ten-week gold options in Figure 4-11. Note the change in theoretical values as volatility is increased from 11% to 14% to 17%. The 360 call and put, which are essentially at-the-money, change by approximately 1.85 ($185) for each three-percent- age-point increase in volatility. While out-of-the-money options do not show as great a dollar change in value, in percent terms their sensitivity to a change in volatility is even greater. As volatility increases from 11% to 14%, the 390 call and 330 put more than double in value, and double again as volatility increases from 14% to 17%. A three-per- centage-point change in volatility over ten weeks is not at all uncommon. Indeed, the volatility of gold can show swings of six or seven percentage points in a relatively short period of time. This is evident from the historical volatility of gold shown in Figure 4-12. Given its importance, it is not surprising that the serious option trader spends a considerable amount of time thinking about volatility. Using his knowledge of historical, forecast, implied, and, in the case of agricultural commodities, seasonal volatility, he Figure 4-11 3 May 1991 August Gold Futures at 358.30 Time to expiration = 10 weeks Interest rate = 5.50% Exercise Settlement Implled Theoretical Value If... Price Price Volatility Vol. = 11% Vol. = 14% Vol. = 17% Calls 330 29.20 15.36 28.27 28.84 29.69 340 20.60 14.48 19.26 20.40 21.73 350 13.20 13.86 11.61 13.28 15.01 360 7.80 13.89 6.02 7.87 9.73 370 4.20 14.00 2.62 4.20 5.88 380 2.40 14.93 .94 2.01 3.32 390 1.40 15.93 .28 86 1.75 Puts 330 1.20 15.28 .29 87 1.72 340 2.60 14.69 1.17 2.31 3.64 350 5.10 14.04 3.41 5.08 6.80 360 9.50 13.92 7.70 9.55 11.41 370 15.70 13.88 14.18 15.77 17.45 380 23.70 14.57 22.40 23.47 24.78 390 32.50 15.13 31.62 32.20 33.08 Chapter 4 78 L6-Aew O6-AON o6-dy 68-des 68-12 ge-Bny se-qe4 4e-Inr 2g-uer 8 FOL Fol 81 [0c (%) Anielon pezijenuuy ma 82d ANNEIOA PIO YOOM-OL :ZL- eunBi4 Volatility 79 must try to make an intelligent decision about future volatility. From this, he will look for option strategies which will be profitable when he is right, but which will not resuit in a disastrous loss when he is wrong. Because of the difficulty in predicting volatility, a trader must always look for strategies which will leave the greatest margin for error. No trader will survive very long pursuing strategies based on a future volatility estimate of 15% if such a strategy results in a Joss when volatility actually turns out to be 16%. Given the shifts that occur in volatility, a one-percentage-point margin for error is no margin for error at all. We have not yet concluded our discussion of volatility. But before continuing, it will be useful to look at option characteristics, trading strategies, and risk considerations. We will then be in a better position to examine volatility in greater detail. eo 5 & Using an Option’s Theoretical Value From a theoretician’s point of view, the Black-Scholes Model represents a novel solution to a complex problem. The model requires a limited number of inputs and relatively simple mathematical calculations. These factors have made the Black-Scholes Model the most popular of all option pricing methods. While a trader might appreciate the elegance of the mathematics, itis still the actual performance of the model in the marketplace which is his primary consideration. Is it really possible to profit from price discrepancies between model-generated values and the market prices of options? To see how the model is intended to function, let us make two assumptions: 1. The price distribution of an underlying contract is accurately represented by a lognormal distribution. 2. We actually know the future volatility of an underlying contract. Clearly, the second assumption is not very realistic since we obviously don’t know the future. As we shall see later, the first assumption is also highly questionable. But for the time being, rather than focus on the assumptions in the model, we want to focus on its use by a trader. If we make these assumptions, and the Black-Scholes Model does indeed work, then we ought to be able to turn any difference between an option’s price and its theoretical value into a profit. How should we go about doing this? Suppose that a series of options are available on a certain futures contract with the following conditions: June futures price = 101.35 Interest rate = 8.00% Time to June expiration",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.427903"
}