{
  "id": "57d0f16098b3",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 1,
  "content": "11.5 −7.0 * All returns are gross (i.e., returns exclude management and incentive fee deductions in cases where return figures are based on managed accounts). Annual returns include compounding of monthly returns except for accounts traded at constant fixed notional level for the entire year. ** Largest percentage decline from prior equity peak based on month-end data. Note: The data in this table has not been audited, and insofar as any of the traders included might manage assets other than their own, this data should not be relied upon for any investment decisions. 8 futures traders part 9 Peter Brandt Strong Opinions, Weakly Held Three years later Since our interview several years ago, have there been changes in the way you trade? I’ve always been quick to close losing trades, but ever since our interview I have become uber-obsessed with risk management. I have done this in two ways: by reducing my maximum risk per trade to 50 to 60 basis points, and by bleeding off risk as quickly as possible. I’ve become more aggressive in advancing protective stops on at least half of my position. Stops are often moved the same day of the trade, with the idea of having a breakeven trade on half the position within a few days. You reference becoming even more extreme in your risk management since our interview. Is this timing coincidental, or was it somehow related to the interview? If you talk about your trading for an entire day like I did with you, a bit of self-discovery takes place in the process of talking. At some point afterward—I don’t remember exactly when—I analyzed my trades going way back. In line with the Pareto principle, I found that almost all my profits came from 15% of my trades. So that means my goal as a trader must be to make sure the other 85% of my trades come as close 10 as possible to a net zero performance, thereby allowing the 15% to put in the bottom line. But there is a trade-off. If you tighten your risk control to further limit the loss in losing trades, you will also change the percentage of meaningful winning trades. As a result of tighter stops, you would turn some of those winners into losers. That’s true, but I did look at whether there was something behaviorally different about the 15% trades versus the other 85%, and there was. What was that difference? The significant winning trades worked immediately. For example, last year, I had 17 trades that contributed to almost my entire bottom line. Fourteen of those 17 trades never had a losing close. The other three had a closing loss for only one or two days. Sure, some of the trades that were stopped out eventually did work. But the 17 significant winners were behaviorally different. They broke out and went. I never had to grind through a losing period with them. Any other changes in your trading? One new thing I have started doing—and I have no idea how it’s going to work out—is adding a third tranche on those trades that are also triggered by weekly chart patterns. If a trade that is triggered on the daily chart isn’t also clear on the weekly chart, then I’ll have just two tranches—one tranche that I trade with tighter stops than the other. I give more leeway to the third tranche, which is triggered by the weekly chart, than the other two tranches that characterize my normal trading process. I am attracted to the idea of using weekly charts to signal trades because I had committed to my wife and kids that I would be done with trading in 2025, the 50-year anniversary of when I first went to the Chicago Board of Trade. But I still want to trade. So my thinking is that if I could switch to trading just on weekly charts, I could continue trading without it interfering with anything else. Rather than suddenly switch from daily to weekly charts in 2025, I am starting to experiment with the idea now to give myself a couple of years to see if I can make trading on weekly charts work—and I am not sure I can. 11 If I am stepping back my trading activity from daily to weekly, I wouldn’t expect a rate of return anywhere near what I average now. But I’d be OK if I could make only 10%–15% a year, not that I ever have a return target because I think that is stupid. Stupid because you don’t know what opportunities the market will provide? Exactly. As a trader, your goals should be process-oriented, not return-oriented. I noticed you have built up a large Twitter following. Which of your tweets has gotten the biggest response? Some of my largest responses have been to tweets with single-sentence trading advice. Some examples: “Don’t carry a position over the weekend if it shows a loss on the Friday close.” “Don’t risk more than 1% of your capital on any trade.” In one of your tweets, you refer to a market being in a “chair-and-ottoman” pattern. Was that a spoof, or were you being serious? No, it’s not a spoof. I first saw the pattern in a sugar chart years ago. I thought to myself, “What the heck is that?” Edwards and Magee, and Schabacker, had nothing to say about that pattern. So, I made up the name myself. What is a recent example of the chair-and-ottoman pattern? A recent example was a chair-and-ottoman bottom in gold. The chair was formed between September 28 and October 21 [2022]. The ottoman formed between October 21 and November 4 when gold broke out on the upside of the pattern, which is when I went long. I was bullish on gold anyway. Why was that? The bearish sentiment in gold was very high. The Commitment of Traders report showed that at the gold low in late September 2022, commercials had their smallest short",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management"
  ],
  "created_at": "2026-02-05T00:37:44.178558"
}