{
  "id": "26869c946ad2",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 12,
  "content": "l y to fi n d t h at t h e strategies you use to contro l unp l easant t h oug h ts an d f ee l ings d o h ave some short‐term benefi t. They tend to quickly alleviate the strong emotions. When a person is f ear f u l o f a l oss, f or examp l e, c l osing t h e tra d e provi d es imme d iate re l ie f o f t h e f ear b ecause t h e t h reat o f t h e l oss h as b een d isc h arge d . A tra d er h ot an d angry a f ter h er stop h as b een ta k en out d irect l y satis fi es h er d esire f or revenge b y jumping b ac k into t h e mar k et. But t h ese imme d iate b ene fi ts ring h o ll ow w h en we consi d er t h at on l y emotions are satis fi e d an d l itt l e e l se is accom pl is h e d . T h ose w h o d o t h is exercise fi n d t h at t h eir contro l strategies are emp l oye d in the service of their emotions , not in the service of theirs tra d ing. T h is b ecomes c l ear w h en t h ey l oo k at t h e d isa d vantages an d costs invo l ve d an d compare t h ese against l onger‐term b ene fi ts. For most tra d ers, d isa d vantages inc l u d e misse d tra d es an d f or f eite d pro fi ts as we ll as f ee l ing d iminis h e d in some way f or no t executing tra d es proper l y an d stic k ing to t h eir p l ans. Most fi n d no l ong‐term b ene fi t in attempting to contro l t h eir un d esira bl e t h oug h ts an d emotions. Ta bl e 3.2 summarizes some traders’ res p onses to the costs and benefi ts form in Exercise 3.2. When we start to look closely at exertin g psycholo g ical control over unwanted t h ou gh ts an d emotions, we b e g in to rea l ize t h at it is actua ll y quite d ys f unctiona l to our tradin g . Jamie, a trader who consistently cut winnin g trades short, had this to say about doin g the above exercise: I never rea l ize d I was s h ootin g myse lf in t h e f oot. I mean, w h o wants to h ave a loss? No one, of course. But this became the all‐encompassin g TABLE 3.2 What Other Traders Say Are A dvantages and Disadvantages of Psycho- logical Control Disadvantages Advantages Misse d su b stantia l pro f it Al ways cutting pro f its s h ort T emporary re l ie f f rom stress Missed choice trade setup s D on’t trust my system; losing confidence in my self Did not have to confront my f ear Cance ll e d or d ers an d misse d goo d tra d e s Se lf ‐ima g e is poo r Feel l i ke a fa i lu r e No self ‐esteem Sto pp e d t h e stress—unti l t h e ne x t t r ade T h ousan d s l ost in pro f its F ai l ing to d eve l op se lf as a t ra d er Ab so l ute l y none excep t avoi d ing d ea l ing wit h my gree d Loss o f incom e D epressio n N o l ong‐term b ene f its note d Another setback to sticking to my rules L ac k o f lif e b a l a n ce Fee l b ette r in t h e s h o r t t erm, but long term I am no t achieving what I wan t 77THE STRUGGLE TO CONTROL AND ELIMINATE EMOTIONS th ou gh t I h a d w h enever I put on a tra d e. I just cou ld n ’t h ave a l oss. I th ou gh t it wou ld b e terri bl e. I l ost f ocus. I wasn ’t rea d in g t h e mar k e t or mana g in g my position. My b o d y ti gh tene d up. I f e l t l i k e I was in a vise. Eac h time I g ot into a tra d e, I f e l t overw h e l me d . Everyt h in g was centered on avoidin g a loss. The relief came when I closed the t rade. Then I could relax and feel like I could g et out from under the pressure coo k er. But t h en I f e l t b a d a ll over again. I wasn ’t tra d ing. I wasn ’t getting any b etter. I wasn ’t ma k ing money . I f e l t l i k e I ’d never b ecome com p etent. Jamie is d escri b",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:45.718721"
}