{
  "id": "35a9c13776a2",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 6,
  "content": "it is faster, and it has full customer support from the vendor. It is ideal for test- ing strategies that involve a large portfolio of stocks. (Imagine backtesting a strategy involving 1,500 symbols on Excel—it is Chan800064_c03.indd 34 6/7/2021 2:04:48 PM Backtesting 35 possible, but quite painful.) It has numerous advanced statistical and mathematical modules built in, so traders do not have to rein- vent the wheel if their trading algorithms involve some sophis- ticated but common mathematical concepts. (A good example is principal component analysis—often used in factor models in statistical arbitrage trading, and a hassle to implement in other programming languages. See Example 7.4.) Supplementary tool- boxes (which cost about $50 each) such as Statistics and Machine Learning, Econometrics, and Financial toolboxes are particularly useful to quant traders. There is also a large number of third-party freeware available for download from the internet, many of them very useful for quantita- tive trading purposes (an example is the cointegration package used in Example 7.2). Finally, MATLAB is very useful in retrieving finan- cial information from various websites. Example 3.1 shows how this can be done. Despite the seeming sophistication of the platform, it is actu- ally very easy to learn (at least for basic usage), and it is very quick to write a complete backtest program using this language. It is also inexpensive: the home version costs about the same as Micro- soft Office. You can use MATLAB for live trading, too, if you purchase its Trading Toolbox, or if you purchase a third-party toolkit, such as that from undocumentedmatlab.com. I will include MATLAB codes for all the backtesting examples in this book as well as provide a quick survey of the MATLAB language itself in the appendix. Example 3.1: Using MATLAB to Retrieve Yahoo! Finance Data MATLAB is not only useful for numerical computations but also for text parsing. Following is an example of using MATLAB to retrieve a stock’s historical price information from Yahoo! Finance. First, copy the file getMarketDataViaYahoo.m from github.com/Lenskiy/market-data-func- tions and save it to your local folder. Then save the following code as example3_1.m to your local folder, too: Chan800064_c03.indd 35 6/7/2021 2:04:48 PM 36 QUANTITATIVE TRADING Python Python has now taken over MATLAB to become the de facto backtesting language, especially after the numpy and pandas packages became available. With these packages, you can manip- ulate arrays and time series data just like you do in MATLAB. Python benefits from a large number of third-party packages for specific applications. There is Scikit-learn for machine learning, plotly for interactive data visualization, and seaborn for plotting, just to name a few most commonly used ones. While Python has almost any packages that you need for finance and trading, it is not without flaws: 1. Version conflicts abound. Even with my team of professional software developers (one of them has sold his software firm % Example 3.1: Download data from Yahoo initDate = '1-Sep-2020'; symbol = 'AAPL'; aaplusd_yahoo_raw = getMarketDataViaYahoo(symbol, initDate); aaplusd_yahoo= timeseries([aaplusd_yahoo_raw.Close, aaplusd_yahoo_raw.High, aaplusd_yahoo_raw.Low], datestr(aaplusd_yahoo_raw(:,1).Date)); aaplusd_yahoo.DataInfo.Units = 'USD'; aaplusd_yahoo.Name = symbol; aaplusd_yahoo.TimeInfo.Format = \"dd-mm-yyyy\"; figure, plot(aaplusd_yahoo); legend({'Close', 'High', 'Low'},'Location', 'northwest'); disp(aaplusd_yahoo_raw.Close) This program file example3_1.m is available for download from epchan. com/book, with “sharperatio” as both username and password. You can easily modify this code to download as many tickers as you like. This program requires the getMarketDataViaYahoo function to work. That .m file can be downloaded from www.mathworks.com/matlabcentral/ fileexchange/68361-yahoo-finance-and-quandl-data-downloader. (You should save it in the same folder as example3_1.m.) Chan800064_c03.indd 36 6/7/2021 2:04:48 PM 8 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 38 QUANTITATIVE TRADING R I have used R as the language for teaching my Financial Risk Ana- lytics course at Northwestern University’s Master’s in Data Science program, which covered everything from time series analysis to cop- ulas. It is a great language if you want to use classical statistical and econometric analyses for your trading (and there is nothing wrong with that!). That is because many academic statisticians and econo- metricians have implemented their algorithms in R. There aren’t as many implementations of machine-learning algorithms as Python or MATLAB. However, I recommend you do not use machine learning if you are creating a new trading strategy, and use ML only for improving your strategy (for reasons explained in Chapter 2 and in more depth at predictnow.ai/finml). Hence, R is a good language for this initial step of strategy exploration, though not as good as MATLAB since its IDE (RStudio) is also free, and, dare I say, primitive. Naturally, like Python, it also comes with zero support. If you want to learn R, Example 3.1: Using Python to Retrieve Yahoo! Finance Data Following is an example of using Python to retrieve a stock’s historical price information from Yahoo! Finance. First, run pip install pandas_datareader on your Anaconda prompt. Then save the following code as example3_1. py to your local folder: % Example 3.1: Download data from Yahoo from pandas_datareader import data as pdr def test_yfinance(): for symbol in [‘AAPL’, 'MSFT', 'VFINX','BTC-USD']: print(\">>\", symbol, end=' ... ') data = pdr.get_data_yahoo(symbol,st art='2020-09-25', end='2020-10-02') print(data) if __name__ == \"__main__\": test_yfinance() This program file example3_1.py is available for download from epchan. com/book, with “sharperatio” as both username and password. You can easily modify this code to download as many tickers as you like. Chan800064_c03.indd 38 6/7/2021 2:04:48 PM 9 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Backtesting 39 there is an elegant and very readable little book by Jonathan Regen- stein (Regenstein, 2018)",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.604220"
}