{
  "id": "d2239db8cff2",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 72,
  "content": "may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c08 JWBT634-Grimes May 10, 2012 7:48 Printer: Hamilton Printing Trade Management 243 FIGURE 8.4 The Same Market, with Partial Exits at the Two Worst Points Early in the Trade Adding to Existing Trades There are a few different schools of thought on whether to add to existing trades. Be sure to separate these additions from the case of a normal, planned trade entry done in pieces. The normal scaling-in entry (if that is in your trading plan) is usually done as the trade moves against you, and with the idea of accumulating a maximum intended position size against a clear risk level. These additions are different from additions that come after the initial entry has already reached its maximum size, and they may or may not come after partial proﬁts have been taken. In some cases, you may add to a full-size trade and so have on two or more times your expected exposure. In other cases, you may book partial proﬁts (or losses) on an existing trade, and then add back only enough size to get back to your initial trading size and risk. There are too many possibilities here to consider every possible scenario, but let’s consider some arguments for and against a few scenarios. Never Add to an Existing Trade Some trading systems are designed to simply enter on a set of criteria and exit on another set of criteria. In these systems, all we are 1,100 1,050 1,000 950 900 - Market -P&L 110 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c08 JWBT634-Grimes May 10, 2012 7:48 Printer: Hamilton Printing 248 TRADING STRATEGIES FIGURE 8.5 A Stop Under the Previous Day’s Low Is Appropriate in a Parabolic, Runaway Trend often justiﬁes working very tight stops. Figure 8.5 shows a daily chart of Silver futures, which, after an already extended uptrend, broke into a parabolic expansion. A trader holding a long position in a runaway trend like this could have worked a stop each day below the previous day’s lows. In this example, assume that the trade was entered some- where around A on the chart; if you were working a stop under the previous day’s low, it would not have been hit until the point marked C, the day after the extreme high of the run-up. This is a very aggressive stop technique that crosses the line into a proﬁt-taking exit. Basically you are asking for the market to take you out of the position with a slight downtick so you can book the proﬁt, but you are also leaving yourself open to continued upside in the unlikely event the market extends further. You want your stop to be hit in this case. Parabolic trends are a special example because they often carry very high risk of sharp reversals from climax points. Traders who are fortunate enough to be holding heavy exposure into such a move can become emotional and excited as they extrapolate the move into inﬁnity, and this time of extreme emotion often results in very poor deci- sions. Use tight stops on at least part of the position to remove the emotional component from the decision process in parabolic trends. P1: OTA JWBT634-c08 JWBT634-Grimes May 10, 2012 7:48 Printer: Hamilton Printing 254 TRADING STRATEGIES Monitoring Tools Another point to consider is how often you will look at your positions. If you are an intraday trader, you must be present at the screen every moment of the trading day. You will eat lunch at the screen and will reduce your break time to the bare minimum necessary for taking care of bodily functions, and there will be days you will even skip those. One of the advantages of being a trader with a longer time horizon is that it is acceptable to monitor your positions less frequently. For instance, a two-day to two- week swing trader can legitimately check in on her positions two or three times a day, perhaps on the open and again near the close, if there is a system in place for monitoring and catching unusual moves in her markets. Longer-term investors may well check in on their portfolios once a week, but it still behooves them to check daily for large and unusual moves in their holdings or in related markets. It is much easier to do this with some basic infrastructure in place to support these functions. Position/Risk Sheet Figure 8.6 shows an example of a daily risk and P&L sheet. For most traders, this is perhaps the most important daily record. After each session close, it serves the purpose of reviewing and summarizing the day’s P&L and of measuring the intended risk for the next session. While the market is actually open, the stop levels and risk information on this sheet are important reminders and guides for behavior. Most traders get into trouble when they ignore risk parameters and end up taking large losses that are multiples of intended risk. Having this document and committing to following it religiously will insulate the trader from some of these catastrophic losses. Figure 8.6 is only an example showing the simplest and most basic information needed on this sheet. You can take this model and elaborate on it to ﬁt your style and your needs. Though some of the ﬁelds are self-explanatory, this sheet is extremely important, so it is worth the time to go through it in some detail: r DateIn: This is the initial entry date of the",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.706657"
}