{
  "id": "7cfadce9cee7",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 108,
  "content": "for 8.00, sells two 100 calls at 4.80, and purchases one 1 05 call for 1.60, he has bought the 95/100/105 butterfly for zero since: (2 x 4.80) — (8.00 + 1.60) = 9.60 — 9.60 = 0 Since a butterfly can never be worth less than zero at expiration, and in this case might be worth as much as five points, the purchase of this butterfly represents a riskless trading opportunity. Another way of reaching the same conclusion is to realize that a butterfly is made up of two consecutive vertical spreads. In our example, the purchase of the 95/100/105 butterfly consists or purchasing the 95/100 vertical call spread and selling the 100/105 vertical call spread. We know that as the market rises, a vertical call spread goes more deeply into-the-money and becomes more valuable. Therefore, as long as there is an equal amount between exercise prices, a vertical call spread with lower exercise prices will always be more valuable than a vertical call spread with higher exercise prices. The opposite is true of vertical put spreads. Those with higher exercise prices are always more valuable than those with lower exercise prices. If two vertical spreads violate this relationship, a trader can take advantage of the situation by 236 Chapter 11 purchasing the spread which ought to be more valuable, and selling the spread which ought to be less valuable. In our example, the vertical call spreads are: 95/100 spread 8.00 — 4.80 3.20 100/105 spread 4.80 — 1.60 3.20 While both spreads are trading at the same price, the 95/100 spread is intuitively more valuable than the 100/105 spread. Consequently, a trader will try to purchase the 95/100 spread and sell the 100/105 spread. If he succeeds, he will have purchased the butterfly for zero. While there is no guarantee that this will be profitable (the underlying market could finish below 95 or above 105), the strategy still makes sense because there is no risk associated with it. Consider a different type of relationship: od Underlying price = 99.75 Interest rate = 0 95 100 105 calls: 6.85 3.70 1,10 puts: 2.10 3.95 6.35 First, we might check to make sure that all the synthetic relationships balance. Since they do, there is no profit opportunity there. Next, we might check the butterflies. Both the call and put butterflies are trading for 55. This might or might not be a reasonable price; without a theoretical pricing model it would be difficult to say. But at least the butterflies are trading for some positive number, so it is not immediately apparent that they represent a good trading opportunity. Is there any other logical relationship that might be violated? Look at the prices of the straddles: 95 100 105 call + put: 8.95 7.65 7.45 We know that a straddle becomes more valuable as the underlying price moves away from the exercise price, resulting in one side of the straddle, either the call or put, going more deeply into-the-money. With the underlying price at 99.75, the 95 straddle should be more valuable than the 100 straddle, and this is reflected in the respective prices of 8.95 and 7.65. The 105 straddle, being further away from 99.75, should also be more valuable than the 100 straddle. But here the prices do not reflect the additional value. The 105 straddle is .30 cheaper than the 100 straddle. Even though we don’t know the theoretical value of either the 100 or 105 straddle, we do know that the 105 straddle is too cheap with respect to the 100 straddle. Therefore, if given the opportu- nity, a trader would attempt to purchase the 105 straddle at 7.45 and sell the 100 straddle at 7.65. There is no guarantee that this strategy will be profitable. The underlying contract could finish above 105, in which case the 100 straddle will be worth five points more than the 105 straddle. But if we assume that movement is random, then the sale of the 100 straddle and the purchase of the 105 straddle puts the laws of probability heavily on the trader’s side. Option Arbitrage 237 Finally, consider this scenario: Underlying price = 100.75 Interest rate = 0 95 100 105 March calls: 7.50 3.85 2.35 June calls: 9.65 5.70 3.30 Is there any apparent mispricing here? First, we might look at the butterflies. The March butterfly is trading for (7.50 + 2.35} - (2 x 3.85) = 2.15. The June butterfly is trading for (9.65 + 3.30) - (2 x 5.70} = 1.55. Since both butterflies are trading for some positive amount, it isn’t immediately clear that we should buy or sell either one? What about the prices of the butterflies with respect to each other? Should the June butterfly, at 1.55, be less expensive than the March butterfly, at 2.15? It may seem that the June butterfly, with more time to expiration, ought to be more expensive. In option evaluation we usually associate more time with greater value. But if the market remains at 100.75, the price of the butterfly will expand towards 4.25 as time passes. Hence, it is logical that the March butterfly is more valuable than the June butterfly. Is there any other relationship we might consider? When we see options with different expiration dates, time spreads certainly come to mind. 95 100 105 June call less March call: 2.15 1.85 95 Is there anything wrong with these prices? We know that a time spread maintains its greatest value with the underlying contract at the exercise price. The 100 time spread, being more at-the-money, is trading for more than the 105 time spread, as one would expect. The 100 time spread should also be more valuable than the 95 time spread. Here the 95 time spread is trading at a greater price, and, again, if we assume random movement in the underlying contract, this is clearly not logical. Without a theoretical pricing model, we can’t be sure what each of these spreads is worth.",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.438806"
}