{
  "id": "f253d8e1755f",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 195,
  "content": "IL 1991; 222 p. Colburn, James T. Trading in Options on Futures (futures) The New York Institute of Finance; New York, NY 1990; 310 p. Frost, Ronald J. Options on Futures, Revised Edition (futures) Probus Publishing Co.; Chicago, IL 1994; 254 p. Fullman, Scott H. Options: A Personal Seminar (stocks) New York Institute of Finance; New York, NY 1992; 373 p. 459 460 Hexton, Richard Dealing in Traded Options (stocks) Prentice-Hall International Ltd.; Hertfordshire, UK 1989; 192 p. Luft, Carl F.; and Sheiner, Richard K. Understanding and Trading Listed Stock Options, Rev. Ed. (stocks) Probus Publishing Co.; Chicago, IL 1994, 231 p. Mayer, Terry S. Commodity Options (futures) New York Institute of Finance; New York, NY 1983; 300 p. McMillan, Lawrence G. Options as a Strategic Investment (stocks) The New York Institute of Finance; New York, NY Third Edition, 1993; 882 p. The Options Institute (editor) Options: Essential Concepts and Trading Strategies (stocks) Business One Irwin; Homewood, IL 1990; 403 p. Smith, Courtney Option Strategies (stocks) John Wiley & Sons, Inc.; New York, NY 1987; 256 p. Thomsett, Michael C. Getting Started in Options (stocks) John Wiley & Sons, Inc.; New York, NY 1989; 229 p. Walker, Joseph A. How the Options Markets Work (stocks) New York Institute of Finance; New York, NY 1991; 229 p. Wasendorf, Russell R.; and McCafferty, Thomas A, All About Options Probus Publishing Co.; Chicago, IL 1993; 213 p. Appendix F Recommended Reading 461 INTERMEDIATE BOOKS Baird, Allen Jan Option Market Making (futures) John Wiley & Sons, Inc.; New York, NY 1993; 201 p. Bookstaber, Richard M. Option Pricing and Investment Strategtes (stocks) Third Edition Probus Publishing Co.; Chicago, IL 1991; 300 p. Bookstaber, Richard M.; and Clarke, Roger G. Option Strategies for Institutional Investment Management (stocks) Addison-Wesley Publishing Co., Inc.; Menlo Park, CA 1983; 168 p. Clasing, Henry K, Jr.; Lombard, Odile; and Marteau, Didier Currency Options (currencies) Business One Irwin; Homewood, IL 1992; 270 p. Denning, Hugh Equity Options: Valuation, Trading & Practical Strategies (stocks) Longman Professional; Melbourne, Australia 1991; 183 p. DeRosa, David F. Options on Foreign Exchange (currencies) Probus Publishing Co.; Chicago, IL 1992; 272 p. Fabozzi, Frank J. Winning the Interest Rate Game: A Guide to Debt Options (interest rates) Probus Publishing Co.; Chicago, IL 1985; 300 p. Fabozzi, Frank J. The Handbook of Fixed-Income Options (interest rates) Probus Publishing Co.; Chicago, IL 1989; 657 p. Figlewski, Stephen; Silber, William L.; and Subrahmanyam, Marti G. (editors) Financial Options: From Theory to Practice Business One Irwin; Homewood, IL 1992; 579 p. 462 Fitzgerald, Desmond M. Financial Options (stocks) Euromoney Publications; London, England 1987; 262 p. Gastineau, Gary The Options Manual (stocks) McGraw Hill; New York, NY Third Edition, 1988; 440 p. Gemmill, Gordon Option Pricing: An International Perspective McGraw-Hill; London 1993; 267 p. Kolb, Robert W. Options: The Investor’s Complete Toolkit (stocks) New York Institute of Finance; New York, NY 1991; 216 p. Labuszewski, John W.; and Nyhoff, John E. Trading Options on Futures (futures) John Wiley & Sons, Inc.; New York, NY 1988; 264 p. Labuszewski, John; and Sinquefield, Jeanne Inside the Commodity Option Markets (futures) John Wiley & Sons, Inc.; New York, NY 1985; 384 p. Smith, A.L.H. Trading Financial Options Butterworths; London, England 1986; 200 p. Sutton, W. H. Trading Currency Options (currencies) The New York Institute of Finance; New York, NY 1988; 208 p. Tompkins, Robert Options Explained (futures/interest rates) MacMillan Publishers Ltd.; Basingstoke, Hants, England 1991; 301 p. Wong, M. Anthony Trading and Investing in Bond Options (interest rates) John Wiley & Sons, Inc.; New York, NY 1991; 262 p. Appendix F Recommended Reading 463 ADVANCED BOOKS Brenner, Menachem (editor) Option Pricing: Theory and Applications (stocks) Lexington Books; Lexington, MA 1983; 235 p. Cox, John C.; and Rubenstein, Mark Options Markets (stocks) Prentice-Hall; Englewood Heights, NJ 1985; 498 p. Gibson, Rajna Option Evaluation: Analyzing and Pricing Standardized Option Contracts McGraw-Hill, Inc.; New York, NY 1991; 304 p. Hodges, Stewart (editor) Options: Recent Advances in Theory and Practice Manchester University Press; Manchester, England 1990; 181 p. Hull, John C. Options, Futures, and Other Derivative Securities Prentice-Hall, Inc.; Englewood Cliffs, NJ 2nd Edition, 1993; 492 p. Jarrow, Robert; and Rudd, Andrew Option Pricing (stocks) Dow Jones-Irwin; Homewood, IL 1983; 235 p. Ritchken, Peter Options: Theory, Strategy and Applications (stocks) Scott, Foresman and Co.; Glenview, IL 1987; 414p. Index +A & Adjustment, 84, 168-169, 193-195 American Stock Exchange, 6n, 303 Assignment, 4-6, 224-225 Arbitrage, 218, 456 ARCH Model, 280 Atthe-money. See Option, at-the-money + Be Backspread, 138-139, 145, 200, 452 intermarket, 338 Backwardation, 129 Barone-Adesi, Giovanni, 248, 438n Beckers, Stan, 66n, 397n, 400n Binomial tree, 435 Black, Fischer, 40n, 43, 431n, 432n Bollerslav, T., 281n Box, 228-231, 254, 456-458 Burghardt, Galen, 275n Butterfly, 145-148, 235-236, 452, 458 body of, 145n bull and bear, 201 wings of, 145n Buy/write, 261 % C % Calendar spread. See Time spread Cap, 265 Carrying costs, 38, 41-42, 111, 221-223, 249-250, 436. See also Interest rates Chicago Board of Trade (CBOT}, 2, 6n, 128, 129, 134 Chicago Board Options Exchange (CBOE), 2, 43, 120, 197, 231, 323, 329n, 343 Chicago Mercantile Exchange (CME), 2, 120, 133, 272, 323, 324n Chicago Stock Exchange, 303, 327n Christmas tree, 157-158 Clearing firm, 8-9 Clearing house, 8-9 Collar, 265 Commodity Exchange, Inc. (COMEX}, 105, 128, 131 Condor, 158 Contango relationship, 128 Contingency order, 170 Contract position, 360 Conversion, 217-219, 456 Conversion/reversal market, 219. See also Synthetic market Covered write, 260-262 Cox, John, 248, 400n, 434n Curvature. See Gamma Cylinder, 264 & D& Delta, 82, 99, 359-360 American vs. European option, 250, 253 as a condition for early exercise, 246- 248 as a probability, 102 as arate of change, 99 as an equivalent underlying position, 101-102 characteristics, 118 dollar ($delta), 332 effect of price change. See Gamma effect of volatility change, 106, 110, 210 465 466 effect of time passage, 106, 110 implied, 120 of an index futures contract, 311-312 tisk, 179, 353 Delta neutral, 82, 106, 110, 137, 159, 199,227 Diagonal spread, 157, 201n Diffusion process, 394-395 Distribution,",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "market_structure",
    "strategies",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.452345"
}