{
  "id": "9f4fc2df41b5",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 1,
  "content": "451 x Table of Contents “ Appendix E # Synthetic and Arbitrage Relationships 453 Arbitrage Values for European Options (no early exercise permitted} 455 Other Useful Relationships: 456 “ Appendix F + Recommended Reading 457 Elementary Books 457 Intermediate Books 459 Advanced Books 461 Index + 463 « Preface to the First Edition Within the last decade trading options has increased at an explosive rate. Not only have traditional market participants, speculators, hedgers, and arbitrageurs all become ac- tively involved in option markets, but the number of individual floor traders willing to risk their own capital in these markets has grown dramatically. Yet the trader entering an option market for the first time may find that his initial efforts are less than totally successful. Indeed, the learning period in options during which a trader gains full confidence in his ability to survive and thrive under all types of market conditions may require many months or even years of trading experience. Unfortunately, the great majority of traders do not survive this learning period. The usual characteristics of options, the subleties of the marketplace, and the unforseen risks, all seem to conspire against the inexperienced trader and eventually lead to his demise. Much of the pain experienced by a new trader could be avoided if the trader were better prepared for the realities of option trading. Unfortunately, existing option litera- ture has tended to take either a highly theoretical approach best suited to an academic environment, or a simplistic approach presenting options as just another way of trading stocks or commodities. Neither approach is likely to meet the needs of the serious trader. The former approach is not only mathematically beyond the capabilities of most traders, but relies heavily on theoretical assumptions which are too often violated in the real world. The latter approach cannot possibly prepare a serious trader for the wide variety of strategies with which he must be familiar, nor with the very real risks to which he Will be exposed. This book was written with the hope of filling the void in the traditional option literature by combining theory and real-world practice. Moreover, it was written Primarily with the serious trader in mind. This includes traders whose firms are actively Involved in option markets, either by choice or by necessity, or individual traders who wish to make the most of the opportunities offered by options. This is not meant to discourage those who are casually or peripherally involved in options markets from Teading this book. Additional insight into any subject is always worthwhile. But understanding options requires substantial effort. The serious trader, because his livelihood often depends on this understanding, will usually be more willing to invest the time and energy required to attain this goal. ; In Preparing the reader for the option marketplace, the author has tried to combine an intuitive approach to option theory with a discussion of the real-life problems with Which he will be confronted. Of course, the reader who is comfortable with mathemat- Cs is in no way discouraged from delving more deeply into the theory of option pricing xi xii Preface in many of the excellent academic presentations of the subject. But the important point is that such a rigorous opproach is not necessary for success in option trading. Indeed, the great majority of successful option traders have never even looked at a mathematical presentation of option theory. Nor would many of them be capable of understanding the complex mathematics if they did. Much of the presentation in this book will necessarily be colored by the author’s personal experiences as a floor trader. Sophisticated hedging strategies, such as portfolio insurance, and complex intermarket spreading strategies are touched upon only briefly, if at all. Yet the principles of option evaluation which enable a floor trader to successfully participate in an option market are the same principles which will enable any participant to make the best use of options, regardless of the reasons for entering the market. Additionally, the author is able to place special emphasis on a lesson which floor traders quickly learn but which casual traders too often forget. Without a very healthy respect for the risks of option trading and a full understanding of risk management techniques, today’s profits can quickly turn into tomorrow’s losses. Because of the more recent introduction of listed options on futures contracts and the increased interest in these markets, the author has tended to concentrate the examples in the text on these options. However, the principles which lead to success in futures options are equally valid in commodity, stock, and index option markets. The core material in this book was developed in classes taught by the author to traders at the Chicago Board of Trade. In expanding the material into book form the author has tried to draw on a wide variety of other sources. Foremost among these are the many floor traders who offered their comments and criticisms. In addition, special thanks go to Greg Monroe of the Chicago Board of Trade Education Department and Mark Rzepczynski of the Chicago Mercantile Exchange Research Department for their comments on the text, and to David Isbister of Monetary Investments International for preparation of some of the values used in the tables. Finally, my thanks to the staff at Probus Publishing for their encouragement, patience, and assistance in dealing with a first time author. Sheldon Natenberg Chicago uy « Preface to the Second Edition + In 1986, when I first discussed with Probus Publishing the idea of an option book for professional traders, there was considerable doubt as to whether there would be sufficient interest to justify publication of such a book. After all, how many professional option traders are there? To everyone’s (pleasant) surprise, when the book came out not only did it turn out that a large number of professionals were purchasing the book, but many non-professionals also seemed to be very interested in this approach. The revised edition is no different in its focus.",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "risk_management",
    "fundamentals",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.422168"
}