{
  "id": "ba98fb88e159",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 77,
  "content": "separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing Risk Management 277 principle of “risk more, make more” is technically true, as you can see from the mean terminal values for the 10, 12, and 25 percent risk levels in the table, the declining me- dians tell a different story. We cannot see it in the table, but the distribution of these ending balances becomes unacceptable, and the payoff of our well-considered positive expectance trading strategy starts to look more like a lottery ticket as we risk a higher percentage of the account. Do not be misled by the sheer size of the winners, because, as you know by now, the extremely low probabilities associated with those outcomes moderate the expected value. There is one last important thing to consider. Many traders like to change their bet size based on any number of factors. This can be a well-thought-out and disciplined el- ement of a trading strategy or of trading certain markets. For instance, it might make sense to trade certain kinds of patterns on smaller risk (for instance, the failure tests in Chapter 6), and some traders might want to approach illiquid markets with smaller risk. Too many discretionary traders make emotional decisions about risk without any real analysis, varying their risk based on their impressions of how good a trade is likely to be. If you are making emotional decisions about risk, you are almost certainly making sub- optimal decisions. If you are going to intervene and meddle with position sizing and risk, it is important that you do two things: One, understand the impact of random sizing on a system and a strategy. Two, keep careful records and do objective analysis to be sure that your actions are actually adding something of value compared to the unadjusted position sizing rules. Table 9.6 shows the effect of randomly changing the bet size on each trade. The 4 percent column is reproduced from Table 9.5 for comparison, and then three other tests were run where each bet size was a random value between 0 and 8 percent ( ∼Uniform [0, 8%]). On average, the random bets were still 4 percent, but they varied between 0 percent, where the trader skipped the trade altogether, to 8 percent, where the trader sized up and took on double risk. Notice that in all cases, the randomly sized bets underperformed the simple ﬁxed fractional 4 percent. Of course, it does not have to be that way. The TABLE 9.6 Examples of the Eﬀect of Randomly Varying Bet Sizes 4% Rand1 Rand2 Rand3 Nonrandom [0%–8%] [0%–8%] [0%–8%] Mean Terminal Value 263,545 262,190 257,249 254,106 Median Terminal Value 222,225 192,474 198,389 187,049 Std Dev of Terminal Value 193,846 239,548 211,231 220,697 Coeﬃcient of Variation 0.74 0.91 0.82 0.87 Mean of Max Value 316,875 333,660 326,773 324,438 Mean of Min Value 79,046 74,116 74,063 73,836 Highest Terminal Value 1,670,569 2,062,297 1,886,388 2,001,251 Lowest Terminal Value 29,561 14,833 18,562 20,599 Percent Terminal DD ≥75% 0.0% 0.4% 0.2% 0.3% Percent of Accounts Bankrupt 0.0% 0.0% 0.0% 0.0% P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing Risk Management 279 There are many possibilities and choices to be made in position sizing. For the self- directed discretionary trader, this is an important element of the trading plan that de- serves careful consideration and study. THEORETICAL PERSPECTIVES ON RISK Mathematically, risk is part of the expected value function, and can be deﬁned as: Risk = Probability of loss × Expected size of loss Though this is a simple equation, there is a profound truth hidden here: the key to properly understanding risk is that the magnitude of the risk depends on both the prob- ability and the size of the loss (see Figure 9.3). Risks that are very rare and also carry no serious consequences are usually insigniﬁcant and can be ignored. However, make sure the consequences are really as small as you think they are; it is easy to miscal- culate because these events are infrequent. In addition, consequences are not always consistent—is it possible that there is a small subset of these events that carry more serious outcomes? Risks that are common with low consequences demand careful at- tention and scrutiny. Traders tend to ignore these risks because they are clearly deﬁned and seem small enough to be insigniﬁcant, but a large number of these can eat away at a trading account over time. Examples of these kinds of risks in trading might be normal slippage and transaction costs. High-probability, high-consequence risks are also usually easy to avoid. These are risks that most people would characterize as stupid and inviting disaster. Most people will look at a risk like this and simply say, “Why would you do that?” Traders usually do not have issues with these risks because they effectively eliminate traders from the industry through a quick and efﬁcient process of natural selection. If you take those kinds of risks as a trader, you will soon not be a trader. High Low High Probability of Occurrence Consequences Potentially career-ending. Avoid these risks! Dangerous, but can usually be managed. Many mistakes are made here. Inconsequential Ignore, but be sure that consequences are actually low. Common. effect of many Consider the of these in the aggregate. FIGURE 9.3 Probability/Consequence Risk Grid 116 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing Risk Management 287 FIGURE 9.4 Daily Chart",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.707497"
}