{
  "id": "71a9ca43e16f",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 40,
  "content": "e f ining ro l es an d va l ues outsi d e o f tra d in g M aintaining a tra d ing journa l R egu l ar review o f c h arts Seek feedback and advice from experienced traders C oncentrate on one tra d ing met h o d R egu l ar use o f Tr a d er ’s Per f ormance Assessment See k f ee db ac k f rom mentors an d tra d ing psyc h o l ogist s E ngage in d e l i b erate practic e C reate developmental plans to address developmental needs Keep goo d recor d s 272TRADE MINDFULLY Exercise 11.2 Mental Skills Inventory: Constructive Self‐Assessment Mental Domain Rating Self‐Esteem I know my self‐worth and am able to keep myself on an even keel no matter how my trading goes. I neither get excited when I have a strong trading performance nor get down on myself when my trading performance is less than I would like. Performance Accountability I take full responsibility for my trading performance and am willing to confront the factors that affect my performance, including my performance shortcomings. Perseverance I do the work necessary without distraction and strive to be the best trader I can. I maintain my intensity of effort even when things aren’t going my way. Continuous Improvement I use the information about my trading performance to improve as a trader, making adjustments in my trading. I constantly seek ways to develop and improve my trading knowledge, skills, and abilities. 46 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 273 T his is the fi rst book that inte g rates mindfulness skills with performance psychol- o g y to present traders with a structured tradin g psycholo g y process. Our focus has been on the mental and emotional challenges traders face and the cutting-edge psycholo g y that can address and help the trader deal with the mental side of the g ame. T wo thin g s stand out. One is the importance of practicin g mindfulness. The other is committing to the Before‐During‐After trading psychology process.r Althou g h tradin g is replete with psycholo g ical challen g es, if there is a secret to g reater consistency and profi cient performance in tradin g , it is developin g the skill of mindful self‐awareness. Mindfulness research reveals enormous benefi ts for trad- ers. The practice of mindfulness trains the mind to be aware of ourselves and what our mind is telling us and, most importantly , mindfulness enables us to see that we have a choice in how we act in any g iven tradin g situation. Mindfulness helps us no- tice when we have become emotionally hooked by a demandin g tradin g situation and also that we do not need to take action to appease the mind’s chatter. Mindfulness, acceptance, and commitment help us remember and choose what is of value to us in our tradin g and perform the hi g h-value activities that lead to optimum performance and profi table trading results. The hi g h-value mental skills and hi g h-value actions (HVMS and HV As) associ- ate d wit h optima l tra d in g per f ormance an d pro fi ta bl e tra d in g resu l ts are h one d throu g h the Before‐During‐After trading psychology process. Preparing for trading in r a hi g h-quality way , takin g our preparation into tradin g to maximize our tradin g abili- ties, an d assessin g our tra d in g per f ormance an d resu l ts wit h t h e intent to improve our preparation and execution is the royal road to developin g , advancin g , and en- hancin g our tradin g . It is a purposeful, systematic method that g uides you in makin g attaina bl e g oa l s w h i l e at t h e same time h e l ps you d eve l op new s k i ll s so t h at you can actualize the trader y ou desire to be. Fina l T h oug h ts CHAPTER 12 275FINAL THOUGHTS technical skill and money mana g ement practice. Without a stron g sense of one’s psychology , which we defi ne as a psychological edge, technical strategies can easily be compromised and money mana g ement practices may be left by the roadside. The mental side of the game and especially the trading process described in this book can help you both develop and use your technical skills to their g reatest advanta g e . ■Next Steps As this book draws to a close, you will want to begin thinking about what to do next. Each individual is diff erent. Althou g h there are commonalities amon g traders, we each experience the trading world from our own unique perspective. This is the beauty and joy of bein g human. As we conclude, refl ect on what you personally have learned from this book. What has chan g ed or is be g innin g to chan g e for you with respect to your emotions, your mind, and trading psychology? Has your perspective chan g ed about your tradin g psycholo g y? Do you see new opportunities for yoursel f in tradin g ? If so, what are they? Consider what has been most useful for you in reading and practicing what’s presented in this book. W as it how intuitive and deliberative minds work? Mindfulness",
  "word_count": 1000,
  "topics": [
    "psychology",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T00:37:45.722515"
}