{
  "id": "7143a42e1a4c",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 10,
  "content": "- in g will be elusive when takin g the same actions as others, especially when emotions are involved. W e have already seen that we have little control over our amygdala and the internal, psychobiolo g ical events that fear and other stron g emotions unleash when the fi g ht‐fl i g ht response is tri gg ered. Aside from this tradin g axiom and our biology , there are sound psychological reasons why actively trying to control strong emotions will make matters worse. W e will see later wh y this is virtuall y alwa y s a fruitless task. For now , let’s look at how traders typically try and cope with the emotional side of tradin g . See if you can identify with the same or similar copin g strate g ies that most other traders rely on. A g ain, brin g in g clarity is a fi rst major step in d ea l in g wit h anyt h in g re l ate d to psyc h o l o g y an d t h at is w h at we wi ll d o h ere as we review how traders typically cope with challen g in g emotions. There are many ways traders attempt to cope with stron g emotions. Because little is k nown a b out t h is su b ject in tra d in g , peop l e try just a b out anyt h in g . Even t h ou gh traders try many thin g s, we can break copin g down into three basic areas: an attempt to improve the technical side of tradin g , a quest to avoid losses, and the endeavor to exercise psyc h o l o g ica l contro l . We d iscuss eac h in turn. 13 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 73THE STRUGGLE TO CONTROL AND ELIMINATE EMOTIONS Exercise 3.1 The Price I Pay to Control My Thoughts and Feelings Triggering Situation Thoughts, Emotions, and Sensations Control Strategy Used/ What You Did Effect on Me Price I Paid Example: I was in a profi table trade “This could turn into a loss. I should close the trade.” Anxiety and fear, muscle tension, sweaty palms “At fi rst, I tried to stop the anxiety, then I closed the trade.” I made a small profi t but mostly felt relief from the tension. I felt bad when the market rallied. I missed profi ts and thought, “I’ll never get good at trading.” 14 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 74 TRADE MINDF U LLY List as many examp l es as you can; 10 wou ld b e goo d , more wou ld b e b etter. Keep in min d t h ere are no ri gh t or wron g answers. It is your experience t h at is crucia l h ere an d t h at y ou want to c l ari fy , as it is on ly y our experience t h at wi ll trut hf u lly te ll y ou how successfully thou g hts and feelin g s can be controlled. Y ou are doin g some personal research on the eff ectiveness of controllin g unpleasant thou g hts and emotions. Just like when we research a potential trade setup to see how it has acted in the past so that we can get an i d ea a b out w h at to expect f rom it in f uture tra d ing situations, we are d oing the same thing here with our attempts to control emotions. Y ou want to see how e ff ec - tive your strate g ies have been for you in the past to g et a g ood idea about how e ff ective t h ey are l i k e l y to b e in contro ll ing your t h oug h ts an d f ee l ings in t h e f uture. Because our b e l ie f a b out t h e necessity to contro l t h oug h ts an d emotions runs so d eep, it is vital that you include all the strategies you have used in your attempts to restrain, eliminate, or escape from them . T ake your time with this; you really want to be thorou g h. T r a d ers are inventive w h en it comes to attempting to manage strong, unwante d emotions such as fear, anxiety , overexcitement (greed), anger, and the like. T ab l e 3 . 1 contains a partial list of methods, tactics, and strate g ies reported by some traders who have tried to control their uncomfortable thoughts, emotions, and related phys - ical sensations associated with tradin g . Perhaps you have tried similar strate g ies? Now that y ou have developed an inventor y of the wa y s y ou personall y tr y to ex - ercise psychological control over thoughts and emotions, it will be helpful to nex t TABLE 3.1 How Some Other Traders Have Tried to Control Unwanted Thoughts and Feelings Trie d to suppress t h ou gh ts an d f ee l in gs Snappe d",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:45.718491"
}