{
  "id": "af5558bc9481",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 26,
  "content": "for any one outcome.) The standard deviation not only describes how fast the distribution spreads out; it also tells us something about the likelihood of a ball ending up in a specific trough or group of troughs. In particular, the standard deviation tells us the probability of a ball ending up in a trough which is a specified distance from the mean. For example, we May want to know the likelihood of a ball falling down through the maze and ending up in a trough lower than 5 or higher than 10. We can answer the question by asking how many standard deviations the ball must move away from the mean, and then determine the probability associated with that number of standard deviations. The exact probability associated with any specific number of standard deviations can be found in mathematical tables in most books on statistics. Alternatively, such probabilities can be closely approximated using an appropriate formula (see Appendix B). For option traders the following approximations will be useful: +1 standard deviation takes in approximately 68.3% (about 24) of all occurrences +2 standard deviations takes in approximately 95.4% (about 199) of all occur- rences +3 standard deviations takes in approximately 99.7% (about 369479) of all occur- rences 58 Chapter 4 Note that each number of standard deviations is preceded by a plus or minus sign, Because normal distributions are symmetrical, the likelihood of up movement and down movement is identical. Now let’s try to answer our question about the likelihood of getting a ball in a trough lower than 5 or higher than 10. We can designate the divider between troughs 7 and 8 as the mean of 71/. If the standard deviation is 3, what troughs are within one standard deviation of the mean? One standard deviation from the mean is 714 +3 = 4 to 10%. Again interpreting 4 as the divider between troughs, we can see that troughs 5 through 10 fall within one standard deviation of the mean. We know that one standard deviation takes in about 2/3 of all occurrences, so we can conclude that out of every three balls we drop into the maze, two should end up in troughs 5 through 10. What is left over, one out of every three balls, will end up in one of the remaining troughs, 0-4 and 11-15. Hence, the answer to our original question about the likelihood of getting a ball in a trough lower than 5 or higher than 10 is about 1 chance in 3, or about 33%. (The exact answer is 100% — 68.3%, or 31.7%.} This is shown in Figure 4-6. Let’s try another calculation, but this time we can think of the problem as a wager. Suppose someone offers us 30 to 1 odds that we can’t drop a ball into the maze and get it specifically in troughs 14 or 15. Is this bet worth making? One characteristic of standard deviations is that they are additive. In our example, if one standard deviation is 3, then two standard deviations are 6. Two standard deviations from the mean is therefore 714+ 6 = 1% to 13%. We can see in Figure 4-6 that troughs 14 and 15 lie outside two standard deviations. Since the probability of getting a result within two standard deviations is approximately 19 out of 20, the probability of getting a result beyond two standard deviations is 1 chance in 20. Therefore 30 to 1 odds may seem very favorable. Recall, however, that beyond two standard deviations also includes troughs 0 and 1. Since normal distributions are symmetrical, the chances of getting a ball specifically in troughs 14 or 15 must be half of 1 chance in 20, or about 1 chance in 40. At 30 to 1 odds the bet must be a bad one since the odds do not sufficiently compensate us for the risk involved. In Chapter 3 we said that one logical approach to option evaluation is to assign a probability to an infinite number of possible price outcomes for an underlying contract. Then, if we multiply each possible price outcome by its associated probability we can use the results to calculate an option’s theoretical value. The problem is in dealing with an infinite number of price outcomes and probabilities, since an infinite number of anything is not easy to work with. Fortunately, the characteristics of normal distribu- tions have been so closely studied that formulas have been developed which facilitate the computation of both the probabilities associated with every point along a normal distribution curve, as well as the area under various portions of the curve. If we assume that prices of an underlying instrument are normally distributed, these formulas repre- sent a unique set of tools with which we can solve for an option’s theoretical value. This is one of the reasons Black and Scholes adopted the normal distribution assumption as part of their model. Volatility 59 Figure 4-6 21 standard deviation = 68.3% (2/3) Mean = 7.50 +2 standard deviations = 95.4% (19/20) Standard Deviation = 3.00 - +3 standard deviations = 99.7% (369/370) + 95% > 8 69 i 11.12 = «13, 14 «15 -2 -1 +1 +2 standard standard mean standard standard deviations deviation 7.50 deviation deviations 1.50 4.50 10.50 13.50 60 Chapter 4 UNDERLYING PRICE AS THE MEAN OF A DISTRIBUTION Now that we have decided to describe prices in terms of a normal distribution, how do we feed this distribution into a theoretical pricing model? Since all normal distributions can be described by a mean and the standard deviation, in some way we must feed these two numbers into our pricing model. When we enter the present price of an underlying instrument we are actually entering the mean of a normal distribution curve. An important assumption in the Black-Scholes Model is that, in the long run, a trade in the underlying instrument will just break even. It will neither make money nor lose money. Given this assumption, the",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.426217"
}