{
  "id": "21251d04b667",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 9,
  "content": "and 9.10 from the sale of the 115 put. As we change our assumptions about the likely price of the underlying contract at expiration, we alter the likely profit or loss from any option position. If, instead of rising to 108.00, the underlying contract actually rises to 120.00, the purchase of the 100 call for 2.70 will result in a profit of 17.30 rather than 5.30. On the other hand, if the underlying contract falls to 90.00, the purchase of the 100 call will result in the loss of the full premium of 2.70. In the latter case, if we sell the 110 put for 11.35, instead of making 9.35 as we would with the underlying contract at 108.00, we will actually lose 8.65. Using a value for an option of either zero or intrinsic value, we can graph the profit or loss at expiration from any option trade which we might make today. Such graphs not only enable the new trader to assess the likely profitability of an option trade, but also help him to understand some of the unusual characteristics of options. However, before looking at graphs of various option positions, we ought to look at the profit and loss graph of an underlying contract. Because it is a derivative instrument, an option’s value is always dependent on the price of the underlying instrument. At expiration an option’s value is totally dependent on the price of the underlying contract. Indeed, if we have an opinion on the likely price of the underlying contract at some date in the future, we don’t need to trade options at all. We can simply buy or sell the underlying contract. Figure 2-1 shows the value at expiration of both a long and a short position in our example underlying contract taken at the current price of 99.00. The horizontal (x) axis represents the price of the underlying futures contract, and the vertical (y) axis represents the profit or loss from our position. Note that each graph is a straight 45° line Elementary Strategies 15 Figure 2-1 Y long an underlying 8+ ; contract at 99.00 va 64 ‘ +1 +1 ze 4 : 5 1 SS +1 o 2 ae 99.00 o+- a i -2- n Qn 3 a . 6: short an underlying x. contract at 99.00 = 8 ~L245 . * -10 T T T T T 7 85 90 95 100 105 110 - 115 extending infinitely far in either direction.! The potential profit or loss to each position is therefore unlimited. Note also that there is a continuous one-to-one relationship between movement in the underlying contract and the value of the position. If we take a long position, for each point the underlying contract rises, we make a point; for each point the underlying contract falls, we lose a point. If we take a short position the Situation is just reversed. For each point the underlying contract rises, we lose a point; for each point the underlying contract falls, we make a point. Using the same evaluation method, Figure 2-2 shows the profit or loss at expiration from the purchase of a 100 call at 2.70. Note that in this case the graph is no longer a Straight line. If the underlying contract falls below 100 at expiration the 100 call will be Out-of-the-money and therefore worthless, and we will lose the full 2.70 we paid for the call. Above 100, the call will be in-the-money, and will increase in value at the same Tate as the underlying contract; the position will gain one point in value for each point rise in the value of the underlying contract. If the underlying contract finishes at 102.70, the 100 call will be worth its intrinsic value of 2.70, and we will break exactly even. Above 102.70, the profit from the purchase of the 100 call is potentially unlimited, just like a long position in the underlying contract. a, 1. Of course, an underlying price cannot fall below zero, so the downside profit or loss is in theory limited. However, if the price of an underlying contract should go to zero, it will probably seem like an unlimited profit or loss to most traders. 16 Chapter 2 Figure 2-2 10 long a 100 call at 2.70 Profit 24 exercise price (100) | | maxium loss (-2.70) { (102.70) break even ~# Loss -10 Tt T T T T 85 90 95 100 105 110 115 RISK/REWARD CHARACTERISTICS The profit and loss graph of a long call position at expiration will always have the same general shape as the graph in Figure 2-2. The position will always have limited downside risk and unlimited upside profit potential. The exact point at which the maximum loss will occur is determined by the exercise price (the point at which the graph bends) and the price of the option. Graphs of long positions in the 95, 100, and 105 calls are shown in Figure 2-3. Figure 2-4 represents the profit and loss from a short position in the 95, 100, and 105 calls. These are simply inversions of the long call graphs. The positions now have profit potential limited to the amount of the premium for which they were sold, and unlimited upside risk similar to a short position in the underlying contract. Figure 2-5 represents long positions in the 95, 100, and 105 puts. The risk/reward characteristics of these positions are similar to long call positions, but now the limited risk is on the upside and the unlimited profit potential is on the downside. The position will break even if the underlying contract falls below the exercise price by exactly the amount of the option’s trade price. Below that break-even price the potential profit to the position is unlimited, increasing by one point for each point drop in the price of the underlying contract. Elementary Strategies 17 Figure 2-3 107 | long a 95 call at 5.50 — —— 8 long at 100 call at",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals"
  ],
  "created_at": "2026-02-05T08:09:54.423599"
}