{
  "id": "2ed1a78260db",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 45,
  "content": "a Catalyst for the Market to Transition to a Trading Range P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing Interfaces between Trends and Ranges 135 A FIGURE 5.9 Trends May Terminate into Trading Ranges When Pullbacks Become Ranges lead to sharper countertrend momentum due to trapped traders who entered on the false breakout. Again, the common thread tying these scenarios together is that there is a lack of conviction beyond the previous trend extreme, the market ﬁnds equilibrium as supply and demand balance, and a period of sideways trading activity follows. Figure 5.10 shows an example of a failure test at the previous high in an uptrend that ended the trend. Last, pullbacks may fail via the failure pullback sequence: sharp countertrend mo- mentum; a small pullback, which often sets up a good trade; and then another strong counter (the original trend) thrust. In this case, the move out of the failure pullback often exhausts itself somewhere close to the measured move objective (MMO), thus deﬁning the initial extreme of the new trading range. Figure 5.11 shows a road map for this type of action. The swing marked A is the conﬁrmation that the trend had decisively ended, at least for the time being. The common pattern tying all of these transitions from trend to trading range is a failed pullback, and this point is important: trends fail when pullbacks fail. This is why it is so critical for all technical traders, whether they trade with the trend, countertrend, in ranges, or on breakouts of those ranges, to be familiar with the patterns associated with pullbacks and their failure. The point of a trading methodology is not to predict the future, but to understand the forces at work in the market at any time, their rela- tive balance, and the most likely resolution of emerging price structures. When some- thing changes, and this happens frequently, a good trading methodology will embrace A FIGURE 5.10 A Failure Test at the Previous Pivot Extreme May Be a Catalyst for the Market to Transition to a Trading Range 64 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing 136 MARKET STRUCTURE A FIGURE 5.11 Sharp Countertrend Momentum May Exhaust into a Trading Range this change and make adjustments to trades. Exactly how you choose to implement this will depend on your personality and your chosen methodology, but the key is that you un- derstand the ebb and ﬂow of market dynamics. Managing trades in this ﬂuid environment is the next challenge to consider. Trade Management Issues Beginning traders assume that catching the end of a trend is a proﬁtable trade because the market will reverse into a trend in the opposite direction. This is the classic “buy the low or sell the high,” which, though emotionally gratifying when it works out, can be very challenging to execute. First, this outcome is fairly rare; many trends end by transition- ing into trading ranges. As the market chops sideways in the ensuing range, there are no outsized proﬁts, and aggressive traders may even ﬁnd themselves taking multiple small losses as they continue to try to position for the major trend change that never comes. In addition, most of these ranges, especially if they are able to hold and consolidate some- where in the neighborhood of the previous trend extreme, are more likely to be trend continuation than reversal patterns on the higher time frame. It certainly is possible to trade these trend terminations into trading ranges proﬁtably, but doing so demands lower expectations; sometimes small trades within the range may be all the market offers. Once a position has been established in a suspected trend termination, the ﬁrst thing to look for is conﬁrmation that the trend has indeed terminated. Usually, this is not difﬁcult: if an uptrend terminates, the market will stop going up, and vice versa for a downtrend. However, this somewhat tongue-in-cheek observation ignores the cases where the trend extreme is retested or perhaps even slightly exceeded in the developing trading range. It is important to monitor price action in order to separate trend continu- ation from these brief tests of trading ranges; in general, failure patterns such as springs and upthrusts mark the tests in successful trend terminations. The presence of strong momentum beyond the previous trend extreme is an undeniable sign that the trend is continuing. Once the trend termination has been successfully identiﬁed, it is important to take higher time frame market structure into consideration. The trading time frame trading range will eventually terminate, but is an exit from one direction more likely than the other? On the trading time frame and lower time frames, the range will probably be P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing Interfaces between Trends and Ranges 139 FIGURE 5.12 Wheat Futures in Mid-1996 Had a Parabolic Expansion and Subsequent Reversal into a Downtrend limit risk with iron discipline. Do not hold on hoping the market will come back, and do not add to your position hoping to average out of your loss. At some point the market will reverse, but you may have been margin called and taken out of business long before that happens. Like most things in technical analysis, we see similar patterns on all time frames— intraday, daily, and all the way out to monthly and beyond, but the pattern varies in signiﬁcance depending on the time frame. A parabolic exhaustion on a 1-minute chart might mark a high that lasts for several hours, whereas the corresponding pattern on a daily chart could set a high that would hold for many years. It is",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.702445"
}