{
  "id": "85688e0a19ca",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 124,
  "content": "of owning the underlying asset together with a 100 put) in theory he would have a position equivalent to owning 57% of his asset. Therefore, if he wants to replicate the combination of the underlying asset and the 100 put, he must sell off 43% of his holdings in the asset. When he does that, he will have a position theoretically equivalent to owning a 100 call. Now suppose a week passes and the value of his asset has risen to 102.26. What would be the delta of the 100 call which the hedger desires to own? Again, feeding all the inputs into a theoretical pricing model, we find that the call now has a delta of 62. If the hedger wants a position which is equivalent to a long call, he now needs to own 269 aBpe jeojeioeuy aalyeHou yenuajod 3SU episdn peywujun aBpe feonesoeyy aanebeu jeyusjod ysu episdn peywuyjun ofp yeojneioey) aaneBeu jenusjod YSU apIsUMOP pPe}/LUI]UN/{sU spisdn payin aBpe jeonaiosyy aanebou jenuajod ood ynd spesoxe eoud ||20 JI IGep jenusjod oud eplsuMop Ps}ULI| afpe jeojaioey) aaneBou jenusjod ySU episdn payuyun aBps jeojneioey) sanebou |eyusjod aBps jeoneioeu} aAneBau [eljuaj}od YSU SpIsSUMOP peywUN aBps jeoneioeyy aanebou jeyuejod SU SplsUMOP PS}lwW!|UN aHpe seoljaioeu) eaneBou jeyusjod ¥SU episdn pey|wWljunpisu epIsuMOP pe}tUjUN aBps jeoneioeyy saqeheu jenusjod aod [eo spesoxe oud jnd jl yqep jenuajod qyoud spisdn paywy aBps jeonsioey) saqeBou penusjod YSU SpISUMOP poy uN aBpe jeonaioey) aanebeu jenusjod abeyueapesig Hedging with Options aBpe [eoje108y) salyisod ‘jenusjod youd apisumop peyuun ape jeojeioey) sanisod fenuajod Word episumop peyumjun ape jeoneiosy) sAnisod jenusjod aBpe Jeojneiosy) eAnisod jenuajod wold episdn peyuiunAyoid episumop paywUuN eoud [eo spseoxe soud jnd JI paso penusjod YSU apisdn pay aBpe jeonesoey) sanisod jenuajod aBpe jeoneloey) aAnisod jenusajod youd episumop peylwijuN/{su episdn pay aBpe jeonjeioey) sanisod jenuajod woud episdn paywuyun ape jeonauoey) sAnisod senusjod youd episdn peyuyun ape jeojeioey) sanisod jenusjod aBpe jeonaioey) aanisod jenusjod youd episumop pelllulunAyoid spisdn peywijun aoud jnd spesoxe soud |e0 J yIpsio penuajod YSU SpISUMOP PS}ILU!| abpe |eoneioey) aAqisod yenuejod ape jeonei0ey) Ssanisod jenusjod woud episdn payiuljunyysu episuMop ps}ILu| sobe]ueApy peelds own jing peaids [eoen jing 8yUM 1nd one aseyaind |e0 ones Qnd be jes ‘12 eB Ang) 90U9} WoYs 1nd peisaoo ek |Jes [eo sanosjoid e Ang peaids own Jeeq peaids jeopeAseeq 8]UM [feo one! easeyoind jnd one (reo © |Jes ‘Ind e Anq) 8oue} Buoy} [29 POIBA0D & |jes ind sanseyoud e Ang ABayeas Bubpey BulApepun yous BulAyepun Buoy uoflsod seifeeis Huibpey jo Arewuing :Z-E4 eunbl4 270 Chapter 13 62% of his original holding in the underlying asset. He must therefore buy back 5% of his original holding in the asset. Suppose another week passes and the value of the asset has fallen to 99.07. Using the new market conditions, the 100 call would now have a delta of 46. In order to replicate the call position, the hedger must now sell off 16% of the asset, so that he owns only 46% of his original holding. Notice what the hedger is doing. He is periodically rehedging his original holding to create a position with the same delta characteristics as the call. If he continues to do this over the ten-week period, he has, in effect, created a ten-week call at an exercise price of 100. The reader may have already realized that we are simply repeating the example in Figure 5-1, but in a slightly different form. In that example, we purchased an under- priced call and replicated the sale of the same call through a continuous rehedging process. In our current example we are also replicating the call through a continuous rehedging process. But here we want to purchase the call rather than sell it. All our adjustments are therefore the opposite of those in Figure 5-1. Note also that at week ten (expiration), instead of liquidating the position, as we did in Figure 5-1, we plan to buy in the remainder of the asset. It was always our intention to retain our entire holding of the asset at expiration. The replicated position in our current example is shown in Figure 13-8. In order to replicate the call, the hedger will have to buy back some of the asset when the market rises and sell some of the asset when the market falls. The unfavorable adjustments (buying high, selling low) suggests that there will be a cost associated with this rehedging process. What will the cost be? If the replication process offers the same protection as owning a 100 put, then one might expect the cost of the replication process to be the same as the theoretical value of the ten week 100 put. This is indeed the case. Using the previously listed inputs, the Black-Scholes model yields a theoretical value for the 100 put of 2.55. This is identical to the cost of the replication process described in Figure 13-8. The rehedging process is an attempt to replicate the automatic rehedging charac- teristics of the option. As a hedge against an underlying position, an option has the very desirable characteristic of offering greater protection as the market moves adversely, and less protection as the market moves favorably. In effect, the option automatically rehedges itself to fit the required amount of protection. This is the influence of the gamma on the option’s delta. When a hedger attempts to replicate the characteristics of an option by continuously rehedging the underlying position himself, he is simply trying to replicate the automatic rehedging (gamma) characteristics of the option. The cost of the option, or the cost of the rehedging process, is the price the hedger pays for the option’s gamma characteristics. Since we need to continuously compute the delta to replicate an option through a rehedging process, this method of replication requires us to use a theoretical pricing model. We are therefore likely to encounter many of the same problems which we encounter anytime we use a theoretical pricing model to evaluate an option. Is the model itself correct? Do we have the right inputs? Leaving",
  "word_count": 1000,
  "topics": [
    "options"
  ],
  "created_at": "2026-02-05T08:09:54.441293"
}