{
  "id": "97b1a58b9288",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 134,
  "content": "trying to pick individual stocks. Portfolio managers can use index instruments to create a wide variety of risk/reward scenarios for large, diversified stock portfolios. Finally, professional arbitrageurs find that in spite of the highly liquid and usually efficient index markets, pricing disparities occur often enough to warrant close monitoring of these markets. When a disparity does exist, a trader can execute an arbitrage by hedging the mispriced index against either other stock indices or against a basket of stocks. Such arbitrage strategies are commonly referred to as index arbitrage. For all of the foregoing reasons, no book on options would be complete without at least some discussion of index options. However, index futures and options are so closely related, and so many strategies involve both instruments, that it is almost impossible to discuss one without discussing the other. We will therefore include both instruments in our discussion. WHAT IS AN INDEX? An index is a number which represents the composite value of a group of items. In the case of stock indices, the value of the index is determined by the value of a group of specified stocks, with the value of the stocks usually being determined by their prices in the marketplace. As the stocks which make up the index rise in price, the value of the index also rises, reflecting the increased value of the stocks; as the stocks fall in price, the value of the index also falls, reflecting the declining value of the stocks. If some Stocks in the index rise while others fall, the offsetting changes in stock prices may result in the index itself remaining unchanged, even though it’s possible that every stock in the index changed price. The value of the index always reflects the total value of the stocks which make up the index. 301 302 Chapter 15 CALCULATING AN INDEX There are several different methods of calculating stock index values, but the most common methods entail weighting the stocks either by price or by capitalization. To see how these methods work, consider an index composed of the following four stocks: Total Shares Total Stock Price Outstanding Capitalization 1 125 10,000 1,250,000 2 80 5,000 400,000 3 52 25,000 1,300,000 4 17 40,000 680,000 Ifan index is price weighted, each stock's value in the index is directly proportional to its price. Using this method, the total value of the index is simply the sum of the prices of all the stocks in the index: 125 + 80+ 524+ 17 =274 The price weighting of each stock is therefore: stock 1: 125/274 = 45.6% stock 2: 80/274 = 29.2% stock 3: 52/274 = 19.0% stock 4: 17/274 = 6.2% 100.0% Since the importance of each stock is directly proportional to its price, when measured in percent terms movement in higher priced stocks will have a greater impact on the value of the index than equal movement in lower priced stocks. If a trader were monitoring a price weighted index for possible changes, he would do well to look for movement in the higher priced stocks in the index. If an index is capitalization weighted, the index value is the total value of all the outstanding stock of the firms in the index. The total value, or capitalization, of a firm is the price of a share multiplied by the number of shares issued by the firm. The total capitalization of the four stocks making up our index is: (125 x 10,000) + (80 x 5,000) + (52 x 25,000) + (17 x 40,000) = 1,250,000 + 400,000 + 1,300,000 + 680,000 = 3,630,000 The capitalization weighting of each stock is therefore: stock 1; 1,250,000/3,630,000 = 34.5% stock 2: 400,000/3,630,000 = 11.0% stock 3: 1 ,300,000/3,630,000 = 35.8% stock 4: 680,000/3,630,000 = 18.7% 100.0% Stock Index Futures and Options 303 If an index is capitalization weighted, in percent terms the stocks which will have the greatest effect on the index are those with the greatest market value. These are often stocks which are very widely held, even though they may not be the highest priced stocks. For convenience, when an index is first introduced it is common to set the index value equal to some round number, most often 100. In order to achieve this number, the actual value of the index must be either multiplied or divided by some number. For example, when we calculated the price weighted value of our four-stock index, the value was 274. To transform the index value to 100, we solve: 274/x = 100 x =2.74 This number, 2.74, is referred to as the index divisor, and is used in all subsequent index calculations. Whenever a new value of the index is calculated, that value will always be divided by 2.74 to yield the published index value. If we wanted to set the value of our capitalization weighted index to 100, we solve: 3,630,000/x = 100 x = 36,300 In this case, the index divisor is 36,300. An index divisor is not constant, but can change as the capitalization of the index changes. If stocks in the index split or declare special stock dividends, or if stocks are replaced by other stocks due to buyouts, liquidations, or bankruptcies, the index value might go up or down, even though the market prices of the stocks making up the index remain unchanged. To offset this effect, when any capitalization change occurs in the stocks making up the index, the divisor is changed to reflect the relative value of index, and to ensure that the index value represents a true picture of price changes in the marketplace. Regardless of the method used to calculate an index, prices for each of the component stocks must be determined. If a stock is traded on only one exchange, there is never any doubt as to the stock’s price. It is simply the last trade price. But what if a stock is traded on more than one exchange? If the last trade for a stock",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management"
  ],
  "created_at": "2026-02-05T08:09:54.442912"
}