{
  "id": "b03c6f5c03c9",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 16,
  "content": "hope to intelligently enter the option market. The option trader who wants to intelligently evaluate the potential profitability of an option trade is faced with the task of analyzing several different factors. At a minimum he must consider: 1. The price of the underlying contract 2. The exercise price 3. The amount of time remaining to expiration 4, The direction in which he expects the underlying market to move 5. The speed at which he expects the underlying market to move Ideally, he would like to express each of these factors numerically, feed the numbers into a formula, and derive a value for the option. By comparing the value to its price in the marketplace, the trader would then know whether the purchase or sale of the option was likely to be profitable. This is essentially the goal of option evaluation: to analyze an option based on the terms of the option contract, as well as current market conditions and future expectations. EXPECTED RETURN Suppose we are given the opportunity to roll a six-sided die, and each time we roll we will receive a dollar amount equal to the number which comes up. If we roll a one, we get $1; if we roll a two, we get $2; and so on up to six, in which case we get $6. If we were to roll the die an infinite number of times, on average, how much would we expect to receive per roll? We can calculate the answer using some simple arithmetic. There are six numbers which can come up, each with equal probability. If we add up the six possible outcomes Introduction to Theoretical Pricing Models 37 1+2+3+4+54+6=21 and divide this by the six faces of the die we get 21/6 = 314. That is, on average we can expect to get back $31/2 each time we roll the die. This is the average, or expected, retum. If someone were to charge us for the privilege of rolling the die, what might we be willing to pay? If we purchased the chance to roll the die for less than $314, in the long run we would expect to be winners. If we paid more than $314, in the long run we would expect to be losers. And if we paid exactly $31, we would expect to break even. Note the qualifying phrase “in the long run.” The expected return of $3 is a realistic goal only if we are allowed to roll the die many, many times. If we are allowed to roll only once, we cannot count on getting back $31. Indeed, on any one roll it is impossible to get back $314 since no face of the die has exactly 314 spots. Nevertheless, if we pay less than $314 for even one roll of the die, the laws of probability are on our side because we have paid less than the expected return. Ina similar vein, consider a roulette bet. A roulette wheel has 38 slots, numbered 1 through 36, 0 and 00.! Suppose a casino allows a player to choose a number. If the player’s number comes up, he receives $36; if any other number comes up, he receives nothing. What is the expected return from this proposition? There are 38 slots on the roulette wheel, each with equal probability, but only one slot will return $36 to the player. If we divide the one way to win $36 by the 38 slots on the wheel, the result is $36/38 = $.9474, or about 95¢. A player who pays 95¢ for the privilege of picking a number at the roulette table can expect to break about even in the long run. Of course, no casino will let a player buy such a bet for 95¢. Under those conditions the casino would make no profit. In the real world, a player who wants to purchase such a bet will have to pay more than the expected return, typically $1. The 5¢ difference between the $1 price of the bet and the 95¢ expected return represents the profit potential, or edge, to the casino. In the longrun, for every dollar bet at the roulette table, the casino can expect to keep about 5¢. Given the above conditions, any player interested in making a profit would rather Switch places with the casino so that he could be the house. Then he would have a 5¢ edge on his side by selling bets worth 95¢ for $1. Alternatively, the player would like to find a casino where he could purchase the bet for less than its expected return of 95¢, perhaps 88¢. Then the player would have a 7¢ edge over the casino. THEORETICAL VALUE The theoretical value of a proposition is the price one would expect to pay in order to just break even in the long run. Thus far the only factor we have considered in determining the value of a proposition is the expected return. We used this concept to Calculate the 95¢ fair price for the roulette bet. There may, however, be other Considerations, Suppose that in our roulette example the casino decides to change the conditions Of the bet slightly. The player may now purchase the roulette bet for its expected return —____ 1. Asis customary in the U.S., we assume a roulette wheel with 38 slots. In some parts of the world the roulette wheel may have no slot 00. This of course changes the odds. 38 Chapter 3 of 95¢ and, as before, if he loses the casino will immediately collect his 95¢. Under the new conditions, however, if the player wins the casino will send him his $36 winnings in two months. Will both the player and the casino still break even on the proposition? Where did the player get the 95¢ he used to place his bet at the roulette wheel? In the immediate sense he may have taken it out of his pocket. But a closer examination may reveal",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.424671"
}