{
  "id": "47c7e1f5f324",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 21,
  "content": "audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Setting Up Your Business 89 broker’s trading server. As discussed in Chapter 2, any delay in the transmission of your order to your brokerage results in slippage, which is quite real in terms of lost profits. In fast-moving markets, every millisecond counts. Besides offering a high-speed connec- tion, a VPS (e.g., speedytradingservers.com) will also ensure your trading strategy is resilient to common household disasters such as internet outage, electricity outage, flooding, and so on. It can cost only a few hundred dollars a month. You can monitor your trad- ing programs at the VPS using a free software such as Windows Remote Desktop. You will certainly want to purchase multiple monitors to hook up to the same computer so that you have extended screen space to monitor all the different trading applications and portfolios. SUMMARY This chapter focused on those decisions and steps that you need to take to bridge the research phase and the execution phase of your trading business. I have covered the pros and cons of retail trading versus proprietary trading and the issues to consider in choosing a brokerage or proprietary trading firm. In a nutshell, retail brokerages give you complete freedom and better capital protection but smaller leverage, while proprietary trading firms give you less freedom and less capital protection but much higher leverage. Finding a suitable retail brokerage is relatively easy. It took me less than a month to research and settle on one, and I have not found a reason to switch yet. Finding a suitable propri- etary trading firm is much more involved, since there are contracts to sign and an exam (Series 7) to pass. It took me several months to get my account set up at one. Of course, you can choose to have both retail and proprietary accounts, each tailored to the specific needs of your strategies. This way, you can also easily compare their speed of execution and depth of liquidity. Chan800064_c04.indd 89 5/20/2021 10:55:00 AM 90 QUANTITATIVE TRADING Regardless of whether you have chosen to trade in a retail bro- kerage or join a proprietary trading firm, you need to make sure their trading account and systems have these features: • Relatively low commissions • Trade a good variety of financial instruments • Access to deep pool of liquidity • Most importantly, API for real-time data retrieval and order transmission I also described the progressive buildup of the physical infra- structure you need to build in order to run a trading business. Some of the components of a trader’s operating environment men- tioned are: • Personal computer • High-speed internet connection • Noninterruptible power supply • Real-time data and news feed and subscription to financial TV news channels • VPS Building out the physical trading infrastructure is actually quite easy, since in the beginning you probably have all the components ready in your home office already. I have found that it is easy to trade a million-dollar portfolio with nothing more than a few thou- sand dollars’ initial investment in your physical infrastructure and a few hundred dollars a month in operating cost. But if you want to increase your trading capacity or improve your returns, additional incremental investments will be needed. Once you have considered and taken these steps, you are now positioned to build an automated trading environment to execute your strategy, which will be covered in the next chapter. Chan800064_c04.indd 90 5/20/2021 10:55:00 AM 44 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 90 QUANTITATIVE TRADING Regardless of whether you have chosen to trade in a retail bro- kerage or join a proprietary trading firm, you need to make sure their trading account and systems have these features: • Relatively low commissions • Trade a good variety of financial instruments • Access to deep pool of liquidity • Most importantly, API for real-time data retrieval and order transmission I also described the progressive buildup of the physical infra- structure you need to build in order to run a trading business. Some of the components of a trader’s operating environment men- tioned are: • Personal computer • High-speed internet connection • Noninterruptible power supply • Real-time data and news feed and subscription to financial TV news channels • VPS Building out the physical trading infrastructure is actually quite easy, since in the beginning you probably have all the components ready in your home office already. I have found that it is easy to trade a million-dollar portfolio with nothing more than a few thou- sand dollars’ initial investment in your physical infrastructure and a few hundred dollars a month in operating cost. But if you want to increase your trading capacity or improve your returns, additional incremental investments will be needed. Once you have considered and taken these steps, you are now positioned to build an automated trading environment to execute your strategy, which will be covered in the next chapter. Chan800064_c04.indd 90 5/20/2021 10:55:00 AM Setting Up Your Business 91 REFERENCES Economist. 2007. “Too Much Information.” July 12. www.economist.com /finance/displaystory.cfm?story_id=9482952. Markoff, John. 2007. “Faster Chips Are Leaving Programmers in Their Dust.” New York Times, December 17. www.nytimes.com/2007/12/17 /technology/17chip.html?ex=1355634000&en=a81769355deb7953&ei=5124 &partner=permalink&exprod=permalink. Oldfield, Richard. 2007. Simple but Not Easy. Doddington Publishing. Chan800064_c04.indd 91 5/20/2021 10:55:00 AM 45 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.607068"
}