{
  "id": "b0f185053dbc",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 131,
  "content": "of Trade from 1989 to 1991. In late 1989, and again in mid-1991, there were declines in the volatility of Treasury Bond futures, and these were accompanied by corresponding declines in implied volatility. From August 1990 through January 1991 {the period of the Iraqi invasion of Kuwait), there were several sharp increases in the volatility of the futures, and these were accompanied by similar increases in implied volatility. Clearly, the marketplace, in the form of changing implied volatility, was responding to the changing historical volatility of the underlying contract. Notice, however, that the fluctuations in implied volatility were usually less than the fluctuations in historical volatility. When the historical volatility declined, the implied volatility rarely declined by an equal amount. And when historical volatility increased, the implied volatility rarely increased by an equal amount. Because volatility 291 Volatility Revisited c6-uer 16-des He-une’ 16-qe4 06490 der 06-JEN 68-AON 68-Bnv 6e-dy 6e-uer AyeIOA eouoysiy Aep 02 v (%) AWINEIOA Ayyejon payduul m4 St Aynejoa seunyng puog Aunsead] :Z-y1 einbig 292 Chapter 14 tends to be mean reverting, when historical volatility is above its mean there is a greater likelihood that it will decline, and when historical volatility is below its mean there is a greater likelihood that it will increase. Moreover, the further out in time we go, the greater the likelihood that the volatility of the underlying contract will return to its mean. (Look again at Figure 14-3.) Consequently, the implied volatility of long-term options tends to remain closer to the mean volatility of an underlying contract than the implied volatility of short-term options. As historical volatility rises, the implied volatility of all options is likely to rise. But given the stronger mean reverting characteristics of volatility over long periods of time, the implied volatility of long-term options will tend to rise less than the implied volatility of short-term options. As historical volatility falls, the implied volatility of all options is likely to fall. But the implied volatility of long-term options will tend to fall less than the implied volatility of short-term options. This is born out by Figure 14-8, the implied volatility of Treasury Bond options for various expiration months from September 1990 to May 1991. Note the increase in implied volatilities during January 1991. But the increase in the implied volatility of the short-term contract (March) was much greater than the increase in the implied volatility of the mid-term (June) contract, which was in turn greater than the increase in the implied volatility of the long-term (September) contract. When implied volatility began to decline in late January 1991 the roles were reversed. The March contract declined the most rapidly, followed by the June contract, and the September contract. This is typical of the way in which implied volatility tends to change in response to changing volatility environments. Over long periods of time the historical volatility of the underlying contract will be the dominant factor affecting implied volatility. Over short periods of time, however, other factors can also play a significant, perhaps even a dominant, role. If the market- place foresees events which could cause the underlying contract to become more volatile, anticipation of these events might cause implied volatility to change in ways that are not necessarily consistent with historical volatility. For example, government reports on economic conditions are issued periodically, and these reports have been known to contain surprises for the interest rate and foreign exchange market. This potential for surprise can cause uncertainty in the marketplace, and this uncertainty is often reflected in an increase in implied volatility. Going into government reports, there is a strong tendency for implied volatility to rise, even in the face of low historical volatility in the underlying instrument. Government reports are not the only factors which add uncertainty to the market. Any future events which could have unexpected consequences can have an effect on implied volatility. In the currency markets, upcoming meetings of finance ministers—or in the energy markets upcoming OPEC meetings—often cause implied volatility to rise. In the stock option market, earnings news, the potential success or failure of new products, or (most dramatically) the possibility of a takeover, can all cause increases in implied volatility, regardless of the historical volatility of the stock. In a similar way, if the marketplace believes that no significant events are likely to occur in the foreseeable future, uncertainty is removed from the market. In such a case the implied volatility may start to fall, even if the actual historical volatility has been 293 Volatility Revisited 16-22 16-484 6-uer 06°80 06-AON 06-20 06-des o6-Bny o6-inr tj it ml { 9 166 | Jequiaydas 1661 Yoel b66l ounr (%) Aeon peyduy 066} Jequisssq 0661 Jaquiaydas TOL Zt - AyyiejoA peljdwy seunyjng puog Ainsead, :¢-p} ainbig 294 Chapter 14 relatively high. This is why implied volatility sometimes drops right after large moves in the underlying contract. Once the big event has occurred, there may be a perception that all the uncertainty has been removed from the market. Regardless of short-term changes in implied volatility, it is still important for a trader to remember that the volatility of the underlying contract will eventually overwhelm any considerations of implied volatility. As an example, consider the following situation: futures price = 97.73 time to expiration = 60 days interest rate = 6% implied volatility = 20% Given these conditions, the 100 call would be trading for 2.17, with an implied delta of 40. Suppose we create a delta neutral position by purchasing ten 100 calls for 2.17 each, and selling four futures contracts at 97.73. What will happen to our position if implied volatility rises to 22%? If implied volatility immediately goes to 22%, the new price of the 100 call will be 2.47, and we will show a profit of 10 x (2.47 2.17) = +3.00 Suppose, however, that the increase in implied volatility occurs very slowly, over a period of 20 days, and during this period the price of the underlying futures contract remains at 97.73. Under",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.442415"
}