{
  "id": "e23cb90dc860",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 189,
  "content": "return for the option is the sum, for each outcome where the option is in-the-money, of the difference between the option’s exercise price and the underlying price, multiplied by the probability of that outcome. All outcomes where the option is out-of-the-money are set to zero. In order to create a binomial tree which will approximate a lognormal distribution we can define the following: u = evn d= 1/u where n = the number of periods to expiration (the number of branches on the binomial tree) Figure B-1 A 3 Period Binomial Tree u= +5 145 (100 call = 15) d= -5 a \" 105 405 (100 call = 5) 100 100 95 95 (100 call = 0) 90 85 (100 call = 0) 436 Appendix B Vv t the annual volatility of the underlying contract the time to expiration in years As n becomes very large, the resulting terminal prices of the binomial tree converge to a lognormal distribution. The probability, p, of an up move is determined by the requirement that the underlying market be arbitrage-free, ie., that no profit can be made trading the underlying contract. If there are no interest considerations, which is the case with a futures contract, we can ensure that the underlying futures market is arbitrage-free by defining the probability, p, of an up move as: p = (1-d)/(u-d) In an arbitrage-free stock market, the stock price must increase by the amount of carrying costs over each period. If r is the risk-free rate, the rate, rr, by which the stock price must increase over each period is: r= 1+ (rt/n} We can ensure that the underlying stock market is arbitrage-free by defining the probability, p, as: p = (rr-d)/(u-d) Finally, we must discount the expected return for the option by the carrying costs over the life of the option by multiplying the expected return by 1/(rr)\". The basic form of the Cox-Ross-Rubenstein Model is: n ! ! ~ (an 2 nb! pe(1—p)*max(0,ukd\"“U-E) + ka(n-10)! Ton 7 1 n! ~ (an py king: P(t pyr imax(0,E-uld*U) k=0 , In order to use the Cox-Ross-Rubenstein Model to evaluate an American option, we need to check whether at the beginning of each time period the value of the option is such that early exercise is warranted. For example, in our two-period example with the underlying at 100, we saw that the expected return for the 90 call was 10. If the option were settled in cash, the theoretical value of the option would be 10 less the carrying costs over the holding period. If the carrying costs were .25, the theoretical value of the option would be 9.75. If, however, the option were American, everyone would exercise the option in order to obtain 10 points right now. In other words, the fact that the option is American would require us to set the theoretical value at 10. If we define U(i,j) as the j® underlying price at the end of the i time period (see Figure B-2), and C(i,j) or P(i,j) as the call or put value at each U(i,j), then we must check to see whether each C(i,j) < U(i,j)-E, if we are evaluating an American call, or whether The Mathematics of Option Pricing 437 Figure B-2 U(4,0) U(i,j) is the jth underlying price U(,0) at the end of the ith period , U2,0) U(4,1) U(1,0) U@G,1) a U2,1) u(4,2) U(1,1) UG,2) U(2,2) U(4,3) U(0,0) is the current price UG,3 of the underlying contract 8) /\\ U(4,4) each P(i,j) < E-U(i,j), if we are evaluating an American put. If either condition is true the option becomes an early exercise canditate, and we set the value of C{i,j) equal to U(i,j)J-E, or the value of P(i,j) equal to E-U(i,j). We begin by calculating each terminal value U(n,j) for j=0,...,.n. From these values we can calculate the value of the option at each previous node, C(n-1,j} or P(n-1 ,j) for j=0,....n-1. If C(n-1,j) turns out to be less than U(n-1,j)-E, or if P(n-1,j) turns out to be less than E-U(n-1,j), the option value is set to parity, and the iterative procedure continues. We continue to work backwards to C(0,0) or P(0,0) (the current value of the call or put), always setting the value at each node, U(i,j), to max[C(ij), U{i,j)-E] fora call, or max(P(i,j}, E-U(i,j)] fora put: pcdi+1,) + d-p)Cd4+1,j+1) tr pP(i+1,j) + (@-p)PG4+1,j+)) Ir P(i, j) = max , E-UGi, | Since the delta of an option is its change in value for a given change in the price of the underlying contract, we can also calculate call and put deltas from a binomial model: C(1,1) — C(1,0) WA = call 4 = dt) —UCL,0) 438 Appendix B _ Pd,l)—Pd,0) ~ U(,1)- Ud) The larger n is chosen, the more accurate the option value generated by the model will be. Unfortunately, as n increases, the number of calculations required to evaluate an American option increases geometrically. Most traders who use the Cox-Ross-Ruben- stein model choose n somewhere between 25 and 50. This represents a reasonable trade-off between computer time and accuracy. putA III. The Whaley (Quadratic) Model® The Whaley Model uses an approximation technique to estimate the critical price, U*, at which an American option should optimally be exercised early. This critical price is then used to determine the value of the option. In order to find U* for a call, we must solve the equation: E — Ut = e@9U*N(h-EN(h-vvt)] + [((1-e®'N(h-wVt))(U*/q,)] (For convenience we will refer to the two sides of this equation as LHS [the left-hand side] and RHS [the right-hand side].) where b = carrying costs on the underlying instrument (for futures b = 0; for stock b = r) and all other abbreviations are those used in the Black-Scholes Model * 2 nf | [>+7} n wt Gq = [HXN-1) + V(N-1)? + 4M/0]/2 M = 2r/y N = 2b k = let To solve for U* we pick a desired degree of accuracy, €, satisfying: (LHS - RHS) /E<e We",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.451466"
}