{
  "id": "6505990c831b",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 186,
  "content": "one order is executed, the other is automatically cancelled. Order Book Official (OBO)——An exchange official responsible for executing market or limit orders for public customers. Out-of-the-Money-—An option which currently has no intrinsic value. A call (put) is out-of-the-money if its exercise price is more (less) than the current price of the underlying contract. Out-Option—A type of barrier option which is deemed to have expired if the underlying instrument trades at some predetermined price prior to expiration. Out-Price—The price at which the underlying instrument must trade before an out option is deemed to have expired. Out-trade-——A trade which cannot be processed by the clearing house due to conflicting information reported by the two parties to the trade. Overwrite—The sale of an option against an existing position in the underlying contract. Parity—Intrinsic value. Pin Risk—The risk to the seller of an option that at expiration the option will be exactly at-the-money. The seller will not know whether the eption will be exercised. Portfolio Insurance—A process whereby the quantity of holdings in an underlying instrument is continuously adjusted to replicate the characteristics of an option on the underlying instrument. Position—The sum total of a trader’s open contracts in a particular underlying market. Position Limit—For an individual trader or firm, the maximum number of open contracts in the same underlying market permitted by an exchange or clearing house. Premium—the price of an option. Program Trading—aAn arbitrage strategy involving the purchase or sale of a mispriced stock index futures contract against an opposing position in the stocks underlying the index. Put Option—A contract between a buyer and a seller whereby the buyer acquires the right, but not the obligation, to sell a specified underlying contract at a fixed price on or before a specified date. The seller of the put option assumes the obligation of taking delivery of the underlying contract should the buyer wish to exercise his option. Range Forward—A fence. A Glossary of Option and Related Terminology 427 Ratio Backspread—A backspread. Ratio Spread—Any spread where the number of long market contracts {long underly- ing, long call, or short put) and short market contracts (short underlying, short call, or long put) are unequal. Ratio Vertical Spread—A spread, usually delta neutral, where more options are sold than are purchased, and where all options have the same underlying contract and expire at the same time. Ratio Write—The sale of multiple options against an existing position in an underlying contract. This is simply a covered write using more than one option. Reverse Conversion (Reversal)—A short underlying position together with a long call and short put, where both options have the same exercise price and expire at the same time. Rho (p)—The sensitivity of an option’s theoretical value to a change in interest rates. Risk Conversion (Risk Reversal)-—A fence which includes a long (short) underlying position. Roll—A jelly roll. Scalper—A floor trader on an exchange who hopes to profit by continually buying at the bid price and selling at the offer price in a specific market. Scalpers usually try to close out all positions at the end of each trading day. Serial Expiration—On commodity exchanges, options on the same futures contract which expire in more than one month. Series—All options with the same underlying contract, same exercise price, and same expiration date. Short—A position resulting from the sale of a contract. The term is also used to describe a position which will theoretically increase (decrease) in value should the price of the underlying contract fall (rise). Note that a short (long) put position is a long (short) market position. Short Premium—A position which will theoretically increase in value should the underlying contract sit still. The position will theoretically decrease in value should the underlying contract make a large move in either direction. Short Ratio Spread—A ratio vertical spread. Short Squeeze—A situation in the stock option market, usually resulting from a partial tender offer, where no stock can be borrowed to maintain a short stock position. If 428 Appendix A assigned on a short call position, a trader may be forced to exercise a call early in order to fulfill his delivery obligations, even though the call still has some time value remaining. Sigma (o)—The commonly used notation for standard deviation. Since volatility is usually expressed as a standard deviation, the same notation is often used to denote volatility. Specialist—A market maker given exclusive rights by an exchange to make a market in either a specified contract of group of contracts. A specialist may buy or sell for his own account, or act as a broker for others. In return, a specialist is required to maintain a fair and orderly market. Speculator—A trader who hopes to profit from a specific directional move in an underlying contract. Spread—A long market position and an offsetting short market position usually, but not always, in the same underlying market. Stock-Type Settlement—A settlement procedure in which the purchase of a contract requires full and immediate payment by the buyer to the seller. All profits or losses from the trade are unrealized until the position is liquidated. Stop Limit Order—A contingency order which becomes a limit order if the contract trades at a specified price. Stop (Loss) Order-—A contingency order which becomes a market order if the con- tract trades at a specified price. Straddle—A long (short) call and a long (short) put, where both options have the same underlying contract, the same expiration date, and the same exercise price. Strangle—A long (short) call and a long (short) put, where both options have the same underlying contract, the same expiration date, but different exercise prices. Strap—An archaic term for a position consisting of two long (short) calls and one long (short) put where all options have the same underlying contract, the same expiration date, and the same exercise price. Strike Price (Strike)}—Exercise price. Strip—aAn archaic term for a position consisting of one long (short) call and two long (short) puts where all options have the same underlying contract, the same expiration date, and the same",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.451001"
}