{
  "id": "7aecf70f6cb3",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 9,
  "content": "58000 70.38 You can see that the adjusted closing prices from our calculations and from Yahoo! are the same (after rounding to two decimal places). But, of course, when you are reading this, IGE will likely have distributed more divi- dends and may have even split further, so your Yahoo! table won’t look like the one above. It is a good exercise to check that you can make further adjust- ments based on those dividends and splits that result in the same adjusted prices as your current Yahoo! table. Chan800064_c03.indd 44 6/7/2021 2:04:49 PM 13 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Backtesting 45 Example 3.3: An Example of How Survivorship Bias Can Artificially Inflate a Strategy’s Performance Here is a toy “buy low-priced stocks” strategy. (Warning: This toy strategy is hazardous to your financial health!) Let’s say from a universe of the 1,000 largest stocks (based on market capitalization), we pick 10 that have the lowest closing prices at the beginning of the year and hold them (with equal initial capital) for one year. Let’s look at what we would have picked if we had a good, survivorship-bias-free database: SYMBOL Closing Price on 1/2/2001 Closing Price on 1/2/2002 Terminal Price ETYS 0.2188 NaN 0.125 MDM 0.3125 0.49 0.49 INTW 0.4063 NaN 0.11 FDHG 0.5 NaN 0.33 OGNC 0.6875 NaN 0.2 MPLX 0.7188 NaN 0.8 GTS 0.75 NaN 0.35 BUYX 0.75 NaN 0.17 PSIX 0.75 NaN 0.2188 RTHM 0.8125 NaN 0.3000 All but MDM were delisted sometime between 1/2/2001 and 1/2/2002 (after all, the dot-com bubble was seriously bursting then!). The NaNs indi- cate those with nonexistent closing prices on 1/2/2002. The Terminal Price column indicates the last prices at which the stocks were traded on or before 1/2/2002. The total return on this portfolio in that year was –42 percent. Now, let’s look at what we would have picked if our database had sur- vivorship bias and actually missed all those stocks that were delisted that year. We would then have picked the following list instead: SYMBOL Closing Price on 1/2/2001 Closing Price on 1/2/2002 MDM 0.3125 0.49 ENGA 0.8438 0.44 NEOF 0.875 27.9 Chan800064_c03.indd 45 6/7/2021 2:04:49 PM 14 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 46 QUANTITATIVE TRADING Does Your Strategy Use High and Low Data? For almost all daily stock data, the high and low prices are far noisier than the open and close prices. What this means is that even when you had placed a buy limit order below the recorded high of a day, it might not have been filled, and vice versa for a sell limit order. (This could be due to the fact that a very small order was transacted at the high, or the execution could have occurred on a market to which your order was not routed. Sometimes, the high or low is simply due to an incorrectly reported tick that was not filtered out.) Hence, a backtest that relies on high and low data is less reliable than one that relies on the open and close. Actually, sometimes even a market on open (MOO) or market on close (MOC) order might not be filled at the historical open and close prices shown in your data. This is due to the fact that the historical prices shown may be due to the primary exchange (e.g., New York Stock Exchange [NYSE]), or it may be a compos- ite price including all the regional exchanges. Depending on where your order was routed, it may be filled at a different price from the SYMBOL Closing Price on 1/2/2001 Closing Price on 1/2/2002 ENP 0.875 0.05 MVL 0.9583 2.5 URBN 1.0156 3.0688 FNV 1.0625 0.81 APT 1.125 0.88 FLIR 1.2813 9.475 RAZF 1.3438 0.25 Notice that since we select only those stocks that “survived” until at least 1/2/2002, they all have closing prices on that day. The total return on this portfolio was 388 percent! In this example, –42 percent was the actual return a trader would experience following this strategy, whereas 388 percent is a fictitious return that was due to survivorship bias in our database. Chan800064_c03.indd 46 6/7/2021 2:04:49 PM 15 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Backtesting 47 historical opening or closing price shown in your dataset. Neverthe- less, the discrepancies of the open and close prices usually have less impact on backtest performance than the errors in the high and low prices, since the latter almost always inflate your backtest returns. After retrieving the data from a database, it is often advisable to do a quick error check. The simplest way to do this is to calculate the daily returns based on the data. If you have open, high, low, and close prices, you can calculate the various combinations of daily returns such as from the previous high to today’s close as well. You can then examine closely those days with returns that are, say, four standard deviations away from the average. Typically, an extreme return should be accompanied by a news announcement, or should occur on a day when the market index also experienced extreme returns. If not, then your data are suspect. PERFORMANCE MEASUREMENT Quantitative traders",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:43.604769"
}