{
  "id": "af9619134469",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 148,
  "content": "that this mispricing is random. Sometimes synthetic markets will be too expensive and sometimes they will be too cheap compared to their theoretical values. In the real world, however, synthetic markets always seem to be under pressure. That is, the synthetic market tends to trade at less than theoretical value. If the synthetic market (the difference between a call price and its companion put price) is worth 1.00, the actual market price usually seems to be something less than 1.00. What causes this systematic, downward bias? Index markets, with their great liquidity, are the most popular ofall option markets. They offer all types of traders—directional, volatility, arbitrage—a chance to make decisions based on general market conditions rather than on the unique factors which can affect individual stocks. True or not, most traders believe that the genera! market is less subject to manipulation than individual stocks, so that index options markets offer a more level playing field. One especially active participant in index markets is the portfolio manager. A portfolio manager is responsible for going into the market and generating a maximum return on capital with a minimum amount of risk. Historically, portfolio managers have achieved this goal in the equity markets by maintaining a portfolio of stocks which the manager believed would outperform the general market. As the manager identified new stocks which met this criteria he added them to the portfolio, while at the same time selling off other stocks in the portfolio which had either met his performance goals or ceased to perform as expected. A manager with an equity portfolio might naturally want to protect his holding by taking advantage of the hedging opportunities in an option market. For example, he might want to buy puts to protect the stocks in the portfolio, or sell calls to enhance the stocks’ performance. Until the introduction of index options he had to execute the hedging strategy for each individual stock within that stock’s option market. If he owned 40 stocks and wanted to execute a uniform hedging strategy for the portfolio, the manager had to go into the individual option markets for the 40 different stocks and execute each hedging strategy separately. This was not only time consuming, but the transaction costs tended to reduce the expected benefits of the hedge. With the introduction of index options, a manager with a broadly based portfolio realized that his holdings often mimicked an index on which derivative instruments Stock Index Futures and Options 327 were available. If the manager believed that the characteristics of his portfolio were sufficiently similar to the index, index options now offered a way of hedging the stocks in the portfolio without the time consuming and costly process of executing a hedging strategy in each individual stock. However, the effect of portfolio hedging strategies on stock index derivatives has been one-sided. Whereas a professional trader will take either a long or short position in the underlying instrument, as market conditions dictate, the vast majority of equity portfolio managers take only long positions in equities. Even if a manager believes a stock will underperform the market, one rarely hears of a manager selling stock short (selling stock which he doesn’t own) as part of his investment program. Therefore, a portfolio manager is almost always trying to hedge a long position in the market. This means that the manager is either buying protective puts, selling covered calls, or pursuing some combination of these strategies. The result is that there is constant selling pressure on calls and constant buying pressure on puts. This downward bias is also evident in stock index futures markets, where a portfolio manager can pursue a dynamic hedging strategy, such as portfolio insurance, by selling futures contracts to protect his equity holdings against adverse market movement. The effect is the same as in option markets—there is always downward pressure on the markets. If there were a sure way to profit from this downward bias in the market, arbitrageurs would take the opposite position in the underlying index. But we have seen that executing an exact basket is not always possible. Moreover, when the portfolio manager protects his long equity position by selling calls, buying puts, or selling futures, a market maker or arbitrageur ends up taking the opposite position. He is long calls, short puts, or long futures. If he wants to hedge his position with an underlying basket of stocks, he must sell stocks short. And selling stocks short is never as easy as buying stocks. While not totally prohibited in the United States, as it is in many markets, traders who want to sell short are subject to an uptick rule (see Chapter 5). And there is no guarantee that an uptick will occur in even one stock, let alone several hundred.8 Moreover, most traders are subject to different borrowing and lending rates. Even if a trader can sell short all the stocks in the basket, the interest earnings from the short Stock sale may not be the same as the interest cost when stock is purchased. Given all these factors, the stock index market is not a symmetrical one. Many More factors seem to result in downward pressure on synthetics and futures than upward pressure. This does not mean that such markets can never become inflated, with calls trading for more than expected with respect to puts, or with futures contracts trading at greater than fair value. But this is by far the exception. In stock index markets around the world, there tends to be constant downward pressure on derivative Products. 8. The Chicago Stock Exchange has tried to facilitate the trading of index products by introducing the Chicago Basket (CMX), a basket of 20 major U.S. stocks which can be traded at one time, and which is not subject to the uptick rule. Hence, a trader who wants to be short all 20 stocks can sell the basket without worrying about finding an uptick in each individual stock. Chapter 15 328 e6-uer",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.445103"
}