{
  "id": "4a2dc012a58e",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 104,
  "content": "to return to the center after the trend stops. This effect is due to the decay in the EMA, which sees all data to the left of the average; the SMA is just a simple average of the past 20 data points. Once the market has been ﬂat for 20 bars, the simple moving average exactly equals the close. There are two important lessons here. Most traders know the ﬁrst, but few know the second. For an SMA and an EMA of the same length: r The EMA will react faster to a large price change because it front-weights the data. r However, the EMA is also slower to react to stabilizing prices because it has a very long look-back window. 160 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing Appendix B: A Deeper Look at Moving Averages and the MACD 411 FIGURE B.1 Twenty-Period Simple (Dotted Line) and Exponential Moving Averages in a Market That Cleanly Shifts from Trading Range to Trend and Back Many traders are convinced that moving averages provide support and resistance. Chapter 16 investigates this claim in some depth, and shows that there is no proof that any moving average is any better than any random number. One reason that so many traders remain convinced of this support/resistance effect is because it looks so con- vincing on charts. It is easy to ﬁnd example after example of places where price touched a moving average and then shot away, but this is a result of two effects: One, we tend to attach more signiﬁcance to lines on charts and to perceive patterns in random relation- ships. Two, there is a mathematical reason for this, as moving averages will approach prices as they pause in trends due to simple math. Figure B.2 illustrates this effect in an idealized market moving in stair-step trend legs. If the rate of a trend is constant (arithmetically, not geometrically), a moving average will eventually settle into a consistent visual relationship with that market, tracking it at the same rate below, for an uptrend, or above in the case of a downtrend. If the rate of the trend increases, or if there is a shock in the opposite direction, the EMA will react before the SMA, but, as before, the SMA will react more quickly to stabilizing prices. It is also not well known, but the EMA will approach price more closely than a SMA in a stable trend, again due to the front-weighting in the EMA calculation. Essentially, the EMA catches turns a bit faster, but is much slower to come into the new, stable value when the trend ends and transitions into a new trading range. This is expected behavior, as the EMA should respond quickly to recent data while maintaining a memory of the long data history. Figure B.3 shows a trend with two inﬂection points and a clear ending 161 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing 412 APPENDIX B: A DEEPER LOOK AT MOVING AVERAGES AND THE MACD FIGURE B.2 Are the Moving Averages Supporting Prices? FIGURE B.3 Notice the Diﬀerent Behavior of the EMA and the SMA at Inﬂection Points and at the End of the Trend 162 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing Appendix B: A Deeper Look at Moving Averages and the MACD 413 FIGURE B.4 Notice the Diﬀerent Behavior of the EMA and SMA in Response to a Single Large Price Shock point. Spend some time thinking about how the SMA and EMA react differently at these inﬂections; if you are using the slope of a moving average, or a moving average crossover, to deﬁne trends, you need to be aware of these issues. One average is not better than the other, but you need to be mindful of the differences. Figure B.4, which has a single price bar that is not visible far above the top of the chart, is useful for building intuition about how the averages react to a sudden shock. Note that the SMA shows two inﬂection points when there was actually only one event on the chart. The second inﬂection (the drop) in the SMA was merely an artifact created as the price spike moved out of the average’s evaluation window. In this particular case, the EMA probably more accurately reﬂects what is going on in the market. Traders using an SMA in an intuitive fashion are not likely to be misled, because they are focusing on the bigger picture, but systematic approaches or tools (such as trend indicators) derived from an SMA may have some issues with outliers. Particularly in intraday data, where the overnight gap is signiﬁcant, or longer-term equities, which have frequent price shocks due to earnings announcements, systematic tools based on simple moving averages are subject to distortion. Few traders realize that simple moving averages are low-pass ﬁlters, meaning that they will ﬁlter out (eliminate) higher-frequency oscillations and cycles. Figure B.5",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.711644"
}