{
  "id": "e2cd046840e1",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 101,
  "content": "104. Or, as before, we might combine these three trades by selling the call for six, buying the put for 314, and buying the stock for 10314. Assuming that all options are European (no early exercise permitted), and taking into consideration both interest rates and dividends, we can now express the full value of the synthetic relationship in the stock option market as: 1. The exact value depends on the discounted price, or present value, of the exercise price. For a more detailed explanation, see Appendix B. Option Arbitrage 223 call price — put price = stock price — exercise price + carrying costs — dividends where the carrying costs are calculated on the exercise price and the dividends are those expected prior to expiration. Using put-call parity, we can always calculate a call, put, or underlying stock price when we know the prices of any two of the other contracts. For example, with the stock at 102 and the June 100 put at 31/4, we have: call price = stock price — exercise price + put price + carrying costs — dividends = 102-100+3%4+2-1% = 5% With the June 100 call at 61% and the stock at 1011/4, we have: put price = call price + exercise price — stock price — carrying costs + dividends = 644+ 100-101%4-2+1'% = 4% Finally, with the June 100 call at 7 and the June 100 put at 144, we have: stock price = call price — put price + exercise price — carrying costs + dividends = 7-1%+100-24+1% = 104% ARBITRAGE RISK New option traders are often instructed to go into the market and concentrate on executing conversions and reversals because these strategies are riskless. Beware: There are no riskless strategies. There are only strategies with greater or lesser risk. The risks of doing conversions or reversals may not be immediately apparent, but they exist nonetheless. Interest Rate Risk Whenever there is a cash flow associated with a trade, the value of the trade depends on the interest which can be earned on a credit or which must be paid to carry a debit over the life of the trade. This is a function of interest rates, and since interest rates may not be constant, the interest considerations can change over time. If part of the expected profit from a trade depends on our earning 8% ona credit balance, a reduction in interest rates to 6% will certainly reduce our profit, and might even result in a loss. If part of the expected profit from a trade depends on our paying 7% on a debit balance, an increase in interest rates to 10% will likewise reduce our profit. In practice, large changes in interest rates over the limited life of most options? are the exception rather than the 2. Weare referring here primarily to exchange traded options with expirations up to approximately nine months. Long-term options with expirations of up to several years will obviously be much more sensitive to changes in interest rates. 224 Chapter 11 rule. For this reason the interest rate risk associated with conversions and reversals is relatively small. Note also that synthetic strategies in the stock option market are much more sensitive to interest rates than the same strategies in the futures option market. A stock option conversion or reversal includes the cash flow from the underlying stock, while a similar trade in the futures option market includes no such cash flow. The cash flow from a stock trade is always greater than the cash flow from an option trade since the price of stock is always greater than the price of the options. Execution Risk Since no market participant wants to give away money, a trader is unlikely to be offered a profitable conversion or reversal all at one time. Consequently, he will have to execute one or two legs of the strategy, and hope to be able to execute the final leg(s) at a later time. He may, for example, initially purchase the underlying contract and puts, and later hope to complete the conversion by selling calls. However, if call prices begin to fall, he may never be able to profitably complete the conversion. Even a professional trader on an exchange, who would seem to be ina good position to know the prices of all three contracts, can be fooled. He may purchase a call and sell a put (synthetic long underlying) at what he thinks are good prices. However, when he tries to sell the underlying contract to complete the reversal, he may find that the price is much lower than what he thought it was. Anytime a strategy is executed one leg at a time, there is always the risk of an adverse change in prices before the strategy can be completed. Pin Risk When we introduced the concept of a synthetic position, we assumed that at expiration either the underlying market would be above the exercise price, in which case any call would be exercised, or below the exercise price, in which case any put would be exercised. But what will happen if the underlying market is exactly equal, or pinned, to the exercise price at the moment of expiration? Suppose a trader has executed a June 100 conversion: he is short a June 100 call, long a June 100 put, and long the underlying contract. If the underlying market is above or below 100 at expiration, there is no problem. He will either be assigned on the call or will exercise the put. In either case he will offset his long underlying position so that he will have no market position on the day following expiration. Now suppose that at the moment of expiration the underlying market is right at 100. The trader would like to be rid of his underlying position. If he doesn’t get assigned on the call, he plans to exercise his put; if he does get assigned on the call, he will let the put expire",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.437791"
}