{
  "id": "d676191a0f0f",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 92,
  "content": "and a more decisive failure. At First Consolidation The ﬁrst pullback following a breakout is often an excellent spot to enter a trade. If the breakout works and a longer trend develops, this entry will have been right at the inception of the new trend. However, there is still a possibility of a failed breakout, which, in this case, will fail through a failed pullback. Deep study DFS - Daily o· iscover f -inancial s -erv,ces 22.00 21.50 21.00 , , 20.50 20.00 0.80 Mar Apr May 141 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c11 JWBT634-Grimes May 11, 2012 8:32 Printer: Hamilton Printing PART IV The Individual, Self-Directed Trader P1: OTA JWBT634-c11 JWBT634-Grimes May 11, 2012 8:32 Printer: Hamilton Printing CHAPTER 11 The Trader’s Mind If you open yourself to insight, you are at one with insight and you can use it completely. If you open yourself to loss, you are at one with loss and you can accept it completely. —Daodejing (ca. 6 BCE) A t one point or another, everyone who has interactions with the market asks one- self, “Why is trading so hard?” There are legitimate reasons why trading should be difﬁcult: markets are highly random; whatever edge we can ﬁnd is eroded by competition from smart, well-capitalized traders; some traders work within various con- straints; and markets are subject to very large shocks that can have devastating effects on unprepared traders. Even so, it seems like something else is going on, almost like we are our own worst enemies at times. What is it about markets that encourages people to do exactly the wrong thing at the wrong time, and why do many of the behaviors that serve us so well in other situations actually work against us in the market? Part of the answer lies in the nature of the market itself. What we call “the market” is actually the end result of the interactions of thousands of traders across the gamut of size, holding period, and intent. Each trader is constantly trying to gain an advantage over the others; market behavior is the sum of all of this activity, reﬂecting both the rational analysis and the psychological reactions of all participants. This creates an environment that has basically evolved to encourage individual traders to make mistakes. That is an important point— the market is essentially designed to cause traders to do the wrong thing at the wrong time . The market turns our cognitive tools and psychological quirks against us, making us our own enemy in the marketplace. It is not so much that the market is against us; it is that the market sets us against ourselves. These issues are particularly relevant to the individual, self-directed trader who has few limits placed on his or her behavior and is faced with the nebulous job description 347 142 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c11 JWBT634-Grimes May 11, 2012 8:32 Printer: Hamilton Printing 366 THE INDIVIDUAL, SELF-DIRECTED TRADER High Low HighSKILLS CHALLENGES FLOWAnxiety Boredom Relaxation FIGURE 11.1 Cs´ıkszentmih´alyi’s Performer State as a Function of Challenges and Skills Source: Adapted from Mih ´aly Cs´ıkszentmih´alyi, Finding Flow (New York: HarperCollins, 1997). tens of thousands of times and understands the complexities of paper, paint, and mois- ture; he has mastered brushstrokes and color to the point where they are tools that he can draw upon without conscious thought. The master musician has assimilated the techni- cal requirements of her instrument through tens of thousands of practice sessions spread over many years. The expert rock climber seems to have a sixth sense, drawing on a deep understanding of torque, kinesthetics, and the properties of different types of rock that comes only from long experience. The trader has seen enough market action and has done enough statistical studies to know what usually happens when a market closes very strongly three days in a row, with a wider range the third day. There is nothing remark- able about any of these skills taken individually, but their deep assimilation into a whole that seems to be greater than the sum of the parts is one of the hallmarks of mastery. Figure 11.1 also shows why the ﬂow experience can act as a powerful guide for learn- ing and skill development. Being in the ﬂow state is highly desirable; it feels good and we perform well in this state. Being in that space becomes its own intrinsic motivation and we will naturally do whatever is necessary to return to the ﬂow state when we are pushed out of it. Imagine that you are in the area of the graph where your high skills are meeting moderately high challenges, but not sufﬁcient challenges to fully absorb your attention. In this case, the performer can get back to the ﬂow state by adding challenges and in- creasing the complexity of the task. Similarly, if the performer is in the space where high challenges are met by skills that might not quite be up to the task, increasing the level of those skills will move the performer back into the potential ﬂow zone. It takes energy, attention, and focus to achieve this ﬂow state, but its presence can be a powerful clue that the performer is in an optimal state to learn, to grow, and to develop new skills. The Role of Attention and Focus In the normal world,",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.709787"
}