{
  "id": "a992c768e0fc",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 190,
  "content": "E — Ut = e@9U*N(h-EN(h-vvt)] + [((1-e®'N(h-wVt))(U*/q,)] (For convenience we will refer to the two sides of this equation as LHS [the left-hand side] and RHS [the right-hand side].) where b = carrying costs on the underlying instrument (for futures b = 0; for stock b = r) and all other abbreviations are those used in the Black-Scholes Model * 2 nf | [>+7} n wt Gq = [HXN-1) + V(N-1)? + 4M/0]/2 M = 2r/y N = 2b k = let To solve for U* we pick a desired degree of accuracy, €, satisfying: (LHS - RHS) /E<e We then perform progressive iterations, each time replacing U* , with: Uti = (E + RHS—b,U* |] / (1b) where b, = et N(hU*)(1-1/q,) + [I-e®) N’(hU*/(wVt)//q, Once U™ has been calculated to the desired degree of accuracy, the value of an American call, C, and its delta, A, can be found by solving: C=c + A(U/U*)%) 6. Barone-Adesi, Giovanni and Whaley, Robert E., “Efficient Analytic Approximation of American Option Values,” Journal of Finance, Vol. 42, No. 2, June 1987, pages 301-320. The Mathematics of Option Pricing 439 A= 8+ Ag,(U/U)*/U where C = the value of a European call 3) = the delta of a European call A, = (U*/q,){1-e®'N(nU\")| In order to find U* for a put, we must solve the equation E - Ut = e@* (EN(h— wt) - U*N(h)] — [1 - e& N(h)) (U*/q,)] (We again refer to the two sides of this equation as LHS [the left-hand side] and RHS |the right-hand side].) where b = carrying costs on the underlying instrument (for futures b = 0; for stock b = r) and all other abbreviations are those used in the Black-Scholes Model Ut ve «(F| + [>+ 5} } n we gq, = WN-l) - VN-1? + 4M/k)I/2 M = 2r/y¥2 N = 2b/e k = Let To solve for U* we pick a desired degree of accuracy, e, satisfying: {LHS — RHS) /E<e We then perform progressive iterations, each time replacing U\", with: U’7,, = [E- RHS - b,U\"] / (1-b,) where b, = et N(hU*)(1-1/q,) + [I-e®*N“(hU)/(wV)I/q, Once U™ has heen calculated to the desired degree of accuracy, the value of an American put, P, and its delta, A, can be found by solving: P=p+ A,U/U*)4% where p the value of a European put the delta of a European put — (U*/q,)[1-e% N(hU\")}] om ou 440 Appendix B NORMAL DISTRIBUTIONS Since the assumption that price changes are normally distributed plays such an impor- tant role in many theoretical pricing models, it may be useful to know how to compute some of the numbers associated with a normal distribution. The Mean (m) The mean (m) of a distribution of n occurrences is the average outcome of all the occurrences (x,}: n 1 m=> 2% 1=1 The Standard Deviation (c) The standard deviation (o) of a distribution of n occurrences is defined as:” o-Vid. Toy my 1=] If a distribution is normal, approximately 68.3 percent of the occurrences fall within one standard deviation of the mean, approximately 95.5 percent of the occur- rences fall within two standard deviations of the mean, and approximately 99.7 percent of the occurrences fall within three standard deviations of the mean. Skewness (Sk) and Kurtosis (Ku) If a distribution is approximately normal, it may be useful to know how the distribution deviates from a true normal distribution. We can determine this by computing the skewness and kurtosis of the distribution. Many of the measures associated with a distribution are derived from a group of numbers called moments. In general, the j* moment of a distribution about the mean is: n 1 m, = a mm) 1=1 To determine the skewness and kurtosis of a distribution, we need the second, third, and fourth moments: n 1 m, = 7 %,-m? 1=1 7. Because we are dividing by (n-1) this is technically the sample standard deviation. This is the form which is most commonly used for volatility calculations. The Mathematics of Option Pricing 44] 1 n M3 = >> (x,-_m)° 1=1 n 1 My = 5 (my 1=1 The skewness of a distribution is defined as: M3 A perfectly normal distribution has a skewness of zero. If the distribution is positively skewed (Sk > 0), the right tail is longer than the left. If the distribution is negatively skewed (SK < 0}, the left tail is longer than the right. The kurtosis of a distribution is defined as: skewness = . M4 kurtosis = ——z — 3 My A perfectly normal distribution has kurtosis of zero (mesokurtic). If a distribution has a positive kurtosis (Ku > Q), more occurrences fall in the middle and at the extreme tails of the distribution (leptokurtic}. If a distribution has a negative kurtosis (Ku < 0), fewer occurrences fall in the middle and at the extreme tails of the distribution (platykurtic). While almost all spreadsheets include the mean and standard deviation functions, and many also include skewness and kurtosis, it may be worthwhile to do a sample calculation. Consider, for example, the pinball distribution in Figure 4-2 (reproduced in Figure B-3}. In order to compute the mean, we must multiply the number of balls in each trough by the number of the trough, add up the total (563), and divide by the total number of balls (75): mean = 563/75 = 7.507 To compute the standard deviation, for each ball we square the difference between its trough and the mean, add up all 75 results, divide by the number of occurrences less one (74), and take the square root of this number. n standard deviation = Vo _ m2 Jj 2 (x, - m) 2% - 7.507) 1=1 Appendix B Zbl099 OSt\"9s— CQl Sb LLL 0€ 02S°09 Ode'el LiG’ep 00°02 ves’ L9s°¢ og! et v86'ey per tg 0€6°09 29°09 €Lo'v8 0 zuonelAeq x $a0uelinD909 Jo JoqUINN OSt'9S oA LZLV0E 06102 €0c'a! LIe'9 fs ere 2520\" ATA cad'9 L60°S+ oLe'0d €ce'0€ LEE Sy ose’9s porenbs uonejAeqg",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.451633"
}