{
  "id": "a7ab60a36b98",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 11,
  "content": "by some traders who have tried to control their uncomfortable thoughts, emotions, and related phys - ical sensations associated with tradin g . Perhaps you have tried similar strate g ies? Now that y ou have developed an inventor y of the wa y s y ou personall y tr y to ex - ercise psychological control over thoughts and emotions, it will be helpful to nex t TABLE 3.1 How Some Other Traders Have Tried to Control Unwanted Thoughts and Feelings Trie d to suppress t h ou gh ts an d f ee l in gs Snappe d rubbe r ba n d a r ou n d wri st w h en angry Di d n ’t use sto p s U se d a l co h o l an d d ru gs E ducated self o n fea r a n d g ree d Read self‐hel p books T ook medication s Tried to exert my willpower an d d isci pl in e T ook an anger management course Jum p ed i nto trades / o vertra d e d Cut man y winning trades s h or t Distracted sel f when u p se t Did relaxation and meditation exerc i se s Used a brain s y nchronization mac h ine; h o l ograp h ic / su bl imina l message C Ds Held on to l osing trade s T alked self out of anxiet y an d f ea r J oine d c h a t r oom to sta y cal m Use d h er b a l supp l ements a n d teas U se positive a ff irmations to c h ange ho w I th in k Di d n ’t take the t r ade O vertraded m y positions to make u p for p rior losses Left m y t radin g desk to t r y and calm d o wn Add e d to a l osin g position to g et out at br ea k e v en L ea rn e d a ll I cou ld a b out tec hni ca l anal y si s Tri e d to f o r ce m y self to be tou g h minded 15 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 75THE STRUGGLE TO CONTROL AND ELIMINATE EMOTIONS look at the benefi ts and costs of these eff orts. If you fi nd that you are g ettin g a lot of benefi t from your eff orts to control undesirable thou g hts and feelin g s, g reat! Y ou can continue to d o more o f t h e same. I f y ou are l i k e ever y one e l se, h owever, y ou are l i k e l y to fi n d t h at you are payin g a very h eavy price f or t h ese actions. Any b ene fi t is likel y to be onl y ver y temporar y , or hollow . Exercise 3.2 will help you to assess the advanta g es and disadvanta g es of your psyc h o l ogica l contro l strategies. In t h e Control Strategy column, list each strategy you y use d f rom t h e Control Strategy/What You Did column of Exercise 3.1. Then identifyd Exercise 3.2 Short- and Lon g-Term Costs and Benefi ts of My Control Strategies Control Strategy Disadvantages and Costs Advantages and Benefi ts Short-Term Long-Term Short-Term Long-Term Example 1: Avoided pulling the trigger Missed good profi t; felt bad Keeps me out of many good trades; not improving; feel like a loser Feel less anxious Not sure if there are any benefi ts Example 2: Exit trade before it can go against me Could have made 5+ points rather than 0.75 points; felt very frustrated Signifi cant lost profi ts; doubts about making it as a trader Relieved the fear Nothing comes to mind 16 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 76 TRADE MINDF U LLY t h e d isa d vantages an d costs f rom app l ying t h is strategy , b ot h s h ort‐ an d l ong‐term, t h en t h e a d vantages an d b ene fi ts. T h ere are two examp l es to h e l p gui d e you in t h e process of completing the columns. If you are l i k e ot h er tra d ers w h o h ave comp l ete d t h is exercise, you are l i k e l y to fi n d t h at t h e strategies you use to contro l unp l easant t h oug h ts an d f ee l ings d o h ave some short‐term benefi t. They tend to quickly alleviate the strong emotions. When a person is f ear f u l o f a l oss, f or examp l e, c l osing t h e tra d e provi d es imme d iate re l ie f o f t h e f ear b ecause t h e t h",
  "word_count": 1000,
  "topics": [
    "psychology",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:45.718618"
}