{
  "id": "713f72ded13b",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 121,
  "content": "of Economic Perspectives 17, no. 1 (2003): 59–82. Mandelbrot, Beno ˆıt, and Richard L. Hudson. The Misbehavior of Markets: A Fractal View of Financial Turbulence. New York: Basic Books, 2006. Mauboussin, Michael J. “Untangling Skill and Luck: How to Think about Outcomes—Past, Present and Future.” Maboussin on Strategy, Legg Mason Capital Management, July 2010. Miles, Jeremy, and Mark Shevlin. Applying Regression and Correlation: A Guide for Students and Researchers. Thousand Oaks, CA: Sage Publications, 2000. Niederhoffer, Victor. The Education of a Speculator. New York: John Wiley & Sons, 1998. Plummer, Tony. Forecasting Financial Markets: The Psychology of Successful Investing, 6th ed. London: Kogan Page, 2010. 194 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-biblio JWBT634-Grimes April 27, 2012 18:15 Printer: Hamilton Printing Bibliography 445 Raschke, Linda Bradford, and Laurence A. Conners. Street Smarts: High Probability Short-Term Trading Strategies. Jersey City, NJ: M. Gordon Publishing Group, 1996. Schabacker, Richard Wallace. Technical Analysis and Stock Market Proﬁts . New York: Forbes Publishing Co., 1932. Schabacker, Richard Wallace. Stock Market Proﬁts. New York: Forbes Publishing Co., 1934. Schwager, Jack D. Market Wizards: Interviews with Top Traders . New York: HarperCollins, 1992. Snedecor, George W., and William G. Cochran. Statistical Methods, 8th ed. Ames: Iowa State Uni- versity Press, 1989. Soros, George. The Alchemy of Finance: Reading the Mind of the Market. New York: John Wiley & Sons, 1994. Sperandeo, Victor. Trader Vic: Methods of a Wall Street Master. New York: John Wiley & Sons, 1993. Sperandeo, Victor. Trader Vic II: Principles of Professional Speculation. New York: John Wiley & Sons, 1998. Taleb, Nassim. Fooled by Randomness: The Hidden Role of Chance in Life and in the Markets . New York: Random House, 2008. Tsay, Ruey S. Analysis of Financial Time Series. Hoboken, NJ: John Wiley & Sons, 2005. Vince, Ralph. The Leverage Space Trading Model: Reconciling Portfolio Management Strategies and Economic Theory. Hoboken, NJ: John Wiley & Sons, 2009. Waitzkin, Josh. The Art of Learning: An Inner Journey to Optimal Performance. New York: Free Press, 2008. Wasserman, Larry. All of Nonparametric Statistics . New York: Springer, 2010. Wilder, J. Welles, Jr. New Concepts in Technical Trading Systems. McLeansville, NC: Trend Research, 1978. 195 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-babout JWBT634-Grimes April 27, 2012 19:35 Printer: Hamilton Printing About the Author A dam Grimes has nearly two decades of experience in the industry as a trader, analyst, and system developer. He began his trading career with agricultural com- modities, a reﬂection of his roots in a Midwestern farming community, and traded Chicago Mercantile Exchange (CME) listed currency futures during the Asian ﬁnancial crisis. Later, he managed a successful private investment partnership focused on short- term trading of stock index futures, and swing trading of other futures and options prod- ucts. He spent several years at the NYMEX, and has held positions for a number of ﬁrms in roles such as portfolio management, risk management, and quantitative system development. Adam is the CIO of Waverly Advisors, LLC, an asset management and advisory ﬁrm specializing in tactical allocation and risk management in liquid markets. Adam is an expert in applying quantitative tools and methodology to market data, particularly in modeling volatility and complex intra-market relationships. In addition to his ongoing research and trading, Adam is also a proliﬁc writer and educator. His personal website and blog (www.adamhgrimes.com) extends the work of this book with examples and applications to live market data. He has been a contributor on CNBC’s “FastMoney,” and his work and research have been quoted in major media outlets such as the Wall Street Journal, Investor’s Business Daily, TheStreet.com, SmartMoney.com, SFO Magazine , and many others. 447",
  "word_count": 709,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:53.714242"
}