{
  "id": "54f40d4a61cd",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 14,
  "content": "mean options? Yes, as my primary short position, I bought weekly puts in the stock indexes and the stocks I wanted to be short. I got my ass kicked for 2½ weeks. I bought weekly options because I wanted to maximize my position. At the time, I had about $7 million in my account. Each week that passed with nothing happening, I lost a couple of hundred thousand dollars as the options expired worthless. I bought the weekly options again and again. I couldn’t stop. But I was getting nervous, wondering how much longer I could keep taking these significant weekly losses. Then—I will never forget this—I watched CNBC on the day there was the first crack in the market, a decline of about 3%. I watched the commentators talking about how huge of a buying opportunity that 3% break was. I almost fell to the floor. I was thinking, “You bastards! How do you not see what is going on?” Why were you angry? Did you think the CNBC commentators’ recommendations would affect the market? No, I don’t believe they have any impact, but I thought their comments might represent how people were thinking. And if everyone felt this way, it would push the market collapse that I was looking for out another couple of weeks. I didn’t want to go through another two weeks of bleeding money on my short-term puts. I didn’t want to have to keep losing six figures a week. Given these weeks of bleeding money, with the prospect of more of the same, did your confidence waver? No, I knew the pandemic was coming and that it couldn’t be stopped. Let me tell you a story that illustrates my frame of mind. Every few months, we have a dads dinner where a bunch of dads of the kids that are all friends go out to dinner at this neighborhood steakhouse. We were having one of these dinners right around this time. About midway through dinner, someone mentions this China coronavirus thing and asks if it’s real. I just let it out and said, “You guys are going to think I’m crazy, but let me tell you what’s about to happen. In the next few weeks, we will all learn that the world is going to shut down. I have no idea what that means, 48 but I would assume there’s going to be chaos, and we’re going to run out of all sorts of stuff. I’ve prepared for it by buying a freezer and stocking up on everything we might need.” I must have been very convincing because three of these dads went out the next day and bought freezers at our local Home Depot. Then, about two weeks later, I received messages from each of them thanking me and saying they couldn’t believe I told them exactly what would happen weeks earlier. It was a bittersweet moment for me because I was distraught over the pandemic being real and the devastation it caused, but at the same time, I felt so vindicated as an investor. I wasn’t insane. It was the biggest trade in my life. After the market finally cracked, did you replenish your weekly options when they expired? Yes, I kept taking those profits and buying puts again and again. I was seeing people processing something that I had already processed weeks earlier. Every day, more influential people said the pandemic was real and the market would react further. I was probably sleeping only two or three hours a night. I knew this was the moment I had waited for my entire life. I want to be very clear: I mean as a trader. I never hope for bad things to happen, but as a trader, I knew this was my moment to do what I do. The Covid bear market didn’t last long, and the market reversed abruptly, eventually setting new highs by a wide margin. When did you abandon your bearish stance? During that market drop, something way more important was happening that I knew would become an even bigger trade for me. I recognized that a handful of companies were positioned to not just benefit from the virus but benefit hugely. And those companies were being sold off along with the rest of the market, which blew my mind. The potential impact of the virus on these companies was so obvious that if you asked a 13-year-old on the street whether one of these companies would benefit or be harmed by a global pandemic where everybody had to stay home, they could give you the correct answer. I’m talking about companies like Peloton when people can’t go to gyms, Shopify when every retailer in the world now needs a significant 49 e-commerce presence, and Amazon when everyone had to order everything online. This is not complicated stuff. It is just really, really obvious. What about the vaccine companies? I didn’t mess with the vaccine companies. You didn’t know whether they would be successful. The vaccine companies required some degree of speculation and being right about something. The companies I was looking to buy were 100% shots. There was no question. There was no debate. There was no discussion to be had. The only question was when, not if, the market would see this. When did you decide to go long these companies? The market was in panic mode. I wasn’t going to invest in these companies while the market was in freefall. I was prepared to go all in on these long trades in a way that I had never done before, but I was not going to flip from my short positions to long positions until after the market had made a turn. I knew precisely what stocks I was going to trade. I was mentally prepared, so no research had to be done. Exactly two days after the market bottomed, I exited all my short positions and went leveraged long. How did you know this two-day",
  "word_count": 1000,
  "topics": [
    "options",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:44.180357"
}