{
  "id": "827921727617",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 39,
  "content": "better read on the market than any chart pattern. Converging Ranges Trading ranges are periods of relative consensus, where the market tends to trade around a price level in equilibrium. One common variation of the trading range idea sees the market making successively smaller swings, as if zeroing in on a target price level. The edges of this range appear to converge at some point in the future, and this pattern often appears to be a triangle on price charts, as in Figure 4.19. Traditionally, the assumption is that these triangles set up good breakout trades, and there are many rules regarding direction and price targets for these breakouts. I have not found any of these traditional rules to be effective or reliable; sometimes they work FIGURE 4.19 A Converging Range t 59 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing 118 MARKET STRUCTURE FIGURE 4.18 A Tighter Consolidation Against Resistance Often Leads to a Break of That Resistance One ﬁnal structure to be aware of is a tight consolidation near the edge of one side of the range, as in Figure 4.18. Remember, if the edges of the range are going to hold as support or resistance, the pattern we expect to see is price rejection near the level. If, instead, prices are able to consolidate and hold near one side of the range, this is more indicative of pressure building against that side of the range. This is a classic precursor of breakout, and many chartists would read this as a smaller range inside a bigger range, a not incorrect deﬁnition. Furthermore, this pattern is also the basis for the classic cup and handle chart pattern, but reading the simple dynamics of emerging market structure will usually give a better read on the market than any chart pattern. Converging Ranges Trading ranges are periods of relative consensus, where the market tends to trade around a price level in equilibrium. One common variation of the trading range idea sees the market making successively smaller swings, as if zeroing in on a target price level. The edges of this range appear to converge at some point in the future, and this pattern often appears to be a triangle on price charts, as in Figure 4.19. Traditionally, the assumption is that these triangles set up good breakout trades, and there are many rules regarding direction and price targets for these breakouts. I have not found any of these traditional rules to be effective or reliable; sometimes they work FIGURE 4.19 A Converging Range P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing On Trading Ranges 119 FIGURE 4.20 An Ascending Triangle. Holding Higher Lows into Resistance Is a Sign of Increasing Buying Pressure well, but just as often they do not. My trading rules for triangles are simple and reduce to one principle: do not fade the ﬁrst breakout from one of these formations. Though these breakouts may not be reliable or consistent enough to build a trading program on, you certainly do not want to be caught on the wrong side of a strong move out of any kind of consolidation. There are many variations of these converging ranges, which chartists describe as symmetrical triangles, ascending or descending triangles, wedges, pennants, and so on, usually with the qualiﬁcation that “volume is very important in these formations.” (How do they know that?) Most of these are traditionally taken to be continuation patterns, but, for me, it is simple: they are all basically the same pattern. They clearly show volatility compression, which puts us on guard and in breakout mode, looking for continuation of any breakout from these ranges. There is one exception that might be slightly more sig- niﬁcant: the ascending triangle (see Figure 4.20), where price holds successively smaller declines (higher lows) into a clearly deﬁned resistance level (or the same formation, in- verted, to the downside). This type of pattern typically shows strengthening conviction on the part of buyers, reﬂected in weakening price rejection from resistance, and usually leading to a breakout above that resistance. This is another pattern that sets up good breakout trades. Whenever a market makes a very large, sharp movement in one direction, followed by a similar move in the other direction, this suggests confusion on the part of market participants as they try to process whatever information caused the price shock. The normal expectation, following this kind of price movement, is for the market to spend a period of time consolidating, most likely in some kind of converging triangle formation. It is very common to see traders incur multiple losses in these areas because they are ﬁrst drawn to the market by the large price movements, and then they get caught in the random oscillations of the triangle. Simply by recognizing that a large spike followed by a quick reverse spike usually leads to a triangle and a very suboptimal trading environment, many of these losses can be avoided. Expanding Ranges Chartists also recognize a number of formations relating to widening triangles where each swing, both up and down, is bigger than the preced- ing swings. There are also a number of diamond-shaped formations where price ﬁrst P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing 120 MARKET STRUCTURE FIGURE 4.21 An Expanding Range expands and then contracts in a classic triangle, and, of course, there are associated trading rules and targets for each formation. My rule for these is simple: the market is confused (as evidenced by the price action) and I do not have to have a position. I ﬁnd it difﬁcult to deﬁne my risk or to",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure"
  ],
  "created_at": "2026-02-05T00:37:53.701478"
}