{
  "id": "993509827793",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 39,
  "content": "we plan to close out the position by: 1. Letting any out-of-the-money options expire worthless. 2. Selling any in-the-money options at parity (intrinsic value) or, equivalently, exercising them and offsetting them against the underlying futures contract. 3. Liquidating any outstanding futures contracts at the market price. Let’s go through this procedure step by step and see what the complete results of our hedge were. Original Hedge: At June expiration (week 10) we can liquidate our June 100 calls by either selling them at 2.54, or by selling futures at 102.54 and exercising the calls. Either method will result in a credit of 2.54 to our account. Since we originally paid 3.25 for each option, we have effectively lost .71 per option, and our total loss on the options is 100 x -.71 =-71.00. As part of our original hedge we also sold 57 June futures at 101.35. At expiration we had to buy them back at 102.54, for a loss of 1.19 per contract. Our total loss on the futures is therefore 57 x -1.19 = -67.83. Adding this to our option loss, the total loss on the original hedge is -71.00 -67.83 = -138.83. This certainly does not appear to have been successful. We expected to make money on the hedge, and yet we have a sizable loss. Adjustments: The original hedge was not our only transaction. In order to remain delta neutral, we were forced to buy and sell futures contracts over the ten-week life of the option, At the end of week one we were 500 deltas long, so we had to sell 5 futures at Figure 5-1 Total Total Interest Futures Delta of Delta Adjustment Futuree on Week Price 100Cali Poeltion In Futures Adjustment Variation Variation 0 101.35 57 0 0 0 0 0 1 102.26 62 +500 sell 5 5 ~51.87 -.72 2 99.07 46 ~1,600 buy 16 +11 +197.78 +2.43 3 400.39 53 +700 sell 7 +4 ~60.72 ~.65 4 100.76 56 +300 sell 3 +1 ~19.61 —.18 5 403.59 74 +1,800 sell 18 -17 —158.48 -1.22 6 99.26 45 ~2,900 buy 29 +12 +320.42 +1.97 7 98.28 35 7,000 buy 10 +22 +44,10 +.20 8 99.98 50 +1,500 sell 15 +7 59.50 -.18 9 103.78 93 +4,300 sell 43 -36 —190.00 —.29 10 102.54 buy 36 86 Chapter 5 102.26. At the end of week two we were 1600 deltas short, so we had to buy 16 futures at 99.07; and so on each week until the end of week ten. At expiration we were short an extra 36 futures contracts, and we bought these in at the closing price of 102.54, Note that each time the futures price rose our delta position became positive, so that we were forced to sell futures; and each time the futures price fell our delta position became negative, so that we were forced to buy futures. Because our adjustments depended on the delta position, we were forced to do what every trader wants to do: buy low and sell high. What was the result of all the adjustments required to maintain a delta neutral position? In fact the result was a profit of 205.27. (The reader may wish to confirm this by adding up the cash flow from all the trades in the adjustment column in Figure 5-1.) This profit more than offset the losses incurred from the original hedge. Carrying Costs: What else will effect our final profit or loss? Originally we bought calls and sold futures. While futures are subject to futures-type settlement and require no initial cash outlay, the options are subject to stock-type settlement and require full payment. We bought 100 calls for 3.25 each, for a total outlay of 325.00. Based on our assumed 8.00% interest rate, the carrying cost on 325.00 for 10 weeks is .08 x 70/365 x 325.00 = 4.99, We will have to include this debit of 4.99 in our final calculations. Variation Costs: Finally, we must take into consideration the variation costs required to maintain our futures position. As futures move up or down in price, cash is either credited to, or debited from, a trader’s account. In theory, a trader can earn interest on a cash credit, but must pay interest on a cash debit. For example, we initially sold 57 futures contracts at 101.35. One week later the futures price rose to 102.26, so our account was debited 57 x (101.35 — 102.26} = -51.87. Financing this debit for nine weeks at 8.00% cost us—51.87 x .08 x 63/365 = -.72. In order to remain delta neutral at the end of week one we sold an additional five futures contracts, for a new total of short 62 futures. One week later (week 2) the futures price fell to 99.07, so our account was credited 62 x {102.26 - 99.07) = +197.78. The amount of interest we were able to earn on this credit for 8 weeks at 8.00% was +197.78 x .08 x 56/365 = +2.43. The cash flow resulting from futures variation is shown in Figure 5-1 under the “variation” column, and the resulting interest is shown under the “interest on variation” column. The total interest is +1.36. We can now summarize all the profit and loss components resulting from our position: Original Hedge Adjustments Option Carrying Costs Variation Costs -138.83 4205.27 -4.99 +1.36 The total profit is -138.83 +205.27 -4.99 +1.36 = +62.81. How much did the theoretical pricing model predict we would make? We bought 100 calls worth 3.88 for 3.25 each, for a total theoretical edge of 100 x (3.88 - 3.25) = 100 x .63 = +63.00. In other words, the theoretical model came very close to predicting the actual profit from the position. Using an Option’s Theoretical Value 87 In our example, the profit and loss was made up of four components. Two of these were profitable (the adjustments and the variation costs) while two were unprofitable (the original hedge and the option carrying costs). Is this always",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.428398"
}