{
  "id": "7d60126ad9bc",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 111,
  "content": "market return. CAPM was an important step in the evolution of academic thinking about markets, but has little, if any, utility in actual practice. causation In ﬁnancial markets, it is very difﬁcult to determine causative links between markets and exogenous factors. Classically, researchers in other ﬁelds try to isolate po- tential causative factors to understand their inﬂuence, but this is difﬁcult to do in market settings. It is important to avoid assumptions and to learn to think carefully about this important issue. central limit theorem A theorem that informally states that the outcome of many ran- dom events will tend to follow the normal distribution. For instance, if a set of dice is rolled many times and the rolls recorded, the data set will eventually approximate the normal distribution. The central limit theorem is very important to many statistical tests. central tendency The term that describes how values in a probability distribution tend to cluster around one or more values. Mean, median, and mode are common measures of central tendency. chandelier stop A trailing stop technique that hangs a stop a certain distance under the highest point the market has reached since the position was initiated. (The technique is mirrored to the downside.) Many variations are possible. climax Usually refers to a move near the end of an extended trend in which the trend accelerates into a steeper move, usually accompanied by an increase in volume. Climaxes on higher time frames can mark major inﬂection points in markets, but smaller climaxes are common on lower time frames. One of the central problems of technical analysis is discerning climax from strength (or weakness, in the case of a downside climax). 178 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing Glossary 429 close Many ﬁnancial markets report ofﬁcial closing prices at the end of the session. These are usually not simply the last price traded (though they may be in some markets), but are set through several different methods. This price is important to traders because daily P&Ls are marked to this price. Also, many traders will use close to refer to the last price of any time interval (e.g., “the close of this current 5-minute bar or candle”). coefﬁcient of variation Obtained by dividing the standard deviation by the mean— conceptually this is similar to the reciprocal of the Sharpe ratio with the risk-free rate set to zero. While not a meaningful measure by itself, it is useful when comparing differ- ent trading techniques, systems, or patterns, as it shows how much variability is being assumed per unit of return. complex pullback A two-legged pullback that is a complete ABCD trend structure. These are common, especially in mature trends. compound loss Compound gains or losses take into account the compounding effect of interest. For instance, two consecutive 10 percent losses do not total a 20 percent loss, because the second was made on a smaller capital base. conditional probability If Prob(A) is the probability of event A occurring, then Prob(A|B) is read as “the probability of A occurring, given that B has occurred.” Conditional prob- ability is one of the techniques used to ascertain independence in trading systems and market patterns. Many traders make errors in thinking about probabilities because they do not understand this important subject. cone of uncertainty A term that describes the future distribution of asset prices for a given level of volatility. Useful in a theoretical sense to visualize some speciﬁc prob- lems relating to uncertainty, but most applications assume that the normal distribution holds. Since it almost never does in ﬁnancial markets, there is limited practical utility for this tool. conﬂuence Some methodologies assume that support and resistance levels are more meaningful if levels from several different time frames line up at a speciﬁc price. This lining-up of levels is called conﬂuence. consolidated tape A high-speed system that electronically reports the last price and vol- ume data on sales of exchange-listed equities. consolidation A general term to describe a condition in which markets are not trending. In general, consolidation areas are seen as resting points in a trend, usually leading to continuation in the direction of the original trend. For practical purposes, pullbacks, ﬂags, and consolidations are equivalent terms. day trade A trade entered and exited on the same day and not held overnight. demand line Richard Wyckoff’s term for uptrend lines drawn below prices that show where buyers’ demand has been sufﬁcient to stop the downward movements of prices. dependent variable In regression analysis, the variable whose values are assumed to change in response to the other variable(s). disaster risks A term used to refer to risks from nearly completely unforeseeable events such as ﬁre, ﬂood, or a large-scale failure of the exchange network. These risks are ex- tremely rare, could have catastrophic consequences, and are very difﬁcult to hedge. 179 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing 430 GLOSSARY discretionary trading A style of trading that allows varying degrees of human input in trading decisions. distribution The opposite of accumulation; traditionally, a price area where holders of an asset are seen to be selling their inventory carefully, so as to avoid causing prices to break down. In practice, often taken as a sign of impending price weakness. drawdown In trading system design or",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.712834"
}