{
  "id": "cfaedd3a5e49",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 35,
  "content": "102 call because the implied volatility of the 98 call is a full percentage point less than the implied volatility of the 102 call. Does this mean that one ought to buy the 98 call and sell the 102 call? Not necessarily. If the future volatility of the Treasury Bonds turns out to be 8%, then both options are overpriced; while if volatility turns out to be 14%, both options are underpriced. Moreover, the leverage values of the options may not be the same so that their sensitivity to changes in market conditions may, under Volatility 75 some circumstances, make several 102 calls a more desirable purchase than one 98 call. If we ignore these considerations, in relative terms the 98 call is a better value because its implied volatility is lower. While option traders may at times refer to any of the four types of volatilities, two of these stand out in importance, the future volatility and the implied volatility. The future volatility of an underlying contract determines the value of options on that contract. The implied volatility is a reflection of each option’s price. These two numbers, value and price, are what all traders, not just option traders, are concerned with. If a contract has a high value and a low price, then a trader will want to be a buyer. Ifa contract has alow value and a high price, then a trader will want to be a seller. For an option trader this usually means comparing the future volatility with the implied volatility. If implied volatility is low with respect to the expected future volatility, a trader will prefer to buy options; if implied volatility is high, a trader will prefer to sell options. Of course, future volatility is an unknown, so we tend to look at the historical and forecast volatilities to help us make an intelligent guess about the future. But in the final analysis, it is the future volatility which determines an option’s value. To help the new trader understand the various types of volatility, consider the following analogy to weather forecasting. Suppose a trader living in Chicago gets up on a July morning and must decide what clothes to wear that day. Do you think he will consider putting on a parka? This is not a logical choice because he knows that historically itis not sufficiently cold in Chicago in July to warrant wearing a winter coat. Next, he might turn on the radio or television to listen to the weather forecast. The forecaster is predicting clear skies with temperatures around 90° (32°C). Based on this information, our trader has reached a decision: he will wear a short sleeve shirt with no sweater or jacket, and he certainly won’t need an umbrella. However, just to be sure, he decides to take a look out the window to see what the people outside are wearing. To his surprise, everyone is wearing a coat and carrying an umbrella. The people outside, through their clothing, are implying completely different weather. What clothes should the trader then wear? He must make some decision, but whom should he believe, the weather forecaster or the people in the street? There can be no certain answer because the trader will not know the future weather until the end of the day. Much depends on the trader’s knowledge of local conditions. Perhaps the trader lives in an area far removed from where the weather forecaster is located. Then he must give added weight to local conditions. On the other hand, perhaps the people in the street all listened to a weather forecaster who has a history of playing practical jokes. The decision on what clothes to wear, just like every trading decision, depends on a great many factors. Not only must the decision be made on the basis of the best available information, but the decision must also be made with consideration for the possibility of error. What are the benefits of being right? What are the consequences of being wrong? If a trader fails to take an umbrella and it rains, that may be of little consequence if the bus picks him up right outside his residence and drops him off right outside his place of work. On the other hand, if he must walk several blocks in the rain, he might catch the flu and be away from work for a week. The choices are never easy, and one can only hope to make the decision that will turn out best in the long run. 76 Chapter 4 Seasonal Volatility There is one other type of volatility with which a commodity trader may have to deal. Certain agricultural commodities, such as corn, soybeans, and wheat, are very sensitive to volatility factors arising from severe seasonal weather conditions. Such conditions occur especially in the summer months when drought can destroy major portions of a crop and cause prices to fluctuate wildly. For this reason, grains show a significant increase in volatility during the months of June, July, and August. Conversely, they show a significant decrease during the early spring months, before American planting has begun but after the South American crop has been harvested. Given these factors, one Must atttomatically assign a higher volatility to an option contract which extends through the summer months. If, in February, a trader has assigned a volatility of 18% to a May soybean contract, he will certainly choose some higher volatility, perhaps 22%, for a November contract. He knows that the November contract includes the summer months, while the May contract does not. The effect of seasonal volatility on soybeans is shown in Figure 4-10. A trader who is new to options might initially question whether volatility is really that important. He has probably been pursuing directional strategies where volatility was not a consideration. It is also possible to purstte a variety of directional strategies in the option market. But if a trader has a thorough understanding of volatility, he has an additional variable",
  "word_count": 1000,
  "topics": [
    "options",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.427752"
}