{
  "id": "9a228a7dc478",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 120,
  "content": "of a protective option offers a limited and known risk, a hedger might be willing to accept more risk in return for some other advantage. Instead of purchasing an option to protect an existing position, a hedger might consider selling, or writing, an option against the position. This strategy does not offer the limited risk afforded by the purchase of a protective option but, in its favor, the strategy results in a cash credit rather than a debit. This credit offers some, though not unlimited, protection against an adverse move in the underlying market. Consider a fund manager whose portfolio consists of a long position in a certain stock. If the manager is worried about a decline in the price of the stock, he might choose to sell a call option against the stock. The amount of protection the manager is seeking, as well as the potential upside appreciation, will determine which call is sold, whether in-the-money, at-the-money, or out-of-the-money. Selling an in-the-money call offers a high degree of protection, but will eliminate most upside profit potential. Selling Hedging with Options 261 an out-of-the-money call offers less protection but leaves room for large upside profit potential. For example, if the stock is currently trading at 100, the fund manager might sell a 95 call. If the 95 call is trading at 614, the sale of the call will offer a high degree of protection against a decline in the price of the stock. As long as the stock declines by no more than 614, to 9314, the manager will do no worse than break even. Unfortunately, if the stock begins to rise, the fund manager will not participate in the rise since the stock will be called away when the manager is assigned on the 95 call. Still, even if the stock rises, the manager will get to keep the 1 !4-point time premium he received from the sale of the 95 call. If the manager wants to participate in upside movement in the stock, and is also willing to accept less protection on the downside, he might sell a 105 call. If the 105 call is trading at two, the sale of this option will only protect him against a two-point fall, to 98, in the price of the stock. If, however, the stock begins to rise, he will participate point for point in this advance up to a price of 105. Above 105, he can expect the stock to be called away. Which option should the manager sell? Again, that is a subjective decision based on how much risk the manager is willing to take as well as the amount of upside appreciation in which he wants to participate. Many covered write programs involve selling at-the-money options. Such options offer less protection than in-the-money calls, and less profit potential than out-of-the-money options. An at-the-money option is pure time premium. If the market sits still, a portfolio of at-the-money options have been sold against an existing position in the underlying instrument will show the greatest appreciation in value. The value of typical covered writes, also known as overwrites, are shown in Figures 13-3 (covered call) and 13-4 (covered put). When the underlying is purchased and calls are simultaneously sold against the position, a covered write is also referred to as a buy/write. As with the purchase of a protective option, a covered write consists of a position in the underlying and an option. It can therefore be expressed as a synthetic position: long underlying + short call = short put short underlying + short put = short call A hedger who sells a call to protect a long underlying position has effectively sold a put at the same exercise price. A hedger who sells a put to protect a short underlying position has effectively sold a call. In our example, if the portfolio manager sells a 100 call to protect a long stock position, the result is identical to selling a 100 put. The purchase of a protective option and the sale of a covered option are the two most common hedging strategies involving options. If given a choice between these strategies, which one should a hedger choose? In theory, the hedger ought to base his decision on the same criteria as the pure trader: price versus value. In general, if the price of an option is lower than its value, then the purchase of a protective call or put makes the most sense. If the price of an option is higher than its value, then the sale of a covered call or put makes the most sense. By comparing implied volatility to a forecast 262 Chapter 13 Figure 13-3: A Covered Call combined position “ aa “ sell a covered call va ma _ —<_--- — Va long an underlying position 4 Figure 13-4: A Covered Put Vv NN combined position NN — NN sell a covered put ~<<_ \\ N N ro TAQ oe ee ee LS ne SN N a short an underlying position Hedging with Options 263 volatility, a hedger ought to be able to make a sensible determination as to whether he wants to buy or sell options. Of course, he is still left with the choice of exercise prices. This will depend on the amount of adverse or favorable movement the hedger foresees, as well as the risk he is willing to accept if he is wrong. While theoretical considerations will often play a role in a hedger’s decision, practical considerations may also be important. If a hedger knows that he will be forced out of business if the underlying contract moves beyond a certain price, then the purchase of a protective option at that exercise price may be the most sensible strategy, regardless of whether the option is theoretically overpriced. ! Most hedgers find, however, that there is a psychological barrier to buying options. “Why should J lay out money for an option when | will probably lose the premium?” The hedger",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.440652"
}