{
  "id": "0f9caaa54ee6",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 118,
  "content": "Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing Glossary 439 markets strong or weak near the beginning or end of the month?) or even time of day for some markets. second-order pivot A pivot point that is preceded and followed by lower ﬁrst-order pivots for a second-order pivot high (reversed for pivot lows). semistrong form EMH A variant of the efﬁcient markets hypothesis that postulates that all publicly available information is incorporated in price. If this is true, it would not be possible to achieve superior risk-adjusted returns based on any publicly available information. setup leg Another term for the preceding trend leg, or the leg that sets up a retracement. Sharpe ratio A simplistic measure of risk-adjusted performance. short To short or sell short is to sell an asset with the idea of buying it back later at a lower price. For most new traders, buying and selling higher is intuitive, but most pro- fessional traders are as comfortable shorting and buying back lower. (In this case, the sequence is “sell high, buy lower,” which is still proﬁtable.) signiﬁcance testing A statistical testing technique that attempts to evaluate the proba- bility that the results could be due to chance and not to the presence of an actual signal in the market. (Note: This is a complex topic. This explanation is market-speciﬁc.) simple moving average (SMA) A tool commonly used in technical analysis that averages prices over a lookback window, moving this window forward with each trading bar. For example, a 20-period SMA would average the past 20 bars’ prices. size effect Smaller stocks (in terms of market cap) tend to outperform larger stocks, but there may be offsetting risks. slippage The difference between the intended and achieved execution prices. A cost of trading or an element of transaction costs. spread This term is used in two different contexts: First, it is the distance between the bid and the ask in markets; wider spreads usually indicate less liquidity and higher costs of trading. Second, see spread trading. spread trading A type of trading strategy that seeks to proﬁt from changes in the relative value of a set of markets by being long and short different assets. This technique is an important part of most professional traders’ tool kits. springs The opposite of upthrusts: Price trades below support and immediately fails to carry lower. The quick recovery shows underlying buying pressure and potential accu- mulation. standard deviation A measure of dispersion, also used as a (potentially poor) proxy for risk in many ﬁnancial analyses. Standard Deviation Control Chart A tool to visualize the variation in a trader’s returns over time. Can be used to highlight potential problems and issues with changing perfor- mance. standard deviation spike An indicator that standardizes each bar’s price change for cur- rent volatility conditions. stationary In a stationary time series, the properties of the distribution do not change over time. Note that this is not the same as saying prices do not move or trend; 189 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing 440 GLOSSARY stationarity refers to the shape and location of the return distribution. There is debate about whether ﬁnancial markets exhibit stationarity. Stoller Average Range Channels (STARC) A modern variation of the Keltner Channel concept. stop and reverse A trading strategy that, rather than exiting the market, ﬂips from long to short and vice versa when a stop level is hit. stop-loss point An initial point for directional trades, established at the time the trade is entered, where a loss will be booked on the trade. Stop-loss points must be placed outside the noise level of the market and at price levels where the trade is decisively wrong. Setting correct stop-loss points is a combination of art and science. strong form EMH A form of EMH that states that all information, even secret inside information, is incorporated in the price. Used today as a theoretical concept only, and well refuted by a number of events and empirical studies. supply line Another name for a downward-sloping trend line, drawn above prices. So- called because it represents an area where supply has been sufﬁcient to meet demand and stop the upward movement of prices in the past. support A price area where it is anticipated buyers might offer enough buying interest to hold prices above the level. The study of how price acts around support and resistance is one of the building blocks of technical analysis. survivorship bias Survivorship bias covers a range of logical errors and mistakes that may come from examining the surviving members of a game of chance or another selec- tion process. It is almost always better to examine the entire group before the selection process, as the survivors can give misleading impressions about the process and the probabilities involved. swings Price movements from one level to another. This is an imprecise term with some overlap between swings and trends. (Chapter 2 offers a structured approach to deﬁning swings based on pivot points and market structure.) swing trading Formally, a style of trading that seeks to proﬁt from the next swing in the market. Swing traders generally do not scale in, and do not attempt to hold through large, adverse price movements. Informally, many writers use this term to describe the trader who focuses on three-day to two-week holding periods, but this is a faulty deﬁnition of the term. systematic trading Usually refers to a style of trading that is rule-based and that could be at least partially computerized. tail risk The risk of large outlier events at the tails",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.713869"
}