{
  "id": "5414fb8b5045",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 0,
  "content": "Updated Text for This Updated Text PDF is only for purchasers of the audiobook edition of Unknown Market Wizards on or after November 7, 2023. UNKNiWN MARKET WIZARDS Other books by Jack D. Schwager ⚡ Market Wizards: Interviews with Top Traders The New Market Wizards: Conversations with America’s Top Traders Hedge Fund Market Wizards: How Winning Traders Win Stock Market Wizards: Interviews with America’s Top Stock Traders The Little Book of Market Wizards: Lessons from the Greatest Traders A Complete Guide to the Futures Markets: Technical Analysis, Trading Systems, Fundamental Analysis, Options, Spreads and Trading Principles Market Sense and Nonsense: How the Markets Really Work (and How They Don’t) Schwager on Futures: Technical Analysis Schwager on Futures: Fundamental Analysis Schwager on Futures: Managed Trading Myths and Truths UNKNiWN MARKET WIZARDS The best traders you've never heard of JACK D. SCHWAGER Ill Harriman House harriman house ltd 3 Viceroy Court Bedford Road Petersfield Hampshire GU32 3LJ GREAT BRITAIN Tel: +44 (0)1730 233870 Email: enquiries@harriman-house.com Website: harriman.house First published in 2020. This revised paperback edition 2023. Copyright © Jack D. Schwager The right of Jack D. Schwager to be identified as the Author has been asserted in accordance with the Copyright, Design and Patents Act 1988. Hardback ISBN: 978-0-85719-869-3 Paperback ISBN: 978-0-85719-871-6 eBook ISBN: 978-1-80409-052-7 British Library Cataloguing in Publication Data A CIP catalogue record for this book can be obtained from the British Library. All rights reserved; no part of this publication may be reproduced, stored in a retrieval system, or transmitted in any form or by any means, electronic, mechanical, photocopying, recording, or otherwise without the prior written permission of the Publisher. This book may not be lent, resold, hired out or otherwise disposed of by way of trade in any form of binding or cover other than that in which it is published without the prior written consent of the Publisher. Whilst every effort has been made to ensure that information in this book is accurate, no liability can be accepted for any loss incurred in any way whatsoever by any person relying solely on the information contained herein. No responsibility for loss occasioned to any person or corporate body acting or refraining to act as a result of reading material in this book can be accepted by the Publisher, by the Author, or by the employers of the Author. Ill Harriman House 5 Preface to the Revised Edition I am doing something with this volume I have never done before in any Market Wizards book: revisiting the traders years later for an update. I conducted the original interviews for Unknown Market Wizards in 2019. The years since then have been remarkably eventful, witnessing a worldwide pandemic, extraordinary government stimulative actions, a transition from low inflation to the highest inflation in 40 years, and two bear markets. The assumption that readers would be curious about how the traders interviewed navigated the turbulent markets of this interim period provided the catalyst for my decision to conduct follow-up interviews for this revised edition. How have the traders fared in the intervening years since the original interviews? As demonstrated by the accompanying table, which summarizes the annual returns and worst drawdown experienced by the traders during the past four years, they have continued to generate superior performance. All but two of the traders had average annual returns greater than 20%, with some far exceeding this level. The only two traders below this average return level maintained strong return/risk performance. Their more moderate returns simply resulted from their choosing to run low-exposure portfolios. 6 They could have doubled their exposure levels—and, by implication, returns—and still had low maximum draw down levels. Two statistics that require further explanation are Camillo’s 2022 return and the surveyed period maximum drawdown. These numbers, which seem to imply that Camillo witnessed a devasting surrender of previous profits, are misleading. These figures miss that, in 2022, Camillo recognized the market environment was unfavorable to his strategy and drastically reduced his trading size (an action discussed in the update to his chapter), thereby greatly mitigating his dollar losses. As a result, despite the huge percentage decline in 2022, he only surrendered about 13% of the profits of the prior three years, and the period since our original interview represented the best performance of his career. There is a valuable lesson here: reducing your exposure when your trading is out of sync with the markets is critical to long-term success. Readers may note that Jeffrey Neumann is missing from the accompanying table. This omitted entry reflects Neumann’s reluctance to have his performance numbers made public, which, in some sense, is ironic since the last few years were the best of his entire career (a fact I was able to verify) and arguably the best of any trader surveyed in this volume. 7 Annual Return (%)* Average Annual Compounded Return Average Annual Arithmetic Return Maximum Drawdown (%)** 2019 2020 2021 2022 2019–2022 2019–2022 2019–2022 Brandt 37.1 39.4 50.2 52.9 44.7 44.9 −7.0 Shapiro 9.9 18.4 17.3 15.1 15.1 15.2 −3.6 Bargh 166.2 80.0 52.4 119.0 100.0 104.4 −9.7 Sall 121.4 48.6 101.7 273.5 123.1 136.3 −31.0 Dhaliwal 466.0 80.0 50.4 17.2 105.9 153.4 −16.2 Netto 4.4 5.6 53.4 26.9 21.0 22.6 −10.5 Camillo 28.2 356.5 8.4 −52.9 31.5 85.1 −67.1 Parker 15.6 53.7 19.8 −0.4 20.7 22.2 −18.9 Kean 34.1 54.6 23.8 −6.8 24.4 26.4 −16.4 Krejčí 15.0 14.5 9.6 6.9 11.4 11.5 −7.0 * All returns are gross (i.e., returns exclude management and incentive fee deductions in cases where return figures are based on managed accounts). Annual returns include compounding of monthly returns except for accounts traded at constant fixed notional level for the entire year. ** Largest percentage decline from prior equity peak based on month-end data. Note: The data in this table has not been audited, and insofar as any of the traders included might manage assets other than their own, this data should not be relied upon for any investment decisions. 8 futures traders part 9 Peter Brandt",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.178362"
}