{
  "id": "d68e53370702",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 4,
  "content": "expiration date for stock options in the United States is usually the third Saturday after the third Friday of the expiration month. For options on futures contracts, however, the expiration need not coincide with the delivery month specified in the option contract. In some cases the exact expiration date for a futures option can predate the delivery month of the underlying futures contract by several weeks. A crude oil option on the NYMEX will typically expire the first Saturday of the preceding month, so that an October option will actually expire the first Saturday in September. 1. Several exchanges have recently introduced flex options, which permit the buyer and seller to negotiate both the exercise price and expiration date. These are still considered exchange traded options since the contracts are guaranteed by the exchange. The Language of Options 3 Figure 1-1: Contract Specifications Crude Oil* October 21 Call | Expiration Exercise | Underlying Date Price Type GE March 80 Put *If this is a futures option, the underlying is a futures contract rather than the physical commodity. Figure 1-2: An Option Buy Order BUY |c |e) GTC JAN APR \\o |GE 4) “| 40 3! CON JUL OCT AUG NOV CXL SEP DEC FILLS OPEN CusT EX TIME CLOSE FIRM F8/BB TAKEN BY RNR FIRM M/M ACCT# 4 Chapter I Figure 1-3: An Option Sell Order SELL|©] e late JAN APR ; 25 |oex |e | furs [ai vot STOCK MAR JUN EXPX PREM CON JUL OCT ne on. SEP DEC FILLS OPEN CUST EX. TIME CLOSE FIRM FB/BB TAKEN BY RNR FIRM M/M ACCTH EXERCISE AND ASSIGNMENT A trader who owns a call or a put option has the right to exercise that option prior to its expiration date, thereby converting the option into a long underlying position, in the case of a call, ora short underlying position, in the case of a put. A trader who exercises a crude oil October 21 call has chosen to take a long position in one October crude oil futures contract at $21 per barrel. A trader who exercises a GE March 80 put has chosen to take a short position in 100 shares of GE stock at $80 per share. Once an option is exercised it ceases to exist, just as if it had been allowed to expire unexercised. A trader who intends to exercise an option must submit an exercise notice to either the seller of the option, if purchased from a dealer, or to the guarantor of the option, if purchased on an exchange. When a valid exercise notice is submitted, the seller of the option is assigned. Depending on the type of option, he will ne required to take a long or short position in the underlying contract at the specified exercise price. In addition to its underlying contract, exercise price, expiration date, and type, an option is further identified by the conditions of exercise. An option is either American, The Language of Options Figure 1-4: The Exercise and Assignment Process | > Clearing House Clearing firm notifies the clearing house that the buyer wishes to exercise ee Buyer's Clearing Firm Buyer notifies his clearing firm that he wishes to exercise his option thereby taking a long (call) or short (put) position inthe underlying instrument at the exercise price t Holder of a Long Option Position _ Clearing house chooses a seller at random and notifies the seller's clearing firm that the seller has been assigned Y | Seller's Clearing Firm | Seller 1s notified by his clearing firm that he has been assigned, and that he now has a short (call) or long (put) position in the underlying instrument at the exercise price Y Holder of a Short Option Position (Buyer) (Seller) Figure 1-5: An Exercise Notice DATE EXERCISE TIME STAMP | NOTICE PUT CALL STRIKE CGAL) QTy STK/COMM MONTH PRICE TODAY YE: NO 10” DM mor | Se |\" 1X Initials; _SHN Account # Firm # Broker # Per 6 Chapter I Figure 1-6: An Assignment Notice DATE ASSIGNMENT NOTICE STRIKE QTY STK/COMM MONTH PRICE PUT CALL 15 |Grude Ort | Oct 8 X Initials: RIN 5 | 1-Bonds |} Dec ch |X Account # Firm # whereby the holder can exercise the option at any time prior to expiration, or European, whereby the holder can exercise the option only on expiration day.? The great majority of exchange traded options throughout the world are American options, carrying with them the right of early exercise. Indeed, all U.S. exchange traded stock and futures options are American.* As in any competitive market, an option’s price, or premium, is determined by supply and demand. Buyers and sellers make competitive bids and offers in the marketplace. When a bid and offer coincide, a trade is made. The premium paid for an option can be separated into two components, the intrinsic value and the time value. An option’s intrinsic value is the amount which would be credited to the option holder’s account if he were to exercise the option and close out the position against the underlying contract at the current market price. For example, with gold trading at $435 per ounce, the intrinsic value of a $400 call is $35. By exercising his option, the holder of the $400 call can buy gold at $400 per ounce. If he sells gold at the market price of 2. Since exchanges need time to process exercise and assignment notices, the holder of an exchange traded option must usually submit an exercise notice no later than the close of business on the day prior to expiration. 3. Certain index options, such as the S&P 500 traded on the Chicago Board Options Exchange, and the Major Market traded on the American Stock Exchange, are European. Some foreign currency options traded on the Philadelphia Stock Exchange are also European. the Language of Options 7 $435 per ounce, $35 per ounce will be credited to his account. With a certain stock trading at $62, the intrinsic",
  "word_count": 1000,
  "topics": [
    "options",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.422705"
}