{
  "id": "476bdc962531",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 102,
  "content": "P1: OTA JWBT634-bapp01 JWBT634-Grimes May 11, 2012 8:31 Printer: Hamilton Printing 406 APPENDIX A: TRADING PRIMER FIGURE A.3 Comparison of Bar and Candlestick Charts create some advantages over simple time-scaled charts by making readable patterns out of very illiquid or extremely volatile markets. Bars and Candles Once we start aggregating trades on the x-axis, a graphical device is needed to explain the activity in that space. One logical solution is simply to plot a vertical bar, with the top and bottom of the bar representing the high and low extremes reached during the period (right panel in Figure A.3). Traders often ﬁnd it useful to mark the ﬁrst trade of the period with a tick on the left side of the bar (the open) and the last trade of the period with a tick on the right side (the close). These four data points, plotted like this, create the classical bar chart. An alternate format is the candlestick chart, which prints a wide body between the open and close of the bars, with thinner shadows (also called “tails” or “wicks”) above and below the body, reaching to the high and low of the period (left panel in Figure A.3). Candlestick charts were ﬁrst used in medieval Japan for rice trading, so much of the terminology associated with patterns of candles is also Japanese. Traditionally, the body of the candle is ﬁlled in if the close is lower than the open and left empty if the close is 349.00 349.00 9:40 9:50 10:00 9:40 9:50 10:00 156 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp01 JWBT634-Grimes May 11, 2012 8:31 Printer: Hamilton Printing Appendix A: Trading Primer 407 higher than the open. Modern charting software packages usually ﬁll the body of every candle but change the color to something intuitive like red for downward-closing candles and green or blue for upward-closing candles. Time Charts and Other Options Though the strength of tick charts is their ability to adapt to activity levels in the markets, traders and analysts often prefer a format where each bar corresponds to a predictable unit of time. These time charts are by far the most commonly used in most applications, and are especially useful for traders looking at daily and longer time frames. The chart is referred to by the length of each time unit (as in a 5-minute chart), which may also be called the time frame of the chart. Many traders choose to look at different time frames (for instance, 5-minute, hourly, and daily charts) for the same market to get a better sense of the forces affecting prices at any time. There are other possibilities for scaling the x-axis, but these tend to be less used except in certain speciﬁc contexts. It is possible to aggregate bars not by ticks (trans- actions) but by trading volume. In this case, a bar would contain a certain number of FIGURE A.4 Market Proﬁle Chart of AAPL AAPI. - Oaiy Apple Inc 360.00 358.00 356.00 354.00 352.00 350.00 348.00 346.00 344.00 342.00 340.00 338.00 r 336.00 334.00 Jul 5 6 7 8 11 157 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp01 JWBT634-Grimes May 11, 2012 8:31 Printer: Hamilton Printing 408 APPENDIX A: TRADING PRIMER shares or contracts, after which the next bar would begin. Another possibility is to have each bar end after a certain range is reached, so that, for instance, each bar would be 0.25 wide. (Be aware that the range bars created at the end of a trading day will be dif- ferent from the ones created as the market unfolds. This makes backtesting and analysis on range bars virtually impossible.) Other types of charts include swing charts, point and ﬁgure charts, kagi charts, line charts, and many others, but these are much less common and are outside the scope of this primer, with one exception. One other chart worth mentioning is Market Proﬁle, cre- ated by Peter Steidlmayer in the 1980s. Market Proﬁle charts essentially allow the trader to look inside the bar to see where most volume and trading activity occurred in the time period. Market Proﬁle displays this information in a graphical format attached to the right of each bar, with wider horizontal bars indicating more trading activity at that price level. (See Figure A.4.) While most charting methods only reprocess the same open, high, low, and close (OHLC), volume, and open interest information, Market Proﬁle is an important innovation—it adds detail and perspective that is not visible on a standard chart. 158 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing APPENDIX B A Deeper Look at Moving Averages and the MACD T he charts and the discussion that follow may look a little strange, but the thought process is important. Too many times, traders use indicators or tools on their charts that they do not understand. Rules are developed based on the action of a squiggly line without fully understanding what that line measures and represents. Though some traders will ﬁnd some success with an",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "market_structure",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.711354"
}