{
  "id": "c956925fed59",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 7,
  "content": "a perfect illustration of the importance of mindset in trading. Event trading is different from other trading strategies; it’s almost like playing a professional sport. You have to be so present in that moment. There is so much information coming at you, so many variables you don’t control, and yet you have to be in this state of equanimity where time slows down. You’re as calm as you can be. If you’re in a fight-or-flight state, you won’t be able to make the best rational decision. How large was your open loss on that trade at its worst point? It was about 10% of my equity. Do any other major trades come to mind since our interview a few years ago? There was one last month following the release of the U.S. November [2022] CPI report. The report showed a 0.2 drop in the year-over-year core CPI year and a 0.2 drop in the year-over-year headline CPI, at a time when many were still expecting a higher inflation print. So, the report was a complete shock. Based on work we had done looking at price moves after different categories of events, I felt there was a high probability that the CPI report would result in a maximum price move. However, because of the market’s increased volatility, I had to give up three times as much as usual to get into the trade. What was the trade you did? I went long Euro Stoxx 50 futures because the S&P is subject to volatility- based trading halts, which makes it inappropriate for my type of event trading. 27 What exactly do you mean when you say, “give up three times as much as usual to get into the trade”? Because of the market’s increased volatility, the difference between the market price at the time of the data release and the price where my buy order would get executed was much wider than normal. Most traders would be unwilling to give up as much as was needed to get into the trade. But I was willing to do it because I felt the probability of success was high. So, this was a trade where you went long as soon as you saw the reported number. Yes, it was the purest form of event trading: You wait for the catalyst and then go with it. It is a difficult trade to do because the market responds to the reported number almost instantaneously. Nine out of ten times, by the time you can get filled in the trade, the new information has been fully discounted. But sometimes, the profit opportunity is still there. Why did you have such a high conviction on this trade? My pre-trade analysis indicated that the same higher volatility that made it necessary to give up more to get into the trade would result in a bigger price move and a larger payout on the trade as well. It was also a time when I was running hot. As a trader, you need to be aware when the market conditions are aligned with your running hot. That’s where the magic happens. That’s where you get paid to take risk. You can only take on a lot of leverage when you have a very high conviction on the timing, and events offer that opportunity. If a catalyst is good enough to make it very likely that you will get an anticipated market move at that moment, you can use maximum leverage. Whereas if you have a three-month or a six-month view, you can’t take remotely the same leverage because the timing is uncertain. How big of a day was that CPI trade? It was about 40% profit day. After this large win, though, I quickly fell into a big drawdown—big for me, that is, about 10%. My more significant drawdowns often follow big winning periods. Sometimes, it’s the result of misguided overconfidence, and the market will quickly humble you. Other 28 times, it’s because the tide has turned; you stop running hot, and valid trades lead to a series of back-to-back losses. Over the years, I’ve tried to limit any leakage, but it’s impossible to eliminate entirely. Drawdowns can be frustrating and, if left unchecked, can trigger a self-reinforcing spiral that leads to poor decision-making, compounding the situation and affecting your most valuable asset: your emotional capital. My feelings about drawdowns are drastically different now than when I first began trading. Now, I accept that being in a drawdown is the natural state of a trader. You spend most of your time underwater just like a shark; you’re an apex predictor coming up occasionally for a big meal. It’s very difficult to succeed at event-based trading if you adopt a hunter-gatherer mentality, trying to find small, consistent wins to keep you alive. This perspective on drawdowns allows me to be in the right mindset when the unicorn trade arrives. In the past, I may have had low confidence and been timid in my approach coming out of a drawdown. But now, just like the shark, I’m always ready for the next big meal. An apex predator knows nothing else; timidness is not part of its nature. This drawdown was fairly recent. Was there any unicorn trade since then that allowed you to recover? There was. I entered the drawdown after the CPI trade on November 10 [2022]. I exited the drawdown on the ECB rate announcement on December 15. The ECB surprised markets with a notable hawkish shift. At the rate announcement, a lot of information is published all at once, which often leads to volatility on the release. I quickly noticed that the ECB language regarding rate hikes, which included such terms as “significantly further” and “sufficiently restrictive,” signaled a marked change from its previous month’s statement. The ECB was telling the market that rates were too low and much more work was needed to bring inflation back down to its target. Also, inflation projections were very high. I sold the",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.179306"
}