{
  "id": "740a0e041651",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 67,
  "content": "frame, for instance, 1- or 3-minute charts, and other times when the most important factor might be a level that is visible on weekly or monthly charts. We can usually identify a dominant structure or set of structures on one time frame, and can often watch as control is essentially passed from one time frame to another. For instance, perhaps a resistance level is tested multiple times on the 1-minute chart, and then is broken cleanly with a clear consolidation just below the level. At this moment, the 1-minute chart would be in control, but perhaps this breakout happened at the turn of a pullback on the 5-minute chart. We could then say that the pullback on the 5-minute chart and the subsequent trend leg have taken control as the 5-minute chart becomes the dominant time frame. Perhaps the market eventually runs into a new resistance area on the 30-minute chart, at which point we could identify that as the dominant technical @LH - Oaiy Lean Hog Continuous Contract [Aug11] Mar Apr Jul 2.00 0.00 -2.00 101 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 217 FIGURE 7.21 Exhaustion on the Weekly Chart Suggests Passing on This Buy Signal FIGURE 7.22 Several Factors on the Weekly Chart Contradict a Potential Short on the Daily iy Wheat Continuous Contract @W- Oa '08 • S&P S00 Index StlX-Oa,ly '08 1,300.00 102 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 218 TRADING STRATEGIES FIGURE 7.23 Why Short under a Bull Flag on the Daily Chart? evidence to negate a potential short setup on the lower time frame. In this case, a set of conditions that might not have fully supported a long entry were enough to justify not taking a potential short setup. Second, most of the trades that are contradicted by higher time frames are also not excellent setups on one time frame. To some extent, focusing on the geometry of a single time frame will also wrap in some of the multiple time frame factors, though there is still valuable information to be gleaned from analysis of neighboring time frames. Higher time frame considerations are not limited to providing ﬁlters to skip trades; sometimes they also can be motivation enough to justify trade entries. Figure 7.23 shows LULU, a market-leading stock in February 2011, extended above the upper band on the weekly chart, again with momentum divergence on the MACD. The tight consolidation on the daily chart might potentially be a place for aggressive longs to consider adding to positions or entering new positions. Looking only at the daily chart, we would never consider shorting under such a consolidation, because a high and tight ﬂag is usually in- dicative of real conviction from buyers; furthermore, shorting an extremely strong mar- ket leader in any context is usually a recipe for pain. It is far better to spend your time and mental energy ﬁguring out how to buy those market leaders and how to short lag- gards, in most cases. However, in this case, the weekly chart provided another layer of information, and the clear overextension made it possible to justify a quick short un- der the little range on the daily chart. There is also another lesson here: after a longer P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 219 FIGURE 7.24 The Higher Time Frame Suggests That the Lower Time Frame Short Will Be Diﬃcult pullback, this stock spent some time consolidating and eventually headed much higher. Swing traders cannot be greedy. Your job is to take what opportunity the market offers and to be quick to realize when the trade is over. These examples have focused on longer time frames, but the same principles apply to much shorter time frames as well. Figure 7.24 shows 5- and 30-minute charts of the USDJPY in the early evening (New York time) on March 16, 2011. The 5-minute chart shows a structure that could potentially be shortable for at least a retest of recent lows, though the presence of a selling climax, indicated by the overextension past the lower band, should give shorts pause for concern. In this case, the 30-minute chart provides context that is not as clearly visible on the 5-minute chart. The market is drastically overextended beyond the lower band on the higher time frame; this usually happens in response to a signiﬁcant exogenous shock—in this case the aftermath of the 2011 T¯ohoku earthquake in Japan. In a situation like this, you may still choose to take the short trade, but you have to realize that the character of the trade, especially if you are wrong, will be different. There is a much higher probability of a dramatic failure and reversal when the market is overextended on the higher time frame, so a trade taken under these conditions has a completely different risk proﬁle. Skip the trade altogether, take it and manage the risk with a tighter stop, or choose to get out at the ﬁrst sign you might be wrong—these are all acceptable alternatives. What is not acceptable is ignoring the clear message of the LULU - Oaiy Lululemon Alhletica Inc , , Dec '11 13:00 14:00 15:00 Feb 16:00 17:00 Mar 60.00 55.00 50.00 80.000 79.S00 79.000 78.S00",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.705915"
}