{
  "id": "32cbb58c4acd",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 11,
  "content": "trading days in format mm/dd/yyyy. tday=txt(2:end, 1); % convert the format into yyyymmdd. tday=datestr(datenum(tday, `mm/dd/yyyy'), `yyyymmdd'); % convert the date strings first into cell arrays and % then into numeric format. tday=str2double(cellstr(tday)); % the last column contains the adjusted close prices. cls=num(:, end); % sort tday into ascending order. [tday sortIndex]=sort(tday, `ascend'); % sort cls into ascending order of dates. cls=cls(sortIndex); % daily returns dailyret=(cls(2:end)-cls(1:end-1))./cls(1:end-1); % excess daily returns assuming risk-free rate of 4% % per annum and 252 trading days in a year excessRet=dailyret - 0.04/252; % the output should be 0.7893 sharpeRatio=sqrt(252)*mean(excessRet)/std(excessRet) This MATLAB code is also available for download at my website (epchan.com/book/example3_4.m). Chan800064_c03.indd 50 6/7/2021 2:04:50 PM 17 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Backtesting 51 Using Python This is the code that can be run in a Jupyter notebook. The code is avail- able for download at epchan.com/book/example3_4.ipynb Calculating Sharpe Ratio for Long-Only Vs Market Neutral Strategies import numpy as np import pandas as pd import matplotlib.pyplot as plt First part of example df=pd.read_excel('IGE.xls') df.sort_values(by='Date', inplace=True) dailyret=df.loc[:, 'Adj Close'].pct_change() # daily returns excessRet=dailyret-0.04/252 # excess daily returns = strategy returns - financing cost, assuming risk-free rate of sharpeRatio=np.sqrt(252)*np.mean(excessRet)/ np.std(excessRet) sharpeRatio 0.789580250130583 Using R The code is available for download at epchan.com/book/example3_4.R library('zoo') data1 <- read.csv(\"IGE.csv\") # Comma delimited data_sort <- data1[order(as.Date(data1[,1], '%m/%d/%Y')),] # sort in ascending order of dates (1st column of data) adjcls <- data_sort[,ncol('Adj.Close')] adjcls[ is.nan(adjcls) ] <- NA mycls <- na.fill(adjcls, type=\"locf\", nan=NA, fill=NA) dailyret <- diff(mycls)/mycls[1:(length(mycls)-1)] excessRet <- dailyret - 0.04/252 sharpeRatio <- sqrt(252)*mean(excessRet, na.rm = TRUE)/ sd(excessRet, na.rm = TRUE) sharpeRatio Now let’s calculate the Sharpe ratio of a long–short market-neutral strategy. In fact, it is a very trivial twist of the buy-and-hold strategy above: at the time we bought IGE, let’s suppose we just shorted an equal dol- lar amount of Standard & Poor’s depositary receipts (SPY) as a hedge, and closed both positions at the same time in November 2007. You can also Chan800064_c03.indd 51 6/7/2021 2:04:50 PM 18 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 52 QUANTITATIVE TRADING download SPY from Yahoo! Finance and store it in a file SPY .xls. You can go through very similar steps as previously covered in both Excel and MATLAB, and I will leave it as an exercise for the reader to perform the exact steps: Using Excel 1. Sort the columns in SPY .xls in ascending order of date. 2. Copy column G (Adj Close) in SPY .xls and paste it onto column J of IGE.xls. 3. Check that column J has the same number of rows as columns A–I. If not, you have a different set of dates—make sure you download the matching date range from Yahoo!. 4. Perform the same steps as previously covered to calculate the daily returns in column K. 5. For clarity, type “dailyretSPY” as the header in column K. 6. In column L, compute the net returns for the hedged strategy as the difference between column H and K divided by 2. (Divide by 2 because we now have twice the capital.) 7. In cell L1506, compute the Sharpe ratio of this hedged strategy. You should get “0.783681.” Using MATLAB % Assume this is a continuation of the above MATLAB %code. % Insert your own code here to retrieve data from % SPY.xls just as done previously. % Name the array that contains the daily returns of % SPY \"dailyretSPY\". % net daily returns (divide by 2 because we now have twice as much capital.) netRet=(dailyret - dailyretSPY)/2; % the output should be 0.7837. sharpeRatio=sqrt(252)*mean(netRet)/std(netRet) Using PYTHON Second part of example df2=pd.read_excel('SPY.xls') df=pd.merge(df, df2, on='Date', suffixes=('_IGE', '_ SPY')) df['Date']=pd.to_datetime(df['Date']) df.set_index('Date', inplace=True) df.sort_index(inplace=True) dailyret=df[['Adj Close_IGE', 'Adj Close_SPY']].pct_ change() # daily returns Chan800064_c03.indd 52 6/7/2021 2:04:50 PM 19 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Backtesting 53 dailyret.rename(columns={\"Adj Close_IGE\": \"IGE\", \"Adj Close_SPY\": \"SPY\"}, inplace=True) netRet=(dailyret['IGE']-dailyret['SPY'])/2 sharpeRatio=np.sqrt(252)*np.mean(netRet)/np.std(netRet) sharpeRatio 0.7839419359681374 Using R This code can be downloaded as example3_4.R: # 2nd part of example 3.4 data2 <- read.delim(\"SPY.txt\") # Tab-delimited data_sort <- data2[order(as.Date(data2[,1], '%m/%d/%Y')),] # sort in ascending order of dates (1st column of data) adjcls <- data_sort[,ncol('Adj.Close')] adjcls[ is.nan(adjcls) ] <- NA mycls <- na.fill(adjcls, type=\"locf\", nan=NA, fill=NA) dailyretSPY <- diff(mycls)/mycls[1:(length(mycls)-1)] excessRet <- (dailyret - dailyretSPY)/2 informationRatio <- sqrt(252)*mean(excessRet, na.rm = TRUE)/sd(excessRet, na.rm = TRUE) informationRatio Example 3.5: Calculating Maximum Drawdown and Maximum Drawdown Duration We shall continue the preceding long–short market-neutral example in order to illustrate the calculation of maximum drawdown and maximum drawdown duration. The first step in this calculation is to calculate the “high watermark” at the close of each day, which is the maximum cumula- tive return of the strategy up to that time. (Using the cumulative return curve to calculate high watermark and drawdown is equivalent to using the equity curve, since equity is nothing more than initial investment times 1 plus the cumulative return.) From the high watermark, we can calculate the drawdown, the maximum drawdown, and maximum drawdown duration: Using Excel 1. In cell M3, type “=L3”. 2. In cell M4, type “=(1+M3) *(1+L4)-1”. This is the cumulative compounded return of the strategy up to that day. Populate the entire column M with the cumulative compounded returns of",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.605146"
}