{
  "id": "b86234d327ad",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 90,
  "content": "D in Figure 10.34. However, this is a case in which the statistical tendencies for different asset classes matter. An individual stock or stock index might have been more set for a small reversal following day like D, but currencies do not show this tendency. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: The Anti 333 E: Though signiﬁcant exposure should have been trimmed early, at lower proﬁt tar- gets, this small pullback is a justiﬁable second entry. Many traders will treat an entry like this as an entirely separate trade, perhaps continuing to hold part of the position from the Anti as well. F: What is this? A potential setup for a sell Anti? In this case, the short trade following F would have been a marginal winner, but once again the message is clear: being able to read developing market structure and price action can give a great insight into trade management. Anti Failures The Anti is a speciﬁc variant of the pullback trade, characterized by its location in the trend and the speciﬁc strong countertrend thrust setting up the pullback. Because it is a pullback, when the Anti pattern fails, it does so through the same patterns in which other pullbacks fail. This section shows three common Anti failures: failure through consoli- dation, failure near previous swing, and ﬁnally, failure by strong momentum against the attempted trend change. Failure Through Consolidation FIGURE 10.35 A Buy Anti Fails into Consolidation in YGE EURUSD - Daily Euro / us Dollar 1.38000 1.36000 --- 6 t-~---, ::::::: ~ -~~-0.02000 May Jun Jul Aug ~ - ',, _ _ _ /\\ ~: ,_.__ 0.20 51~ --~,cx;;;;;z.~~ ,,,,----- ~ ' - -- - - ' , - . . - - -- - - - '' -0.60 Apr May Jun Jul 137 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 334 TRADING STRATEGIES This point cannot be overemphasized: every edge any of these patterns has comes from an imbalance of buying and selling pressure. When a trade is entered, prices should quickly move from the entry price; if the market is able to trade around the entry price, this is more suggestive of balance between buyers and sellers. In this environment, tech- nical patterns have no edge. Figure 10.35 shows a buy Anti in Yingli Green Energy Holding Company Ltd (NYSE: YGE) at A. This was not an excellent example of an Anti because the preceding setup leg, the upswing, was only two bars and did not show a strong change of character. Not every pattern is textbook clear, and, though it may be counterintuitive, it is not necessarily true that better patterns have a higher expectancy. In this case, after a long entry somewhere around A, the stock simply went dead and quiet. This is not what should have happened—if there were trapped shorts ner- vous about their positions, they should have covered aggressively and this buying pres- sure should have caused a sharp up move in the stock. When prices move contrary to what should be happening in a trade, it is time to adjust the trade: reduce exposure, tighten stops, or exit the trade completely. Failure Near Previous Swing FIGURE 10.36 A Sell Anti Finds Support at Previous Swing P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: The Anti 335 Figure 10.36 shows a good sell Anti in Coffee futures. After a parabolic climax, a sharp downdraft, and slow bounce, a short position could have been entered somewhere around A. Remember that in any pullback trade, the ﬁrst, most conservative, target is the extreme of the move setting up the pullback. In this case, the market was clearly having trouble getting through this target at B. Depending on the exact entry point and stop location, point B may have already been beyond the ﬁrst proﬁt target. If not, it would have been prudent to reduce risk somewhere in the bars following the failure to trade below the previous swing at B. Eventually, Coffee was able to slip below this support and appeared to be set to trade lower. However, a sharp failure at C swept price back above support. It might have been justiﬁable to hold a partial position through this large up day, especially if partial proﬁts had already been booked, but there is no reason to endure any more pain following C. This small bar, consolidating at the high of the move back above support, is a lower time frame consolidation and a strong indication that prices are headed higher in the near term. Always respect the message of developing market structure. Failure by Strong Momentum Against FIGURE 10.37 A Buy Anti Fails with Strong Momentum @KC- Da'ly ' Coffee C Cont' muous Contract 240.00 220.00 '11 Feb Apr 0.98000 0.96000 0.94000 Apr 11 , -0.01000 ,ay Jun 138 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trading at Support and Resistance 337 Breakouts: Early Entry in Base FIGURE 10.38 Buying a Spring at Support in VHC Setup After a long run-up, VirnetX Holding Corporation (AMEX: VHC) rolled over into an extended consolidation, as shown in Figure 10.38. A: The initial downswing, at A, might have set up a sell Anti. B: However, at B,",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.709461"
}