{
  "id": "5aea027e85bc",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 9,
  "content": ". 169 F igure B.12 . . . . . . . . . . . . . . . . . . . . . . . . . . . . 170 F igure B.13 . . . . . . . . . . . . . . . . . . . . . . . . . . . . 171 F igure B.14 . . . . . . . . . . . . . . . . . . . . . . . . . . . . 172 F igure B.15 . . . . . . . . . . . . . . . . . . . . . . . . . . . . 172 F igure B.16 . . . . . . . . . . . . . . . . . . . . . . . . . . . . 173 APPENDIX C 174 Glossary 176 Bibliography 192 Ab out the Author 195 1 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing PART I The Foundation of Technical AnalysisP1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing CHAPTER 1 The Trader’s Edge If you would be a real seeker after truth, it is necessary that at least once in your life you doubt, as far as possible, all things. —Ren ´e Descartes T here is something fascinating and mesmerizing about price movements in actively traded markets; academics, researchers, traders, and analysts are drawn to study markets, perhaps captivated as much by the patterns in the market as by the promise of ﬁnancial gain. Many people believe that price changes are random and un- predictable; if this were true, the only logical course of action would be to avoid trading and to invest in index funds. This is, in fact, what a signiﬁcant number of ﬁnancial ad- visers recommend their clients do. On the other hand, there are analysts and traders who believe that they have some edge over the market, that there is some predictability in prices. This camp divides into two groups that historically have been diametrically opposed: those who make decisions based on fundamental factors and those who rely on technical factors. Fundamental analysts and traders make decisions based on their assessment of value, through an analysis of a number of factors such as ﬁnancial state- ments, economic conditions, and an understanding of supply/demand factors. Techni- cal traders and analysts make decisions based on information contained in past price changes themselves. Our work here concerns the latter approach. Few traders make decisions in a vac- uum; technical traders may consider fundamental factors, and fundamental traders may ﬁnd that their entries and exits into markets can be better timed with an understand- ing of the relevant elements of market structure, money ﬂows, and price action. Most traders ﬁnd success with a hybrid approach that incorporates elements from many disci- plines, and there are very few purely technical or fundamental decision makers. The key distinction, for us, is that technically motivated traders acknowledge the primacy of price itself. They know that price represents the end product of the analysis and decision 3 2 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing 10 THE FOUNDATION OF TECHNICAL ANALYSIS FIGURE 1.1 Nothing Seems to Matter Before 1985: DJIA on a Linear Scale FIGURE 1.2 Investors’ Actual Experiences: DJIA on a Log Scale SINDU - Monthly Dow Jones Industrial Average '65 70 75 '80 '85 S!NDU - Monthly Dow Jones Industrial Average '65 '70 '75 '80 '85 '90 '95 '00 '05 '90 '95 '00 '05 '10 '10 14,000.00 12,000.00 10,000.00 8,000.00 6,000.00 4,000.00 2,000.00 14,000.00 12,000.00 10,000.00 8,000.00 6,000.00 4,000.00 2,000.00 3 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing 16 THE FOUNDATION OF TECHNICAL ANALYSIS FIGURE 1.3 Every Pivot High and Low Another name for the type of pivot in Figure 1.3 is a ﬁrst-order pivot. Though these ﬁrst-order pivots do sometimes coincide with major turning points in the market, they are so common that they cannot be extremely signiﬁcant. Every major turning point, by deﬁnition, comes at a pivot, so it is easy to overstate their importance; once you see a chart with every possible pivot marked, it becomes obvious that this structure is so common that it is nearly insigniﬁcant. It is also interesting to consider that most pivots on one time frame mark signiﬁcant market structures on lower time frames, but this is a complication that we will save for later. As a stand-alone concept, ﬁrst-order pivot highs and lows have limited utility; their power comes from their relationship to other pivots and their ability to deﬁne market structure. They are like a single brick in a building—not that interesting or useful by itself. Second-order pivot highs (also called intermediate-term pivots) are ﬁrst-order pivot highs that are preceded and followed by lower ﬁrst-order pivot highs; again,",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:53.696312"
}