{
  "id": "7fbb356209ba",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 115,
  "content": "to make little difference. Both models will generate incorrect values because the inputs are incorrect. The American model may produce less error, but that will be small consolation if the incorrect inputs lead to a large trading loss. American option values are most important when there is a significant difference between the carrying cost associated with the option and the carrying cost associated with the underlying contract. The greater the difference between the two carrying costs, the greater the value of early exercise. When the underlying contract is a futures contract and the option on the contract is subject to futures-type settlement, the cost of carrying either position is, in theory, zero. This is the same as assuming an effective 250 Chapter 12 interest rate of zero. If we use a zero interest rate, there is no difference between European and American option values. When the options on a futures contract are subject to stock-type settlement, there is a small difference between the carrying cost on the option and the carrying cost on the underlying contract. Although che option is subject to stock-type settlement, the price of the option is only a small fraction of the price of the underlying contract. The additional value for early exercise is therefore small, and is only likely to show up in deeply in-the-money options. Even in this case, the difference between European and American values is often less than the minimum price increment. In such a market, a trader is unlikely to profit significantly because he is using an American pricing model while other traders are using a European pricing model. Practical considerations, such as the accuracy of the trader’s volatility estimate, his ability to anticipate directional trends in the underlying market, and his ability to control risk through effective spreading strategies, will far outweigh any small advantage gained by using an American rather than a European model. The importance of early exercise is greatest when the underlying contract is a stock or physical commodity.3 In such a case there is a significant difference between the carrying cost on an option and the carrying cost on an underlying position. This difference will especially affect the difference between European and American put values, since early exercise will allow the trader to earn interest on the proceeds from the sale at the exercise price. An option trader in either the stock or physical commodity market will find that the additional accuracy offered by an American model, such as the Cox-Ross-Rubenstein or Whaley models, will indeed be worthwhile. The significance of this difference is shown in Figure 12-1. THE EFFECT OF EARLY EXERCISE ON TRADING STRATEGIES The delta of an American option will always be greater than the delta of an equivalent European option. The extent to which it is greater will depend on how deeply in-the-money the option is, as well as the interest considerations resulting from early exercise. In most cases the delta of an American option will differ only slightly from a European option, and the possibility of early exercise is therefore unlikely to have a significant impact on volatility or directional strategies. In the former case, a trader may have to adjust the ratio of a strategy slightly if he wants to remain close to delta neutral. In the latter case, a trader may find that he is a few deltas longer or shorter than he would be if employing the same strategy with European options. Because early exercise of an option is not automatic, there are strategies which depend on someone making an error and not exercising an option early when he ought to do so. For example, a stock option trader might try to execute a dividend play. This strategy consists of buying stock and selling deeply in-the-money calls as the ex-dividend 3. Early exercise can also be an important consideration in the foreign exchange market if the interest rates associated with the domestic currency (the currency in which the option Is settled) and foreign currency (the currency to be delivered in the event of exercise) are significantly different. Early Exercise of American Options 251 Figure 12-1 European vs. American Put Values Stock price = 100.00 Volatility = 25%; Interest rate = 8.00%; Dividend = 0 4 weeks to expiration: Black-Scholes Black-Scholes Cox-Ross Cox-Ross Value Delta Value Delta 80 put .00 0 00 0 90 put 15 5.0 15 5.1 100 put 2.46 45.1 2.51 —46.4 110 put 9.67 —89.5 10.03 ~95.3 120 put 19.28 —99.4 20.00 —100.0 13 weeks to expiration: Black-Scholes Black-Scholes Cox-Ross Cox-Ross Value Delta Value Delta 80 put 1 2.2 man -2.3 90 put 97 -14.3 1.00 -14.9 100 put 4.00 41.2 4.20 ~44.0 110 put 10.00 -70.6 10.71 78.2 120 put 18.25 89.2 20.00 —100.0 26 weeks to expiration: 1 Black-Scholes Black-Scholes Cox-Ross Cox-Ross Value Delta Value Delta 80 put 46 57 50 6.4 90 put 1.89 —-18.1 2.02 ~19.6 100 put 5.11 -37.7 5.55 42.1 110 put 10.43 —58.9 11.58 ~-68.8 120 put 17.56 -76.4 20.04 94.8 date for the stock approaches. If the trader is not assigned on the calls, he will break even on the stock (the stock price will fall, but he will collect the dividend). At the same time he will profit when the deeply in-the-money calls which he has sold fall by the amount of the dividend. Of course, if he is assigned on the calls, as he ought to be, he will only break even. But for each call which goes unexercised the trader will profit by the amount of the dividend. Dividend plays were much more common in the early days of option trading when the market was less sophisticated and many options which should have been exercised were not. As markets have become more efficient, only a professional trader, with very low transaction costs, can afford to take advantage of such a possibility. Even then, he may find that he is assigned on the great majority of the calls he has sold. 252 Chapter 12 A",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.439908"
}