{
  "id": "fc778f4a87e0",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 192,
  "content": "is not possible to invert the Black-Scholes Model to arrive at an implied volatility from a known option price, a Newton-Raphson search can be used to converge on the implied volatility quite quickly. We first make a guess as to the option’s implied volatility, and then use the option’s vega (sensitivity to a change in volatility) to come progressively closer to the true implied volatility. This method is illustrated in Figure B-4. Because an option’s vega is relatively linear, the method converges very quickly, usually with no more than four iterations, even with a poor first guess. The iterative process is: Xp =X - uP i+1 7 “A V; where p = __ the option’s price x, = the volatility y, = the option’s theoretical value at volatility x, v, = the option’s vega at volatility x, We choose a desired degree of accuracy, €, and continue with the process until ly, - pl < €, at which point x, is the desired implied volatility. THE EXPONENTIAL AND NATURAL LOGARITHM FUNCTIONS Since the natural logarithm (In(x)}} and exponential function (e%) play such an important role in most theoretical pricing models, a brief discussion of their use may be worth- while. Suppose r = an annual interest rate, expressed as a decimal fraction = the amount of an investment = the time period over which the investment is made, expressed in years When r is continuously compounded, the value, V, of I at the end of the time period, t, is given by: Vz=et.] When r is continuously compounded, the initial investment, I, required to yield V at the end of the time period is given by: The Mathematics of Option Pricing 447 ] = ett.V [is referred to as the present value of V, i.e., V discounted by its carrying costs. The yield, y, resulting from the continuous compounding of the interest rate, r, over the time period is given by: y=et-l The annualized yield is y/t. Example: If r=10% (.10), the value of a $2,000 investment in three months (t=.25) if interest is compounded continuously will be: V = et. $2,000 = e!-25 . $2,000 = e25. $7,000 = 1.0253 - $2,000 = $2,050.63 Example: If r=6% (.06) and is compounded continuously, the amount of money one would need to invest to have $5,000 after eight months (t=.667) would be: I = ett. $5,000 = e%-947 . $5,000 = e~4. $5,000 = .9608 - $5,000 = $4,803.95 Example: If r=15% (.15) and is compounded continuously, the total yield on a six-month (t=.5) investment will be: y=et—] =e155— 1 = 0-975 _ | = 0779 (7.79%) The total annualized yield is: y/t = .0779/.5 = 1558 (15.58%) If [is the amount initially invested, the continuously compounded rate of return, t,, needed to yield V over some period of time, t, is given by: r, = In(V/I) If V is greater than I, the resulting rate of return will be a positive number. If V is less than I, the resulting rate of return will be a negative number. The annualized rate of return is: r=r/t=In(V/I/t Example: Assuming continuous compounding, the annual rate of return required for an initial investment of $3,000 to yield $3,200 in nine months (t=.75) is: r = In(3,200/3,000)/.75 = In(1.0667)/.75 = 0645/75 = .0861(8.61%) Note that the exponential and logarithmic functions are inverses: In(eX) = en) = x 448 Appendix B Because volatility is also a rate of return, and is assumed to be continuously compounded, the exponential and logarithmic functions can be used to calculate expected price changes of an underlying contract. Example: Suppose a certain futures contract is trading at a price, P, of SO and has an annual volatility, v, of 12%. A one standard deviation upward price change is ev-P=el2. 50 = 1.1275 -50 = 56.37 A one standard deviation downward price change is ev. P=e!2. 50 = 8869 - 50 = 44.35 Since we know that one standard deviation takes in about 68 percent of all outcomes, we know that if the volatility figure of 12% is correct, there is a 68 percent chance that one year from now the same futures contract will be trading between 44.35 and 56.37. What about a two standard deviation price change? If the move is upward, we calculate: e122. 50 = 24.50 = 1.2712 - 50 = 63.56 If the move is downward, we calculate: e122. 50 = e274. 50 = .7866 - 50 = 39.33 Since we know that two standard deviations takes in about 95% of all outcomes, we know that if the volatility figure of 12% is correct, there is a 95% chance that one year from now the same futures contract will be trading between 63.56 and 39.33. For time periods other than one year we must also take into consideration the square root relationship between time and volatility. If a one standard deviation price change over a period is given by v, then a one standard deviation price change over a period which is twice as long is v V2. Similarly, a one standard deviation price change over a period only half as long is v V.5. The generalized rule is: volatility (standard deviation) over the periodt=v-V t where v is the annualized volatility and t is the time period in years. This enables us to express a move of n standard deviations over t as either: env it. P (an upward move) or eavvt . P (a downward move) where P is the current price of the contract. Example: With an underlying contract at 84.00 and an annual volatility of 16%, a one and two standard deviation price change over a three-month period (t = .25) is: e-16V.25 . 84.00 = e165. 84.00 = 28. 84.00 = 1.0833 - 84.00 = 91.00 (up 1 standard deviation) The Mathematics of Option Pricing 449 e2 16.25 . 84.00 = e2-16-5. 84.00 = e!6- 84.00 = 1.1735 - 84.00 = 98.57 (up 2 standard deviations) e~ 16V-25 84.00 = e~!6-5. 84.00",
  "word_count": 1000,
  "topics": [
    "options",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.451951"
}