{
  "id": "6c98219d57f6",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 11,
  "content": "WallStreetBets. Of course, none of them had the success of GameStop, but many had 5× to 10× moves. 39 How did you know when to bail out of these trades, as they were stocks that were being pushed far beyond any fundamentally justified price levels by speculative buying? Getting out is by far the worst aspect of my trading. I consider myself a poor seller of stocks. I take large positions, and when a stock has doubled or tripled, and the risk/reward has changed, I start scaling out of my position. Once I start selling a position, I just can’t stop. What other trades were responsible for your big gains? I did well with Covid, but SPACs were career-changing for me. [A SPAC, an abbreviation for a special purpose acquisition company, is a public company that raises capital for the express purpose of acquiring a target private company, which is not identified, and taking it public. The original investors in a SPAC receive shares, typically priced at $10, and warrants. Once a deal with an acquisition target is announced, these investors have the option of withdrawing their investment and receiving their money back.] It was a once-in-a-generation moment. You could buy a company with almost zero risk because you could opt to get your money back at nearly the same price. I noticed a pattern where there would be a huge volume spike, usually in the last two minutes of the day, and the next day these companies would announce who they were partnering with. After the announcement, the stock would go up to $20 or even $30. And, if it was a poor partner, maybe only $15. So your upside was 2X or more, and your downside was a few cents per share. And SPACs had virtually unlimited liquidity at just over $10, so you could size up to any level you wanted. I had massive positions in lots of these SPACs. There were several months when virtually every day one of these SPAC positions was hitting, and I was making $3 million, or $5 million, or $7 million on a single trade. There were two profit opportunity days in SPACs: the day they announced a partner and the day when the ticker symbol changed, usually a couple of months later. Would you sell your position on these days? 40 Yeah, I would sell on the initial pop after the partner was announced, and if I got back in on a subsequent dip, I would sell on the symbol change. If I liked the stock, I might hold part of the position longer. The economic structure of SPACs, though, is a bad deal for investors. [A critical negative aspect is that the 20% promotion fee typically given to the SPAC founder effectively dilutes the value of the shares investors receive.] I agree. I haven’t played SPACs for a long time. It was just a moment in time that will live with me forever. I will always be looking for another zero- risk, unlimited-gain opportunity. What major trading theme came after SPACs? Cryptocurrencies were having insane run-ups, just like small caps had a year earlier. At one point, my crypto trading was actually larger than my equity trading. As we speak, cryptocurrencies are down 80% or more, depending on the currency. How do you know when the game is over? Do you remember those trendlines we talked about in our original interview? When Elon Musk came out and said Tesla would no longer accept Bitcoin for car purchases because of the negative environmental impact of Bitcoin mining, it coincided perfectly with the breaking of that trendline. I had been all in on crypto, and here was this significant warning sign. That is when I cut back my crypto exposure in a big way. Again, when I start selling something, I don’t stop. I remember from our original interview that you never go short. Yet, in the past few years, we’ve had two bear markets: the Covid bear market and the more prolonged bear market this year [2022]. How do you avoid getting hurt in such adverse market environments? Well, the Covid bear market only lasted for about a month. I saw the news and could see where things were going. So, I liquidated everything and just played golf every day. When did you begin trading again? What told you that the bear market was over? 41 It was the price action in the stocks that offered solutions to the problems Covid created. When the vaccine makers started acting super strong, it clicked that I had to get into stocks that could help deal with Covid. I bought vaccine makers, mask and thermal camera manufacturers, and drone delivery companies. How about the 2022 bear market, which has lasted much longer and may still not be over? How did you avoid significant losses during this period? Well, I am down this year, which doesn’t surprise me. After the previous incredible two years, I would expect to be down at some point. That said, I am down only a couple of percent. Were you trading more lightly in 2022? I probably made as many trades on an average day in 2020 as in the entire first half year of 2022. Was there a reason for your drastically reduced trading activity? I earned it. I took time off to spend with my family and travel. Was it just that, or was it because you perceived market conditions were less favorable? I had done so well for so long. My friends who were newbies weren’t texting me anymore. They were losing. I wasn’t making any money. It was just a perfect time to walk away. I took a break until August of this year [2022] when lithium prices broke out to multiyear highs and went parabolic. This price action got me super motivated. I am incredibly bullish on lithium equities for the next few years and think it’s going to be the price move of",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "crypto",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.179860"
}