{
  "id": "5fe4ba09a898",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 142,
  "content": "model, optimum early exercise cannot be calculated. The distortion can sometimes be quite large if many stocks in the index happen to pay a large 3. Because of the order imbalances which can occur in individual stocks when a large number of stock index arbitrages are liquidated at the same time, some exchanges have chosen to settle stock index options and futures on expiration day based on the opening index price. This opening price is determined by the opening prices of each stock in the index on that day. Since stocks can open at different times, the index value may not represent simultaneous stock trades. 4. There is usually a cut-off time after which an index option may not be exercised on a given day. In the United States this is usually within an hour after the index has been fixed at the end of the trading day. 316 Chapter 15 dividend on the same date, or pay no dividend for an extended period. Figure 15-1 shows that this is often the case for the S&P 500. A Phantom Variable In some markets, stocks or their derivative products continue to trade after the closing index price has been fixed for the day. In the United States, most stock indices are fixed at 4:00 PM Eastern Time when trading ceases on the New York Stock Exchange, However, many of the stocks in the index continue to trade on regional stock exchanges, and futures and options on the indices may also continue to trade for some period after the close. The fact that the underlying index may be fixed while options and futures on the index continue to trade results in an anomaly concerning early exercise. Suppose a trader owns a stock which settles at a price of $50 when trading ceases at 4:00 PM on the primary stock exchange. Suppose also that the trader has the right to sell that stock to someone at the settlement price of $50 until 12:00 midnight the same day. If the trader’s intention is to hold onto the stock, their is no reason for him to exercise this right. But suppose some negative news on the stock comes out at 4:30 PM, and he finds that the stock is now trading on other exchanges at $48. What will he do? If he decided that he wanted to sell the stock because of the bad news, the trader would certainly exercise his right to sell at $50 rather than selling it at $48 on some other exchange. Even if he wanted to retain ownership of the stock, he would immediately realize that he could show an extra $2 profit by exercising his right to sell at $50, and buying the stock back at $48. Indeed, he would be foolish not to do so since if he did not, he would be throwing away $2. A similar situation occurs in stock index options where early exercise is a possibil- ity, and where alternative instruments are available on the index after the index has been fixed at the close of the trading day. To see what can happen, consider an option market on a very simple, non-dividend paying index which has been fixed at 400.00 when the stock exchange ceases trading at 4:00 PM. If there are 30 days remaining to expiration, with implied volatility at 14%, interest rates at 6%, and no dividend expected, option prices and implied deltas might be the following: Index = 400.00 Time to June expiration = 30 days — Implied volatility = 14% Interest rates = 6% Dividend = 0 Exercise Call Call Put Put Price Price Delta Price Delta 380 22.44 92 59 -8 390 13.98 78 2.12 -23 400 7.42 56 5.62 -46 410 3.24 32 11.71 -72 420 1.14 14 20.12 -94 Stock Index Futures and Options 317 Suppose that at 4:05 PM some very negative economic news comes out. Stocks start to fall on other exchanges which are still open, and traders in the index futures and option markets, which continue to trade after 4:00 PM, react as if the index will open 10 points lower the next morning. If the option market does open the next day at 390.00, option prices and deltas might then look like the following: Index = 390,00 Time to June expiration = 29 days —_ Implied volatility = 14% Interest rates=6% Dividend =0 Exercise Call Call Put Put Price Price Delta Price Delta 380 13.70 79 1.95 —22 390 7.10 55 5.40 -46 400 2.98 31 11.55 ~73 410 98 13 20.08 95 420 25 4 30.00 -100 Suppose a trader originally owned ten 380 calls. What should he do when the negative news hits the market? If he holds his calls, and the market does open at 390.00 the next morning, his calls will be trading at 13.70. He will show a loss of 22.44 — 13.70, or 8.74 per call. But if he exercises his calls today, he will receive 20.00 points, the difference between the exercise price of 380 and that day’s index settlement price of 400.00. If he exercises, his loss will only be 22.44 — 20.00, or 2.44 per option. If he fails to exercise, he will automatically show an additional loss of 6.30. Anytime after the index value has been fixed for the day, a trader who finds that the next day’s presumed theoretical value is less than parity will be better off exercising an index option early rather than holding it. In this scenario the 390 calls will also become early exercise candidates, although the savings will not be as great as with the 380 calls. Prior to the news, the 390 calls might be trading for 13.98. But if the market drops to 390.00 the next morning, the 390 calls will only be trading for 7.10. If the trader owns 390 calls and doesn’t exercise, he will lose 13.98 — 7.10, or 6.88 per call. {f he does exercise, he will lose only 13.98",
  "word_count": 1000,
  "topics": [
    "options",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.444182"
}