{
  "id": "1b4f6f543ea6",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 105,
  "content": "also consider replacing an underlying position in a conversion or reversal with a synthetic equivalent. For example, our original position might be a 100 conversion: short a June 100 call long a June 100 put long an underlying contract Suppose we also execute a reversal at 90: long a June 90 call short a June 100 call short a June 90 put long a June 100 put short an underlying contract long an underlying contract The long and short underlying contracts cancel out, leaving: long a June 90 call short a June 100 call short a June 90 put long a June 100 put 230 Chapter 11 We are left with a synthetic long position at the 90 exercise price, and a synthetic short position at the 100 exercise price. Or we can think of the position as a reversal at one exercise price, and a conversion at a different exercise price. This position, known as a 00x, is similar to a conversion or reversal, except that any risk associated with holding a position in the underlying contract has been eliminated because the underlying position has been replaced with a synthetic underly- ing position at a different exercise price. A trader is long (short) the box when he is synthetically long (short) the lower exercise price and synthetically short (long) the higher exercise price. The example position is long a June 90/100 box. At expiration, regardless of the price of the underlying contract, a trader who has a box will simultaneously buy the underlying contract at one exercise price and sell the underlying contract at the other exercise price. The value of the box at expiration will therefore be exactly the amount between exercise prices. In our example, at expiration the 90/100 box will be worth exactly 10 points because the trader will simultaneously buy the underlying contract at 90 and sell itat 100. Ifit is worth 10 points at expiration, how muchis it worth today? If the options are subject to stock-type settlement, the value of the box today will be the value of the box at expiration less carrying costs. If our 10-point box expires in three months with interest rates at 8%, the value today is: 10-(10x 3/12 x 8%) = 10 —.20 = 9.80 Since a box eliminates the risk associated with carrying a position in the underlying contract, boxes are even less risky than conversions and reversals, which are themselves low-risk strategies. When all options are European (there is no risk of early exercise), and the options are settled in cash rather than through delivery of the underlying contract (there is no pin risk}, the purchase or sale of a box is identical to lending or borrowing funds over the life of the options. In our example, a trader who sells a 10-point box for 9.80 has essentially borrowed funds from the buyer of the box for three months at an interest rate of 8%. If a trader were willing to pay a higher rate to borrow funds, he could sell the box at a lower price, for example 9.70. This corresponds to a rate over three months of 12%. When no other method is available, a trading firm might be able to raise needed short-term cash by selling boxes. Since the firm will probably have to sell the boxes at a price lower than the theoretical value, this will increase the firm’s borrowing costs. Moreover, if the options can be exercised early, or if there is a danger of pin risk at expiration, this method of borrowing may not be without its own risks. We originally introduced a box as a conversion at one exercise price and a reversal at a different exercise price. Since the long and short underlying positions cancel out, we are left with two synthetic underlying positions. The June 90/100 box was written: long a June 90 call short a June 100 call short a June 90 put long a June 100 put The left side of the box is a synthetic long at 90 and the right side is a synthetic short at 100. Instead of dividing the box into right and left sides, we can also divide it into top and bottom sides. Notice that the top side is a bull vertical call spread (long June 90 Option Arbitrage 231 call/short June 100 call), while the bottom side is a bear vertical put spread (long June 100 put/short June 90 put). Since a box is a combination of two vertical spreads, the combined prices of the vertical spreads must add up to the value of the box. For example, with three months remaining to expiration and interest rates at 8%, the value of our June 90/100 box is 9.80. Suppose a trader knows that the June 90/100 vertical call spread is trading for six points. Without any additional information, the trader can estimate the fair market price of for the June 90/100 vertical put spread. He knows 90/100 box is worth 9.80, and that the value ofa call and put vertical spread must add up to the value of the box. The price of the put spread must therefore be: 9.80 — 6 = 3.80 If the trader believes he can either buy or sell the call vertical spread at six points, and he is asked for a market in the put spread, he will probably make his market around an assumed value of 3.80. He might, for example, make a market of 3.50 bid/4.10 ask. If he is able to buy the put vertical for 3.50, he can then try to buy the call vertical for 6.00. If he is successful, he will have paid a total of 9.50 for a box with a theoretical value of 9.80. Conversely, if he is able to sell the put vertical for 4.10, he can then try to sell the call vertical for 6.00. If he is successful, he will have sold a box with a theoretical value of 9.80",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.438398"
}