{
  "id": "2f870df75b4a",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 18,
  "content": "to form the patterns on 5-minute bars. (The time frames are a convenient but unavoidably arbitrary structure.) This pattern building continues all the way to daily, weekly, monthly, and yearly patterns, which all contain essentially the same patterns. Figure 3.2 shows a schematic example of how this might play out in the market. Each trend leg is an impulse, retracement, impulse pattern, and each of those legs also breaks down into the same pattern on the lower time frame. Though only three levels are shown on the diagram, this structure theoretically extends down to the one-tick level. Furthermore, the entire large structure in Figure 3.2 could be a setup leg for a trend on the next higher time frame. This is not an abstract concept, but an important tool to understand market struc- ture. No pattern exists in the vacuum of a single time frame. The market is like a set of Russian nesting matryoshka dolls—digging into one time frame will reveal similar struc- tures nested on lower time frames, all the way down to the tick level. Understanding this structure is a key component of building intuition about markets. Traders usually focus on one speciﬁc time frame, but it is important to understand that the patterns of the lower time frame actually create the patterns on the trading time frame, and that the patterns on the trading time frame are inﬂuenced by evolving patterns on the next higher time frame. In practice, the interactions of structures on lower time frames are usually components of price action, while higher time frames are more likely to provide context or motivation for market structure patterns within the trading time frame. TREND STRUCTURE We now turn to the structure of trends in a little more depth: how they start, how they unfold, and how they come to an end. The presence of a trend suggests an imbalance of 17 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 53 FIGURE 3.3 Thirty-Year Treasury Bond Futures, November 2008 Strong momentum emerges at the right side of the chart, penetrating the upper channel and spiking the MACD to a new high. then slide it to the right to reveal one bar at a time to see the response of the indicator.) Also, notice that both of these cases are very clear, and that the indicator is somewhat redundant because the information is already clearly visible in the price structure. Impulse moves drive trends. As long as each trend leg extends in a momentum move approximately consistent with previous moves, the probabilities favor buying the next pullback for another trend high, or, in the case of a downtrend, shorting the pullbacks for another run at the lows. What you do not want to see in a trend is the emergence of sharp contratrend momentum on one of the pullbacks. Figure 3.5 shows an example in which very sharp downward momentum emerged on a pullback in Sugar futures. Notice that this pullback completely broke the established trend pattern, and spiked the MACD to a sharp new low, which is not consistent with an intact uptrend. Though it is important to understand the subtle clues the market gives us, sometimes the most important ones are very obvious. There is no point trying to trade with the uptrend after an event like this; it is safe to assume the trend is broken until further notice. Remember, the normal pattern in an established trend is that each setup leg is a mo- mentum move, and the subsequent extensions also function as momentum moves setting @US - Daily 30 Yr U.S.Treasury Bonds Continuous Contract 116 114 112 Aug Sep Oct Nov 18 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 54 MARKET STRUCTURE FIGURE 3.4 Five-Minute S&P 500 Futures, December 7, 2010 A large downward price spike (marked with an arrow on the chart) sets oﬀ an extended downtrend. up the next trend leg. Economics 101 tells us that increased demand in a market will lift prices as the market tries to ﬁnd a new market-clearing price; this description of trend movement is one of the mechanisms through which that adjustment happens. Eventually, higher prices will bring enough sellers into the market that a new, perhaps temporary, equilibrium is achieved. Astute technical traders can usually see clues to this process in the market tape. The most important patterns are: new momentum highs or lows, subsequent trend legs making similar new impulse moves, and the absence of strong countertrend momentum on pullbacks. Climaxes Buy pullbacks following an upward impulse move, or short bounces after strong selling impulse moves. That, in a nutshell, is a very effective plan for trading trends. Simple, right? Not so fast—there is a potential complication, and it is one of the most signiﬁcant problems in technical analysis. It is true that there should be follow-through (range ex- pansion) in the direction of previous impulse moves; however, extremely strong impulse 11 :00 12/7 10:00 13:00 12:00 7.00 4.00 19 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:53.697896"
}