{
  "id": "ca428cea52b9",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 20,
  "content": "to recent market history. Volatility contracts greatly in ranges, so any indicators measuring range expansion will also be skewed—in other words, it takes a much smaller movement to make a climax pattern on a breakout of a range. Furthermore, strong breakouts of ranges, even if they are apparently climac- tic, usually see continuation, so these are difﬁcult trades, and it is probably best to look for climaxes only after extended trends. Figure 3.8 shows the Dow Jones Industrial Average (cash index) in the days fol- lowing the terrorist attacks on the World Trade Center on September 11, 2001. Even in this exceptional example, with several days on which the stock market did not trade due to the uncertainty following the attacks, the patterns of climax and exhaustion are consistent. Markets move in response to emotion; robust technical tools quantify 1.00 ~::::2::::~~~..p.=..<e;~,-;-:-:----:;;=:::::::::;----J~T:-:-:-:-----:;~ - ,,~;z:;~ 1_2_00 -5.00 -8.00 Jul Aug Sep Oct Nov 22 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 58 MARKET STRUCTURE FIGURE 3.8 The Dow Jones Industrial Average Before and After the Terrorist Attacks of Septem- ber 11, 2001 those movements and underlying emotions in ways that make them consistently read- able, even in extreme examples. This chart captured a time of great turmoil, but even so, the climax pattern is familiar: large ranges, parabolic expansion outside the bands, many free bars (highs below the lower band), and many large bars that close on their low. In this case, there was no clear upside momentum following the climax, but the sell- ing climax should at least have been a warning to traders not to short into the following pullback. In this case, the extreme reached in mid-September held as the low for over a year. Speaking of extreme situations, Figure 3.9 shows the Dow Jones Industrial Average as it behaved during the crash of 1929. The patterns are essentially the same as we see in any other climax situation, and the geometric relationships of the market to the moving average and the channels are consistent with anything we would see in modern markets. One of the challenges thrown up against technical analysis is that many authors claim it is a self-fulﬁlling prophecy, as many traders are using the same tools and making the same decisions. While this is completely rational, it is a ﬂimsy argument because many technical tools and patterns work on periods of market history where no one was using May Jun Jul Aug Sep 23 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 59 FIGURE 3.9 Dow Jones Industrial Average, Second Half of 1929 Note the same selling climax pattern. them. No one in 1929 was using exponential moving averages or Keltner channels, yet they would have been reliable tools. This is food for thought. There is another point here, concerning expectations from technical patterns. Nei- ther this 1929 climax low nor the 2001 climax low marked the ultimate low for the mar- ket. In both cases the low was retested several times and failed to hold, albeit after the market put in a substantial bounce. Do not assume that these climax patterns are nec- essarily justiﬁcation to assume a countertrend position, but do use them as warnings to lighten up or exit existing with-trend positions. Climax patterns are important and can be extremely dangerous to traders who do not understand how they work. We will revisit this structure several times and consider speciﬁc trading patterns that can set up around them, but the key, for now, is that you can identify the characteristic patterns of climaxes on charts and know to avoid getting caught in the mania or the panic of the crowd. It is not possible to identify these areas with 100 percent accuracy, and it is not always possible to separate climactic moves from simple strength or weakness that should see continuation. Sometimes you will misjudge and make the wrong decision; this is unavoidable, but be sensitive and responsive to this S~DU - Daily Dow Jones Industrial Ave-_;,..ra;:.;;,-ge ___ Aug Sep Oct Nov Dec '30 24 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 61 FIGURE 3.10 Pullbacks in the Uptrend—E-mini S&P 500 Futures, December 2009 complacent. If buyers are more uncertain, they will demand lower prices as protection and will not be willing to bid the market aggressively higher. The end result will be deeper pullbacks, perhaps with a more complex structure. So far, all of the pullbacks examined have been simple pullbacks or consolidations, meaning that they are composed of one contratrend movement. The trend leg ends, the pullback begins, and, at the bottom of the pullback, buyers push the market to new highs. It is not always this simple. Another common pattern is the complex pullback, which is a standard pullback followed by a failed attempt to resume the original trend. When this attempt fails and rolls over, the pullback puts in a second leg",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.698188"
}