{
  "id": "f673a53fb3f2",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 143,
  "content": "less than parity will be better off exercising an index option early rather than holding it. In this scenario the 390 calls will also become early exercise candidates, although the savings will not be as great as with the 380 calls. Prior to the news, the 390 calls might be trading for 13.98. But if the market drops to 390.00 the next morning, the 390 calls will only be trading for 7.10. If the trader owns 390 calls and doesn’t exercise, he will lose 13.98 — 7.10, or 6.88 per call. {f he does exercise, he will lose only 13.98 — 10.00, or 3.98. He will save 2.90 per call through early exercise. Of course, implied volatility might increase following such a violent drop in the market. But even if implied volatility jumps to 18%, the prices of the 380 and 390 calls the next morning will only be 15.06 and 8.84, respectively. This is still less than parity, So a trader holding these calls would still want to exercise them early. Although it does seem that stock index markets are more susceptible to bad news than good, puts might also become early exercise candidates if the market were to jump following unusually bullish news. If, in our example, there was a perception that the Market would open the next morning 10 points higher, at 410.00, the option prices Might look like this: 318 Chapter 15 Index = 410.00 Time to June expiration = 29 days —s Implied volatility = 14% Interest rates=6% Dividend = 0 Exercise Call Call Put Put Price Price Deita Price Deita 380 31.92 98 12 ~2 390 22.45 92 61 -8 400 14.01 78 2.16 -23 410 7.46 55 5.67 -46 420 3.28 32 11.75 72 Now the 410 and 420 puts have become early exercise candidates. Based on the closing index price of 400.00, their parity values are 10.00 and 20.00. But with the index perceived to be at 410.00 their prices are only 5.67 and 11.75. Even if implied volatility were to rise to 18%, their prices would only be 7.49 and 13.37, respectively. This is still well below parity, so a trader would want to exercise the puts rather than hold them. In a market where early exercise is a possibility, options should never trade for less than parity. If a stock index option market remains open after the index has been fixed for the day (as it does for 15 minutes in the United States), even if traders begin to trade the options as if the market will open the next morning at a price significantly different than that day’s closing index price, all options must trade at a price of at least parity. If this were not true, there would be an immediate arbitrage opportunity. If the 390 call were really trading at 7.04 as a result of the negative news, a trader would buy as many calls as possible and immediately submit exercise notices, in the process collecting 10 points per option. He would realize an immediate profit of 2.96 per option. What would happen if the marketplace were wrong about where the index would open the next morning? Suppose that traders believe the market will open the next morning 10 points lower, but in fact the market opens unchanged, or even several points higher. Wouldn’t a trader who exercised the 380 or 390 calls regret his actions? Regardless of what happens the following morning, a trader will always be better off exercising as long as he takes action to offset the effects of the exercise. For example, suppose the trader initiated the following delta neutral ratio spread before the negative news reached the market: long 10 June 390 calls at 13.98 delta = 78 short 25 June 410 calls at 3.24 delta = 32 If the trader holds the position, including his 390 calls, and the market opens the next morning at 390, he will show a loss of 12.75, since: -10 x (13.98 — 7.10) +25 x (3.24 — .98) = -12.30 But suppose the trader decides to exercise his 390 calls. He still needs to balance his delta position by taking in the 780 deltas which disappeared when he exercised his calls. Stock Index Futures and Options 319 One way to do this is to simply close out the spread by buying back the 410 calls at their new price of .98. If he does this, he will show a profit of 16.85, since: -10 x (13.98 — 10.00) +25 x (3.24 ~ .98) = +16.70 If the trader does not want to liquidate his short position in the 410 calls, he can look for another way of taking in 780 deltas. If other stock exchanges are still open and the trader can purchase the stocks making up the index at the new, lower prices and in the correct proportion, he might consider buying stock equivalent to eight index contracts (800 deltas) to make up his loss of 780 deltas. Or, if a futures contract is available on the index, and the futures market, in reaction to the negative news, is now trading 10 points lower, he might buy eight futures contracts since each contract will have approximately 100 index deltas.° It may seem odd, but in fact it doesn’t matter whether the index opens the next morning at a higher price, lower price, or unchanged. What matters is that the marketplace believes that the market will change, and that all contracts are priced accordingly. In such a case, the trader must exercise those options which, given the perceived change in the underlying price, now have a value less than parity, and replace them with other contracts which are not limited by parity constraints, There is clearly an additional early exercise value associated with cash index options, a value which does not result from the usual early exercise considerations of dividends or interest. This value arises because under some circumstances a trader can exercise index options",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.444345"
}