{
  "id": "7efd7cd369e3",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 27,
  "content": "possible on any time frame. FIGURE 3.26 Dow Theory Downtrend with Lower Lows and Lower Highs Us Oolar It\" h Pound I GBPUSO - Daily Br IS '10 1.68000 35 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 78 MARKET STRUCTURE FIGURE 3.25 Higher Highs and Higher Lows in an Idealized Dow Theory Uptrend to identify it, and how you want to trade it. A trader looking for mature trends in mar- kets that trend well might simply look for charts that “begin at one corner of the chart and travel to the other.” This might seem to be an overly simplistic approach to ﬁnding trending markets, but it works for certain kinds of traders. Other traders might look for subtle patterns and momentum shifts that suggest a trend might be turning, with the idea that they will aggressively pursue entries at those spots so that they have bought the low or sold the high if a new trend develops. All of these approaches are valid, but let’s begin with a broad, structural approach to trend identiﬁcation. This is pure market structure approach based largely on the work of the early authors who laid out the principles of what became known as the Dow Theory. Dow Theory Trend Patterns An uptrend is a pattern of successively higher pivot highs (HHs) and higher pivot lows (HLs) (see Figure 3.25). Both are important. Most people readily accept a deﬁnition of an uptrend that requires higher highs; this is intuitive, but it is easy to overlook the im- portance of accompanying higher lows; if a market is only making higher highs, but is not also clearly holding higher lows, the buyers are not solidly in control of that market. Conversely, a downtrend is a series of both lower lows (LLs) and lower highs (LHs) (see Figure 3.26). This is perhaps the most elementary deﬁnition of trend possible on any time frame. FIGURE 3.26 Dow Theory Downtrend with Lower Lows and Lower Highs P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 79 A FIGURE 3.27 Dow Theory Trend Change #1 Under this system, there are three possible trend states: up, down, or uncertain; many people incorrectly assume that a market is either in an uptrend or in a downtrend, but the third possibility is important. There are several reasons that a trend could be identiﬁed as uncertain. For example, perhaps the pattern in the market actually is un- clear and more or less random; we can usually force any structure into some pattern, but such a Procrustean approach is rarely constructive. It is far better to have tools that respect the realities of the market, and at times the market is simply uncertain. The best trend identiﬁcation tools will respect the potential for ambiguity. One of the most important aspects of the study of trends is the study of how they end. Under this idealized Dow Theory structure, there are two categories of trend changes. In the ﬁrst, the market fails to make a new extreme on a with-trend leg. In an uptrend, if the market falls short of the previous pivot high, the trend status becomes uncertain. Note that it is not yet in a downtrend, because the downtrend requires both lower highs and lower lows. Conceptually, buyers failed to push the market to new highs; this is a warning shot across the bow, but not a conﬁrmation of a trend change. It is not uncommon to see a market fail to make a new high, consolidate a bit, and then continue the uptrend unabated. The trend change is actually conﬁrmed only when price trades through the last pivot low, marking a lower low (see Figure 3.27). Once that previous pivot low has been violated, any upswing will now begin from a lower low. Since the market has put in both a lower high and a lower low, the technical requirement for a trend change to downtrend is satisﬁed. The second trend change occurs when prices retreat so aggressively from the highs that they take out the previous pivot low; at this point, the trend pattern is broken be- cause the market shows a higher high and a lower low. (See point A in Figure 3.28.) This pattern is less common, because it requires signiﬁcant volatility off the high to take out the pivot low in one swing. It is, however, an important pattern because it often sug- gests trapped trend traders and can set up very attractive countertrend trades, or a sharp trend change with potential for continuation in the new trend. The actual trend change is more complicated in this case, requiring two more steps. The next rally must fall short of the previous high (point B in Figure 3.28), but the trend change is not conﬁrmed until the market again takes out the previous low. Why? Because it would be possible for the P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 80 MARKET STRUCTURE A B C FIGURE 3.28 Dow Theory Trend Change #2 market to put in a lower high at B, hold a higher low than C, and then continue in an uptrend by trading through B. The only way to be certain that the market will show the lower high and lower low is for the previous low to fail to hold as support. It goes without saying that these patterns are simply inverted for a downtrend chang- ing to an uptrend. In the ﬁrst case, a downtrend fails to make a lower low, and then the trend change is conﬁrmed when the previous pivot high is violated. In",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.699379"
}