{
  "id": "a9b9c2c89ea1",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 34,
  "content": "a mean-reversion strategy. Unfortunately, most stock price series are not stationary—they exhibit a geometric random walk that gets them farther and farther away from their starting (i.e., initial public offering) values. However, you can often find a pair of stocks such that if you long one and short the other, the market value of the pair is stationary. If this is the case, then the two indi- vidual time series are said to be cointegrated. They are so described because a linear combination of them is integrated of order zero. Typically, two stocks that form a cointegrating pair are from the same industry group. Traders have long been familiar with this so- called pair-trading strategy. They buy the pair portfolio when the spread of the stock prices formed by these pairs is low, and sell/ short the pair when the spread is high—in other words, a classic mean-reverting strategy. Endnote: Definitions of Spread_EMA and Spread_VAR Spread_EMAS pread,00 Spread_EMAt 1 2 1 1 2 lookbackp eriod Spread t lookbackp e _ _ rriod Spread EMA_, t Spread_VAR Spread Spread ,11 0 2 Spread_VAR t lookback_period Spread tS pread_EMAt1 2 11 2 1 2 lookback_period *S pread_VAR t Chan800064_c07.indd 147 6/7/2021 7:16:56 AM 148 QUANTITATIVE TRADING Example 7.2: How to Form a Good Cointegrating (and Mean-Reverting) Pair of Stocks As I explained in the main text, if you are long one security and short another one in the same industry group and in the right proportion, sometimes the combination (or \"spread\") becomes a stationary series. A stationary series is an excellent candidate for a mean-reverting strategy. This exam- ple teaches you how to use a free MATLAB package, downloadable at An example of a pair of cointegrating price series is the gold ETF GLD versus the gold miners ETF, GDX, which I discussed in Example 3.6. If we form a portfolio with long 1 share of GLD and short 1.631 share of GDX, the prices of the portfolio form a stationary time series (see Figure 7.2). The exact number of shares of GLD and GDX can be determined by a regression fit of the two component time series (see Example 7.2). Note that just like Example 3.6, I have used only the first 252 data points as the training set for this regression. Spread between GLD and GDX Long 1 share of GLD Short 1.6766 share of GDX 10 8 6 4 2 Spread (in $) –2 –4 –6 0 Date 20060523 20061012 20070309 20070801 20071221 FIGURE 7.2 A stationary time series formed by the spread between GLD and GDX. Chan800064_c07.indd 148 6/7/2021 7:16:57 AM ( ) = ( ) ( +) = ( +) + ( - ) () ()=( ()- ( )) ( + )= ( ( + )- ( +)) + ( - ) () 72 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 148 QUANTITATIVE TRADING Example 7.2: How to Form a Good Cointegrating (and Mean-Reverting) Pair of Stocks As I explained in the main text, if you are long one security and short another one in the same industry group and in the right proportion, sometimes the combination (or \"spread\") becomes a stationary series. A stationary series is an excellent candidate for a mean-reverting strategy. This exam- ple teaches you how to use a free MATLAB package, downloadable at An example of a pair of cointegrating price series is the gold ETF GLD versus the gold miners ETF, GDX, which I discussed in Example 3.6. If we form a portfolio with long 1 share of GLD and short 1.631 share of GDX, the prices of the portfolio form a stationary time series (see Figure 7.2). The exact number of shares of GLD and GDX can be determined by a regression fit of the two component time series (see Example 7.2). Note that just like Example 3.6, I have used only the first 252 data points as the training set for this regression. Spread between GLD and GDX Long 1 share of GLD Short 1.6766 share of GDX 10 8 6 4 2 Spread (in $) –2 –4 –6 0 Date 20060523 20061012 20070309 20070801 20071221 FIGURE 7.2 A stationary time series formed by the spread between GLD and GDX. Chan800064_c07.indd 148 6/7/2021 7:16:57 AM Special Topics in Quantitative Trading 149 www.spatial-econometrics.com, to determine if two price series are coin- tegrated and, if so, how to find the optimal hedge ratio (i.e., the number of shares of the second security versus one share of the first security). The main method used to test for cointegration is called the coin- tegrating augmented Dickey-Fuller test, hence the function name cadf. A detailed description of this method can be found in the manual, also available on the same website mentioned earlier. Using MATLAB The following program is available online as epchan.com/book/ example7_2.m: % make sure previously defined variables are erased. clear; % read a spreadsheet named \"GLD.xls\" into MATLAB. [num, txt]=xlsread('GLD'); % the first column (starting from the second row) is % the trading days in format mm/dd/yyyy. tday1=txt(2:end, 1); % convert the format into yyyymmdd. tday1=.. datestr(datenum(tday1, 'mm/dd/yyyy'), 'yyyymmdd'); % convert the date strings first into cell arrays and % then into numeric format. tday1=str2double(cellstr(tday1)); % the last column contains the adjusted close prices. adjcls1=num(:, end); % read a spreadsheet named \"GDX.xls\" into MATLAB. [num2, txt2]=xlsread('GDX'); % the first column (starting from the second row) is % the trading days in format mm/dd/yyyy. tday2=txt2(2:end, 1); % convert the format into yyyymmdd. tday2=.. datestr(datenum(tday2, 'mm/dd/yyyy'), 'yyyymmdd'); % convert the date strings first into cell arrays and % then into numeric format. tday2=str2double(cellstr(tday2)); adjcls2=num2(:, end); % find all the days when either GLD or GDX has data. tday=union(tday1, tday2); [foo idx idx1]=intersect(tday, tday1); % combining the",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "market_structure",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T00:37:43.609187"
}