{
  "id": "53ca5c2cfad0",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 80,
  "content": "was com- pressed, as evidenced by the smaller ranges on the preceding bars, and it was enough to take a simple breakout exit on close. Stop The initial stop was set somewhere around 11.25 (the small dotted line). It may seem like the stop could have been higher, for the pullback pattern would be decisively violated just below the recent lows, around 11.75. However, the placement of this stop ZAGG- 8' D ·1y Zagg Incorporated Mar 120 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trend Continuation 297 was a risk management decision. Placing the stop farther away from the market results in a smaller position size; this is a prudent step in a potentially overextended market that could reverse on high volatility. FIGURE 10.4 A Successful Pullback Trade Overnight news drove the market to open around the ﬁrst proﬁt target (Figure 10.4). Many traders would have been tempted to not take partial proﬁts here, or even to add to their positions, with the idea that the news could drive the stock into a new, steeper uptrend. While this is always possible, it is not what usually happens. Usually, large gaps like this lead to increased volatility; selling some of the position at the ﬁrst target will mean that even though the stock may ﬂuctuate wildly, your P&L will not. A: After one very strong session, the stock began a pullback or a decline that ended in the volatile session marked A. Remember this pattern: A session with a long shadow in the direction of the preceding swing is often a small climax. In this case, a selling climax was clearly visible on intraday charts. B: Though not the focus of this example, another long position could have been ini- tiated on a breakout of the small days following the selling climax. Consider the bigger picture: this stock was driven higher on news, began a multiweek pull- back that ended in a selling climax, and then spent two sessions in volatility compression. At this point, the stock was potentially primed for a directional P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 298 TRADING STRATEGIES move, and another long position was justiﬁed. Last, note that this leg ran into some resistance just under 16.00, which was approximately the high of the June spike. Pullback, Lower Time Frame Climax Entry FIGURE 10.5 Lower Time Frame Climax Sets Up a Pullback Entry in Silver Futures Setup Different markets have different tendencies to trend, and it is important to ad- just your trade expectations based on these tendencies. Though it is a gross overgener- alization, currencies tend to trend longest and best, commodities are somewhere in the middle, and equities are more prone to mean reversion and reversal than long trends. Silver had just come from an impressive two-and-a-half-year trend, but this small climax and reversal (see Figure 10.5) were unlikely to be enough to end the trend. A: Again, note the buying climax evidenced by the free bars above the channel. There is no momentum divergence here, as there are no swings, only a steady grind up to A. B: The rule is to not buy pullbacks following a buying climax, and the bar preceding B is exactly why: fake-outs and false entries are normal in these environments. ZAGG - Daily z agg Incorporated 10.00 8.00 Jul 1 erContinu @SI- Daily Silv ous Contractact Inset: 60 min ch art ,, ~---,, ~ ~-- -~\\7 1.00 ~b ~~ l,lar 121 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trend Continuation 299 However, notice what happens at B and the inset chart, which shows an intraday perspective on B and the bar before: a strong selling climax on the 60-minute time frame brings the market to the bottom of the daily consolidation. Entry This selling climax is most likely evidence that many weak-hand longs have been ﬂushed out, and it sets up a potential long entry. After this much work, meaning time spent consolidating, the buying climax is effectively worked off. After two bars’ consoli- dation (volatility compression again), the small breakout on the last bar of the chart is a reasonable spot to initiate a long trade. Stop A stop was established not far underneath the consolidation. If the trade is going to work well, the lower time frame selling climax should mark the bottom for the fore- seeable future. There is no point giving a trade like this additional room to move against you after the entry, so a tight stop is justiﬁed. FIGURE 10.6 A Pullback Entry Leads to a Multileg Trend There was no pain on this trade. Silver traded smartly higher, running into some resistance at A in Figure 10.6, just beyond the ﬁrst proﬁt target for this trade. Consider how a trading plan like this puts you in control. If you entered after the ﬂush, took partial proﬁts at 1× your risk or the previous swing high, and now hold a partial position against a raised stop, the worst possible outcome is a small proﬁt. (Be careful with phrases like P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 300 TRADING STRATEGIES “worst possible outcome” though, because there is always the possibility of an outlier. But for all practical intents",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.707961"
}