{
  "id": "def926e81404",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 76,
  "content": "≥75% 0.0% 0.0% Percent of Accounts Bankrupt 0.0% 0.0% 114 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing 274 TRADING STRATEGIES percent ﬁxed fractional sizing, and, though they are not directly comparable, reproduces the numbers from Table 9.1 for comparison. A few things jump out here. First of all, these numbers do seem to be roughly com- parable at ﬁrst glance. We see that both the mean and the median values have increased, which is to be expected because, as the account grows—which, on average, it does with this positive expectancy system—ﬁxed fractional sizing allows you to take on more risk. This is essentially a way to leverage your winners and to use accumulated trading proﬁts to fund further risk. We note that the standard deviation has increased fairly dramatically; the coefﬁcient of variation does not look good. In fact, if they were directly comparable, Table 9.2 suggests we should be able to hit a mean terminal value of around $200,000 for a coefﬁcient of variation of 0.35 with a ﬁxed dollar amount risk plan. Perhaps we are a little disappointed with the ﬁxed fractional results, which seem to have increased volatility of returns without compensating for the extra risk. In fact, the ﬁxed fractional approach would have a lower Sharpe ratio for a commensurate return. Naive rules would suggest that this is lower risk-adjusted return, but hold off on making any decisions for a moment. There just may be more to this story. Digging a little deeper, we see that the mean of maximum value has increased fairly signiﬁcantly, without any real change in the mean of minimum value. In fact, both the mean of minimum value and the lowest terminal value from the run have increased, and we also see that the highest terminal value is about 1.7 times what it was with the ﬁxed sizing. Figure 9.2 gives some insight into what is going on. FIGURE 9.2 Distribution of Terminal Values for Fixed-Dollar and Fixed-Fractional Position- Sizing Plans P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing 276 TRADING STRATEGIES TABLE 9.5 Several Fixed Fractional Monte Carlos 4% 8.333% 10% 12% 25% Mean Terminal Value 263,545 711,375 1,014,163 1,508,351 5,280,790 Median Terminal Value 222,225 307,825 300,832 262,485 5,630 Std Dev of Terminal Value 193,846 1,431,904 2,821,550 6,005,588 79,775,366 Coeﬃcient of Variation 0.74 2.01 2.78 3.98 15.11 Mean of Max Value 316,875 1,046,380 1,636,924 2,781,394 62,017,391 Mean of Min Value 79,046 58,366 51,237 43,292 9,444 Highest Terminal Value 1,670,569 20,392,572 46,000,315 109,597,717 1,757,129,394 Lowest Terminal Value 29,561 4,647 1,967 629 0 Percent Terminal DD ≥75% 0.0% 4.6% 8.0% 15.6% 66.5% the initial 1,000 accounts closed with less than $2,000—certainly a catastrophic loss by any reckoning.) However, the average closing value is well over $5,000,000, and one of the accounts made almost two billion dollars. This is not a bad run from a starting value of $100,000. The 8.333 percent example in Table 9.5 is a special case: it is the Kelly number for this particular system. It is worth pointing out that this is exactly the kind of situation in which the Kelly criterion can be safely applied. The wins and losses are all the same size, and there are never any surprises in the form of larger-than-expected wins or losses. In addition, each trade is completely independent of preceding trades. In other words, there are never longer strings of winners and losers than you would expect to see in random data. The Kelly number produces some pretty impressive results, with mean and median terminal values far exceeding anything we were able to hit with the (reasonable) con- stant risk scenarios. In addition, the Kelly criterion opens the door to truly outstanding performance; one of our Kelly-sized accounts would have run the $100,000 initial invest- ment up to over $20 million by the end of the run. As you might expect from an aggressive strategy, there is also signiﬁcant risk of loss, as 4.6 percent of the accounts closed under $25,000. Even so, there may be situations in which a trader could accept the risks of an optimized strategy in return for the potential reward. This might depend on the trader’s risk tolerance and investment goals for the account. For instance, is the trading account your entire net worth, or is it just a small subaccount that you intend to press aggres- sively? These questions go beyond the math behind the strategies, but they are important questions to consider before you actually put capital at risk in the market. As you might imagine, since it is an optimized, aggressive number, bad things start to happen when we risk more than the Kelly criterion suggests. Though the general 'E Cl) <J <ii 0.. 10 5 0 100,000 200,000 300,000 400,000 Constant $2,000 risk 15 10 'E Cl) <J <ii 0.. 5 0 ~~ \\ \\ I i L ,.., 0 100,000 200,000 300,000 400,000 Fixed Fractional (2%) 115 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing Risk Management 277 principle of “risk more, make more” is technically true, as you can see from the mean terminal values for the 10, 12, and 25 percent risk levels in the table, the declining me- dians tell a different story. We cannot see it in the table, but the distribution",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.707366"
}