{
  "id": "21ae9a6513d7",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 123,
  "content": "be willing to accept unlimited downside risk, but he is probably unwilling to accept unlimited upside risk. A hedger with a short underlying position may be willing to accept unlimited upside risk, but he is probably unwilling to accept unlimited downside risk. A hedger who constructs a position with unlimited risk in either direction is presumably taking a volatility position. There is nothing wrong with this, since volatility trading can be highly profitable. But a true hedger ought not lose sight of what his ultimate goal is: to protect an existing position, and to Keep the cost of this protection as low as possible. A hedger can also protect a position by constructing one-to-one volatility spreads with deltas which yield the desired amount of protection. For example, a hedger who wants to protect 50% of a short underlying position can buy or sell time spreads or butterflies with a total delta of +50. Such spreads offer partial protection within a range. The position still has unlimited upside risk, while it also retains unlimited downside profit potential. Such volatility spreads also give the hedger the choice of buying or selling volatility. If implied volatility is generally low, with the underlying market currently at 100, the hedger might protect a short position by purchasing a 110 call time spread (purchase a long-term 110 call, sell a short-term 110 call). This spread has a positive delta and, at the same time, is theoretically attractive since the low implied volatility makes a long time spread relatively inexpensive. If the 110 call time spread has a delta of +25, to hedge 50% of his directional risk the hedger can buy two time spreads for each short underlying position. Conversely, if implied volatility is high, the hedger can consider selling time spreads. Now he will have to choose a lower exercise price to achieve a positive delta. If he sells the 90 call time spread (purchase a short-term 90 call, sell a long-term 90 call}, he will have a position with a positive delta and a positive theoretical edge. If he wants to protect 75% of his position, and the spread has a delta of +25, he can sell the spread three times for each underlying position. In the same way, a hedger can also buy or sell vertical spreads to achieve a desired amount of protection. Depending on whether options are generally underpriced or overpriced (implied volatility is too low or too high), the hedger will work around the at-the-money option. With the underlying market currently at 100, the hedger who wants to protect a long position can sell a vertical call spread with a negative delta (sell the lower exercise price call, buy the higher exercise price call). If implied volatility is high, he will prefer to sell an at-the-money option and buy an out-of-the-money option. If implied volatility is low, he will prefer to sell an in-the-money option and buy an at-the-money option. Each spread will have a negative delta, but will also have a positive theoretical edge since the at-the-money option is the most sensitive to changes in volatility. As is obvious, using options to hedge a position can be just as complex as using options to construct trading strategies. Many factors go into the decision-making process. When a potential hedger is confronted for the first time with the multitude of 268 Chapter 13 possible strategies, he can understandably feel overwhelmed, to the point where he decides to abandon options completely. When this happens the hedger, or someone advising the hedger, should lay out a limited number of strategies (perhaps four or five) which make sense, and compare the various risk/reward characteristics of the strate- gies. Given the hedger’s general market outlook, and his willingness or unwillingness to accept certain risks, it should then be possible to make an intelligent decision. A summary of common hedging strategies, with some of their advantages and disadvan- tages, is given in Figure 13-7. PORTFOLIO INSURANCE Suppose a hedger holds a long position in a certain asset, and he wants to protect his holding against downward movement by purchasing a put option. Unfortunately, the hedger finds that no option market for this asset exists. Nor is any other source, such as an option dealer, available. Is there any way the hedger can create the put option himself? If the hedger were really able to purchase a put, his position would be: long underlying + long put But we know from the synthetic relationships in Chapter 11 that a long underlying position together with a long put is equivalent toa long call. Therefore, the hedger really wants to own a call with the same exercise price as the put. What would be the characteristics of this call? We could analyze the call using a theoretical pricing model. In order to do that, we need to know what the underlying asset is, and then we need to determine the inputs into the model. Suppose the underlying asset is a futures contract, and that we plan to use the following inputs: exercise price = 100 time to expiration = 10 weeks underlying price = 101.35 interest rate = 8% volatility = 18.3% Feeding these inputs into a theoretical pricing model, we find that the call option which the hedger would like to own has a delta of 57. This means that if the hedger actually owned the call (instead of owning the underlying asset together with a 100 put) in theory he would have a position equivalent to owning 57% of his asset. Therefore, if he wants to replicate the combination of the underlying asset and the 100 put, he must sell off 43% of his holdings in the asset. When he does that, he will have a position theoretically equivalent to owning a 100 call. Now suppose a week passes and the value of his asset has risen to 102.26. What would be the delta of the 100 call which the hedger desires to own? Again, feeding all",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.441094"
}