{
  "id": "1fa935249148",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 95,
  "content": "underlying contract. In stock options, the forward price is the current price of the stock, plus carrying costs on the stock, less expected dividends. Assuming an underlying stock price of 99, six months to expiration, a volatility of 28%, interest rates of 10%, and no dividend, we can see from Figure 10-6 that the 105 call has a delta of 50 and therefore acts like the at-the-money option, even though its exercise price is six points higher than the current underlying price. Therefore, any vertical spread should focus on the 105 call or 105 put. The approximate prices of vertical spreads with these stock options at implied volatilities of 23% and 33% are shown in Figure 10-7. Figure 10-6 Stock price = 99; Time = 6 months; Volatility = 28%; Interest = 8.00% Theoretical Option Vaiue Delta Gamma Theta Vega 95 call 11.97 69 1.8 -.031 24 105 call 6.96 50 2.0 -.030 27 115 call 3.74 32 1.8 ~.025 25 95 put 4.25 -31 1.8 -.013 22 105 put 9.20 ~50 2.0 -.011 26 115 put 15.68 -68 1.8 —.004 24 210 Chapter 10 Figure 10-7 95 95/105 105 105/115 115 Volatility Call Spread Call Spread Call 23% 10.77 5.20 5.57 3.05 2.52 28% 11.97 (69) 5.01 (19) 6.96 (50) 3.22 (18) 3.74 (32) 33% 13.21 4,85 8.36 3.34 §.02 95 95/105 105 105/115 115 Volatility Call Spread Call Spread Call 23% 3.05 4.41 7.46 6.56 14,02 28% 4.25 (-31) 4.60 (19) 8.85 (—50) 6.39 (19) 15.24 (-68) 33% 5.49 4.76 10.25 6.27 16.52 As always, we can never be certain of the delta values of a spread because we can never be certain that we have the correct inputs into the model, in particular, volatility. If volatility turns out to be lower than our estimate, the deltas will move away from 50. If volatility turns out to be higher than our estimate, the deltas will move towards 50. This will change the delta values of the spreads. However, if we work around the at-the-money option, spreads with approximately the same amount between exercise prices will have approximately the same delta values. Our primary problem will be deciding whether implied volatility is too high or too low. Notice that in every case, whether with futures options or with stock options, whether using a low volatility or a high volatility, if one leg of our spread always involves an at-the-money option, the vertical spread which includes the in-the-money option always has a higher price than the spread which includes the out-of-the-money option. A new trader might take the view that since both spreads have approximately the same delta values, it must make sense to always purchase the cheaper spread or sell the more expensive. This ignores the purpose of option evaluation: to consider not only the initial cost of a strategy, but to compare that to the strategy’s expected return. In our futures option example, a trader will always have to pay more for the 95/100 call spread than the 100/105 call spread. But if implied volatility is too high, the 95/100 spread will also return more to the trader. To see why, suppose a trader is choosing between the 95/100 bull call spread and the 100/105 bull call spread. Consider three possible cases. In case one, the trader is right and the market moves from 100 to 110. If that happens both spreads will be winners since they will both widen to their maximum value of five points. In case two, the trader is wrong and the market drops to 90. In that case both spreads will be losers since they will both collapse to zero. Now consider case three, where the trader is wrong because he expected the underlying market to rise and it didn’t. But he wasn’t terribly wrong, because it also didn’t fall. It simply remained at 100. If that happens the 100/105 spread will collapse to zero, while the 95/100 spread will still widen to its maximum value of five points. The 95/100 spread is always more valuable than the 100/105 spread because it has time on its side. The 100/105 spread needs the market to rise to show a profit. The 95/100 spread doesn’t really need the Bull and Bear Spreads 211 market to rise; it just needs for the market not to fall. The reader can confirm this by calculating the gamma and theta positions of the spreads in Figure 10-5. The 100/105 spread has a positive gamma and a negative theta, whereas the 95/100 spread has negative gamma and a positive theta. If a trader is considering a bull vertical spread, how likely is it that the market will rise? That depends on his ability to predict market direction. At the same time, he must ask himself how likely it is that the market will move. That depends on his ability to predict volatility. If a trader believes there is a good chance the market will move (high volatility), and at the same time believes the movement will be to the upside (bullish on direction), it makes sense to buy the 100/105 spread. On the other hand, if the trader believes the market is unlikely to move significantly (low volatility), but at the same time believes that whatever movement does occur is likely to come on the upside (also bullish), it makes sense to buy the 95/100 spread. In both cases the trader is trying to maximize the return on his investment when he is right and minimize the loss when he is wrong. Why might a trader with a directional opinion prefer a vertical spread to an outright long or short position in the underlying instrument? For one thing, a vertical spread is much less risky than an outright position. A trader who wants to take a position which is 500 deltas long can either buy five underlying contracts or buy 25 vertical call spreads with a delta of 20 each. The 25 vertical spreads may sound riskier than five underlying",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.436854"
}