{
  "id": "b0728c5dc5df",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 17,
  "content": "roulette wheel may have no slot 00. This of course changes the odds. 38 Chapter 3 of 95¢ and, as before, if he loses the casino will immediately collect his 95¢. Under the new conditions, however, if the player wins the casino will send him his $36 winnings in two months. Will both the player and the casino still break even on the proposition? Where did the player get the 95¢ he used to place his bet at the roulette wheel? In the immediate sense he may have taken it out of his pocket. But a closer examination may reveal that he withdrew the money from his savings account prior to visiting the casino. Since he won’t receive his winnings for two months, he will have to take into consideration the two months interest he would have earned had he left the 95¢ in his savings account. If interest rates are 12% annually (1% per month), the interest loss is 2% x 95¢, or about 2¢. If the player purchases the bet for its expected return of 95¢, he will still be a 2¢ loser because of the cost of carrying a 95¢ debit for two months. The casino, on the other hand, will take the 95¢, put it in an interest-bearing account, and at the end of two months collect 2¢ in interest. Under these new conditions the theoretical value of the bet is the expected return of 95¢ less the 2¢ carrying cost on the bet, or about 93¢. If a player pays 93¢ for the roulette bet today and collects his winnings in two months, neither he nor the casino can expect to make any profit in the long run. The two most common considerations in a financial investment are the expected return and carrying costs. There may, however, be other considerations. For example, suppose the casino decided to send the player a 1¢ bonus over the next two months. He could then add this additional payment to the previous theoretical value of 93¢ to get a new theoretical value of 94¢. This is similar to the dividend paid to owners of stock in a company. And, in fact, dividends are an additional consideration in evaluating options on stock. Exchanges will perhaps object to the casino analogy. They prefer that option trading not be thought of as gambling. There is certainly no desire here to assess the moral implications of either gambling or option trading. The fact remains that the same laws of probability which enable a casino to set the odds for different games of chance are the same laws of probability which enable a trader to evaluate an option. The concept of theoretical value based on probability is common in many aspects of business. For those uncomfortable with the gambling analogy, one can go back to the original justification for options and think of them as insurance policies which require the payment of a premium. Through the use of statistical data and probability theory, an actuary at an insurance company will attempt to calculate the likelinood that the insurance company will have to make good on an insurance policy. He can then factor into the equation what the insurance company expects to earn on premium payments, and thereby arrive at a theoretical value for the insurance policy. The policy can then be offered to prospective customers at an additional cost, which represents the theoreti- cal edge to the insurance company. In the same way, the goal of option evaluation is to determine, through the use of theoretical pricing models, the theoretical value of an option. The trader can then make an intelligent decision whether the option is overpriced or underpriced in the market- place, and whether the theoretical edge is sufficient to justify going into the marketplace and making a trade. Introduction to Theoretical Pricing Models 39 A WORD ON MODELS Before continuing, a few observations on models in general will be worthwhile. A model is a scaled down or more easily managed representation of the real world. The model may be a physical one, such as a mode! airplane or building, or it may be a mathematical one, such as a formula. In each case, the model is constructed to help us better understand the world in which we live. However, it is unwise, and sometimes dangerous, to assume that the model and the real world which it represents are identical in every way. They may be very similar, but the model is unlikely to exactly duplicate every feature of the real world. All models, if they are to be effective, require us to make certain prior assumptions about the real world. Mathematical models require the input of numbers which quantify these assumptions. If we feed incorrect data into the model, we can expect an incorrect representation of the real world. Every model user must be aware: garbage in, garbage out. These general observations about models are no less true for option pricing models. An option model is only someone’s idea of how options might be evaluated under certain conditions. Since either the model itself, or the data which we feed into the model, might be incorrect, there is no guarantee that model-generated values will be accurate, nor can we be sure that these values will bear any logical resemblance to actual prices in the marketplace. There is in fact a great deal of disagreement among traders as to the usefulness of option pricing models. Some traders feel that models are so much hocus-pocus, and have no relationship to what goes on in the real world. Other traders feel that once they have a sheet of theoretical values in hand all their problems are solved. The reality lies somewhere in between. Anew option trader is like someone entering a dark room for the first time. Without any guidance he will grope in the dark and may eventually find what he is looking for. The trader who is armed with a basic understanding of theoretical",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.424824"
}