{
  "id": "4cf5e4a6d216",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 146,
  "content": "even with the additional risks that go with such a strategy. This means either trying to execute the basket of stocks underlying the index, or looking for an acceptable substitute for the basket. If the index is narrowly based, with only 20 or 30 stocks, it may not be unreason- able to try and execute a complete basket of stocks. If the index is more broadly based, with several hundred stocks, the difficulties of executing every stock in the right quantity may make it impractical to execute a complete basket. In such a case, a trader may question whether a complete basket is really necessary for his purposes. In most indices not every stock has the same weighting. If an index is very broadly based, price changes in the smallest companies may have very little impact on the index. It may be possible to eliminate these companies and still have a basket which is almost identical to the index. In the search for an acceptable tradeoff between ease of execution and correlation with the index, traders are always experimenting with different pseudo-baskets, a selection of stocks in the index which can be easily bought or sold, and which will react to changing market conditions in a way which is almost identical to the actual index. The primary question for most traders is one of correlation. What degree of correlation is sufficient for the trader’s purposes? 100 percent? 99%? 95%? A correlation of 99% between a pseudo-basket and the index may sound good. But if the index is at 400.00 and a trader executes a conversion with the synthetic market mispriced by 1.00, the 99% correlation means he could be wrong by as much as 1% of 400.00, or 4.00. Under some conditions, his presumed profit of 1.00 might turn into a loss of 3.00. Of course, the laws of probability are still in the trader’s favor. The pseudo-basKet’s deviation from the true index could also work in the trader’s favor, occasionally giving him a profit greater than 1.00. Arbitrages tend to be done in large size because they are supposed to be very low-risk strategies. If the trader executes a large number of conversions or reverse conversions using a pseudo-basket in place of the actual index, he may find that the correlation risk has a greater impact than he expected. Another possible substitute for the index is a futures contract on the index which underlies the cash options. If such a contract is available, a trader can use the futures Stock Index Futures and Options 323 contract in place of the underlying basket in his arbitrage strategies. The futures contract is not only easier to execute than a basket, with lower transaction costs, but there will pe a 100% correlation between the futures contract and the actual index. If the futures contract and the index expire at the same time, the futures contract and the option values will converge to the same price at expiration. Moreover, the trader will not have to worry about liquidating either his option or futures position. The clearing house will automatically settle all contracts in cash at expiration. Providing that the futures contract and the options expire at the same time, a futures contract on the same index which underlies the cash option market is a perfect substitute for the basket. Indeed, if the options are European with no chance of early exercise, an arbitrage between the futures contract and options is virtually riskless. Once the trader has completed his arbitrage, he Knows that the futures contract and index will correlate perfectly and will converge at expiration. In the United States, traders in the S&P 500 options market at the Chicago Board Options Exchange often treat the S&P 500 futures contract traded at the Chicago Mercantile Exchange as the underlying contract in their strategies.° Traders take a similar approach on many European and Asian exchanges which trade index options on cash and where a futures contract with the same underlying index is also available. If the futures contract offers an acceptable substitute for the index basket, the problem then becomes one of the prices at which an arbitrage can be executed. While it may be easy to buy and sell a futures contract, can it be done at prices which make a conversion or reverse conversion profitable? If the synthetic market is mispriced by 1.00 in the index option market, and we can trade the futures contract at exactly its fair value, there is no problem. But is that likely to be the case? If it were, everyone in the marketplace would line up to buy or sell a synthetic in the option market, and take an opposing position in the futures market. This activity would force the markets back to fair value, and any arbitrage opportunity would quickly disappear. Traders find that if contracts ate mispriced in one index market, they are often mispriced by an equal amount in other index markets. If a synthetic underlying position (long call, short put) is 1.00 too cheap in the option market, a trader usually finds that the futures contract is also 1.00 too cheap. If this were not the case, everyone would take advantage of the Situation by purchasing the cheaper contract, either the synthetic or futures contract, and selling the more expensive. In this respect, markets are typically very efficient. A Mispricing in one market usually means a similar mispricing in all related markets. If it can be traded at the right price, a futures contract on an index is perhaps the best substitute an option trader can find. If such a contract is not available, a trader might instead consider a futures contract on a different, but similar, index. For example, the largest index option market in the United States is the S&P 100 (OEX) market at the Chicago Board Options Exchange. Traders in this market are always searching for an acceptable substitute for the underlying basket of 100 stocks. A futures contract on",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.444811"
}