{
  "id": "e2d28d148854",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 76,
  "content": "such spreads entail buying some overvalued options or selling some underpriced options. The theoretical values and deltas in Figure 8-20 have been reproduced in Figures 8-21 and 8-22, but now prices have been included which reflect implied volatilities different from the volatility input of 20%. The prices in Figure 8-21 reflect an implied volatility of 17%. In this case the reader will find that only those spreads with a positive vega will have a positive theoretical value: call and put backspreads long straddles and strangles Volatility Spreads 167 Figure 8-21 March Futures = 100.00 IMPLIED VOLATILITY = 17% Time to Expiration = 6 weeks Volatility = 20% Interest = 6.00% CALLS PUTS Exerclse Theoretical Theoretical Price Price Value Delta Price Value Delta 90 10.00 10.10 93 .07 A7 6 95 §.54 §.82 78 57 85 -21 100 2.28 2.69 $1 2.28 2.68 48 105 65 95 24 §.62 §.92 ~75 110 12 26 8 10.05 10.16 -91 June Futures = 100.00 Time to Expiration = 13 weeks Volatility = 20% Interest = 6.00% CALLS PUTS Exercise Theoretical Theoretical Price Price Value Delta Price Value Delta 90 10.54 10.97 81 45 1.18 -17 95 6.83 7.46 67 1 94 2.85 31 100 4.00 4.71 51 4.00 4.71 47 108 2.11 2.77 36 7.01 7.66 -62 110 1.00 1.52 23 10.79 11.30 -75 Figure 8-22 March Futures = 100.00 ‘Time to Expiration = 6 weeks IMPLIED VOLATILITY = 23% Volatility = 20% Interest = 6.00% CALLS PUTS Exerclse Theoretical Theoretical Price Price Value Delta Price Value Delta 90 10.23 10.10 93 30 17 6 95 6.12 §.82 78 1.16 85 21 100 3.09 2.69 $1 3.09 2.68 48 105 1.28 95 24 6.25 5.92 -7§ 110 44 .26 8 40.37 10.16 -91 June Futures = 100.00 Time to Expiration = 13 weeks Volatility = 20% Interest = 6.00% CALLS PUTS Exercise Theoretical Theoretical Price Price Value Delta Price Value Delta 90 11.45 10.97 81 1.66 1.18 -17 95 8.08 7.46 67 3.19 2.55 -31 100 §.42 4.71 $1 §.42 471 -47 105 3.44 2.77 36 8.34 7.66 -62 110 2.08 1.52 23 11.87 11,30 —7§ 168 5 Chapter 8 short butterflies long time spreads The prices in Figures 8-22 reflect an implied volatility of 23%. Now the reader will find that only those spreads with a negative vega will have a positive theoretical value: call and put ratio vertical spreads short straddles and strangles long butterflies short time spreads An important assumption in most theoretical pricing models is that volatility is constant over the life of an option. The volatility input into the model is assumed to be the one volatility which best describes price fluctuations in the underlying instrument over the life of the option. When all options expire at the same time, it is this one volatility which will, in theory, determine the desirability of a spread. In real life, however, a trader may believe that volatility is likely to rise or fall over some period of time. Very often implied volatility will also rise or fall. Since time spreads are particularly sensitive to changes in implied volatility, whether volatility is rising or falling can affect the desirability of time spreads. Consequently, we can add this corollary to our spread guidelines: Long time spreads are likely to be profitable when implied volatility is low but is expected to rise; short time spreads are likely to be profitable when implied volatility is high but is expected to fall. These are only general guidelines, and an experienced trader may decide to violate them if he has reason to believe that the implied volatility will not correlate with the volatility of the underlying contract. A long time spread might still be desirable in a high implied volatility market, but the trader must make a prediction of how implied volatility might change under certain conditions. If the market were to stagnate, with no movement in the underlying contract, but the trader felt that implied volatility would remain high, a long time spread would be a sensible strategy. The short-term option would decay, while the long-term option would retain its value. In the same way, a short time spread might still be desirable in a low implied volatility market if the trader felt that the underlying instrument were likely to make a large move with no commensurate increase in implied volatility. ADJUSTMENTS A volatility spread may initially be delta neutral, but the delta of the position is likely to change as the price of the underlying contract rises or falls. Moreover, changes in volatility and time to expiration can also affect the delta of spread. A spread which is delta neutral today may not be delta neutral tomorrow, even if all other conditions remain the same. The optimum use of a theoretical pricing model requires a trader to continuously maintain a delta neutral position throughout the life of the spread. Continuous adjustments are impossible in real life, so a trader ought to give some thought to when he will adjust a position. Essentially, we can consider three possibili- ties: Vodatility Spreads 169 1. Adjust at regular intervals—In theory, the adjustment process is assumed to be continuous because volatility is assumed to be a continuous measure of the speed of the market. In practice, however, volatility is measured over regular time intervals, so a reasonable approach is to adjust a position at similar regular intervals. If a trader’s volatility estimate is based on daily price changes, the trader might adjust daily. If the estimate is based on weekly price changes, he might adjust weekly. This is a trader’s best attempt to emulate the assumptions built into the theoretical pricing model, 2. Adjust when the position becomes a predetermined number of deltas long or short—Very few traders insist on being delta neutral all the time. Most traders realize that this is not a realistic approach, both because a continuous adjustment process is physically impossible, and because no one can be certain that all the assumptions and inputs",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.434080"
}