{
  "id": "3f6723e76ce0",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 164,
  "content": "correct. If any of these assumptions are wrong, the values generated by the theoretical pricing model are also likely to be wrong. Asa result, the trader might find that a position which initially appears to be neutral in terms of a risk sensitivity is in fact not neutral at all. A COMPLEX POSITION Each of our previous examples consisted of only two different options. A more complex position may consist of options at several different exercise prices. Consider the position shown in Figure 17-5. We can determine many of the characteristics of this position simply by looking at the total sensitivities. Since the position has a positive gamma, negative theta, and positive vega, it will initially act like a backspread. In addition, we can see that the Figure 17-5 Stock price = 202.50; Time to June expiration = 6 weeks; Volatility = 24.0% Interest rate = 6.00%; Dividend = 0 June Th. Imp. Contract Positlon Price Value Delta Gamma _ Theta Vega Vol. 190 call 15.50 15.50 82 1.6 -.077 18 24.0 195 call ~23 11.63 11.80 72 2.0 —.088 23 23.3 200 call +55 8.25 8.63 61 2.3 ~.094 26 22.6 205 call -35 5.75 6.06 49 2.4 —.094 27 22.9 210 call -20 4.00 4.08 37 2.3 —.086 26 23.7 215 call +41 2.63 2.63 27 2.0 ~.074 23 24.0 190 put —42 1.63 1.70 -18 1.6 ~.046 18 23.6 195 put +85 2.75 2.95 -28 2.0 —.056 23 23.1 200 put +8 45 4.76 -39 2.3 -~,062 26 23.0 205 put -18 6.88 7.15 ~51 2.4 ~.060 7 23.0 210 put 10.00 10.13 -63 23 —.052 .26 23.5 215 put -30 13.75 13.65 ~73 2.0 -.039 23 24.5 stock -18 {00 Stock Calls Puts Delta Gamma_ Theta Vega P&L totals: -18 +18 +3 -277 +50.5 ~2.244 +6.10 +18.82 368 Chapter 17 downside contract position is net short 21 (short 18 stock contracts, long 3 puts) while the upside contract position is flat (short 18 stock contracts, long 18 calls). The position has unlimited downside reward and limited upside risk/reward. Based on these characteristics, the position can essentially be described as a put backspread. The theoretical graph of the position under current conditions is shown by the solid line in Figure 17-5a. In Figure 17-5a we also see how the position will change as time passes. Because the trader is long a large number of June 195 puts and June 200 calls, as expiration approaches the position will act more and more like a long June 195/200 strangle. Although the position is now slightly delta short, with the stock at its current price of 202.50, the June 200 calls will tend to dominate, causing the delta position to become increasingly long as time passes. Should the stock drop below 195, the June 195 puts will tend to dominate, and the delta will become increasingly short with the passage of time. Consequently, as time passes the gamma of the position will become very large with the stock price between 195 and 200. The total delta and gamma of the position as time passes is shown in Figures 17-5b and 17-5c. Figure 17-5d shows the sensitivity of the position to a change in volatility. As we would expect, any increase in volatility will help the position and any decline in volatility will hurt. Even if we increase or decrease volatility by 20%, to 30% or 18%, the shape of the position remains essentially the same. While the delta and gamma will change with changes in volatility, these numbers are not as sensitive to a change in Figure 17-5a eT 2004 6 weeks to expiration (current) 3 weeks to expiration 10075 theoretical profit & loss oS ~1007 1 week to expiration at expiration \\ -2007 -300 T T TT T —T T T T 180 185 190 195 200 205 210 215 220 225 230 stock price Position Analysis 369 Figure 17-5b delta position oT 6000- 4000- -6000- -8000 180 6 weeks to expiration (current) 4 3 weeks to expiration at expiration TT T 195 200 T T T T 205 210 215 220 stock price T 225 230 Figure 17-5c gamma position 400 1 1 week to expiration 4 30044 ‘ | _ \\ 3 weeks to expiration 200- in pa . \\ “oy me 4 100-4 ve me -100-4 6 weeks to expiration (current) -200 T TT T T T T T T T 180 185 190 195 200 205 210 215 220 226 stock price 230 370 Chapter 17 Figure 17-5d 300 2004 * volatility = 24% 1504 volatility = 30% 100 507 volatility = 18% theoretical profit & loss +100 T T T T - T T T 180 185 190 196 200 205 210 215 220 225 230 stock price volatility as they are to the passage of time. The total delta and gamma of the position as volatility changes is shown in Figures 17-Se and 17-5f. A trader with this position must be concerned with a significant decline in volatility. He will be especially worried about a slow decline in the market over time. Each day that passes is costing him 2.244 (the theta) in potential profit, and this number will accelerate as time passes. If several weeks should pass with little movement in the stock price, he will come under increasing pressure to reduce his theta risk. If he decides to take some protective action, he will have to sell some options, either calls or puts. If he considers a large move in the underlying stock a possibility, he may not want to sell calls since this will leave him net short contracts on the upside. This will probably lead him to sell off some of the puts which he is long, either the 195 or 200 puts. Up to now we have not considered the risk associated with a change in interest rates or, in the case of stock options, dividends. While these risks are usually small with respect to the other risks,",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.447574"
}