{
  "id": "25d556dd4282",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 95,
  "content": "392 THE INDIVIDUAL, SELF-DIRECTED TRADER a stronger edge. These trades, taken alone, made $5,109 on 17 trades, showing a mean trade of $301 with a standard deviation of $515, achieving statistical signiﬁcance as well. This trader should possibly consider these trades further, and ask if some of the other trades could be eliminated from the playbook. This is also a vivid illustration of the fact that neither reward/risk ratio nor winning percentage is particularly important when taken alone. Consider the C trades, which have a very impressive win ratio of 81.3 percent, but an average loss more than three times the size of the average win essentially wipes out any edge. Note also that it is not necessary to calculate expected value in this analysis, as the trade means are equivalent to the expected values for each class of trade. Standardizing for Risk One complicating factor is that this trader was not consistent in his risk. Though not vis- ible in Table 12.1, risk per trade on the $100,000 account ranged from a low of $199 to a high of $1,790. The nominal trade risk will vary under a ﬁxed percentage plan (see Chapter 9), but this trader was not executing a ﬁxed percentage plan as trade risks ranged from 0.2 percent to 1.8 percent of equity at the time of entry. Standardizing each trade’s P&L as a percentage of the amount risked can provide deeper insight into the trader’s performance: %R = Actual dollar P&L ÷ Initial risk Table 12.2 shows the result of this analysis. This time, the results paint a very different picture. On average, the trader made 0.3 times the initial risk on every trade, with a standard deviation of 0.8; this is a much better ratio of return to standard deviation than in the ﬁrst table. The t-test shows that this P&L is statistically signiﬁcant at the 0.001 level, as there would be less than a 0.1 percent chance of seeing a result this extreme due to random chance. There is a very important point here: The trader’s net P&L was a combination of both his position sizing choices and whatever actual edge he may have had. Standardizing for risk removes the position sizing effect and reveals that this trader actually was trading with a clear statis- tical edge, even though it was completely obscured by his position sizing decisions. This second analysis also suggests that there probably is an edge to the C-class trades, which TABLE 12.2 Summary Statistics for %R P&L System N= Sum Mean StDev AvgWin AvgLoss Win% p= A 29 2.9X 0.1X 0.8X 0.8X −0.5X 44.8% 0.249 B 17 13.5X 0.8X 0.8X 1.2X −0.3X 70.6% 0.001 C 16 6.7X 0.4X 0.7X 0.7X −0.8X 81.3% 0.013 D 6 0.1X 0.0X 0.6X 0.6X −0.3X 33.3% 0.463 All 68 23.2X 0.3X 0.8X 0.9X −0.4X 58.8% 0.000 P1: OTA JWBT634-c12 JWBT634-Grimes May 10, 2012 8:16 Printer: Hamilton Printing Becoming a Trader 393 FIGURE 12.3 Trade-by-Trade %R P&L returned an average of 0.4 times initial risk against a standard deviation of 0.7. Based on this analysis, A-class and D-class trades should be carefully examined, as it appears there may not be an edge. Compare Figure 12.3, which shows the individual trade results as %R, to Figure 12.2. At ﬁrst glance they appear to be similar, showing the same runs of wins and losses, but look again. Notice especially that the two large losses that stood out in the middle of Figure 12.2 are normal, insigniﬁcant losses when expressed as %R. Is it possible that the trader increased risk on those two trades, taking outsized risks and losses? If so, could those losses have unbalanced him psychologically and led to the series of losing trades? This cannot be answered from a numerical analysis, but these are the kinds of questions that must be asked. Note that, in general, Figure 12.3 is much more consistent—though the trader may have made poor decisions about his position sizing on each trade, it appears that he was working within and respecting his risk limits very well. This analysis can and should be extended to more detailed investigations of the dif- ferent classes of trades and different asset classes, if applicable. For now, let’s leave this example with one more step. It is possible to generate a pro forma P&L, which as- sumes that the trader had risked a consistent percentage of account equity on each trade. Figure 12.4 shows this pro forma equity curve, assuming 1 percent ﬁxed fractional risk, against the actual P&L. Note that you cannot simply add the %R results in Table 12.2 to get ending P&L under a ﬁxed fractional scheme because the amount risked is always changing with each trade. In this case, the trader would have ended with $22,935 had he 2.SX 2.0X 1.SX 1.0X O.SX o.ox - 0.SX J .• I I . I I r· ., I ... r I I I I -1.0X - 1.SX 146 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c12 JWBT634-Grimes May 10, 2012 8:16 Printer: Hamilton Printing 394 THE INDIVIDUAL, SELF-DIRECTED TRADER FIGURE 12.4 Cumulative Actual and Pro Forma P&L simply used 1 percent ﬁxed fractional risk, a stunning gain over his actual $3,158. The path of this pro forma P&L provides another, visual conﬁrmation of what we have seen clearly in the %R analysis—the trader actually did have an edge, but did not apply it very well. The lessons, in this case, are probably simple: perhaps eliminate one or two of the trading systems and consider applying the rest with a ﬁxed fractional risk approach in the next period. Control Charts Control charts are tools used in manufacturing to monitor physical processes for early",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.710231"
}