{
  "id": "9517f0116faf",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 180,
  "content": "options at different exercise prices. This would reflect his opinion that implied volatility was too low, but would also take into consideration the relative value of options reflected by the skew. Ina similar manner, the trader could also shift the skew right or left as the price of the underlying contract changed. If the underlying contract several weeks later were to Models and the Real World 409 move up 2.00, a trader could keep the shape of the skew constant but shift the whole skew up 2 points. At the same time, he could raise or lower the skew, using the at-the-money options as a reference point, to reflect his opinion that the implied volatility was either too high or too low. He could again use the resulting skew to evaluate options at different exercise prices, and from this information to decide on a strategy. The result of shifting a skew either up or down, or from side to side, is shown in Figure 18-8b. Shifting the whole skew might be a reasonable approach if a trader believes that the skew will remain constant in the face of changing market conditions. But is this likely? The implied volatilities at different exercise prices are likely to depend on how the marketplace views the likelihood of large moves in the underlying market. But all moves are relative, both with respect to the underlying price and to time. In relative terms a 4 point move in the underlying contract is larger with the underlying contract at 80 (a 5% move) than with the underlying contract at 100 (a 4% move). In relative terms a four-point move over a two-week period is larger than a four-point move over a two-month period. The fact that the volatility skew is likely to change with changing market conditions is born out in Figure 18-8c. The skew changed its shape, generally becoming more severe, as time passed. It also changed its position as both the price of the underlying contract and implied volatility changed. This poses a problem for a trader trying to incorporate a volatility skew into a theoretical pricing model. Pricing models are not Figure 18-8b 4.30 | 4.20 skew with aii volatilities raised .25 4.10 4 > 4.00 \\ z : £ \\ . ‘ skew with underiying & \\ ‘ contract 2.00/higher [e) . \\ > 3.90 ok 7 | = 3.80 \\ % > sro ———1 fh ooo, ~ A Le ee et en ee ° current skew 3.50 T t 84 8s 86 87 88 89 90 91 92 93 94 Exercise Price 410 Chapter 18 Figure 18-8c 6.00 T \\ 5.507 \\ é \\ 5 weeks to expiration f \\ Bund futures = 91.57 / f 1 ks ti irati \\ 2 5.004 weeks to expiration £6.00 Bund futures = 89.23 to} \\ / ) 2 . 3 2 a € 4.507 uae - 17 weeks to expiration Bund futures = 87.86 4.007 | ~ ~ 2 weeks to expiration ~ Bund futures = 91.57 3.50 T T T T T 84 86 88 90 92 94 96 Exercise Price only used to evaluate options under current conditions. They are also used to evaluate risk under changing market conditions. If a trader wants to fully incorporate a skew into his model, he needs to know how the skew is likely to change with changing market conditions. We noted that movement in the underlying contract is relative, both with respect to the current price of the underlying contract and time to expiration. If we are using a theoretical pricing model, we might ask how the model expresses movement in the underlying contract. If we know this, we can determine how the model expresses the relationship between the price of the underlying contract and different exercise prices. This may enable us to determine how the skew will change. In the Black-Scholes model, movement in the underlying contract is measured on a logarithmic scale,!3 and the relationship between the exercise price of an option and the current underlying price is expressed as the logarithm of the exercise price divided by underlying price. At the same time, movement over time is governed by a square root relationship, so that in the Black-Scholes model the relative amount of movement required to reach an exercise price is fully expressed as {natural logarithm (exercise price / underlying price)] / square root (time) 13. For a more detailed discussion of the logarithmic function, and the relationship between time and volatility, see Appendix B. Models and the Real World 411 where time is expressed in terms of years. Since we are using the Black-Scholes model to calculate the implied volatilities of the various options, and since the Black-Scholes model expresses exercise prices in the way we have just described, perhaps it makes sense to express the skew exercise prices in the same way. This has been done in Figure 18-8d. With our new x-axis measurements the skews start to look very much alike. We still need to take into consideration the fact that the skews occupy different positions because they represent different volatilities. In order to generalize the volatility scale (the y-axis), we might consider expressing all volatilities for a given skew in terms of the volatility of a theoretical at-the-money option. For example, going back to Figure 18-8a, we can see from the graph that with the underlying contract at 87.86, the implied volatility of an option with an exercise price of 87.86 (a theoretically at-the-money option) would be approximately 3.57%. We can therefore express the volatility at each exercise price as the difference between that exercise price’s volatility and 3.57. Using this approach, the 91 exercise price, with an implied volatility of 3.81 (the point where the graph crosses the 90 exercise price), would be assigned a value of 3.81 - 3.57 = .24 The 86 exercise price, with an implied volatility of 3.68, would be assigned a value of 3.68 — 3.57 = .11 Figure 18-8d 6.00",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.450035"
}