{
  "id": "bff4ab41646b",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 159,
  "content": "value of -15, Most traditional theoretical pricing models, with their assumption of a lognormal distribution, do not allow for negative prices for the underlying contract. If one were to create a pricing model to evaluate options on spreads, a more realistic assumption might be a normal distribution, which does allow for negative prices. Such a variation on the Black-Scholes model has been suggested in a paper prepared by Darrell Wilcox. This variation is reproduced in Appendix B. a 17 & Position Analysis When a trader first enters an option market, his initial concern is usually finding strategies with sufficient profit potential to justify making a trade. As a trader becomes more actively involved in options, he finds that an increasingly greater portion of his time is spent analyzing the positions he has already taken. What are the risks to the position? What are the rewards? And what action should be taken if market conditions change either in the trader’s favor or against him? Simple volatility spreads, directional spreads, or arbitrage strategies are relatively easy to analyze. As positions become more complex, the risks associated with the position may not be as easy to identify. The first step in analyzing a position is to determine how the position will react to changing market conditions. One way to accomplish this is by looking at the total risk sensitivities of the position (delta, gamma, theta, vega, rho). Unfortunately, the risk sensitivities are only reliable under narrowly defined market conditions. Since it is often dramatic changes in market conditions about which a trader must be concerned, simply looking at the risk sensitivities rarely enables a trader to grasp fully the risks associated with a position. Moreover, most traders find it easier to interpret graphic information than a series of numbers. For all of these reasons, it is oftenuseftul to graph a position’s value under a variety of market conditions. SOME SIMPLE EXAMPLES Let’s start with a simple position:! Stock price = 99.00; — Time to June expiration = 7 weeks Volatility = 20%; = Interest rate = 6%; Dividend = 0 Option Option Option Option Position Price Th. Val. Delta Imp. Vol. long 10 June 95 calls 6.25 5.82 76 23.7 short 30 June 105 calls 1.63 1.08 26 24.5 The position is a typical ratio vertical call spread which we might take if we feel that implied volatility is too high, as it appears to be here. The total theoretical edge is: -10 x (6.25-5.82) + 30 x (1.63-1.08) = +12.20 1. The analyses in this chapter were done using elther the Black-Scholes mode! for stock options or the Black model for futures options, 353 354 Chapter 17 While the position is currently delta neutral, we know that a ratio vertical spread has a negative gamma, positive theta, and negative vega. The gamma, theta, and vega sensitivities of the spread confirm this: Option Gamma Theta Vega June 95 call 4,3 -.0344 113 June 105 call 4.4 -.0278 117 position totals -89.0 +.4900 ~2.380 The negative gamma is an indication that any large move in the underlying stock will hurt the position. This is shown in Figure 17-la. Under current conditions, if the stock price begins to fall and we want to remain delta neutral, for each point decline in the stock price we will need to sell approximately 89 shares of stock (or take some similar negative delta action). If the stock begins to rise, for each point rise in the stock price, we will need to buy approximately 89 shares of stock. A ratio vertical spread also has a positive theta, so the passage of time will help the position. This is confirmed in Figure 17-1b where the value of the position is shown as the time remaining to expiration grows shorter. Note that not only does the position’s potential profit change as time passes, the risks associated with the position also change. As time passes the deltas of options tend to move away from 50, with the delta of in-the-money options moving towards 100 and the delta of out-of-the-money options Figure 17-1a: Long 10 June 95 Calls @ 6.25 Short 30 June 105 Calls @ 1.63 20 104 -107 -20- -307 theoretical profit & loss -40-] -507 -607 -70 T T T T T T T 90 92 94 96 98 100 102 104 106 108 110 stock price Position Analysis 355 Figure 17-1b: Long 10 June 95 Calis @ 6.25 Short 30 June 105 Calls @ 1.63 400 at expiration B0- a a N 1 week to expiration 60 _ } 405 ae ans a ia % S ; wa - 5 oO ie ~ a a “ N. £ forreees ue.c2st SESS cccacc vonmes sevenees semeane wecee nevdyar mest a 20-1 4 weeks to expiration N NS \\ | \\ -40 7 weeks to expiration -6074 -B0 T T T TT TT —T T T tT 90 92 94 96 98 100 102 104 106 108 110 stock price moving towards zero. The net effect is that with the stock price anywhere below 105 our delta position will be getting longer as time passes. If, however, the stock price rises above 105, the 95 call and the 105 call will be in-the-money, and the deltas of both options will move towards 100. This will cause our delta position to become shorter with the passage of time. This is shown in Figure 17-1b where the downward slope of the graph above 105 becomes more pronounced as time passes. Gamma can also change as time passes. At-the-money options always have the highest gamma, and the gamma of an at-the-money option can increase rapidly as expiration approaches. As time passes note how the curvature of the position becomes mote severe around the stock price of 105. If the stock should rise to 105 and remain there as expiration approaches, the position will take on increasingly greater gamma risk, Since a ratio vertical spread has a negative vega, any rise in volatility will",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.446815"
}