{
  "id": "7cb0d04a8cb9",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 41,
  "content": "many cases, the larger traders who are already positioned will take advantage of the volatility and sell a portion of their positions to the small traders rush- ing to buy the breakouts. Think about this if you trade breakouts; this is the pressure that often results in failed breakouts. How smart is it for you to be buying where very DRYS - Daiy DryShips Inc 60.00 50.00 40.00 30.00 May Jun Jul Aug Sep Oct 61 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing 124 MARKET STRUCTURE large traders are selling, or vice versa? Since these large traders have often positioned themselves before the breakout, they often create telltale patterns that help us separate the best breakouts, driven by large-scale interest, from those that are more likely to fail. Higher Lows into Resistance One of the classic patterns sees prices holding higher lows into a more or less clearly deﬁned resistance level. To understand the signiﬁcance of this ascending triangle pattern, imagine that a market is oscillating randomly in a trading range, but then some large buyers become interested in accumulating a position. They would naturally want to buy at as low a price as possible, so they would use the declines to begin buying. Eventually their buying pressure will arrest the decline and the market will resume its upward movement, at which point they will likely turn off their buying to avoid paying elevated prices. Skilled operators could even offer some of their line out, with the dual intent of booking a small proﬁt and of actually holding prices down by their selling pressure. If several large buyers recognize this activity in the market, they will become more aggressive in their buying, while still attempting to measure and control it so as not to force prices higher. As competition in the market intensiﬁes and buying interest builds, the declines will become shallower simply because more people are buying them; this will force large traders to become even more aggressive in buying at higher prices. A mild feedback loop develops within the trading range that often leaves the patterns shown in Figure 5.2. This is often a setup for an excellent breakout trade, and applies equally well, inverted, to the downside. Tight Range Near Extreme of Larger Range Another pattern, conceptually sim- ilar to the previous one, is a tight range near the edge of a larger, established trading range. This tight range is often less than 25 percent of the height of the larger range, and shows that large traders have become interested enough in the market to hold it near the edge of the larger range. Why are they now willing to pay higher prices (or to short at lower prices), rather than letting the market naturally drift back into the middle of the range? This pattern suggests more urgency to their actions and more conviction, and also frequently supports exceptional breakout trades. Figure 5.3 shows a schematic rep- resentation of this pattern, which was mentioned in Chapter 4 as one of the classic signs that support or resistance is likely to fail. Remember, a failure of support or resistance is often a successful breakout trade. FIGURE 5.2 Shorter Swings into Support or Resistance Often Set Up Good Breakouts P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing Interfaces between Trends and Ranges 125 FIGURE 5.3 A Tighter Range Near the Edge of a Larger Range Often Precedes a Good Breakout of That Edge Prebreakout Accumulation At this point, you should realize that we are starting to see the same patterns over and over. This is not rocket science; the patterns of the market are subtle, but they are also logical and, at their core, they are simple. Earlier, we looked at the classic Wyckoff springs and upthrusts as signs of accumulation and distribution. If large players are positioning themselves in the range in anticipation of a breakout, it is very likely that we will see these springs and upthrusts in the prebreakout ranges. Much accumulation and distribution is invisible; institutions spend a lot of money on salaries for skilled execution traders and in the development of execution algorithms. All of this subterfuge is designed to hide the execution of these large orders. However, there are points in the market where they cannot really hide their hands, and, if we know exactly what to look for, we can sometimes get clues as to their intentions. Violations of support and resistance in well-deﬁned ranges are important areas to watch. If excursions beyond the range are short-lived, printing springs and upthrusts at the edges of the range, this becomes strong evidence that large traders are positioning in the market, and often sets up good breakout trades. Characteristic Patterns at Good Breakouts Again, a good breakout is driven by institutional interest that eventually garners the in- terest of the public and results in a feedback loop that propels the market far from the breakout point. It is overly optimistic to assume that prices will trade cleanly through the breakout level and never come back. (This, incidentally, is the absolute best-case scenario for breakout traders, and trades like this are rare.) However, there are some common patterns at the actual breakout point that can separate the best breakout trades from the rest. High Volatility A breakout should be a clearly visible event. If a market approaches a breakout point, trades tightly below the point with signiﬁcant signs of accumulation, and then very politely and gently lifts through resistance to trade higher, this is probably not a good sign. Good breakouts are driven by unusual order ﬂow, so we need to",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.701804"
}