{
  "id": "f866660a0077",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 85,
  "content": "sense to move on to better opportunities—this is not what you, as a short or a potential short, want to see. Note that even though this appears to be a catastrophic pattern failure, the actual loss on the trade should have been very small against the lowered trailing stop. This is a common pullback failure pattern, and a good reminder of the importance of moving stops. Trade management does not necessarily mean executing—everyone un- derstands the idea of reducing position sizes to limit risk, but sometimes simply moving a stop is the right answer. Remember, your job as a swing trader is to take money out of the cleanest single-leg moves in the market. Never let a trade that is working turn into a full-sized loss. Pullback Failure: Goes Flat After Entry FIGURE 10.18 A Pullback in Live Cattle Futures Goes Flat 128 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 314 TRADING STRATEGIES Failure Test FIGURE 10.19 A Failure Test in Ann Taylor (NYSE: ANN) Setup ANN had been in a multimonth uptrend, and was, in fact, a market leader for a substantial part of the advance shown in Figure 10.19. In general, it is difﬁcult to ﬁnd spots to short market leaders, so only the best and clearest trades are appropri- ate. A strong sell-off going into May broke the established pattern of the trend, putting with-trend traders on notice and giving countertrend traders warning to start watching for potential entries. This is an important and often overlooked aspect of countertrend trades: you must have some reason, some justiﬁcation for even considering a coun- tertrend trade, and the best justiﬁcation is price action that shows a distinct change of character. Entry The actual entry was on the day that pressed to a new high and immediately reversed, closing strongly lower. There is a trade-off between trade location and conﬁr- mation here. While an astute intraday trader may have been able to position somewhere near the high of the day, a trader doing so as a matter of course will unavoidably have many losing trades that reverse and take out the highs. A trader waiting for the close will give up signiﬁcant price movement in return for the conﬁrmation. Either plan will work if it is applied with discipline. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trend Termination 315 Stop The stop in this trade should be located at or around (within a few pennies of) the previous trend high. Many traders will place the stop outside the previous trend extreme, but this can result in considerable slippage. Placing the stop inside the previous extreme will result in a rare stop-out where the trade is still valid, but the reduced slippage on nearly all exits will more than compensate. FIGURE 10.20 A Best-Case Failure Test Outcome The chart in Figure 10.20 is an example of practically the best possible outcome from a trade like this. First (1×) proﬁt targets would have been hit early on, and in this case, the failure test actually marked the extreme high point of the trend. A: After a strong downthrust, a small consolidation like this often points to more downside—you can enter new positions here, add to existing positions, or just use the pattern as a reference to manage existing exposure. B: Even if you do not choose to trade pullbacks, they are the fundamental structure of trends, and being able to read price action around pullbacks will give you great insight into the integrity of the trend. Many traders would have covered much of their trade by this point, but seeing small consolidations break down cleanly could give you justiﬁcation for holding part of the trade. C: Continuing with that theme, when you see these patterns not break down as cleanly or easily, it is a sign that something has shifted and the easy money in the trade is probably over. ANN - Daily Ann Taylor Stores Corporation -1.00 Apr l,lay Jun Jul Aug 129 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 316 TRADING STRATEGIES Conclusions This is admittedly a best-case example of a clean and simple failure test trade. It is absolutely essential to maintain the discipline of taking partial proﬁts at the 1× target, because many of these trades will quickly reverse and continue the original trend. In addition, it probably makes sense to do these failure test trades on smaller risk for two reasons: stops tend to be very tight, often less than a single day’s range, and there is increased danger of catastrophic gap failure through the old trend extreme. Failure Test, Second-Day Entry FIGURE 10.21 A Second-Day Failure Test Entry Setup The S&P 500 index, shown in Figure 10.21, had been in a yearlong uptrend and was showing signs of possible overextension on higher time frames. There was no strong down move setting up this countertrend trade, but there were multiple momentum di- vergences and failures on lower time frames that set up the possibility of a successful fade trade. Entry A: The actual entry is slightly more complex in this case. This bar presses to new highs and closes slightly above the previous resistance level. The next day trades high, then reverses to close under the old highs. Entry",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "fundamentals",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.708719"
}