{
  "id": "7afdb309e375",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 14,
  "content": "l e, w h ic h was t h en t h orou ghl y tampe d d own wit h an iron ro d . Once everyone was sa f e l y away f rom t h e roc k , t h e f use wou ld b e lit. But on this day , Phineas Ga g e apparently became distracted. He placed the blast- in g pow d er an d f use into t h e h o l e as usua l , b ut t h en tampe d t h e pow d er fi rm l y . He T h e Necessity o f Emotions in Tra d in g CHAPTER 4 18 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 89THE NECESSITY OF EMOTIONS IN TRADING Exercise 4.1 How My Emotions Function in My Trading Situation Information Speed Attention Commitment Example 1: Price begins to rally aggressively. Should I jump aboard? Feelings of excitement over potential quick profi ts. The market is moving; I need to make a quick decision. However, I don’t feel confi dent enough to take this trade. Feelings of caution prevail. I know I am not seeing all the data. This is why I am not confi dent. I check my other indicators. Feelings of pride. In the past, I would have jumped in, but paying attention to all my feelings kept me out of an unplanned trade. Example 2: Developing plan for tomorrow’s tradin g: identifying trade locations. Feeling very curious about obvious selling in market today. Wondering what does this mean? Feeling calm; there is no rush . Continuing to feel very interested in the evidence of selling. I checked the higher time frame and was excited to fi nd signifi cant resistance! Confi dent feelings that everything is coming together for a great trade tomorrow. 19 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. PART II U sing C utting- Edge Psychology 97 T h e Tra d ers ’ Psychological Edge Lies in a Di ff eren t yg g Kin d o f T h in k ing CHAPTER 5 E ff ective trading calls on traders to confront signifi cant psychological challenges. Facing and overcoming these challenges is not an easy endeavor. The diffi culty lies in the fact that our mind, our biology , and even our genes are not naturally suited f or t h e menta l d eman d s o f tra d ing. In f act, our min d s, our b io l ogy , an d our genes ten d to wor k against us in tra d ing, as we h ave seen in t h e fi rst f ew c h apters. As we h ave a l so seen, t h e so l utions tra d ers d eve l op to a dd ress t h ese c h a ll enges—especia ll y t h e notion t h at emotions s h ou ld b e e l iminate d —o f ten compoun d s t h eir trou bl es. W e are not a bl e to simp l y e l iminate emotions or t h oug h ts at wi ll . T h at ’ s just not possi bl e on a consistent basis. Our minds are more com p lex; a sim p listic, naïve a pp roach not on l y d oes not wor k , it ma k es matters worse. W e nee d to approac h t h e psyc h o l ogy o f tradin g in a diff erent way . ■Mind, Genes, Emotions, and Biology One o f t h e psyc h o l o g ica l c h a ll en g es we f ace is t h e f act t h at our min d s f ree l y app l y menta l s h ortcuts t h at ti l t towar d cognitive b iases in ren d ering tra d ing d ecisions. Costl y errors do not come from conscious intentional actions, nor are the y alwa y s 20 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 101THE TRADERS’ PSYCHOLOGICAL EDGE its concern. It te ll s t h e tra d er h ow b a d a l oss wou ld b e an d h ow t h at j ust can ’ t b e to l erate d . Emotions an d b o d i l y sensations seem to corro b orate t h e interna l voice an d in fl ame t h e d iscom f ort. Just l i k e t h e c h i ld h aving a temper tantrum over t h e can d y b ar, t h e tra d er ’ s inner voice b ecomes stri d ent, urging t h e tra d er to exit t h e tra d e even t h oug h it h",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:45.718956"
}