{
  "id": "75e98b80085b",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 83,
  "content": "a failure out of a complex consolida- tion is much more likely to lead to a sharp reversal and complete failure of the pattern, so further stops tend to result in larger losses with no compensating factors of probability or reward/risk. FIGURE 10.12 A Complex Consolidation Leads to Signiﬁcant Upside P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trend Continuation 307 If you executed the trade with this stop, there are several choices for targets. I set my ﬁrst target at one times my risk in almost all cases, the only exceptions being when that target would be beyond a very visible chart point. In this case (Figure 10.12), there was additional volatility at C, but you should have already sold a portion of your exposure at the ﬁrst target. Once again, booking partial proﬁts and reducing open risk puts you in a position of strength and you can watch action at C and not be forced to react. It is also worth noting that the long lower shadow on the candle at C suggests a lower time frame selling climax. Though it is an extremely aggressive entry, and not appropriate for most traders, adding or entering long positions over the high of C is a possibility to consider. (This is a variation of the nested pullback idea.) D and E were both large drops against the uptrend, and should have been warnings that the trend was vulnerable. After a strong sell-off like E, it is difﬁcult to justify holding long positions in the time frame relevant to this chart. Conclusions Again, much more data has been shown than was needed. Most swing traders, playing for only one clean swing, would have been out of their positions before D. Two other points to consider here: currencies do not tend to trade as cleanly as most other markets, so many technical traders will ﬁnd better results trading them on higher time frames. Last, a complex pullback is usually a higher time frame simple pullback. This is why the moves following these patterns tend to be stronger—they are more cor- rectly higher time frame drives. Complex Pullback FIGURE 10.13 A Complex Pullback in Treasury Note Futures EURUSD D • • a1ly Ewro / US Dollar \\ - ~~ 1.32000 v~±\\:.- -- ______ __ _ '·'\"\"\" =~---·!.> '\" -,J-----·y. '·\"'\"'\" Mar \\ Apr \\ -0.01000 I.lay 125 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 308 TRADING STRATEGIES Setup A: After a small exhaustion on lower time frames, Treasury futures began a ﬁve-day pullback. B: Once again, a long entry was reasonable at the bottom of the ﬁrst pullback, but would have resulted in a losing or, at best, breakeven trade when the ﬁrst pull- back failed. Entry Another leg down brought the market to a potential entry for a complex pull- back. Though only one time frame is shown in Figure 10.13, it is not difﬁcult to visualize the higher time frame: The long drive off the January lows would be a single thrust on a higher time frame, and the complex pullback on the daily chart would resolve in a simple pullback on the higher time frame. You want to avoid buying into the middle of a pull- back like this. Focus attention on establishing positions either on breakouts, with the anticipated momentum, or near potential support in the pattern. This trade shows a hybrid entry technique. The last downswing pressed the pullback below the parallel trend line, parallel to the standard trend line drawn across the top of the pattern. This highlights a very small selling climax, and sets up a potential long entry on strength in the next trading session. Stop Again, stops can be tighter in complex pullbacks than in standard pullbacks. A reasonable stop is just under 110’0, and certainly no deeper than 109’12. There is no point in holding a complex pullback through another countertrend swing. These structures do exist, and they sometimes offer continuation in the direction of the trend, but they are not great trading patterns. FIGURE 10.14 Is This a Failed or Successful Pullback Trade? P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trend Continuation 309 This example highlights the importance of trade location. Consider the entry bar C in Figure 10.14. If the actual entry was made on the close of that bar, the risk point may have been far enough away that no proﬁt targets were hit before the move stopped near D. However, if the entry was done closer to the breakout of the previous day’s high, ﬁrst targets (at 1× risk) would have been reached on the second or third bar following C. The consolidation at D is cause for concern for longs, but not necessarily justiﬁcation for exiting the full position. Pullback Failure at Previous Swing FIGURE 10.15 A Pullback Failure at Previous Swing The ﬁrst common pullback failure is a failure near the previous swing that set up the pullback. Is this actually a failure? The answer depends on your expectations for the pattern. It is a failure if you were expecting another complete trend leg or legs to emerge, but the conservative target for a pullback is that previous swing point. Furthermore, if you have been able to establish a position near the bottom of a pullback in an uptrend or near the top of a pullback in a downtrend, the ﬁrst 1 × risk target may already have been hit. If this is a failure pattern, it is a failure that can often result in a proﬁtable trade. The most common error here is to",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.708412"
}