{
  "id": "e4cda439ebe9",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 58,
  "content": "appears to be overpriced. The trader hopes to profit when the prices of the instruments return to their expected relationship. Among futures traders the most common type of spread involves taking opposing positions in different delivery months for the same commodity. A trader might purchase October crude oil and sell November crude oil on the New York Mercantile Exchange. Or he might buy December corn and sell July corn on the Chicago Board of Trade. The value of this type of intra-market spread depends on a variety of factors, the most important of which is usually the cost of carrying the physical commodity from one delivery month to another. Suppose that February gold on the COMEX is trading for $360 per ounce. What should April gold be trading for? A trader who takes delivery of gold in February at $360 per ounce and holds it until April will incur a debit of $360 per ounce for a two-month period. If interest rates are 9 percent annually, the two-month financing cost will be: 9% x 2/12 x $360 = $5.40 Given the financing cost of $5.40 per ounce that can be saved by purchasing an April futures contract rather than purchasing the physical commodity, the April contract ought to be worth $5.40 more than the February contract, or $365.40 per ounce. If the February contract is trading at $360 and the April contract is trading at $364, the trader knows that the spread is $1.40 too cheap. He can profit from this mispricing by purchasing the spread for $4.00 (buy April for $364, sell February for $360). If the spread returns to its expected value of $5.40, the trader can buy back the February contract and sell out the April contract, thereby realizing a profit of $1.40. Note that the above spread will be profitable regardiess of the general direction of the gold market, as longas the prices of the two delivery months return to their expected $5.40 spread. If February gold rises to $370, the trader will lose $6 on the February side of his spread. If, however, the April contract rises to $375.40, the gain in the value of the April contract will more than offset the loss on the February contract and result in the expected $1.40 per ounce profit. Factors other than financing costs can also affect the price relationship between different futures months for the same commodity. The futures price of some commodi- ties must also include the cost of storing and insuring the commodity for the period between delivery months. In theory, the cost of financing, storing, and insuring a traditional commodity (precious metals, agricultural products, livestock, energy prod- ucts, etc.} must be some positive number, so that the price of a more distant delivery month ought to be greater than the price of a nearby delivery month. This is known as a contango relationship. Any increase in these costs will increase the value of a futures contract. Supply and demand considerations can also affect the spread relationship of different delivery months. In theory, a November crude oil contract ought to always Introduction to Spreading 129 trade for more than an October crude oil contract. But if crude oil is currently in short supply, refiners may be willing to pay more for an October futures contract in order to ensure an uninterrupted flow of crude oil to their refineries. Markets where the near-by delivery month is trading at a premium to the more distant months are said to be in packwardation. Supply and demand for raw materials can often cause traditional commodities markets to go into backwardation. Examples of contango and backwarda- tion markets are shown in Figure 7-1. The cost of carrying a position in an underlying commodity is only one of many factors which can affect a futures spread relationship. A trader who purchases a stock index futures contract will save the financing costs associated with owning the basket of stocks which make up the index. At the same time, he gives up the rights to any dividends he might receive if he actually owned the stocks. The savings in financing costs add value to the futures contract, but the loss in dividends reduces the contract’s value. Matters can be further complicated if different interest rates play a role in the evaluation of a spread relationship. The value of a treasury bond futures contract depends not only on the carrying costs saved by purchasing a futures contract instead of the actual bond (the short-term rate}, but also on the interest lost by not owning the bond (the long-term rate). Depending on the difference between short- and long-term rates, distant delivery months in the treasury bond futures market can be trading at either a premium to the nearby months or at a discount to the nearby months. Similar types of considerations affect relationships in foreign currency futures markets, but here the determining factors are the difference between domestic and foreign interest rates. When foreign rates are low compared to domestic rates, the more distant months trade at a premium; when foreign rates are high, the more distant months trade at a discount. Calculating the spread relationship between different delivery months can be a complex problem, and is covered more fully in texts focusing specifically on futures trading. The point here is that, in theory, there ought to be a well defined price relationship between different delivery months. When this relationship is violated in the Marketplace, a potential profit opportunity exists by selling the overpriced contract and buying the underpriced. Spreads need not be based solely on the relationship between different delivery Months for the same commodity. They can also be based on presumed price relation- ships between different, though usually related, instruments. The NOB (notes over bonds) spread traded on the Chicago Board of Trade is based on the assumption that there is an identifiable relationship between the price of Treasury Bonds and Treasury Notes. When the spread between the prices of these two",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "market_structure",
    "crypto",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.431244"
}