{
  "id": "d5307df34e62",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 73,
  "content": "parameters and end up taking large losses that are multiples of intended risk. Having this document and committing to following it religiously will insulate the trader from some of these catastrophic losses. Figure 8.6 is only an example showing the simplest and most basic information needed on this sheet. You can take this model and elaborate on it to ﬁt your style and your needs. Though some of the ﬁelds are self-explanatory, this sheet is extremely important, so it is worth the time to go through it in some detail: r DateIn: This is the initial entry date of the ﬁrst trade for the position. r Patt: It is a good idea to have some way to distinguish among trades placed by differ- ent systems, from different patterns, or on different criteria. If you have only two or three positions, this may not be necessary, but it becomes important once you have on more than four or ﬁve. Furthermore, this classiﬁcation is essential when doing statistical analysis of your trade results. FIGURE 8.6 A Basic Daily Risk and P&L Sheet @SI- Daily SilYer Continuous Contract [Jul11) 48.000 46.000 44.000 42.000 40.000 38.000 36.000 34.000 32.000 30.000 28.000 '11 Feb !,tar Apr May P&L Risk Oateln Patt Ticker L/S # Priceln Close OpenPL ClosedPL Tot alPL PL96R Stop ~ PLStop l StOev COE ABC S 800 72.08 71.63 1, 000 41.43 41.62 750 11.05 12.55 375 105.89 10 6.64 (360) 0 ( 360) -0.1X 67 .25 (3,504) ( 3,864) 1,328 193 (208) ( 15) -0.0X 40.05 (1, 570) ( 1,585 ) 740 1,125 2,865 3,990 1.lX 11.35 (900) 3,090 405 (281) 0 (281) -0.1X 115.00 (3, 135) ( 3,416) (1,076) 6/ 14/ 11 PB WX 6/ 13/ 11 Sup 6/ 10/11 Anti ZlZ. 6/ 13/ 11 PB 6/ 10/11 PB XYZ S 2,7 50 29.93 29.19 2,032 771 2,803 0.7X 29.46 (742) 2,060 (2,200 ) 5/ 24/ 11 Res BB S 500 22.99 19.04 _1~,9_76 __ 3~,1_1_5 _5~, 1_5_1_1_.4_x_2_0_.5_o_~(7_3o~)~ 4,_4_21_~(~31_0~1 Total 4,684 6,603 11,287 3 .0X (10,582) 706 (1,113 ) 111 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing CHAPTER 9 Risk Management It is important to see distant things as if they were close and to take a distanced view of close things. —Miyamoto Musashi, The Book of Five Rings (1645 CE) M any of the problems of trading reduce to risk management. In most styles of trading, the trader’s job is essentially to manage the risk in trades, focusing on exiting losing trades at the correct points, and letting the upside take care of itself. Risk management is critical, as a few outsized losses can offset the proﬁts from many winning trades; it does not take many errors to completely erode a trading edge. This chapter considers risk management from both practical and theoretical perspec- tives. We begin with practical, applied tools for risk management and position sizing that traders in all time frames will ﬁnd useful. Many large losses come from having trades with inappropriate position sizes, and many traders do not understand the impact of trading size on the bottom line. The chapter moves on to a higher-level perspective on risk, in- corporating some ideas from modern academic thinking and focusing on a few speciﬁc measures of risk, before concluding with a look at some of the less common risks that self-directed traders often overlook. RISK AND POSITION SIZING From a practical perspective, there are three main questions to answer with respect to risk. The ﬁrst two have been addressed in the previous chapter, but the third is supremely important: 1. Where do we place our initial exit orders, both for proﬁts and losses? 2. How do we adjust the trade as it develops through time? 3. How many shares, contracts, or other units do we trade on each position? 263 P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing Risk Management 269 with $1.10 because the original dollar is returned.) Since we are risking $2,000 per trade for 250 trades, the relevant math is: Ending P&L = Expected value × risk per trade × number of trades = 0.10 × $2,000 × 250 = $50,000 So, on average, we can expect to end up with $150,000 in the account ($100,000 starting value + $50,000 proﬁt) at the end of 250 trades. For each of the 1,000 runs, the ﬁnal, ending P&L was recorded, and Table 9.1 presents summary statistics for these ending values. Most of the statistics in the table are self- explanatory. With one exception, these statistics are blind to what happens in the middle of the run. If a trader was up $5,000,000 at one point but the run ended up only $5,000, the only number evaluated is the ending $5,000. The exception is that an account cannot continue to trade if it loses all its funds at any point in the trial, so each run is monitored for this condition. If, at any point in the series of 250 trades, a run reaches a zero or negative balance, it will cease trading and that value will be presented as the terminal value for that run. The number of the 1,000 traders who go bankrupt is recorded, and the percentage is presented at the bottom of the table. Percent of accounts bankrupt = Number of accounts with terminal balance ≤ $0/1,000 We also will record the number of accounts than end up with a greater than 75 per- cent loss from the starting value. Though this is an arbitrary cutoff, it will serve to mea- sure some of the downside risks in some of the more extreme scenarios later on. In reality,",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.706831"
}