{
  "id": "74d81adabf3d",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 133,
  "content": "line) in 296 z6-Aew 26-1dy ZouPN 26-094 zee 16-080 =~ LG-ACN 16-190 16-des Lepov uolyesidxse 2661 eunr dL O} Apiqyejoa penjoe +8 < o 2 lg = z S FOL EEE suoldo gee} eunr Ayyiyejon patjduul zt 86-71 aunbiy 297 Volatility Revisited 6-484 e6-uer 26-038 _ L 26-AON 26-190 z6-des 26-6ny 26-In¢ 1 suondo e661 yoseW Auge}on payduy} uoledidxe e66 i Youve o} Aqyejoa penjoe 26-une 9 re FS < o = le = Zz x +Ol ELL A Go a6-p1 einBi4 Chapter 14 298 €6-AON £6190 €6-das e6-Sny e6-1n¢ e6-unr e6-Aew e6-1dy e6eW I i i t 9 uonesndxe 66 |. Jequieoeq 0} AzjlyejOA penjoe +L < o 2 5 xR suondo e66| Jequaseq Aiqejoa parjduu) ELL ol 26-p1 eunbi4 Volatility Revisited 299 Figures 14-9A, 9B, and 9C. Over long periods of time, the marketplace is reacting to many events. This is easier than reacting to a limited number of events, which is what the marketplace is faced with over a short period of time. The marketplace knows that the laws of probability are more likely to balance out over many occurrences than over only a few occurrences. Note also that there is no guarantee that the marketplace will have the correct implied volatility. The implied volatility is a guess, and guesses carry with them the possibility of error, sometimes very large error. In Figure 14-9B the implied volatility turned out to be much too high over almost all of the option’s life. Had a trader sold premium at any time, he would have shown a profit. At its most extreme, during October 1992, there was almost a four-percentage-point difference between the implied volatility of the March 1993 options and the future volatility of the March 1993 futures contract. In Figure 14-9C the implied volatility was too high during the early part of the option’s life, but too low during the latter part. During the few weeks prior to expiration, the implied volatility was too low by as much as three percentage points. Finally, in Figure 14-9A the implied volatility was relatively accurate over the early part of the option’s life, but too high during the latter part. It should be clear by now that dealing with volatility is a difficult task. To facilitate the decision-making process we have attempted to make some generalizations about volatility characteristics. Even then, if one decides to become involved in a market it may not be at all clear what the right strategy is. Moreover, we have looked at a limited number of examples, making the generalizations even less reliable. Every market has its own characteristics, and knowing the volatility characteristics of a particular market, whether interest rates, foreign currencies, stocks, or a physical commodity, is at least as important as knowing the technical characteristics of volatility. And this knowledge can only come from careful study of a market combined with actual trading experience. Volatility Revisited 299 Figures 14-9A, 9B, and 9C. Over long periods of time, the marketplace is reacting to many events. This is easier than reacting to a limited number of events, which is what the marketplace is faced with over a short period of time. The marketplace knows that the laws of probability are more likely to balance out over many occurrences than over only a few occurrences. Note also that there is no guarantee that the marketplace will have the correct implied volatility. The implied volatility is a guess, and guesses carry with them the possibility of error, sometimes very large error. In Figure 14-9B the implied volatility turned out to be much too high over almost all of the option’s life. Had a trader sold premium at any time, he would have shown a profit. At its most extreme, during October 1992, there was almost a four-percentage-point difference between the implied volatility of the March 1993 options and the future volatility of the March 1993 futures contract. In Figure 14-9C the implied volatility was too high during the early part of the option’s life, but too low during the latter part. During the few weeks prior to expiration, the implied volatility was too low by as much as three percentage points. Finally, in Figure 14-9A the implied volatility was relatively accurate over the early part of the option’s life, but too high during the latter part. It should be clear by now that dealing with volatility is a difficult task. To facilitate the decision-making process we have attempted to make some generalizations about volatility characteristics. Even then, if one decides to become involved in a market it may not be at all clear what the right strategy is. Moreover, we have looked at a limited number of examples, making the generalizations even less reliable. Every market has its own characteristics, and knowing the volatility characteristics of a particular market, whether interest rates, foreign currencies, stocks, or a physical commodity, is at least as important as knowing the technical characteristics of volatility. And this knowledge can only come from careful study of a market combined with actual trading experience. a 15 & Stock Index Futures and Options Since their introduction on U.S. exchanges in the early 1980s, stock index futures and options have experienced phenomenal growth, with increasing participation by all segments of the trading community. Both retail and institutional investors use these instruments to invest in the market as a whole, thereby eliminating the laborious job of trying to pick individual stocks. Portfolio managers can use index instruments to create a wide variety of risk/reward scenarios for large, diversified stock portfolios. Finally, professional arbitrageurs find that in spite of the highly liquid and usually efficient index markets, pricing disparities occur often enough to warrant close monitoring of these markets. When a disparity does exist, a trader can execute an arbitrage by hedging the mispriced index against either other stock indices or against a basket of stocks. Such arbitrage strategies are commonly referred to as index arbitrage. For all of the foregoing reasons, no book on options would",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.442745"
}