{
  "id": "131123cb6516",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 84,
  "content": "depends on your expectations for the pattern. It is a failure if you were expecting another complete trend leg or legs to emerge, but the conservative target for a pullback is that previous swing point. Furthermore, if you have been able to establish a position near the bottom of a pullback in an uptrend or near the top of a pullback in a downtrend, the ﬁrst 1 × risk target may already have been hit. If this is a failure pattern, it is a failure that can often result in a proﬁtable trade. The most common error here is to not recognize the failure, to continue to hold the trade, and to take a senseless loss on the position. A: In Figure 10.15, this day provided an ideal entry into the small pullback, showing a small selling climax and subsequent failure on the part of sellers. Feb Mar Mar Apr 1,tay Jun 126 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 310 TRADING STRATEGIES B: The swing falls short of the previous high. Consider the character of the move we expect to see out of ideal pullbacks: the best examples will show strong con- viction, which this clearly does not. It would have been difﬁcult to hold longs through the session following B. C: No swing trader should still be long, but here is an actual failure test entry for shorts. If, by some chance, you are still holding a long position against a signal like this, exit immediately. Pullback Failure at Previous Swing FIGURE 10.16 A Pullback Failure in Crude Oil A: The same theme is in play here in Figure 10.16, except the pullback setting up the failure was not as deep, so ﬁrst proﬁt targets may not have been hit (depending on stop placement). Once again, the consolidation just under resistance at A is potentially constructive. Ideally, we would like to see more conviction and an easier break of resistance, but everything at this point is still supportive of the long trade. B: There are several logical choices for managing a trade like this: r Take partial proﬁts at A, when the market runs into resistance, even though the 1× target has not been reached. r Tighten stop under A, so that part or all of the position is exited on the bar marked B. r Move stop to breakeven at A so that the worst intended outcome is a scratch. Remember that gap risk exists; the actual loss may be larger. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trend Continuation 311 Whichever plan makes sense to you, the important thing is to execute it consistently. By B, it was clear that the pullback trade was not working cleanly and steps should have been taken to adjust or exit the trade. Also, remember the job of a swing trader is to take money out of one clean swing in the market. No swing trader, working on this time frame, would have been justiﬁed holding the trade through the multiple tests and failures of the resistance level, even though the market did eventually trade higher. Focus on ﬁnding and trading only the best and clearest opportunities. Pullback Failure: Strong Momentum Develops FIGURE 10.17 A Bearish Pullback in Wheat Fails When Strong Upside Momentum Emerges Figure 10.17 shows a consolidation pattern in a downtrend. There were several spots to enter a short position: A: The small bars in this area are evidence of volatility compression and justiﬁca- tion to take trades in the direction of downside breakouts from this area. There were several spots to enter a short position somewhere around A, against a stop somewhere around the highest of the small dotted lines. B: At this point, the second downward closing bar, the trade is working. This is a small, but very important point: once a trade is working, once the market is moving in the intended direction, tighten stops to reduce open risk. This is not a precise trailing stop methodology, but remember that once the trade begins to ---~ Nov Dec '11 3.00 '=-\"-~~✓-= ---- -1.00 l.lar Jul 127 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 312 TRADING STRATEGIES work, if it turns back up, a complex consolidation is a likely outcome. There is no point in booking a full-sized loss on a transition into a complex consolidation, and then possibly not having the capital or the will to attempt another trade in that pattern. C: In this case, extremely strong upside momentum developed against the pullback. Though it was still possible that the pattern would develop into a complex con- solidation, after momentum this strong it probably makes sense to move on to better opportunities—this is not what you, as a short or a potential short, want to see. Note that even though this appears to be a catastrophic pattern failure, the actual loss on the trade should have been very small against the lowered trailing stop. This is a common pullback failure pattern, and a good reminder of the importance of moving stops. Trade management does not necessarily mean executing—everyone un- derstands the idea of reducing position sizes to limit risk, but sometimes simply moving a stop is the right answer. Remember, your job as a swing",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.708580"
}