{
  "id": "2162be9461a5",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 141,
  "content": "futures contract depends on information which may not be readily available to the trader. If he is wrong about the price at which the index is actually trading because the individual stock prices do not reflect the true market, his theoretical evaluation of the futures contract will be incorrect. Most traders have learned through experience that the apparent mispricing of a stock index futures contract is often illusory, or at least smaller than it appears. Options on a Cash Index The exercise or assignment of a stock option requires the buyer or seller to take delivery or make delivery of the underlying stock. In theory there is no reason why the exercise or assignment of a stock index option could not be treated the same way. If a trader were to exercise such an option, he would take delivery or make delivery of all the stocks in the index, in their correct proportion, at a price equivalent to the value of the index. The trader who was assigned would take an opposing position at the same price. While this sounds reasonable, in practice it presents the same problems that would arise if we were to settle a stock index futures contract through the physical delivery of all the stocks. The delivery of many different stocks, in their appropriate amounts (which might include fractional shares), would overwhelm the clearing organization. As with futures, the popular solution is to settle the contract in cash rather than through physical delivery. If a trader holds a 440 call and exercises it with the index at 450, he is credited with a cash amount equivalent to 10 index points. If each index point has a value of $100, his account is credited with $1,000. The account of the trader who is assigned on the same call is debited $1,000. In the same way, ifa trader exercises a 475 put with the index at 450, his account will be credited with $2,500. The account of the trader who is assigned will be debited $2,500. In theory, if the index option is American, carrying with it the right of early exercise, the cash settlement should be based on the index value at the time the trader exercises his option. But this is impractical since exercise is not an instantaneous transaction. An exercise notice must be filled out by the trader, submitted to the clearing firm, and then submitted to the clearing house. Even if one could pinpoint the precise time at which an option was exercised, it might be difficult to ascertain the exact value Stock Index Futures and Options 315 of the index. For all these reasons, the exercise or assignment value for an index option is calculated from the index value at the end of the trading day.> Whether an exercise notice is submitted at 10:00 AM or 3:00 PM, both traders will be credited with cash equal to the difference between the exercise price and the index value at the close of trading on that day.4 Evaluating a Cash Index Option The most common method for evaluating cash options on a stock index is based on the assumption that the underlying contract for a cash index option is a basket of stocks which, taken together, have the characteristics of one individual stock. Therefore, a trader might logically choose to evaluate options on an index using a traditional stock option model, the Black-Scholes model for European options or the Cox-Ross-Ruben- stein model for American options. In either case, it will be necessary to feed into the model the usual information: time to expiration, exercise price, underlying price, interest rates, volatility, and dividend payout. Unfortunately, the dividend payout presents a problem which we have already touched upon in the discussion of stock index futures. If the options are European, with no possibility of early exercise, the total amount of dividend payout expected to expiration is sufficient for theoretical evaluation. But if the options are American, where early exercise is a possibility, we need to know the exact date of the dividend payout. There is, however, no one exact date since dividends on different stocks are paid at different times. In order to accurately evaluate American options, we need to create a matrix of dividend payouts with the dates and amounts, and then feed this into our theoretical pricing model. [fa trader wants an exact evaluation of a stock index option, he will need software which is capable of exact dividend calculations. A less accurate method, but one which might be practical for many traders, is to assume a constant dividend payout. A trader can attempt to determine the average percent dividend paid by each stock, deduct this from the interest rate component, and use the result as the interest rate input. For example, if the average dividend payout is 4%, and interest rates are 6%, the trader can ignore the dividend input and simply use an interest rate of 2%. Some models allow the user to enter the interest rate and the dividend payout (as a percent) individually, and from these inputs the model calculates the value of an American option. In both cases, however, the value of early exercise will be distorted since stock option calls are often exercised just prior to a dividend payout, and puts are often exercised just after a dividend payout. When no exact dividend date has been entered into the model, optimum early exercise cannot be calculated. The distortion can sometimes be quite large if many stocks in the index happen to pay a large 3. Because of the order imbalances which can occur in individual stocks when a large number of stock index arbitrages are liquidated at the same time, some exchanges have chosen to settle stock index options and futures on expiration day based on the opening index price. This opening price is determined by the opening prices of each stock in the index on that day. Since stocks can open at different times, the index value may",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.444018"
}