{
  "id": "91d0ff533dac",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 23,
  "content": "top o f t h e h o l e. W e can use this story e ff ectively by askin g ourselves, am I di gg in g ? Am I still strugg l ing wit h my interna l state, trying to contro l it an d escape w h at I d on ’t par - ticularly like, which I know doesn’t work and which I know hurts my trading? Am I di gg in g ? Am I so cau g ht up and fused with what my mind is tellin g me that I am living out of past memories and projections of the future missing the richness of the present and all the opportunities it o ff ers? Am I di gg in g ? Because of the wa y in which the mind works, most readers will fi nd it diffi cul t to remember to ask themselves, “Am I digging?” W e need a little help. There are a number of ways we can remind ourselves. Write down, “Am I di gg in g ?” on an index card and keep it near your tradin g desk. Use a post‐it note and post alon g side your monitor where you will see it frequently during the day , “Am I digging?” Have a section in your daily journal and call it, “What did I di g today?” Write a sentence or two each ni g ht about your di g s as you review the day . Buy a sheet of dots or squares that have adhesive on the backside from a stationary store and stick these in di ff eren t places you frequent to remind you about di gg in g . Good places to stick these are on your coff ee mu g , on the bathroom mirror, on your computer screen, and on any - thing you are likely to see during the course of your day . If you work with others in a tradin g fi rm, this is a way to maintain your privacy while still havin g reminders avail - able. However you do it, g et into the habit of askin g yourself, “Am I di gg in g ?” After a while, you will begin to catch yourself when struggling or when fused and you will hear yourself say , “Whoops, I’m di gg in g .” This will serve as an automatic, personal si g na l to step b ac k an d h o ld your t h ou gh ts an d f ee l in g s at more o f a d istance, an d to refocus your attention back to the present and onto the tradin g task at hand. ■ Note 1. Steven C. Hayes, Kirk D. Strosahl, and Kelly G. Wilson, Acceptance and Commitment Therap y: An Experiential Approach to Behavior Change ( New Y ork: Guilford Press, 1999 ) , 101–104. 171 CHAPTER 8 Acceptance and Committed Trading p I t is universal truth that all traders experience stress alon g with unwanted emo- t ions and thoughts sometimes in their trading life. No one is completely free from this. Tradin g will always have moments of pain. There will always be mistakes made, missed opportunities, losin g trades, down days, and even slumps for protracted peri- ods. There will always be adversity in trading because trading is a game of probabili- ties. Any g iven trade has a probability of a win and also a probability of a loss. Losses are, therefore, a certainty in tradin g . No one likes losses. There are obvious fi nancial consequences when we su ff er losses, and there are also psycholo g ical consequences associated with losses, that is, pain and stress. Hence it is only natural that we do not like losses. But interestin g enough, it is not the pain and stress themselves but the struggle we have with the pain and stress that actually causes tradin g problems. This is of vital importance for traders to understand. Let’s be ver y clear: It is not stress itsel f that causes tradin g diffi culties, but our rejection of stress and fi ghting it that creates trading problems . As we have seen earlier, workin g to escape, control, mana g e, or g et rid of unwanted emotions an d t h ou gh ts ta k es our f ocus an d attention away f rom our tra d in g tas k s, t h us causin g tradin g problems. And, it is not just tradin g problems, but problems in life as well. Psycholo g ist Steven Hayes and his collea g ues assert that psycholo g ical disturbances are primari l y b rou gh t a b out b y t h e stru ggl e wit h unwante d t h ou gh ts an d emotions. Stress is often mali g ned as a scape g oat. It is viewed as a force that impacts ne g a- tivel y our life, health, work, and relationships. “If I didn’t have such stress, I would tra d e b etter ” ; “ I f I d i d n ’ t h ave stress, I wou ld b e h ea l t h ier. ” Suc h b e l ie f s natura lly l ea d to the eff orts of stru gg lin g with stress and tryin g to g et rid of it. 30 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 181ACCEPTANCE AND COMMITTED TRADING Exercise 8.1 Minor Decisions That Impact",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology"
  ],
  "created_at": "2026-02-05T00:37:45.720141"
}