{
  "id": "6fa68427864f",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 52,
  "content": "When futures options are subject to stock-type settlement, as they currently are in the United States, the carrying cost on a deeply in-the-money option, either a call or a put, can, under some circum- 112 Chapter 6 Figure 6-15: Call Theoretical Value vs. Time to Expiration 12 90 10+ 3 8 Underlying Price = 100 G nvina > Volatility = 20% , gy ee : eee s 100 en se / ne . | 10 ee | : : T T 0 20 40 60 80 100 120 140 160 180 200 Time to Expiration (days) Figure 6-16: Put Theoretical Value vs. Time to Expiration 14- 7 ee oe 10 —- a 2 & 4 _ 8 Underlying Price = 100 8 Volatility = 20% 2 ee — . 100 ord en nee ane : a ae 7 om 27 ee 0 T 7 : 0 20 40 60 80 100 120 140 160 180 200 Time to Expiration (days) Option Values and Changing Market Conditions 113 Figure 6-17: Call or Put Theta vs. Time to Expiration 0,25 Underlying Price = 100 ; Volatility = 20% 0.207, 0.154: Theta 0.10+ . , 100 0.05- 0.00 a — 1 T T - 1 T T ™— + 0 20 40 60 80 100 120 140 160 180 200 Time to Expiration (days) stances, be greater than the volatility component. Jf this happens, and the option is European (no early exercise permitted), it will have a theoretical value less than parity (less than intrinsic value). As expiration approaches, the value of the option will slowly rise to parity. Hence, the option will have a positive theta. A put option on stock can be similarly affected if the put is deeply in-themoney and, again, no early exercise is permitted. If interest rates are high enough, the put may be worth less than parity, and So will rise to parity as expiration approaches. In both cases, however, the option must be European. American options, where early exercise is a possibility, can never be worth less than parity, and so can never have positive thetas.* Since the conditions under which a European option will have a positive theta are rare, in general we can assume that an option will lose value as time passes. THE VEGA OR KAPPA Just as we are concerned with the effect on an option’s theoretical value by movement in the underlying contract (delta) and the passage of time (theta), we must also be 4. One can argue that a put on a stock which is about to pay a large dividend will also have a positive theta. When the stock gives up the dividend, it will drop by approximately the amount of the dividend, and this drop in price will increase the value of the put. The reader can make his own decision as to whether this reflects a positive theta, or is actually the result of some change in market conditions (the stock going ex-dividend). 114 Chapter 6 concerned with a change in volatility. This effect is shown in Figures 6-18 and 6-19, While the terms delta, gamma, and theta are found in most option texts, there is no generally accepted term for the sensitivity of an option’s theoretical value to a change in volatility. The most commonly used term in the trading community is vega, and this is the term which will be used in this book. But this is by no means universal. Since vega is not a Greek letter, a common alternative in academic literature, where Greek letters are preferred, is kappa (K). The vega of an option is usually given in point change in theoretical value for each one percentage point change in volatility.5 Since all options gain value with rising volatility, the vega for both calls and puts is positive. If an option has a vega of .15, for each percentage point increase (decrease) in volatility, the option will gain (lose) .15 in theoretical value. If the option has a theoretical value of 3.25 at a volatility of 20%, then it will have a theoretical value of 3.40 at a volatility of 21%, and a theoretical value of 3.10 at a volatility of 19%. Note in Figure 6-20 that an at-themoney option always has a greater vega than either an in-the-money or out-of-the-money option when all options are of the same type and have the same amount of time to expiration. This means that an at-the-money option is always the most sensitive in total points to a change in volatility. As a corollary, Figure 6-18: Call Theoretical Value vs. Volatility 14 125 90 107 8+ Underlying Price = 100 Time = 60 days Theoretical Value Volatility (%) 5. The theta and the vega are sometimes expressed in dollar (or other appropriate currency) change in the option’s value as time passes or volatility changes. Option Values and Changing Market Conditions 115 Figure 6-19: Put Theoretical Value vs. Volatility 14 90 _ obec ee ee ; a 2 Bg 8 Underlying Price = 100 o manorains Pe ae fe | _ | 100. =\" : ee ae - 0 T y | | 0 5 10 15 20 25 30 = | Volatility (%) the out-of the-money option is always the most sensitive in percent terms to a change in volatility. For example, suppose that with a volatility assumption of 15% an at-the money and an out-of-themoney option have theoretical values of 2.00 and .50, respectively. If we raise our volatility assumption to 20%, the options might now have theoretical values of 3.00 and 1.00. The at-the-money option has shown the greater total point increase (1.00 vs. .50), while the out-of-the-money option has shown the greater percent increase (50% vs. 100%). Since many option strategies involve buying and selling unequal numbers of options, the latter characteristic will be important when we look at trading strategies. (The reader can confirm this by looking again at Figure 4-11.) Note also in Figure 6-20 that the vega of all",
  "word_count": 1000,
  "topics": [
    "options",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.430387"
}