{
  "id": "ea9f586327e4",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 24,
  "content": "allocate capital among them so as to maximize overall risk-adjusted return. The optimal allocation of capital and the optimal leverage to use so as to strike the right balance between risk management and maxi- mum growth is the focus of this chapter, and the central tool we use is called the Kelly formula. OPTIMAL CAPITAL ALLOCATION AND LEVERAGE Suppose you plan to trade several strategies, each with their own expected returns and standard deviations. How should you allocate capital among them in an optimal way? Furthermore, what should Money and Risk Management Chan800064_c06.indd 109 6/7/2021 2:06:02 PM 50 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 112 QUANTITATIVE TRADING Often, because of uncertainties in parameter estimations, and also because return distributions are not really Gaussian, traders prefer to cut this recommended leverage in half for safety. This is called half-Kelly betting. If you have a retail trading account, your maximum overall lev- erage l will be restricted to either 2 or 4, depending on whether you hold the positions overnight or just intraday. In this situation, you would have to reduce each f i by the same factor l/(| f1|+| f2|+…+| fn|), where |f1|+| f2|+…+| fn| is the total unrestricted leverage of the port- folio. Here, we ignore the possibility that some of your individual strategies may hold positions that offset each other (such as a long and a short position each balanced with short and long T-bills, respec- tively), which may allow you to hold a higher leverage than this formula suggests. I stated that adopting this capital allocation and leverage will allow us to maximize the long-term compounded growth rate of your equity. So what is this maximum compounded growth rate? It turns out to be gr S2 2 / where the S is none other than the Sharpe ratio of your portfolio! As I mentioned in Chapter 2, the higher the Sharpe ratio of your portfolio (or 0.5 basis point) every minute! This is because for a geometric ran- dom walk, the average compounded rate of return is not the short-term (or one-period) return m (0 here), but is g = m – s 2/2. This follows from the general formula for compounded growth g (f ) given in the appendix to this chapter, with the leverage f set to 1 and risk-free rate r set to 0. This is also consistent with the fact that the geometric mean of a set of numbers is always smaller than the arithmetic mean (unless the num- bers are identical, in which case the two means are the same). When we assume, as I did, that the arithmetic mean of the returns is zero, the geometric mean, which gives the average compounded rate of return, must be negative. The take-away lesson here is that risk always decreases long-term growth rate—hence the importance of risk management! (See also Box 6.1 on “Loss Aversion Is Not a Behavioral Bias.”) Chan800064_c06.indd 112 6/7/2021 2:06:03 PM 109 CHAPTER 6 A ll trading strategies suffer occasional losses, technically known as drawdowns . The drawdowns may last a few min- utes or a few years. To profit from a quantitative trading busi- ness, it is essential to manage your risks in a way that limits your drawdowns to a tolerable level and yet be positioned to use optimal leverage of your equity to achieve maximum possible growth of your wealth. Furthermore, if you have more than one strategy, you will also need to find a way to optimally allocate capital among them so as to maximize overall risk-adjusted return. The optimal allocation of capital and the optimal leverage to use so as to strike the right balance between risk management and maxi- mum growth is the focus of this chapter, and the central tool we use is called the Kelly formula. OPTIMAL CAPITAL ALLOCATION AND LEVERAGE Suppose you plan to trade several strategies, each with their own expected returns and standard deviations. How should you allocate capital among them in an optimal way? Furthermore, what should Money and Risk Management Chan800064_c06.indd 109 6/7/2021 2:06:02 PM Money and Risk Management 111 Here, C is the covariance matrix such that matrix element C ij is the covariance of the returns of the i th and jth strategies, –1 indi- cates matrix inverse, and M = (m1, m2, …, m n)T is the column vector of mean returns of the strategies. Note that these returns are one- period, simple (uncompounded), unlevered returns. For example, if the strategy is long $1 of stock A and short $1 of stock B and made $0.10 profit in a period, m is 0.05, no matter what the equity in the account is. If we assume that the strategies are all statistically independent, the covariance matrix becomes a diagonal matrix, with the diago- nal elements equal to the variance of the individual strategies. This leads to an especially simple formula: f msii i 2 This is the famous Kelly formula (for the many interesting sto- ries surrounding this formula, see, for example, Poundstone, 2005) as applied to continuous finance as opposed to gambling with dis- crete outcomes, and it gives the optimal leverage one should employ for a particular trading strategy. Interested readers can look up a simple derivation of the Kelly formula at the end of this chapter in the simple one-strategy case. Example 6.1: An Interesting Puzzle (or Why Risk Is Bad for You)1 Here is a little puzzle that may stymie many a professional trader. Sup- pose a certain stock exhibits a true (geometric) random walk, by which I mean there is a 50–50 chance that the stock is going up 1 percent or down 1 percent every minute. If you buy this stock, are",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.607575"
}