{
  "id": "0647d271b806",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 81,
  "content": "gamma always goes hand in hand with a Negative theta. A trader with a negative theta will always have to consider the risk in terms of how much time can pass before the spread’s theoretical edge disappears. The position wants movement, but if the movement fails to occur within the next day, or next week, or next month, will the spread, in theory, still be profitable? Vega (Volatility) Risk—The risk that the volatility which we input into the theoretical pricing model will be incorrect. If we input an incorrect volatility, we will be assuming an incorrect distribution of underlying prices over time. Since some positions have a positive vega and are hurt by declining volatility, and some positions have a negative vega and are hurt by rising volatility, the vega represents a risk to every position. A trader 180 Chapter 9 must always consider how much the volatility can move against him before the potential profit from a position disappears. Rho (Interest Rate} Risk—The risk that interest rates will change over the life of the option. A position with a positive rho will be helped (hurt) by an increase (decline) in interest rates, while a position with a negative rho will show just the opposite characteristics.! Generally, the interest rate is the least important of the inputs into a theoretical pricing model, and it is unlikely, except for special situations, that a trader will give extensive thought to the rho risk associated with a position. So far we have compared only the volatility risk associated with spreads 1, 2, and 3. Is there any other risk with which we ought to be concerned? All of our spreads have a negative gamma, so they will all be adversely affected by a large move in the underlying contract. In order to compare the relative gamma risks, we can construct a graph showing the values of the spreads at varying prices of the underlying contract. This has been done in Figure 9-6. Again, we assume that each spread has approximately the same theoretical value under our theoretical assumptions, in this case at the current underlying price of 49.50. Figure 9-6 4 spread 2 (ratio vertical spread) spread 3 (long butterfly) Theoretical Profit & Loss 6) spread 1 (short straddle) -B4 -10 1 T T T 7 47 48 49 50 51 52 53 Underlying Price 1. Of course, we are only considering the interest rate risk as it applies to the evaluation of options. Changes in interest rates can also affect the evaluation of an underlying contract, such as a bond, or even the shares in a company. But that Js a separate matter. Risk Considerations 181 Looking at Figure 9-6 we can see that if the underlying contract makes a large upward move, spread 3 will be the least affected. It can stand a move up to $2.75 without losing its positive theoretical edge. Spreads 1 and 2 can stand upward moves to only 51.05 and 51.75, respectively. On the downside, spread 1 is still the riskiest since it loses all its theoretical edge if the underlying market should make a swift move down to 47.90. Spread 3 is less risky because it can stand a move down to 47.50. But the least risky on the downside is clearly spread 2, since it never loses all its theoretical edge. In the most extreme downward move the theoretical edge of spread 2 will collapse to approximately zero. PRACTICAL CONSIDERATIONS Considering the vega and gamma risk, spread 3 seems to have the best risk charac- teristics. It has a larger margin for error in terms of volatility than either spread 1 or 2. In terms of underlying price movement it can also stand a larger upward move than the other two spreads. Only when we consider the possibility of a large downward move does spread 3 not display the best risk characteristics. In this case spread 2 comes in first. But spread 3 still looks better than spread 1. In theory, a trader ought to be more willing to execute spread 3 than either spread 1 or 2. In the real world, however, practical trading considerations may play a role in the trader’s decision. Even though spread 3, the butterfly, appears to be the best theoretical choice of the three, it has some practical drawbacks which may make it an unrealistic choice. Spread 3 is a three-sided spread, as opposed to spreads 1 and 2, which are two-sided. A three-sided spread will probably be more difficult to execute in the marketplace, and is likely to cost more in terms of the total width of the bid/ask. If a trader wants to execute the complete spread at one time, as is most common, he may not be able to do so at his target prices. If, on the other hand, he tries to execute one leg? at a time, he will be at risk from adverse changes in the market until the other legs have been executed. Additionally, there is the question of market liquidity. In order to obtain a theoretical edge commensurate with spreads 1 and 2, it was necessary to increase the size of the butterfly sevenfold to 70 x 140 x 70. If there is insufficient liquidity in the May 49, 50, and 51 puts to support this size, it may not be possible to execute the butterfly in the size required to meet our profit expectations. Alternatively, we may be able to execute part of the spread at favorable prices, but as we increase the size, the prices may become less satisfactory. Moreover, for a retail customer the increased size may entail significantly greater transaction costs. If trading considerations make spread 3 impractical, we may have to choose between spreads 1 (the straddle} and 2 (the ratio vertical spread). If that happens, spread 2 is the clear winner. It allows for a much greater margin for error in both volatility (vega risk} and underlying price change (gamma risk}. A trader who",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.434837"
}