{
  "id": "2df639cda8bb",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 104,
  "content": "interest risk associated with the position. This in turn depends on two factors: the general level of interest rates and the amount of time remaining to expiration. The higher the interest rate and the more time remaining to expiration, the greater the risk. The lower the interest rate and the less time remaining to expiration, the less the risk. A 10% interest rate with nine months to expiration represents a much greater risk than a 4% interest rate with one month remaining to expiration. In the former case, the deltas of a synthetic position may add up to 94, while in the latter case the deltas may add up to 99. Note that there is no settlement risk when both contracts are subject to the same settlement procedure. If all contracts are subject to stock-type settlement, no cash flow 228 Chapter 11 results from fluctuations in the prices of the contracts prior to expiration. If all contracts are subject to futures-type settlement, any credit or debit resulting from changes in the price of the underlying futures contract will be offset by an equal but opposite cash flow from changes in prices of the option contracts. Dividend Risk in the Stock Market Consider a stock trading at 10214, with three months to June expiration, interest rates at 8%, and a dividend of 11 expected prior to expiration. The value of the June 100 synthetic (the difference between the 100 call and the June 100 put) is: stock price — exercise price + carry on 100 to expiration — expected dividends = 102% - 100 + (100 x 3/12 x 8%) - 114 =3 Suppose a trader is able to sell a June 100 call for 75/4, buy a June 100 put for 4//, and buy stock for 1021/. If interest rates do not change, and assuming there will not be a problem with pin risk, at expiration the trader should realize a profit of 1%, since he has done the June 100 conversion at 1 better than its value. Since the trader owns the stock, part of his profit comes from the 1'% point dividend which he expects to receive when the stock goes ex-dividend. If the dividend changes unexpectedly, it could affect the trader’s eventual profit. If, for example, the company is doing poorly and decides to cut its dividend in half, to 34, the trader’s conversion will be worth 3 less, and his profit of '44 will turn into a loss of 14. Of course, if the company is doing well and decides to increase its dividend to two points, the conversion will be worth '4 more, and the trader’s profit will increase from 14 to 34. Clearly, the possibility of a change in the expected dividend represents a risk to a conversion or reversal. Moreover, if multiple dividends are expected over the life of the strategy, the impact of a change in the company’s dividend policy can be greatly magnified. BOXES As we have seen, a conversion or reversal entails risk because these strategies combine a synthetic position in options with a position in the underlying contract. The risk arises because a synthetic position in options and an actual position in the underlying contract can have different characteristics, either in terms of settlement procedure, as in the futures option market, or in terms of the dividend payout, as in the stock option market. How might we eliminate this risk? One way to eliminate this risk is to eliminate the position in the underlying contract. Consider a conversion: short a call long a put long an underlying contract Option Arbitrage 229 If we want to maintain this position, but would also like to eliminate the risk that goes with holding an underlying position, we might replace the long underlying position with something that acts like an underlying contract, but which isn’t an underlying contract. For example, we might replace the long underlying position with a deeply in-the-money call. Now our position is: short a call long a put long a deeply in-the-money call If the deeply in-the-money call has a delta of 100, and therefore acts like a long underlying contract, the position will have the same characteristics as the conversion. In the same way, instead of replacing the underlying position with a deeply in-the-money call, we can sell a deeply in-the-money put: short a call long a put short a deeply in-the-money put If the deeply in-the-money put has a delta of -100, and therefore acts like an underlying contract, the position will again have the same characteristics as the conversion. This type of position, where the underlying instrument in a conversion or reversal is replaced with a deeply inthemoney option, is known as a three-way. While eliminating some risks, a three-way is not without its own problems. If a trader sells a deeply in-the-money option to complete his three-way, he still has the risk of the market going through the exercise price. Indeed, as the underlying market moves closer and closer to the exercise price of the deeply in-the-money option, the option will act less and less like a position in the underlying contract. The combination of contracts will then act less and less like a true conversion or reversal. What else acts like an underlying contract but isn’t an underlying contract? A synthetic underlying position obviously fills the bill. In addition to a three-way, we might also consider replacing an underlying position in a conversion or reversal with a synthetic equivalent. For example, our original position might be a 100 conversion: short a June 100 call long a June 100 put long an underlying contract Suppose we also execute a reversal at 90: long a June 90 call short a June 100 call short a June 90 put long a June 100 put short an underlying contract long an underlying contract The long and short underlying contracts cancel out, leaving: long a June 90 call short a June 100 call short a June 90 put long",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.438253"
}