{
  "id": "f8c6022d8834",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 79,
  "content": "r Waiting for precise patterns that indicate the presence of an imbalance. These pat- terns also give risk points (stop levels) for each position. r Executing trades to position with the statistical tendency behind that pattern. r Managing the risk in the trade appropriately, perhaps adjusting the position as the trade develops. r In almost all cases, I am playing for one clean swing in the market. The last part of that is particularly important: a swing trader’s job is to take money out of one swing, usually the next swing, in the market. Swing traders do not enter posi- tions, add to them as they move against the entries, and hope for the best. Swing trading is a style of trading that requires precise entries and active trade management. In many of the examples that follow, you will see that it appears that a lot of money has been left on the table, as I advocate exiting positions when the market would, eventually, have con- tinued to move in the trade’s favor. Some traders will ﬁnd success with an approach that 291 P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trend Continuation 293 supporting these trades. In your own work, focus more attention on the unexpected, on failed patterns, than on neat, perfect examples of successful trades. Last, the discussions of these examples are, for the most part, kept to the most im- portant and most obvious elements of the trade. In reality, any one of these trades could be the subject of deep investigation and could support a narrative running to hundreds of pages. If you think you see another way to understand or to read the patterns in some of these trades, you are almost certainly right. There is little discussion of other patterns and supporting factors (though the MACD and Keltner channels are reproduced on these charts, the text rarely discusses the patterns on these indicators). The trade-off was to provide you with many examples of relevant patterns and trade decisions. TREND CONTINUATION Trend continuation plays offer some of the best and most consistent trading patterns. Many traders ﬁnd that these are their bread-and-butter plays, and that they are the back- bone of a comprehensive trading program. All traders and analysts should be very famil- iar with the ways in which continuation patterns unfold, as a good grasp of these patterns leads to deeper insight into the strength and integrity of the trend. Simple Pullback, Breakout Entry FIGURE 10.1 Short Entry in Verifone Systems Inc. (NYSE: PAY) 119 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing Trade Examples: Trend Continuation 295 FIGURE 10.2 A Successful Short Trade D: The next day (see Figure 10.2), a news item hit this stock intraday, driving it well through the 1 × (one times the initial risk) proﬁt target and within striking distance of the second. In an active stock like this, traders may use intraday patterns to manage risk and to time entries, but must guard against executing in the insigniﬁcant noise of those time frames. E: An attempt to drive through the lows fails (note the failure test at E), and most swing traders would have been taken out of this trade a few bars after E, against a greatly tightened stop. F: There was a possible second short entry after another larger complex consolida- tion, but this trade is slightly out of the scope of the swing trader seeking the simplest, cleanest possible trades. Conclusions This example illustrates what appears to be a simple, bear ﬂag style pull- back, but the context of the bigger-picture reversal from a parabolic higher time frame uptrend adds conﬁdence to the trade. Furthermore, though there were opportunities for reentry and for longer holding periods, the swing trader’s job is to be positioned for the single swing, taking partial proﬁts around D, and most likely exiting the remainder com- pletely on the failure test at E. This is a clean and simple trade, both in concept and in execution. P1: OTA JWBT634-c10 JWBT634-Grimes May 10, 2012 8:1 Printer: Hamilton Printing 296 TRADING STRATEGIES Simple Pullback, Breakout Entry FIGURE 10.3 A Simple Pullback Entry in Zagg, Inc. (Nasdaq: ZAGG) Setup Zagg, Inc. had been a market-leading stock for many months. Several previous examples of near-perfect pullback entries are marked on the chart (Figure 10.3), the second of which was a complex pullback. The current entry, at the right edge of the chart, has three warning signs: it is a divergence after at least the ﬁfth leg in an uptrend, there is a momentum divergence on the MACD, and the stock is slightly overextended in a potential buying climax. In a very strong relative strength leader, it is permissible to take a trade with these conditions, which, in a more normal market, might be justiﬁcation for passing on the trade. Entry The actual entry was on the close of the bar that broke above the previous day’s high. There were other structures visible on lower time frames, but volatility was com- pressed, as evidenced by the smaller ranges on the preceding bars, and it was enough to take a simple breakout exit on close. Stop The initial stop was set somewhere around 11.25 (the small dotted line). It may seem like the stop could have been higher, for the pullback pattern would be decisively violated just below the recent lows, around 11.75. However, the placement of this stop ZAGG- 8' D ·1y Zagg Incorporated Mar 120 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.707808"
}