{
  "id": "8aab67d87c33",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 75,
  "content": "+20 x 4.3 +20 x-.0232 +20x.100 +60 +178.0 -.9640 +4.140 Long 30 June 110 calls +30 x +23 +30 x 2.5 +80 x -.01382 +30x.182 Long 15 June 100 puts +15 x -47 +15 x 3.2 +15x-—0166 +15 x 234 -15 +123.0 -.6450 +8.970 SHORT STRANGLE: Short calls and puts with the same expiration date but different exercise prices. Deita Gamma Theta Vega Position Position Position Position Short 30 March 110 calls —30 x +8 -30 x 2.3 -30x-.0124 -30x.055 Short 40 March 90 puts -40 x -6 -40 x 1.7 -~40x-.0090 -40x.040 0 -137.0 +.7320 —3.250 Short 10 June 95 calls -10 x +67 -10 x 2.9 -10x~-.0140 -10x.209 Short 10 June 105 puts -10 x -62 -10 x 3.0 —10x-.0149 —10x.221 -50 -59.0 +.2890 4.300 Volatility Spreads 165 Figure 8-20: Examples of Volatility Spreads (continued) LONG BUTTERFLY: Short two options at the same exercise price, and long one option with an immediately higher exercise price and one option with an immediately lower exercise price; all options are of the same type and expire at the same time. Delta Gamma Theta Vega Position Position Position Position Long 10 March 95 calls +10x 78 +10x 4.3 +10x-.0221 +10x.100 Short 20 March 100 calls —20x 51 -20x5.8 ~-20x -0313 -20x.134 Long 10 March 105 calls +10 x 24 +10x 4.6 +10x-.0250 +10 .107 0 -27.0 +,1850 —.610 Long 30 June $0 puts +30 x-17 430 X 2.1 +380 X~.0111 +30x 154 Short 60 June 95 puts -60 x-31 -60 x 2.9 -60x-—.0151 -60x.209 Long 30 June 100 puts +30 x -47 +80x3.2 -30x-.0166 +30 .234 -60 ~15.0 +.0750 —.900 SHORT BUTTERFLY: Long two options at the same exercise price, and short one option with an immediately higher exercise price and one option with an immediately lower exercise price; all options are of the same type and expire at the same time. Delta Gamma Theta Vega Position Position Position Position Short 20 March 100 puts -20 x -48 -20 x 6.8 -20x~.0313 -20x.134 Long 40 March 105 puts +40 x ~75 +40 x 4.6 +40 x-.0240 +440 x.107 Short 20 March 110 puts —20 x~91 —20 x 2.3 —20 x-.0103 ~20x.055 ~220* +22.0 ~.1280 +.500 Short 25 June 95 calls —-25 x 67 -25x2.9 ~-25x-.0140 ~25~x.209 Long 50 June 100 calis +50 x 51 +50 x 3.2 +50 x~-.0166 +50 x .234 Short 25 June 105 calls —25 x 36 -25x3.0 -25x-.0160 ~-25x.221 -25 +12.5 —.0800 +.950 * Note that because the ratio of a butterfly is always 1 x 2 x 1, the butterfly can become unbalanced if the exercise prices are far away from the current underlying price. LONG TIME SPREAD: Long a long-term option and short a short-term option where all op- tions have the same exercise price and are of the same type. Delta Gamma Theta Vega Position Position Position Position Long 20 June 100 calls +20 x54 +20 x 3.2 +20x-.0166 +20 .234 Short 20 March 100 calls -20 x 51 —20 x 5.8 -20x-.0313 -20x.134 0 -52.0 +.2940 +2.000 Long 10 June 95 puts +10 x-31 +10x 2.9 +10 x —.0151 +10 x .209 Short 10 March 95 puts -10 x-21 ~10x 4.3 -10 x-—.0232 -10x.100 —100 14.0 +.0810 +1.090 166 Chapter 8 Figure 8-20: Examples of Volatility Spreads (continued) SHORT TIME SPREAD: Short a long-term option and long a short-term option where all op- tions have the same exercise price and are of the same type. Delta Gamma Theta Vega Position Position Position Position Long 25 March 100 puts +25 x 48 +25 x 5.8 +25 x ~.0313 +25 x 134 Short 25 June 100 puts -25 x -47 ~25 x 3.2 -25x--.0166 -25 x 234 —25 +65.0 —.3675 2.500 *Long 10 March 105 calls +10 x24 +10 x 4.6 +10x-0250 +10x.107 Short 10 June 110 calls -10 x 23 -10x2.5 -10 x-.0132 -10 x .182 +10 +21.0 -.1180 —.750 * Although this is technically a diagonal spread, it will tend to act like a time spread because the options have deltas which are approximately equal. buy underpriced and sell overpriced options. Such a market can he easily identified by comparing our volatility estimate to the implied volatility in the option marketplace. If implied volatility is generally lower than our volatility estimate, all options will appear underpriced. If implied volatility is generally higher than our estimate, all options will appear overpriced. If options generally appear underpriced (low implied volatility), look for spreads with a positive vega. This includes strategies in the backspread or long time spread category. Jf options generally appear overpriced (high implied volatility), look for spreads with a negative vega. This includes strategies in the ratio vertical or short time spread category. It may seem at first glance that if one encounters a market where all options are either underpriced or overpriced, the sensible strategies are either long straddles and strangles, or short straddles and strangles. Such strategies will enable a trader to take a position with a positive theoretical edge on both sides of the spread. Straddles and strangles are certainly possible strategies when all options are too cheap or too expen- sive. We will see in Chapter 9 that straddles and strangles, while often having a large, positive theoretical edge, can also be among the riskiest of all strategies. For this reason, a trader will often want to consider other spreads in the backspread or ratio vertical spread category, even if such spreads entail buying some overvalued options or selling some underpriced options. The theoretical values and deltas in Figure 8-20 have been reproduced in Figures 8-21 and 8-22, but now prices have been included which reflect implied volatilities different from the volatility input of 20%. The prices in Figure 8-21 reflect an implied volatility of 17%. In this case the reader will find that only those spreads with a positive vega will have a positive theoretical value: call and put backspreads long straddles and strangles Volatility Spreads 167 Figure 8-21 March Futures = 100.00 IMPLIED VOLATILITY = 17% Time to",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.433915"
}