{
  "id": "ad07b41e2e5c",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 25,
  "content": "quently, the value of the $105 call will be low. If we assume a distribution similar to Figure 4-2, there is an increased probability of the underlying reaching $105, and this will increase the value of the $105 call. Finally, if we assume a distribution similar to Volatility 55 Figure 4-4: High Volatility Distribution Figure 4-4, there is a very real likelihood that the $105 call could finish in-the-money. As a result, the value of the option will increase dramatically. (f we assume only that the price movement of an underlying contract follows a Tandom walk, and nothing about the likely direction of movement, the curves in Figures 4-2, 4-3, and 4-4 might represent possible price distributions in a moderate-volatility, low-volatility, and high-volatility market, respectively. In a low-volatility market, price Movement is severely restricted, and consequently options wil! command relatively low Premiums. In a high-volatility market the chances for extreme price movement is greatly increased, and options will command high premiums. Since the different price distributions in Figure 4-5 are symmetrical, it may seem that increased volatility should have no effect on an option’s value. After all, increased Volatility may increase the likelihood of large upward movement, but this should be Offset by the equally greater likelihood of large downward movement. Here, however, there is an important distinction between an option position and an underlying position. Unlike an underlying contract, an option’s potential loss is limited. No matter how far the market drops, a call option can only go to zero. In our example, whether the market finishes at $80 or $104 at expiration, the $105 call will be worthless. However, if we buy the underlying contract at $100, there is a tremendous difference between the 56 Chapter 4 Figure 4-5: Price Distribution at Expiration present price of underlying low volatility distribution —~ moderate volatility distribution ~ exercise price high volatility distribution ee ~N — — | —_ ee ~~ _ market finishing at $80 or $104. With an underlying contract all outcomes are important; with an option, only those outcomes which result in the option finishing in-the-money are important. In Figure 4-5, we are only concerned with price outcomes to the right of the exercise price. Everything else is zero. This leads to an important distinction between evaluation of an underlying contract and evaluation of an option. If we assume that prices are distributed along a normal distribution curve, the value of an underlying contract depends on where the peak of the curve is located, while the value of an option depends on how fast the curve spreads out. MEAN AND STANDARD DEVIATION Suppose we want to use the concept of price movement based on normal distribution curves in a theoretical pricing model. To do this we need a method of describing the characteristics of the curve to the model. Since the model is based on mathematics, we need to describe the curve in numerical terms so that we can feed the numbers into the model. Fortunately, a normal distribution curve can be fully described with two numbers, the meanand the standard deviation. If we know that a distribution is normal, and we also know these two numbers, then we know all the characteristics of the distribution. Graphically, we can interpret the mean as the location of the peak of the curve, and the standard deviation as a measure of how fast the curve spreads out. Curves which Volatility 57 spread out very quickly, such as Figure 4-4, have a high standard deviation; curves which spread out very slowly, such as Figure 43, have a low standard deviation. While the mean is nothing more than the average outcome, and therefore a familiar concept for many traders, the standard deviation may not be quite so familiar. Indeed, one need not know how either of these numbers are calculated in order to successfully trade options. (For those who are interested, a more detailed discussion appears in Appendix B.} What is important to an option trader is the interpretation of these numbers, in particular what a mean and standard deviation suggest in terms of likely price movement. Let’s go back to Figure 4-2 and consider the troughs numbered 0 to 15 at the bottom. We suggested that these numbers might represent the number of heads resulting from 15 flips of a coin. Alternatively, they might also represent the number of times a ball went right at each nail as it dropped down through the maze. The first trough is assigned zero since any bal! which ends there must have gone left at every nail. The last trough is assigned 15 since any ball which ends there must have gone right at every nail. Suppose we are told that the mean and standard deviation in Figure 4-2 are 7.50 and 3.00, respectively. What does this tell us about the distribution? (The actual mean and standard deviation of 7.51 and 2.99 are calculated in Appendix B. Here, for simplicity, we will round to 7.50 and 3.00.} The mean tells us the average outcome. If we add up all the outcomes and divide by the number of occurrences, the result will be 7.50. In terms of the troughs, the average result will fall half-way between troughs 7 and 8. (Of course this is not an actual possibility. However, we noted in Chapter 3 that the average outcome does not have to be an actual possibility for any one outcome.) The standard deviation not only describes how fast the distribution spreads out; it also tells us something about the likelihood of a ball ending up in a specific trough or group of troughs. In particular, the standard deviation tells us the probability of a ball ending up in a trough which is a specified distance from the mean. For example, we May want to know the likelihood of a ball falling down through the maze and ending up in a trough lower than 5 or higher than 10. We can answer the question by asking how",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.426059"
}