{
  "id": "129bc518335d",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 43,
  "content": "buy enough that your buying pushes the market to $80.01. Even though you need to sell, the most effective way for you to sell actually begins with you buying more. If you are correct and shorts have their stop orders clustered there, those stops will trigger and a rush of additional buying will come into the market. As soon as those stops ﬁre off, you can stop your buying (which is a good thing, because now you are even more long than you were before), and you will be more than happy to sell some of your position to those stop orders. If this campaign is successful, you will be able to sell a signiﬁcant portion of your position into the volatility resulting from those orders, and, if you continue selling the rest of your inventory after the burst of stop orders is completed, ---- t ½& ----~ 62 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing Interfaces between Trends and Ranges 131 FIGURE 5.6 Points A Show Good Examples of Breakout Failures; B is More Typical of Continuation Below the Level either inside, outside, or perhaps right at the breakout level. However, lower time frame price action shows a lack of conviction beyond the breakout level. For instance, in the case of an upside breakout, bounces would be slow and reluctant on the lower time frame, and the market might be seen to move down with much less resistance than when it moves up; we would say that such a market “goes down a lot easier than it goes up”—this is typical of a market that may be holding at higher levels without strong underlying conviction. If this type of action is seen, sharp failure momentum back inside the level is likely to emerge within the next several bars. If this does not happen, then it is more likely that a simple pullback after the break- out is underway, which, remember, does not need to hold outside the breakout level. This is one of the most complex and subtle areas of chart analysis; there is much more art than science involved in discerning the difference between these failed and success- ful breakouts. In all cases, the distinguishing feature is the lack of conviction and mo- mentum beyond the level, both of which can be read in price action and in the chart of lower time frames. Even so, traders who focus on these trades must be prepared to be wrong many times and perhaps to make multiple adjustments to positions as the market P1: OTA JWBT634-c05 JWBT634-Grimes May 10, 2012 7:35 Printer: Hamilton Printing 132 MARKET STRUCTURE structure unfolds. These are areas of great uncertainty where the market is in a state of ﬂux; extreme ﬂexibility is required to successfully navigate these waters. While there have been constant reminders that nearly everything in technical anal- ysis is time frame dependent, one important element is not: When signiﬁcant price ac- tion is anticipated at a speciﬁc price level, it should occur at that level. Whether the trader is watching tick charts or monthly charts, the presence or absence of action at a level is an objective criterion that cannot be ignored. For instance, imagine that a long- term investor, perhaps trading weekly or monthly bars, is expecting signiﬁcant action as a market breaks to a multiyear high. If this does not happen, if the market simply trades beyond that new high without any increase in activity, range, or volume, then this is more suggestive of a failed breakout and the investor might choose to adjust her po- sition within her risk management framework. You can think that she used lower time frame price action to inform this decision, but, in reality, she simply did not see activity that supported the idea of an imbalance at a speciﬁc price level. Failed Pullback Following a Breakout The pullback following a breakout is po- tentially the ﬁrst pullback in a new trend, so any of the common trend failure patterns associated with other pullbacks apply to this pullback—with one small exception. If the breakout level was truly an important level, there should have been a high level of ac- tivity on the breakout and it is relatively uncommon to see breakout pullbacks fail by going into ﬂat ranges. It is far more common to see these pullbacks fail with very strong momentum out of the pattern or fail on a second test of the extreme reached after the pullback. There are usually too many competing inﬂuences and too much order ﬂow for the market to just go dead after a breakout, and this type of consolidation, when it does happen, is usually indicative of a successful breakout. The fact that the market is able to hold outside the level shows that there is real conviction behind the move, and can often set up a sustained move in the direction of the breakout (see Figure 5.7). For the trader looking to trade failed breakouts, the best pullback failures will see a sharp reversal and failure out of the wrong side of the pullback formation, indicating a complete failure of conviction outside the breakout level. For instance, assume that FIGURE 5.7 Consolidation Outside the Prebreakout Range Is Usually Constructive @S- Daily Soybeans Continuous Contract [Jul11) ·11 Feb Mar Apr May Jun ;t( I , ----------- , I 63 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.702109"
}