{
  "id": "a8f17715e447",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 114,
  "content": "candidate, but with one month remaining the option might be early exercise candidate. Of course, we ought to ask why we were considering early exercise in the first place. In many cases, we exercise to earn interest over the life of the option. We can earn more interest over three months than over one month, so from this point of view a three-month option is more likely to be an early exercise candidate than a one-month option. We can see that many factors affect the desirability of early exercise, and these factors can pull in different directions, with some factors dictating for early exercise and some dictating against. Thus far we have only addressed the question of when a trader might find it desirable to exercise an option early. There should be an additional value associated with an American option over an identical European option because the American option carries with it additional rights. Even an out-of-the-money option, which no one would consider exercising today, might someday go deeply enough into-the-money so that it could become an early exercise candidate. This possibility should always make an American option more valuable than a European option. How much more should a trader be willing to pay for an American option over an identical European option? The Black-Scholes mode! makes no attempt to answer this question since it is a European pricing model. In spite of the fact that Black-Scholes generated values are likely to show some inaccuracies in an American market, for many years traders continued to use the model because no model with equal ease of use existed to evaluate American options. The problem of early exercise was dealt with through intuition, or through slight adjustments to Black-Scholes generated values. For example, when a stock is expected to pay a dividend, an American call value can be approximated by comparing the Black-Scholes value of the call option under two cifcumstances: 1. The call expires the day before the stock goes ex-dividend. 2. The call expires on its customary date, but the underlying stock price used to evaluate the call is the current price less the expected dividend. Whichever value is greater is the pseudo-American call value. In the case of options on futures, or of put options on stock, traders used Black-Scholes generated values, but raised any option with a theoretical value less than parity to exactly parity. Models eventually were developed to more accurately evaluate American options. The most widely used of these are the Cox-Ross-Rubenstein model, developed by John Cox, Stephen Ross, and Mark Rubenstein; and the Whaley model, developed by Giovanni Barone-Adesi and Robert Whaley. Unlike the Black-Scholes model, neither of Early Exercise of American Options 249 these models is closed form. One can’t simply sit down and add up all the numbers to get the correct value. Rather, both models are algorithms, or loops, and each time the user makes a pass through the loop, the closer he comes to the true American value of the option. While the Cox-Ross-Rubenstein model is quite easy to understand, both intuitively and mathematically, it may require numerous passes through the loop to generate an acceptable value. On the other hand, the Whaley model is more complex mathematically, but converges to an acceptable value much more quickly. The Cox- Ross-Rubenstein model may require 40 or 50 passes through the loop to reach the same degree of accuracy as the Whaley model achieves with four or five passes through the loop. In addition to evaluating American options, both models also determine when an option should be exercised early. We were somewhat vague on this point in our earlier discussion, stating that the delta of an option should be close to 100 to justify early exercise. When using a true American model, an option is optimally exercised early when its theoretical value is exactly parity and its delta is exactly 100. While the Cox-Ross-Rubenstein and Whaley models in most cases generate similar values, more and more computer services are using the Whaley model to evaluate American options because of the speed with which it can achieve results, However, the Cox-Ross-Rubenstein model, while slower, is still very widely used because it offers some advantages which are not available in the Whaley model. For example, the Whaley model handles the dividend payout of a stock as if it were a continuous interest payment over the life of the option. In reality dividends are paid all at once, and the Cox-Ross-Rubenstein model more accurately reflects the impact of this one-time pay- ment on 4 call option on the stock. Unlike the Whaley model, the Cox-Ross-Rubenstein model can also be used to evaluate some of the recently introduced, exotic options. Such options are path dependent since their value depends not only on the likely price distribution of the underlying contract at expiration, but also on the various paths which the underlying price might take to achieve that distribution. Both these models are discussed further in Appendix B. Regardless of the model a trader chooses, the accuracy of model-generated values will depend at least as much on the inputs into the model as the theoretical accuracy of the model itself. If a trader evaluates an American option using an incorrect volatility, or an incorrect interest rate, or an incorrect underlying price, the fact that he derives his values from an American rather than a European model is likely to make little difference. Both models will generate incorrect values because the inputs are incorrect. The American model may produce less error, but that will be small consolation if the incorrect inputs lead to a large trading loss. American option values are most important when there is a significant difference between the carrying cost associated with the option and the carrying cost associated with the underlying contract. The greater the difference between the two carrying costs, the greater the value of early exercise. When the underlying contract is a futures contract and the option on the contract is subject to",
  "word_count": 1000,
  "topics": [
    "options",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.439793"
}