{
  "id": "76c5ee026f80",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 121,
  "content": "if he is wrong. While theoretical considerations will often play a role in a hedger’s decision, practical considerations may also be important. If a hedger knows that he will be forced out of business if the underlying contract moves beyond a certain price, then the purchase of a protective option at that exercise price may be the most sensible strategy, regardless of whether the option is theoretically overpriced. ! Most hedgers find, however, that there is a psychological barrier to buying options. “Why should J lay out money for an option when | will probably lose the premium?” The hedger is right. Most of the time he will lose the premium because most of the time the option will expire worthless. But the same hedger who refuses to purchase an option to protect his business dealings would never consider leaving his home or family uninsured. Like options, the great majority of insurance policies expire without claims ever being made against them. Houses do not burn down; people live on; cars are not stolen. That is the reason insurance companies make a profit. But the purchaser of an insurance policy is willing to accept the fact that insurance companies make profits. Unlike the insurance company, which is selling the insurance contract with the clear intent of making a profit, the purchaser of an insurance contract is not purchasing the contract to make money. He is purchasing it for the peace of mind which it affords. The same philosophy should apply to the purchase of options. If a hedger needs the protection afforded by the option, the purchase makes sense in spite of the fact that it is likely to be a losing proposition in the long run. FENCES Suppose a hedger desires the limited risk afforded by the purchase ofa protective option, but also wants to avoid the cash outlay associated with such a strategy. What can he do? A popular strategy, known as a fence, is to simultaneously combine the purchase of a protective option with the sale of a covered option. For example, with an underlying contract at 50, a hedger with a long position might choose to simultaneously sell a 55 call and purchase a 45 put. The hedger is insulated from any fall in price below 45, since he can then exercise his put. At the same time, he can participate in any upward move to 55, at which point his underlying position will be called away. The cost of the complete hedge depends on the prices of the 45 put and 55 call. If they are the same, the cost of the hedge is zero. If the price of the 55 call is greater than the price of the 45 put, the hedge can be established for a credit which the hedger gets to keep no matter Where the underlying finishes. With prices of 1.25 and 1.75 for the 45 put and 55 call, the hedger will receive a credit of .50. This will reduce his break-even price on the underlying position to 49.50. 1. Of course, if the options are wildly overpriced, a hedger might be reluctant to buy a protective option. But this is unlikely to happen. If option prices are high, there is usually a valid reason. 264 Chapter 13 Recalling the basic synthetic relationships, we find that a long fence (long the underlying, short a covered call, long a protective put) is simply a bull vertical spread done synthetically. Suppose in our example fence consisting of a long 45 put and short 55 call, we replace the 45 put with its synthetic equivalent: long 45 put = short underlying + long 45 call 45/55 fence = long underlying + long 45 put + short 55 call = long underlying + (short underlying + long 45 call} + short 55 call = long 45 call + short 55 call A short fence consists of a short underlying position together with the purchase of a protective call and sale of a covered put. Since we can always rewrite one of the options with its synthetic equivalent, this is simply a bear vertical spread. Long and short fences are shown in Figures 13-5 and 13-6. Fences are popular hedging tools because they offer known protection at a low cost, or even a credit. At the same time, they still allow a hedger to participate, at least partially, in favorable market movement. Fences go by a variety of names: range forwards, tunnels, cylinders; among floor traders they are sometimes known as spiit- price conversions and reversals. As the borrowing and lending of funds has become more widespread, and since such activity is often based on a floating interest rate, the use of options to hedge long or short interest rate positions has become especially popular. A firm which borrows Figure 13-5: A Long Fence “ a v.. sell a covered call 4 Se, Lo combined position — a oo ~ NN LL LO Me “ ‘ ° ~ “ \\ buy a protective put .. va long an underlying position - Hedging with Options 265 Figure 13-6: A Short Fence 4 bined position a com p NN sell a covered put af a o N ja , ~ — “SD S a buy a protective call ~N y a _ N ~ short an underlying position & funds at a variable interest rate has a short interest rate position. A fall in interest rates will reduce its cost of borrowing, while a rise in interest rates will increase its costs. To cap the upside risk, the firm can purchase an interest rate call, thereby establishing a maximum amount it will have to pay for borrowed funds. No matter how high interest rates rise, the borrower will never have to pay more than the cap’s exercise price. An institution which lends funds at a variable interest rate has a long interest rate position. A rise in interest rates will increase its returns, while a fall in interest",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.440785"
}