{
  "id": "20dcf955caf3",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 171,
  "content": "life of an option. Any credits or debits associated with an option strategy will be subject to an interest rate identical to the least risky rate corresponding to the term of the option. In most markets the least risky rate is the rate associated with government issued securities. A trader in a U.S. option market who sells straddles consisting of three-month calls and puts is assumed by the model to have invested the resulting credit in three-month government treasury bills. If both the option position and the treasury bills are held to expiration, this effectively locks in one interest rate (that associated with three-month treasury bills) over the life of the options. In reality few traders actually take the proceeds from an option trade and invest it in government securities. More often, a trader will put the proceeds in a trading account, where it is subject to a variable interest rate. Moreover, while a trader can lend money to the government by purchasing government securities, he cannot do the reverse and borrow money from the government at the same rate. If he wants to borrow, he may have to go to a bank where the cost of borrowing could be subject to a variable interest rate. Given the realities of the marketplace, most traders’ transactions are not subject to a fixed and riskless rate, as the model assumes, but to a constantly changing interest rate. Is this a cause for worry? While a changing interest rate will cause the value of a trader’s option position to change, interest rates usually do not change in a way which will have a significant impact on an option’s value, at least in the short run. Since the effect of changing interest rates is a function of time to expiration, and since most listed options have terms of less than nine months, interest rates would have to change violently to have an impact on any but the most deeply in-the-money options. Changing interest rates become even less of a concern when one considers how much more sensitive option values are to changes in the price of the underlying instrument or to changes in volatility. This is not to say that a trader should completely ignore the possibility of changing interest rates. As we saw in Chapter 8, changing interest rates can have an impact on time spreads in the stock option market. But even then, interest rates would have to change several percentage points over a short period of time to have a significant impact (see Figure 8-15). With the introduction of long-term equity options, known as LEAPS, the conse- quences of changing interest rates may well become more of a concern. Using the Black-Scholes model, we can see in Figure 18-1 that the values of two-year stock options changes significantly with only small changes in interest rates (delta values are in parentheses). Note particularly how quickly the 120 put drops below its parity value of 20.00. In a high interest rate environment, a long-term in-the-money American put will quickly become an early exercise candidate. Everyone will prefer to exercise the put in order to earn a high rate of interest on the proceeds from the sale of the stock. 389 Models and the Real World (Le-) 029 (69) 00°91 (e€}-) soe (28) 0S'92 (e-) e€° (26) Z8°6e Spl (9e-) se'e (b9) 96°E1 (91-) $2Z'2 (pe) 60'bz (b-) Lb\" (96) pS'Ze TL (Zp-) 6201 (8S) SoZ! (0¢-) 6S\" (08) 2212 (s-) 29° (96) ZI'Se %OL (8b-) bS'ZI (z$) z'ol (b2—) £9'b (92) cp'6} (2-) b6\" (6) 12'Ze %8 0 = puepiAid (€S-) OL'SI (2b) 00°6 (6z-) 68°S (12) O2' Lh (6-) 62’ (16) ve\"0e %9 \"%0E = AYNEIOA (6S—) 00'S (bb) ce (pe-) 6E°Z (99) 80'S} (11) $2°1 (68) 06°22 %b (p9-) pa 12 (ge) $6'S (6e-) £16 (19) OL'eL (pL-) pe'e (98) ep'se %e ‘saB0A Z = UOHeIAXS 0} OUT, ind oz | We9 OL ynd oo} {29 00} ind og 11° 08 s97eY 1S0/0] Uj ‘00 } = 80d yOo}\\S t-8h eunBly 390 Chapter 18 VOLATILITY IS CONSTANT OVER THE LIFE OF THE OPTION When a trader feeds a volatility into a theoretical pricing model, he is telling the model the magnitude of price changes which will occur over the life of the option. Given the characteristics of a normal distribution, the model uses the volatility to extrapolate a certain number of one, two, three, or more standard deviation price changes. Moreover, the model assumes that occurrences of each particular magnitude will be evenly distributed over the life of the option. Two standard deviation price changes will be evenly distributed among the one standard deviation price changes; three standard deviation price changes will be evenly distributed among the one and two standard deviation price changes; and so on. Look at Figures 18-2a and 18-2b, daily bar charts of an underlying contract over the life of a certain option. Both bar charts exhibit exactly the same volatility over the period in question, 16.7%. Yet it is obvious that the order in which the volatility occurs is completely different. In Figure 18-2a all the large price changes occur during the early part of the option’s life, while in Figure 18-2b all the large price changes occur during the latter part of the option’s life. This is often how price changes actually occur in the real world, rather than the even distribution which the model assumes. A trader typically encounters periods of high volatility where all the two and three standard deviation price changes seem to be bunched together. Or he encounters periods of low volatility where all the one standard deviation price changes seem to be bunched together. A graph of historical volatility is never a straight line. (For a good example of this, the reader should look again at Figure 14-2.) But the theoretical pricing model cannot differentiate between our two volatility scenarios. The model simply sees a volatility of 16.7% and assumes that all price changes are evenly distributed, and consistent with",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.448543"
}