{
  "id": "42485afb5348",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 169,
  "content": "long XYZ 60 puts and XYZ 65 calls). The position should show its greatest negative $gamma, positive $theta, and negative $vega when ABC is close to 105 (the position is short ABC 105 calls) and the when XYZ is as far away from 60 and 65 as possible. Since price movement in Figures 17-7a through 17-7e is expressed in standard deviations, in order to interpret the graphs we need to know where the exercise prices are in terms of standard deviations. With ABC at 99 and a one standard deviation price change of 2.75, the ABC exercise prices in terms of standard deviations are: 95 call: (95-99) / 2.75 = -1.5 st. devs. 105 call: (105 — 99) / 2.75 = +2.2 st. devs. With XYZ at 62 and a one standard deviation price change of 1.98, the XYZ exercise prices in terms of standard deviations are: 60 put: (60-62) / 1.98 = -1 st. dev. 65 call: (65 —62) / 1.98 = +1.5 st. devs. With these values in mind, the reader should take some time to study the graphs and confirm that the $delta, $gamma, $theta, and $vega of the position are in fact consistent with the principles of option evaluation. The foregoing example consisted of positions in only two different underlying markets. If a trader had option positions in several different underlying markets, a detailed analysis of the total position would require multidimensional graphs. Even if they could be constructed, such graphs would be too complex for most traders to interpret. Under such circumstances the only practical solution is to separate positions by the underlying instrument and do an individual analysis of each market. 18 % Models and the Real World The accuracy of values generated by a theoretical pricing model rests on two points: the accuracy of the assumptions upon which the model is based, and the accuracy of the inputs into the model. Thus far, we have tended to focus on the second area, the accuracy of the inputs. Through attention to the sensitivities of an option position (delta, gamma, theta, vega, and rho}, a trader can identify those inputs which represent the greatest risk to his position, and thereby prepare to take protective action if things go wrong. While ail the inputs into the model represent a risk to the trader, we have placed special emphasis on volatility, since it is the one input which cannot be directly observed in the marketplace. However, the active option trader cannot afford to ignore the first area, the possibility that the assumptions which form the foundation of the model are themselves inaccurate or unrealistic. Some of these assumptions pertain to the way business is transacted in the marketplace, while others pertain to the mathematics of option pricing. To begin, we might list the most important assumptions built into a traditional pricing model;! 1. Markets are frictionless a. The underlying contract can be freely bought or sold, without restriction b. There are no tax consequences associated with trading c. Everyone can borrow and lend money freely, and one interest rate applies to all transactions d. There are no transaction costs 2. Interest rates are constant over the life of an option 3. Volatility is constant over the life of an option 4. Trading is continuous with no gaps in the price changes of an underlying instrument 5. Volatility is independent of the price of the underlying contract 6. Over short periods of time the percent price changes in an underlying contract are normally distributed, resulting in a lognormal distribution of underlying prices at expiration 1, By “traditional pricing model” we mean those that are most commonly used: the Black-Scholes model and its variations, the Cox-Ross-Rubenstein model, or the Whaley model. 385 386 Chapter 18 The reader may already have an opinion about the accuracy of these assumptions, but let’s consider them one by one. MARKETS ARE FRICTIONLESS In Chapter 5 we came to the obvious conclusion that markets are not frictionless. The underlying contract cannot always be freely bought or sold; there are sometimes tax consequences; a trader cannot always borrow and lend money freely, nor at the same rate; there are always transaction costs. In the futures markets the underlying cannot always be freely bought or sold because exchanges sometimes set daily price limits beyond which a futures contract may not trade. When that limit is reached, trading is halted until the market comes off its limit. If it doesn’t come off limit, trading does not resume until the next business day. The consequences of a locked futures market are usually not severe, and there are several ways for a trader to circumvent the problem. Instead of trading in the futures market, a trader might be able to trade in the cash market. Or the trader might be able to trade the underlying market by trading a futures spread where one side of the spread is not locked. For example, suppose a trader wants to buy a June futures contract which is up limit. If a March futures contract is still trading because it is not up its limit, the trader can buy a June/March spread (buy June, sell March), and then go back into the market and buy the March futures contract. This leaves him long a June futures contract, which is what he wanted. Finaily, if the underlying futures market is locked, but the option market is not locked, a trader can trade synthetic long or short futures contracts. In the stock market, there may be prohibitions against the sale of stock not actually owned. Or if short sales are allowed, there may be restrictions on when such sales can be made. Ifa trader cannot freely sell stock, put prices become inflated compared to call prices, and all the conversions and reversals appear to be mispriced with respect to their theoretical values. If short sales are not freely permitted, many stock option traders try to carry some long stock so they will always be in",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.448278"
}