{
  "id": "02887535bdef",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 40,
  "content": "+62.81. How much did the theoretical pricing model predict we would make? We bought 100 calls worth 3.88 for 3.25 each, for a total theoretical edge of 100 x (3.88 - 3.25) = 100 x .63 = +63.00. In other words, the theoretical model came very close to predicting the actual profit from the position. Using an Option’s Theoretical Value 87 In our example, the profit and loss was made up of four components. Two of these were profitable (the adjustments and the variation costs) while two were unprofitable (the original hedge and the option carrying costs). Is this always the case? It is impossible to determine beforehand which components will be profitable and which will not. One could just as easily construct an example where the original hedge was profitable and the adjustments were not. The important point here is that if a trader’s inputs are correct, in some combination he can expect to show a profit (or loss) approximately equal to that predicted by the theoretical pricing model. Of all the inputs, volatility is the only one which is not directly observable. Where did our volatility figure of 18.3% come from? Obviously, one can’t know the future volatility, but in this case the author took the ten price changes in Figure 5-1 and calculated the annualized standard deviation of the logarithmic changes (the volatility). Hence, the volatility of 18.3% was the correct volatility for this series of price changes. The complete calculations are given in Appendix B. In the foregoing example we assumed that the market was /rictionless, that no external factors affected the total profit or loss. This assumption is basic to many economic models, including the Black-Scholes Model. In a frictionless market we assume that: 1. Traders can freely buy or sell the underlying contract without restriction 2. All traders can borrow and lend money at the same rate. 3. Transaction costs are zero. 4, There are no tax considerations. A trader will immediately realize that option markets are not frictionless, since each of the above assumptions is violated to a greater or lesser degree in the real world. For example, in certain futures markets there is a daily limit on the amount of allowable price movement. When this limit is reached, the market is said to be locked, and no further trading can take place until the price of the futures contract comes off its limit.$ Clearly, in such a market the underlying contract cannot always be freely bought or sold. Additionally, individual traders cannot generally borrow or lend money at the same rate as large financial institutions. If a trader has a debit balance, it will cost him more to carry that debit; if he has a credit balance, he will not earn as much on that credit. There is a spread, and perhaps a fairly large one, between a trader’s borrowing and lending rate. Fortunately, as we discussed in Chapter 3, the interest rate component is usually the least important of the inputs into a theoretical pricing model. Even though the applicable interest rate may vary from trader to trader, in general it will only cause small changes in the total profit or loss in relation to the profit or loss resulting from other inputs. 3. It is sometimes possible to circurnvent the problem of a locked market by either buying or selling the physical commodity rather than the futures contract, or by trading spreads between futures months if one of the months is not locked. 88 Chapter 5 Transaction costs, on the other hand, can be a very real consideration. If such costs are high, the hedge in Figure 5-1 might not be a viable strategy; all the profits could be eaten up by brokerage fees. In theory, the desirability of a strategy will depend not only on the trader’s initial transaction costs, but also on the subsequent costs of making adjustments. The adjustment cost is a function of a trader’s desire to remain delta neutral. A trader who wants to remain delta neutral at every moment will have to adjust more often, and more adjustments mean more transaction costs. Suppose a trader initiates a hedge but adjusts less frequently, or does not adjust at all. How will this affect the outcome? Since theoretical evaluation of options is based on the laws of probability, a trader who initiates a theoretically profitable hedge still has the odds on his side. Although he may lose on any one individual hedge, if given a chance to initiate the same hedge repeatedly at a positive theoretical edge, on average he should profit by the amount predicted by the theoretical pricing model, assuming, of course, that his inputs are correct. The adjustment process is simply a way of smoothing out the winning and losing hedges by forcing the trader to make more bets, always at the same favorable odds. A trader’s disinclination to adjust simply means that there is greater risk of not realizing a profit on any one hedge. Adjustments do not in themselves alter the expected return; they simply reduce the possibility of short-term bad luck. Based on the foregoing discussion, a retail customer and a professional trader are likely to approach option trading in a slightly different manner, even though both understand and use the values generated by a theoretical pricing model. A professional trader, particularly if he is an exchange member, has relatively low transaction costs. Since adjustments cost him practically nothing in relation to the expected theoretical profit from a hedge, he is willing to make frequent adjustments. However, a retail customer who establishes the same hedge will probably not adjust, or will adjust less frequently, because any adjustments are likely to significantly reduce the profitability of a hedge. But if he understands the laws of probability, the retail customer will realize that his position has the same favorable odds as the professional trader’s position. At the same time he should realize that his position is more sensitive to short-term bad luck.",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.428536"
}