{
  "id": "8e6dee912424",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 66,
  "content": "for an extended period of time. The inability of the fast line to back off is a reﬂection of the conviction behind the price movement and should not be taken as an indication to start looking for countertrend trades. Figure 7.17 shows yet another example from Silver futures. In this case, a very strong uptrend pegs the MACD fast line in potentially overextended territory, and it stays there for much of the move. FIGURE 7.17 A Strong Trend Will Peg the MACD Fast Line @SI- Daily Silver Continuous Contract [Sep11] 19.000 18.000 ~ 0.40 D. ~-...... - ./\\ cs ~ - . -e..:.:.,-::: 1 '&----- v ----v---VV -0.20 Jun Jul Aug Sep Oct 98 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 211 One easy way to avoid fading markets in situations like this is to look for divergence only after the fast line touches or comes very near to the zero line. This criterion is another expression of a point made earlier, which is that divergences can be valid only between different swings in the market. If there are no swings and the market is simply in a strong, extended push (as in Figure 7.17), then there really can be no valid information from the fast line of the MACD. In nearly all cases, the fast line will retreat to the zero line in the presence of an accompanying countertrend swing in price, and these are precisely the types of structures that can set up valid divergences. Fast Line Hook A turn in the fast line can often be the ﬁrst indication of emerging momentum, especially when the market is poised at an inﬂection point. This is a case where a very sensitive indicator can sometimes seem to lead price because it is able to ﬁlter out the most important aspects of the price action. Figure 7.18 shows short entries in Freeport-McMoRan (NYSE: FCX) that were generated according to the following rule set: enter short on the ﬁrst bar whose close causes the MACD fast line to turn down after prices have penetrated below the lower band and assuming there is no momentum divergence. (The inverse of this rule set could be applied to generate longs, but there are FIGURE 7.18 Shorts Generated by a Systematic Application of the MACD X D .,, Freeport-McMoRan op FC - 8 • 1 C per&Gold B 99 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 213 FIGURE 7.19 Avoid Buying When the Slow Line Has Been Extended Upward and Has Now Turned Down often highlights a structural tension in the market where the short-term momentum, as measured by the fast line, is in conﬂict with the longer-term momentum measured by the slow line. Figure 7.20 shows the results of combining the fast line hook entry with this condition on a daily chart of Lean Hog futures. This is not intended to be a complete me- chanical trading system, though a system could be built on this concept. Also consider, in Figure 7.20, the fast line hook entries (not marked) that were skipped. At the very least, the MACD provides some powerful clues about market structure, momentum, and price action. MULTIPLE TIME FRAME ANALYSIS Multiple time frame analysis provides another layer of depth and richness to market analysis. It can place patterns in one time frame in the context of other time frames to better identify those spots where the patterns are more likely to have arisen due to an actual imbalance in the market rather than as a result of random chance. Many traders 1,1-Daily M acy's Inc Mar Apr 23.00 1.00 0.00 Jul ....-----.--L-- 100 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 214 TRADING STRATEGIES FIGURE 7.20 Fast Line Hook Entries Qualiﬁed with Fast/Slow Line Spread assume that higher time frames are more signiﬁcant; for instance, that patterns on the weekly chart are more important than patterns on 5-minute charts. This is not exactly true—structures on different time frames can take control at any time, and one of the major tasks of analysis is to identify what time frame and what structure are the domi- nant factors in a particular market at any point in time. There are spots where price action may be completely dictated by what happens on a very short time frame, for instance, 1- or 3-minute charts, and other times when the most important factor might be a level that is visible on weekly or monthly charts. We can usually identify a dominant structure or set of structures on one time frame, and can often watch as control is essentially passed from one time frame to another. For instance, perhaps a resistance level is tested multiple times on the 1-minute chart, and then is broken cleanly with a clear consolidation just below the level. At this moment, the 1-minute chart would be in control, but perhaps this breakout happened at",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.705780"
}