{
  "id": "24edf2f10f28",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 28,
  "content": "a direct quote.) Experiments show that most people would not accept this gamble, even though the expected gain is $5. This is the so-called “loss aversion” behavioral bias, and is considered irrational. Kahneman went on to write that “professional risk takers” (read “traders”) are more willing to act ration- ally and accept this gamble. It turns out that the loss-averse “layman” is the one acting rationally here. It is true that if we have infinite capital, and can play infinitely many rounds of this game simultaneously, we should expect a $5 gain per round. But trading isn’t like that. We are dealt one coin at a time, and if we suffer a string of losses, our capital will be depleted and we will be in debtor prison if we keep playing. The proper way to evaluate whether this game is attractive is to evaluate the expected compound rate of growth of our capital. Let’s say we are starting with a capital of $1,000. The expected return of playing this game once is initially 0.005. The standard deviation of the *This commentary was reproduced from my blog article of the same title at predictnow.ai /blog/loss-aversion-is-not-a-behavioral-bias/ Chan800064_c06.indd 127 6/7/2021 2:06:03 PM 59 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 128 QUANTITATIVE TRADING Another common bias that I have personally experienced is the representativeness bias—people tend to put too much weight on recent experience and underweight long-term average (Ritter, 2003). (This reference has a good introduction to various biases studied by behavioral finance.) After a big loss, traders—even quantitative traders—tend to immediately modify certain parameters of their strat- egies so that they would have avoided the big loss if they were to trade this modified system. But, of course, this is unwise because this modification may invite some other big loss that is yet to happen, or it may have eliminated many profit opportunities that existed. We must remember that we are operating in a probabilistic regime: No system can avoid all the market vagaries that can result in losses. If you feel that your system really is deficient and want to tweak it, you should always backtest the modified version to make sure return is 0.105. To simplify matters, let’s say we are allowed to adjust the payoff of each round so we have the same expected return and standard deviation of return each round. For example, if at some point we earned so much that we doubled our capital to $2,000, we are allowed to win $220 or lose $200 per round. What is the expected growth rate of our capital? As Example 6.1 shows, in the continuous approximation it is –0.0005125 per round – we are losing, not gaining! The layman is right to refuse this gamble. Loss aversion, in the context of a risky game played repeatedly, is rational, and not a behavioral bias. Our primitive, primate instinct grasped a truth that behavioral economists cannot. It only seems like a behav- ioral bias if we take an “ensemble view” (i.e., allowed infinite capital to play many rounds of this game simultaneously), instead of a “time series view” (i.e. allowed only finite capital to play many rounds of this game in sequence, provided we don’t go broke at some point). The time series view is the one relevant to all traders. In other words, take time average, not ensemble average, when evaluating real-world risks. The important difference between ensemble average and time aver - age has been raised in a paper by physicist Ole Peters and Nobel laure- ate Murray Gell-Mann (Peters, et al., 2016). It deserves to be much more widely read in the behavioral economics community. But beyond academic interest, there is a practical importance in emphasizing that loss aversion is rational. As traders, we should not only focus on average returns: risks can depress compound returns severely. Chan800064_c06.indd 128 6/7/2021 2:06:04 PM 60 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 130 QUANTITATIVE TRADING before I learned of the Kelly criterion and other stress testing meth- odologies.) As if this is not enough lesson, I repeated the same mistake again when I started trading independently. It concerns a mean-reverting spread strategy involving XLE, an energy exchange- traded fund (ETF) and the crude oil future (CL). When the spread refused to mean revert over time, I stubbornly increased the size of the spread to almost $500,000. Finally, despair set in, and I exited the spread with close to a six-figure loss. Naturally, the spread started to revert afterward when I wasn’t around to benefit. (Fortunately, several of my other strategies performed well in that first year of my independent trading, so the fiscal year ended with only a small overall loss.) How should we train ourselves to overcome these psychologi- cal weaknesses and learn not to override the models manually and to remedy trading errors correctly and expeditiously? As with most human endeavors, the way to do this is to start with a small portfo- lio and gradually gain psychological preparedness, discipline, and confidence in your models. As you become emotionally more able to handle the daily swings in profit and loss (P&L) and rein in the primordial urges of the psyche, your portfolio’s actual performance will hew to the theoretically expected performance of your strategy. I have certainly found that to be the case after getting over those aforementioned disastrous trades. My newfound discipline and faith in the Kelly formula has so far prevented",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:43.608237"
}