{
  "id": "bf2fc41fa16f",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 47,
  "content": "the execution of a large institutional order, or “herding” behavior. • Competition between traders tends to reduce the number of mean-reverting trading opportunities. • Competition between traders tends to reduce the optimal hold- ing period of a momentum trade. • Trading parameters for each day or even each trade can be opti- mized using a machine-learning-based method we called CPO. • A stationary price series is ideal for a mean-reversion trade. • Two or more nonstationary price series can be combined to form a stationary one if they are “cointegrating.” • Cointegration and correlation are different things: Cointegration is about the long-term behavior of the prices of two or more stocks, while correlation is about the short-term behavior of their returns. • Factor models, or arbitrage pricing theory, are commonly used for modeling how fundamental factors affect stock returns linearly. Chan800064_c07.indd 190 6/7/2021 7:16:59 AM 101 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 191 • One of the most well-known factor models is the Fama-French Three-Factor model, which postulates that stock returns are proportional to their beta and book-to-price ratio, and negatively to their market capitalizations. • Factor models typically have a relatively long holding period and long drawdowns due to regime switches. • Exit signals should be created differently for mean-reversion versus momentum strategies. • Estimation of the optimal holding period of a mean-revert- ing strategy can be quite robust, due to the Ornstein-Uhlen- beck formula. • Estimation of the optimal holding period of a momentum strat- egy can be error prone due to the small number of signals. • Stop loss can be suitable for momentum strategies but not rever- sal strategies. • Seasonal trading strategies for stocks (i.e., calendar effect) have become unprofitable in recent years. • Seasonal trading strategies for commodity futures continue to be profitable. • High-frequency trading strategies rely on the “law of large num- bers” for their high Sharpe ratios. • High-frequency trading strategies typically generate the highest long-term compounded growth due to their high Sharpe ratios. • High-frequency trading strategies are very difficult to backtest and very technology-reliant for their execution. • Holding a highly leveraged portfolio of low-beta stocks should generate higher long-term compounded growth than holding an unleveraged portfolio of high-beta stocks. Most statistical arbitrage trading strategies are some combina- tion of these effects or models: Whether they are profitable or not is more of an issue of where and when to apply them than whether they are theoretically correct. Chan800064_c07.indd 191 6/7/2021 7:16:59 AM 102 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 192 QUANTITATIVE TRADING REFERENCES Alexander, Carol. 2001. Market Models: A Guide to Financial Data Analysis. West Sussex: John Wiley & Sons Ltd. Chan, Ernest. 2013. Algorithmic Trading: Winning Strategies and Their Rationale. Wiley. Economist. 2007a. “This Year’s Model.” December 13. www.economist. com/finance/displaystory.cfm?story_id=10286619. Fama, Eugene, and Kenneth French. 1992. “The Cross-Section of Expected Stock Returns.” Journal of Finance XL VII (2): 427–465. Fielden, Sandy. 2006. “Seasonal Surprises.” Energy Risk, September. https://www.risk.net/infrastructure/1523742/seasonal-surprises. Grinold, Richard, and Ronald Kahn. 1999. Active Portfolio Management. New York: McGraw-Hill. Heston, Steven, and Ronnie Sadka. 2007. “Seasonality in the Cross-Section of Expected Stock Returns.” AFA 2006 Boston Meetings Paper, July. lcb1. uoregon.edu/rcg/seminars/seasonal072604.pdf. Khandani, Amir, and Andrew Lo. 2007. “What Happened to the Quants in August 2007?” Preprint. web.mit.edu/alo/www/Papers/august07.pdf. Kochkodin, Brandon. 2021. “How WallStreetBets Pushed GameStop Shares to the Moon.” www.bloomberg.com/news/articles/2021-01-25/how- wallstreetbets-pushed-gamestop-shares-to-the-moon?sref=MqSE4VuP . Lewis, Michael. 2014. Flash Boys. W.W. Norton. Phillips, Daniel. 2020. “Investment Strategy Commentary: Value Stocks: Trapped or Spring-Loaded?” Northern Trust, September 24. https://www. northerntrust.com/canada/insights-research/2020/investment-manage- ment/value-stocks. Singal, Vijay. 2006. Beyond the Random Walk. Oxford University Press, USA. Schiller, Robert. 2008. “Economic View; How a Bubble Stayed under the Radar.” New York Times, March 2. www.nytimes.com/2008/03/02/ business/02view.html?ex=1362286800&en=da9e48989b6f937a&ei=5124&p artner=permalink&exprod=permalink. Toepke, Jerry. 2004. “Fill ’Er Up! Benefit from Seasonal Price Patterns in Energy Futures.” Stocks, Futures and Options Magazine (3) (March 3). www.sfomag.com/issuedetail.asp?MonthNameID=March&yearID=2004. Uhlenbeck, George, and Leonard Ornstein. 1930. “On the Theory of Brownian Motion.” Physical Review 36: 823–841. Chan800064_c07.indd 192 6/7/2021 7:16:59 AM 103 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 193 CHAPTER 8 Q uantitative trading gained notoriety in the summer of 2007 when some enormous hedge funds run by some of the most reputable money managers rung up losses measured in billions in just a few days (though some had recovered by the end of the month). It is déjà vu all over again in January 2021. They brought back bad memories of other notorious hedge fund debacles such as that of Long-Term Capital Management and Amaranth Advi- sors (both referenced in Chapter 6 ), except that this time it was not just one trader or one firm, but losses at multiple funds over a short period of time. And yet, ever since I began my career in the institutional quan- titative trading business, I have spoken to many small, independ- ent traders, working in shabby offices or their spare bedrooms, who gain small but steady and growing profits year-in and year-out, quite unlike the stereotypical reckless day traders of the popular imagi- nation. In fact, many independent traders that I know of have not only survived the periods when big funds lost billions, but actually thrived in",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "strategies",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:43.611406"
}