{
  "id": "1f45a5ddfda0",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 18,
  "content": "it has been great this year [2022]. I believe there was a long period beginning in 2011 and lasting through 2018 when trend-following systems of this type performed poorly. Yes, that was the era of the “Fed put” [the belief that the Federal Reserve would step in with accommodative monetary policy to support U.S. equity markets whenever they came under severe pressure]. This era was detrimental for trend-following systems and a time when buying the dips in stock prices was the optimal strategy. The problem with these futures trend- following strategies is they have big drawdowns. I’ve never tried trading that approach, but some of my users were interested, so I put it in there. The software comes with a library of about 50 sample systems, including ones similar to the ones I trade but not precisely the same. Is your software designed to work with any specific price data? It works best with Norgate data, an Australian company with the best daily data for equities. Their data includes all the delisted symbols and the historical index constituency. If you’re building a system that trades the stocks in the S&P 500, and you run a backtest using the current components of the index, your results will be badly distorted by survivorship bias. To test the system correctly, you need to run your simulation based on the stocks that were part of the index on every past date, not the stock list based on the current components of the index. RealTest uses Norgate’s index constituency data to include the correct index components for each past date. 58 I see. Without that type of data adjustment, your test will miss the worst- performing stocks in the index, which are the stocks that have fallen out of the index. That’s right. With Norgate data, your test will include stocks like Enron and WorldCom, which went bankrupt and are no longer in the index. Even more importantly, it will exclude recent high-fliers like Tesla before they became part of the index, which I would call a “look ahead bias.” Any change in the strategies you trade? I’ve added two mean-reversion strategies that don’t hold positions overnight. They fade a big move during the day, then exit on the close. One of these strategies takes only longs and the other only shorts. They have done quite well and have helped smooth out my results. Do you deliberately trade an equal number of long and short strategies? Yes. I currently trade three long and three short strategies, which roughly balance each other. This balance between shorts and longs is the main reason my results are relatively smooth over time. Any other changes in your trading system? Another change is that I reduced my position size from 10% per position to 5%. This reduced position size was partly in response to the increased market volatility and partly because I changed my system to allow two strategies to hold the same stock (only one of them overnight). Another innovation, which was influenced by the short squeezes in meme stocks, was to prohibit shorts in any stock in which margins were raised to 50% or higher. It was not a rule I backtested because I don’t have the historical margin data. It was just a risk management rule that kept me out of many losing trades. If I notice I’m losing money faster than usual, I tend to look at what’s going on so I can make changes that I think will help stop the bleeding. The margin rule was one of these cases. 59 Michael Kean Complementary Strategies Three years later I noticed that in February–March 2020, when we had the Covid bear market, you got away without much damage. How did you sidestep that selling wave? I remember a Friday night when Trump held a press conference admitting Covid was an issue. The market had been in freefall, but it had a big rally on that day, gaining about 5%. As the market was soaring, I bought enough puts to hedge my entire long position. Were you waiting for a bounce to hedge? I was. That weekend the Fed had an emergency meeting, and I was upset because I had just spent a lot of money insuring my portfolio, and now the Fed was going to bail everything out. But what actually happened was the market had one of its largest one-day declines on the Monday. I covered my entire put position and made about 4% that day, while the market was down about 8% to 10%. Why did you cover your hedge so quickly? My thesis was that the world would go into a lockdown within a few weeks, and the market would bottom when it did. I saw April 2020 was one of your best months ever. You apparently caught the bull market that followed the Covid crash very early. What told you that first upmove was the beginning of a sustained recovery instead of just a bear market bounce? 60 I was fairly bullish as the market crashed in March because I thought the Fed and the government would throw everything they could at keeping the system going, and that is exactly what they eventually did. I was buying in March as the market was falling. For a week or two, I was losing money along with everyone else. But the big gain I made on my put hedge earlier in the month enabled me to be more aggressive, and I progressively added to my longs through March. So, I was already heavily long by the time the market bottomed in late March. How did your net long position at that market bottom compare with your normal net long position? I was about 80% net long, which is above the top end of my usual range of 40%–70%. This year [2022], the market is down over 20% year-to-date, but you are down only about 6%. How did you keep your losses so contained? During",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.180898"
}