{
  "id": "64fe12c54daa",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 41,
  "content": "low transaction costs. Since adjustments cost him practically nothing in relation to the expected theoretical profit from a hedge, he is willing to make frequent adjustments. However, a retail customer who establishes the same hedge will probably not adjust, or will adjust less frequently, because any adjustments are likely to significantly reduce the profitability of a hedge. But if he understands the laws of probability, the retail customer will realize that his position has the same favorable odds as the professional trader’s position. At the same time he should realize that his position is more sensitive to short-term bad luck. Even though the retail customer may occasionally experience larger losses than the professional trader, he will also occasionally experience larger profits. In the long run, on average, both should end up with approximately the same profit.4 Taxes may also be a factor in evaluating an option strategy. When positions are initiated, when they are liquidated, how the positions overlap, and the relationship between different instruments (options, stock, futures, physical commodities, etc.) may have different tax consequences. Such consequences can often have a significant impact on the value of a diversified portfolio, and for this reason portfolio managers must be sensitive to the tax ramifications of a strategy. Since each trader has unique tax considerations, and this book is intended as a general guide to option evaluation and strategies, we will simply assume that each trader wishes to maximize his theoretical pre-tax profits and that he will worry about taxes afterward. 4. This of course ignores the very real advantage the professional trader often has from being able to buy at the bid price and sell at the ask price. A retail customer can never hope to match the profit resulting from this advantage, nor should he try to do so. Using an Option’s Theoretical Value 89 Returning to our example in Figure 5-1, note that after the hedge was initiated no subsequent trades were made in the option market. The trader’s only concern was the volatility, or price fluctuations, in the underlying market. These price fluctuations determined the size and the frequency of the adjustments, and in the final analysis it was the adjustments which determined the profitability of the hedge. We might think of the hedge as a race between the loss in time value of the June 100 calls and the cash flow resulting from the adjustments, with the theoretical pricing model acting as the judge. The model says that if options are purchased at less than theoretical value, the adjustments will win the race; if options are purchased at more than theoretical value, the loss in time value will win the race. The conditions of the race are determined by the inputs into the theoretical pricing model. While we assumed in our example that the future volatility was known to be 18.3%, we might ask what the outcome would have been had volatility been other than 18.3%? Suppose, for example, it turned out to be higher than 18.3%. Higher volatility means greater price fluctuations, resulting in more and larger adjustments. In our example, more adjustments mean more profit. This is consistent with the principle that options increase in value as volatility increases. What about the reverse, if volatility had been less than 18.3%? Lower volatility means smaller price fluctuations, resulting in fewer and smaller adjustments. This would have reduced the profit. If the volatility were low enough, the adjustment profit would just be enough to offset the other components, so that the total profit from the hedge would be exactly zero. This break-even volatility is identical to the option’s implied volatility at the trade price. Using the Black model, we find that the implied volatility of the June 100 call at a price of 3.25 is 14.6%. At that volatility the race between profits from the adjustments and the loss in the option’s time value will end in an exact tie. Above a volatility of 14.6% we expect the hedge, including adjustments, to show a profit; below 14.6% we expect the hedge to show a loss. Since we needed to make adjustments in order to realize a profit, it may seem that every profitable hedge requires us to maintain the position until expiration. In practice, however, this may not be necessary. Suppose, for example, that immediately after we established the hedge the implied volatility in the option market began to increase. Suppose that it increased from 14.6%, the implied volatility when we bought the June 100 calls, to 18.3%, the future volatility over the life of the option. What would happen to the price of the June 100 call? Its price would rise from 3.25 (an implied volatility of 14.6%) to 3.88 (an implied volatility of 18.3%). We could then sell our calls for an immediate profit of .63 per option. Of course, if we wanted to close out the hedge we would also have to buy back the 57 June futures contracts which we originally sold. What effect would the change in implied volatility have on the price of the futures contracts? Implied volatility is a characteristic associated with options, not with under- lying contracts. For this reason we would expect to see the underlying futures contract continue to trade at its original price of 101.35. By purchasing our 57 outstanding futures contracts at 101.35 we would realize an immediate total profit from the hedge of 63.00, exactly the amount predicted by the theoretical pricing model. If we could do all this, there would be no reason to hold the position for the full ten weeks. 90 Chapter 5 How likely is an immediate reevaluation in implied volatility from 14.6% to 18.3%? While violent changes in implied volatility are possible, they are the exception rather than the rule. Changes usually occur gradually over a period of time, and are the result of equally gradual changes in the volatility of the underlying contract. As the volatility of the underlying contract changes, option demand either rises or falls,",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.428698"
}