{
  "id": "fb879456a085",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 38,
  "content": "the necessary corrective work. 43 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 250T RADE MINDFULLY ■ Notes 1 . C h ar l ie Ma h er , Sport Ps ychology Resource Guide: Building Per formers through Programs, Services, an d Systems (Unpu bl is h e d manuscript, 2003). 2. Russ Harris, “T h e Art o f a Min df u l S.T .O.P ., ” Happiness Trap News l etter, Octo b er, 2013, accesse d Ju l y 8, 2014, h ttp://contextua l science.or g /post/t h e_art_o f _a_min df u l _stop. 3 . C h ar l ie Ma h er , Sport Ps ychology Resource Guide: Building Per formers through Programs, Services, an d Systems (Unpu bl is h e d manuscript, 2003). Exercise 10.2 Mental Skills Inventory—Effective Execution Mental Domain Rating Self‐Confi dence I believe in and trust my abilities in interacting effectively with the markets, especially executing, managing, and exiting my trades. I am clear about the things that I can control. I focus on these and not on things that are not within my control. Emotional Intensity I trade with an effective level of energy and emotional intensity. I monitor my energy and emotional intensity while trading and make adjustments as needed. Focus I maintain effective focus on the trading task at hand. I know the factors that can be distracting and use mindfulness routines when I am vulnerable to distractions. I focus on process rather than results. Poise I remain poised while trading, even in challenging situations. I can recognize when I am vulnerable to losing composure and take the necessary steps before losing it. 44 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 251 The Trading Psychology Process: g C onstructiv e y gy S e lf ‐Assessmen t CHAPTER 11 Jenna traded the popular commodities, includin g Crude Oil and Gold futures. She had developed good technical skills and was a net profi table trader. Al - though enjoying success and profi ts, Jenna could be a better trader than her re- sults refl ected. What held her back was that she did not know that she frequently committed similar errors. For example, Jenna liked to test her refl exes at the be- ginning of the trading day by putting on an aggressive trade to see how she and the market responded. Being aggressive, these trades often went against her. At times, the market went swiftly through her mental stop. When this occurred, she froze and took a much greater loss than anticipated. This would adversely affect her trading the rest of the morning, making her much more cautious. Like many traders, at the end of the day Jenna recorded her trades. She never made more than a cursory review of her trades or her performance fo r that day, however. Therefore, she was blind to the fact that she was making the same errors over an d over again. Not only was she committing trading errors described above, she was also committing an error with respect to process. W h at was missing in Jenna ’ s process was Constructive Se lf ‐Assessment. Wit h- o ut t h is critica l proce d ure, w h ic h inc l u d es a review o f h er tra d ing per f or - mance, s h e k ept h erse lf in t h e d ar k —s h e d i d n ’ t rea l ize s h e was ma k ing t h e same 263THE TRADING PSYCHOLOGY PROCESS W h en using t h e Tra d er ’ s Per f ormance Assessment, k eep in min d t h at we are l ess concerne d a b out resu l ts t h an t h e tra d ing process. Ma k ing t h ree winning tra d es in a row wou ld not b e consi d ere d a tra d ing strengt h on its own, f or examp l e. It is muc h more im - portant to k now w h at you d i d to se l ect t h ree winning tra d es an d h ow t h ese t h ree win - ning trades refl ected your personal strengths. This might exhibit several specifi c abilities, inc l u d ing i d enti f ying h ig h o dd s tra d es, waiting patient l y f or t h em to f u ll y set up, pu ll ing t h e trigger in t h e rig h t p l ace, an d h o ld ing t h em to t h eir l ogica l pro fi t o b jective. When using this assessment protocol, keep in mind that both technical and mental f actors are important an d s h ou ld b e note d . W h en i d enti f ying l imitations, f or ex - amp l e, you mig h t recognize t h at, a l t h oug h your pro fi t target on a l ong tra d e was h ig h er, you c l ose d t h e tra d e a f ter it reac h e d",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:45.722188"
}