{
  "id": "5b5f0885559d",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 26,
  "content": "it. It is not necessary to examine each possibility in detail, because they are all conceptually the same. The market reaches the neighborhood of the ﬁrst proﬁt target and simply is not able to trade very far beyond that target. For traders taking partial proﬁts here, these patterns are not even actually failures; the ﬁrst target was reached. The important point is that traders should always be on guard for potential failure at this area, particularly in the area of previous pivots (e.g., the high of the setup trend leg preceding the pullback). There are many possibilities for trade management, depending on the trader’s per- sonality and the details of the exact trading plan. Many traders prefer to exit some portion of their pullback trades at these targets, with the idea that they will be able to endure a failure at the target without a substantial loss. In fact, by booking partial proﬁts and re- ducing the position size, many times it is possible to walk away from this kind of failure with a proﬁt on the overall trade. Figure 3.24 shows an example of a failure at the ﬁrst proﬁt target in the GBPUSD. A sustained downtrend made a complex pullback (note also the failure entry at the top of the pullback, similar to Figure 3.22 inverted), which broke down and failed to extend beyond the previous swing low. A trader on guard for this fail- ure could certainly have booked a proﬁt on the trade, even though the actual downswing was much smaller than previous downswings. There are several issues to consider here. First, of the three possibilities (failure in- side, precisely at, or beyond the setup leg’s extreme), the one that actually trades beyond the previous pivot to make a marginal new high or low before failing is the most treacher- ous. The reason is that there are likely to be more trapped trend traders, and more traders @ES-Daily E •• -rm r S&P 500 Conf rnuous Contract [Jun11 I '11 Feb l A Apr May 1,280.00 1,260.00 1,240.00 1,220.00 1,200.00 1,180.00 20.00 10.00 0.00 -10.00 -20.00 34 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 77 FIGURE 3.24 A Pullback in the GBPUSD Fails Near the Trend Extreme who will be aggressive about adjusting their positions as the market retreats from that extreme; this can lead to very sharp countertrend momentum on these failures. The sec- ond issue is a mechanical one. If you intend to take proﬁts around these previous swings, spend some time considering how you will do this. What percentage of the position will you exit? Will you do it by bidding or offering at the previous extreme, or will you wait to see the market fail? (Note that waiting for the failure can result in substantial slippage at times.) If you do exit part of the position, will you ever add it back? As you consider the theory and structure of markets, also begin to consider them within the framework of an applied trading plan. TREND ANALYSIS There are many tools in technical analysis for identifying and analyzing trends. The choice of which to use will depend on many factors: your personality, your trading style, what kind of trend you want to identify, where (in terms of the age of the trend) you want P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 78 MARKET STRUCTURE FIGURE 3.25 Higher Highs and Higher Lows in an Idealized Dow Theory Uptrend to identify it, and how you want to trade it. A trader looking for mature trends in mar- kets that trend well might simply look for charts that “begin at one corner of the chart and travel to the other.” This might seem to be an overly simplistic approach to ﬁnding trending markets, but it works for certain kinds of traders. Other traders might look for subtle patterns and momentum shifts that suggest a trend might be turning, with the idea that they will aggressively pursue entries at those spots so that they have bought the low or sold the high if a new trend develops. All of these approaches are valid, but let’s begin with a broad, structural approach to trend identiﬁcation. This is pure market structure approach based largely on the work of the early authors who laid out the principles of what became known as the Dow Theory. Dow Theory Trend Patterns An uptrend is a pattern of successively higher pivot highs (HHs) and higher pivot lows (HLs) (see Figure 3.25). Both are important. Most people readily accept a deﬁnition of an uptrend that requires higher highs; this is intuitive, but it is easy to overlook the im- portance of accompanying higher lows; if a market is only making higher highs, but is not also clearly holding higher lows, the buyers are not solidly in control of that market. Conversely, a downtrend is a series of both lower lows (LLs) and lower highs (LHs) (see Figure 3.26). This is perhaps the most elementary deﬁnition of trend possible on any time frame. FIGURE 3.26 Dow Theory Downtrend with Lower Lows and Lower Highs Us Oolar It\" h Pound I GBPUSO - Daily Br IS '10 1.68000 35 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 78 MARKET",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.699201"
}