{
  "id": "192241784fd4",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 23,
  "content": "of the war. As for my father, he escaped from a labor camp with his brother. I wish I remembered how they escaped, but I guess I was told the story when I was young and don’t recall more detail. I also know that my father, who was German, was living in Germany near the end of the war, passing as a gentile. Two weeks before the end of the war, he was walking his German Shepard and was stopped by two Gestapo officers. They initially argued with each other, one insisting that my father was not Jewish and should be left alone, but the other officer prevailed, and they arrested him. Fortunately, it was near the end of the war, and he was freed shortly afterward, but that is another detail I don’t remember. Actually, that is something I remember from interviewing your mother for an essay I did on the Holocaust in grade school, and I will never forget it. Your father was in a transport with other Jews on a truck on the way to a camp. Americans stopped the truck, and that’s how your father was liberated. When you went to college, did you know what you wanted to do for the rest of your life? In high school, I liked math and thought I wanted to major in it in college. There was a calculus class for seniors, but it conflicted with another class I needed as a requirement. I tried speaking to the principal to resolve the conflict, but it didn’t help. I remember feeling very frustrated because I knew not being able to take that class would be an impediment to my goal, and I couldn’t do anything about it. I tried teaching myself calculus but had trouble fully grasping it. I still started as a math major in college, but by my sophomore year, I realized I wasn’t good enough at it. I always believed that in choosing a career, it has to be something you like but also something you are good at. Math fulfilled the first requirement but not the second. Fortunately, as a freshman, I also took courses in microeconomics and macroeconomics, both taught by the same professor. The introductory year of economics was conducted in this large lecture hall with hundreds 72 of students, which was not ideal, but the instructor was excellent. I liked economics, and by my sophomore year, I switched my major. Did you have any idea of what type of job you wanted to pursue with an economics degree? No, I just figured economics would have a lot of practical applications. Why did you decide to go to graduate school? There wasn’t any decision involved. It was just a natural given that I would go for an advanced degree after college. It was like you get up; you brush your teeth. You graduate college; you go to graduate school. Was that true of your group of friends as well? It was. They all went on to advanced degrees, including biomedical science, nephrology, gastroenterology, psychology, and math. You wouldn’t stop at college. It wasn’t a consideration. That was true of every friend that I had. It was also my natural inclination. How did you choose which graduate schools to apply to? I applied to about a dozen universities with well-regarded economics programs, about half of which I considered reach schools, including Stanford, MIT , Chicago, and Brown. I received several acceptances, the best one being from Brown, an offer that also included a scholarship, making it even more attractive. All my other reach schools were rejections. One side note: Many years later, I received a small royalty check from the University of Chicago because a section of one of my books was being used in one of their courses. I have to admit I got a kick out of my book being used in a university that rejected me. My attendance at Brown, however, was almost prevented. My senior year in college coincided with the first lottery held for the Vietnam draft. Now, I have to provide some background context here. In my early years of college, I was pro-government, a stance that was primarily a reaction to the SDS (Students for a Democratic Society), a radical anti-war group. I hated their tactics of shutting down colleges as a protest against the war. However, I was always a close follower of the news and political events. My views changed as I discovered the government was guilty of lying 73 about crucial aspects of the war. I thought the war was a monumental mistake and not worth risking my life for. I just got to the point where my attitude was, “A curse on both their houses.” At that point, I was antiwar. I knew I didn’t want to risk my life for a war I believed was a colossal blunder and waste. At the time of the first draft lottery, it was estimated that if your birthday had a number in the mid-200s or higher, you had a good chance of not being drafted. I remember listening to the lottery live, with each draw, hoping that my birthday would not be chosen. My birthday ended up being number 64, which was a guaranteed ticket to Vietnam. Weren’t you excluded from the draft as a student? At the time, there was student deferment for college but not graduate school. What did you do? National Guard and reserve units were not being sent overseas at that time. My plan was to immediately enlist in one of those. I started calling various units in Brooklyn, looking for one that had openings. The one I found was a national guard unit in Bedford–Stuyvesant. The next morning, I enlisted and was sworn in. Five months later, in May 1970, I was sent to Fort Polk, Louisiana for basic and advanced training. It was the most miserable weather I had ever experienced. It was over 90 degrees and humid when I",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.181613"
}