{
  "id": "6325db6d15d5",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 31,
  "content": "a fairly immediate meltdown. Being responsive to informa- tion often allows a trader to reduce losses on losing trades, and, ideally, to position on the correct side of the trade. One- to Three-Bar Trend Lines In general, the signiﬁcance of a trend line depends on the signiﬁcance of the points used to deﬁne the line. However, there are some special cases where very short-term trend lines may give good trading signals. Charles Drum- mond (1980) has used these short-term trend lines as the foundation for his Drummond SNX _ Weekly S&P 500 Index 1,200.00 1,150.00 1,100.00 1,050.00 1,000.00 950.00 900.00 850.00 '10 ·11 41 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 89 FIGURE 3.37 A Break of the Parallel Trend Line Can Often Lead to an Accelerated Trend (Daily Silver Futures) Geometry, a unique and interesting perspective on the traditional concepts of support and resistance. In addition, Al Brooks (2009) writes about similar usage of short-term trend lines primarily applied to intraday trading, which he calls Micro Trendlines. Newer traders might be best off avoiding these lines, as there is the temptation to simply con- nect any two points on a chart to see what happens. It is easy to become sidetracked and spend much time drawing, erasing, and redrawing trend lines, when they should be focusing on the bigger-picture trend structure as it develops. At some point in their de- velopment as traders, they may ﬁnd that these small trend lines offer some interesting opportunities for precisely timing entries. The two-day line drawn from the day before yesterday’s low to yesterday’s high, and extended into today’s space on the chart will often deﬁne areas where the market is likely to exhaust itself in an overextended condition. (The corresponding downtrend line can be drawn from the day before yesterday’s high to yesterday’s low, and into today’s price range.) This line is not even a trend line proper, in that we do not look for the slope of the line to contain prices or to deﬁne the trend. Rather, the point where the line intersects today’s prices is a potential reversal or inﬂection point. As with all trend @Sl(D) - Daily Siver Continuous Contract [Jul11] Oct '11 Apr 42 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 90 MARKET STRUCTURE FIGURE 3.38 Trend Lines Drawn between Two Bars Can Provide Good Inﬂections on the Next Bar lines, there is no magic here; it works because markets tend to oscillate within certain volatility levels that can be geometrically deﬁned by the previous movements of that market. Figure 3.38 shows examples of these very short trend lines, but these are only a few isolated examples. One good application for these short-term trend lines occurs frequently in pullbacks. These pullback patterns often have fairly clean boundaries of support and resistance, and small trend lines can be drawn over, under, or touching multiple bars in a row. (This is an exception to the rule earlier that trend lines should deﬁne relationships between real swings in the market.) A very common pattern is to see these short-term trend lines violated for short periods of time, and for the recovery from that break to actually be the catalyst for a move in the opposite direction of the break. For instance, Figure 3.39 shows a clean buy off a (nonstandard) trend line at the bottom of a pullback in an uptrend. Nor- mally, this would probably not be an attractive spot to initiate a long, as we try to avoid buying after a buying climax, but the duration of the consolidation was sufﬁcient to work off the climax condition. The market consolidated long enough that it was reasonable to attempt a long trade. If you had been looking for a spot to buy this market, note how @ES.D - Daily E-mini S&P 500 Continuous Contract [Jun11) 1,360.00 J , ,350.00 1,340.00 1,330.00 1,320.00 1,310.00 1,300.00 18 25 May 9 43 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 91 FIGURE 3.39 The Break of the Trend Line under the Pullback Was the Catalyst for the Move the break of the very small trend line actually provides the entry point. You will have to decide how you want to manage the risk in these trades, but one simple way might be to wait for the market to recover back above the trend line, and then to buy with a stop just under the low of the bar that broke the trend line. It is always important to ask why a pattern should work. In this case, there is a good explanation. The little spike beyond the short-term trend line is a buying or selling climax on lower time frames, so it is a natural exhaustion point for the countertrend move. Fur- thermore, there will be traders who exit their positions when those trend lines are bro- ken, and they will be forced to chase",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.700059"
}