{
  "id": "8e84d3d74120",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 2,
  "content": "a Mean-Reverting Time Series. . . . . . . . . . . . . . . . . . . . . . . . . . . . .88 S easonal Trading Strategies . . . . . . . . . . . . . . . . . . . . . . . 90 Example 7.6: Backtesting the January Effect. . . . . . . . . . . .90 Example 7.7: Backtesting a Year-on-Year Seasonal Trending Strategy . . . . . . . . . . . . . . . . . . . . . . . . . 94 A S easonal Trade in Gasoline Futures. . . . . . . . . . . . . . . . . .98 A S easonal Trade in Natural Gas Futures. . . . . . . . . . . . . . . .99 Summary . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 100 References . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 102 Cha pter 8 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .103 References . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 103 A ppendix 104 Bibliogr aphy 110 Ab out the Author 114 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 1 11 CHAPTER 2 T his is the surprise: Finding a trading idea is actually not the hardest part of building a quantitative trading business. There are hundreds, if not thousands, of trading ideas that are in the public sphere at any time, accessible to anyone at little or no cost. Many authors of these trading ideas will tell you their com- plete methodologies in addition to their backtest results. There are finance and investment books, newspapers and magazines, main- stream media websites, academic papers available online or in the nearest public library, trader forums, blogs, and on and on. Some of the ones I find valuable are listed in Table 2.1 , but this is just a small fraction of what is available out there. In the past, because of my own academic bent, I regularly perused the various preprints published by business school profes- sors or downloaded the latest online finance journal articles to scan for good prospective strategies. In fact, the first strategy I traded when I became independent was based on such academic research. (It was a version of the PEAD strategy referenced in Chapter 7 .) Increasingly, however, I have found that many strategies described by academics are either too complicated, out of date (perhaps the once-profitable strategies have already lost their power due to com- petition), or require expensive data to backtest (such as historical fundamental data). Furthermore, many of these academic strategies Fishing for Ideas Where Can We Find Good Strategies? Chan800064_c02.indd 11 6/7/2021 7:17:55 AM 2 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 12 QUANTITATIVE TRADING work only on small-cap stocks, whose illiquidity may render actual trading profits far less impressive than their backtests would suggest. This is not to say that you will not find some gems if you are persistent enough, but I have found that many traders’ forums or blogs may suggest simpler strategies that are equally profitable. You might be skeptical that people would actually post truly profitable strategies in the public space for all to see. After all, doesn’t this disclosure increase the competition and decrease the profitability of the strategy? And you would be right: Most ready-made strategies TABLE 2.1 Sources of Trading Ideas Type URL Academic Business schools’ finance professors’ websites www.hbs.edu/research/research.html Social Science Research Network www.ssrn.com National Bureau of Economic Research www.nber.org Business schools’ quantitative finance seminars www.ieor.columbia.edu/seminars/ financialengineering Quantpedia (aggregator of all academic papers on quantitative trading strategies!) quantpedia.com Financial blogs and podcasts Flirting with Models www.thinknewfound.com Mutiny Fund mutinyfund.com/podcast/ Chat with Traders chatwithtraders.com Eran Raviv eranraviv.com Sibyl/Godot Finance godotfinance.com Party at the Moontower moontowermeta.com My own! epchan.blogspot.com Trader forums Elite Trader www.Elitetrader.com Wealth-Lab www.wealth-lab.com Twitter Benn Eifert @bennpeifert Corey Hoffstein @choffstein Quantocracy (retweet of new articles) @Quantocracy Mike Harris @mikeharrisNY Euan Sinclair @sinclaireuan My own! @chanep Newspaper and magazines Stocks, Futures and Options magazine www.sfomag.com Chan800064_c02.indd 12 6/7/2021 7:17:56 AM 3 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 14 QUANTITATIVE TRADING epchan.blogspot.com/2007/11/seasonal-trades-in-stocks.html and the reader’s comment therein. This strategy is described in more detail in Example 7.6.) Of course, I would not have traded this strategy without backtesting it on my own anyway, and indeed, my subse- quent backtest confirmed his findings. But the fact that my reader found significant flaws with the strategy",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:43.603523"
}