{
  "id": "216d501d600b",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 96,
  "content": "trader is trying to maximize the return on his investment when he is right and minimize the loss when he is wrong. Why might a trader with a directional opinion prefer a vertical spread to an outright long or short position in the underlying instrument? For one thing, a vertical spread is much less risky than an outright position. A trader who wants to take a position which is 500 deltas long can either buy five underlying contracts or buy 25 vertical call spreads with a delta of 20 each. The 25 vertical spreads may sound riskier than five underlying contracts, until we remember that a vertical spread has limited risk while the position in the underlying has open-ended risk. Of course, greater risk also means greater reward. A trader with a long or short position in the underlying market can reap huge rewards if the market makes a large move in his favor. By contrast, the vertical spreader’s profits are limited, but he will also be much less bloodied if the market makes an unexpected move in the wrong direction. Experienced traders accept the fact that they are human, and that their directional forecasts will occasionally be wrong. When that happens the vertical spreader has a distinct advantage over the trader with an outright position in the underlying market. By intelligently estimating volatility, an option trader can decide whether he wants time working for or against him. When he chooses to have time on his side (positive theta), he can sometimes show a profit when the outright trader either breaks even or shows a loss. When he chooses to have time working against him (positive gamma), the option trader’s losses when he is wrong about market direction will often be less than the losses from an outright underlying position. a 11 - Option Arbitrage One important characteristic of options is that they can be combined with other options or underlying contracts to create positions with characteristics which are almost identical to some other contract or combination of contracts. This type of replication leads to a new category of trading strategies which are unique to the option market. SYNTHETIC POSITIONS Suppose a trader has the following position where all options are European (no early exercise permitted): long a June 100 call short a June 100 put What will happen to this position at expiration? It may seem that one cannot answer the question without knowing where the underlying contract will be at expiration. Surprisingly, the price of the underlying contract does not affect the outcome. If the underlying contract is above 100, the put will expire worthless, but the trader will exercise the 100 call. This results in his buying the underlying contract at 100. Conversely, if the underlying contract is below 100, the call will expire worthless, but the trader will be assigned on the 100 put. This also results in his buying the underlying contract at 100. Ignoring for the moment the unique case when the underlying contract is right at 100, at June expiration the above position will always result in the trader going long the underlying instrument at the exercise price of 100. He will go long, either by choice (the underlying contract is above 100 and he exercises the 100 call} or by force (the underlying contract is below 100 and he is assigned on the 100 put}. We refer to this position as a synthetic long underlying. The position has the same characteristics as the underlying contract, but won’t actually become an underlying contract until expiration. If the trader takes the opposite position, selling a June 100 call and purchasing a June 100 put, he has a synthetic short underlying. This position will always result in his selling the underlying contract at the exercise price of 100, either by choice (the underlying contract is below 100 and he exercises the 100 put) or by force (the underlying contract is above 100 and he is assigned on the 100 call). 213 214 Chapter | I We can express the foregoing relationships as follows: synthetic long underlying = long call + short put synthetic short underlying = short call + long put where all options expire at the same time and have the same exercise price. A synthetic position acts very much like its real equivalent. For each point the underlying instrument rises, a synthetic jong position will gain approximately one point in value and a synthetic short position will lose approximately one point in value. This leads us to conclude, correctly, that the delta of a synthetic underlying position is approximately 100. If the delta of the June 100 call is 75, the delta of the June 100 put will be approximately —25. If the delta of the June 100 put is -60, the delta of the June 100 call will be approximately 40. Ignoring the positive sign associated with a call and the negative sign associated with a put, the deltas of calls and puts with the same underlying contract, expiration date, and exercise price will always add up to approxi- mately 100. As we will see, interest rates, as well as the possibility of early exercise, can cause the delta of a synthetic underlying position to be slightly more or less than 100. But for most practical calculations, traders tend to look at a synthetic underlying position and mentally assign it a delta of 100. Rearranging the components of a synthetic underling position, we can create four other synthetic relationships: synthetic long call = long an underlying contract + long put synthetic short call = short an underlying contract + short put synthetic long put = short an underlying contract + long call synthetic short put = long an underlying contract + short call Again, all options must expire at the same time and have the same exercise price. Each synthetic position has a delta approximately equal to its real equivalent and will therefore gain or lose value at approximately the same rate",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.437015"
}