{
  "id": "24fee09296d9",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 30,
  "content": "of 1.25 or less approximately two trading days out of every three, and a price change of 2.50 or less approximately 19 trading days out of every 20. Only one day in 20 would we expect to see a price change of more than 2.50, We can do the same type of calculation for a weekly standard deviation. Now we Must ask how many times per year prices can change if we look at prices once a week. Unlike trading days, we don’t have “holiday” weeks, so we must make our calculations using all 52 trading weeks in a year. Dividing our annual volatility of 20% by the square root of 52, or approximately 7.2, we get 20%/7.2 = 2%. For our futures contract —__ 2. Depending on holidays, the number of trading days is usually somewhere between 250 and 255. We use 256 as a reasonable approximation since its square root is a whole number and therefore easier to work with. 66 Chapter 4 trading at 100, we would expect to see a price change of 2.75 or less two weeks out of every three, a price change of 5.50 or less 19 weeks out of every 20, and only one week in twenty would we expect to see a price change of more than 5.50. Since we assume that the price of a stock will appreciate by the carrying cost, it may seem that we cannot use the same method (divide by 16 for daily volatility; divide by 7.2 for weekly volatility) to approximate expected movement in an underlying stock. However, over a short period of time, the carrying cost component, like the effect of continuous compounding of volatility, will be relatively small. Therefore, we can use the same method as a reasonable estimate of daily and weekly volatility. For example, suppose a stock is trading at $45 per share and has an annual volatility of 28%. What is an approximate one standard deviation price change over a day’s time and over a week’s time? For a daily volatility we calculate: 28%/16 x $45 = 1.75% x $45 = $.79 For a weekly volatility we calculate: 28%/7.2 x $45 = 3.89% x $45 = $1.75 We expect to see a price change of approximately 3/4 point or less two days out of every three, 1! points or less 19 days out of every 20, and only one day in 20 would we expect to see a price change of more than 114 points. On a weekly basis, we would expect to see a price change of 15/4 points or less two weeks out of every three, a price change of 3!/ points or less 19 weeks out of every 20, and only one week in 20 would we expect to see a price change of more than 314 points. We have used the phrase “price change” in conjunction with our volatility estimates. Exactly what do we mean by this? Do we mean the high/low during some period? Do we mean open to close price changes? Or is there another interpretation? While various methods have been suggested to estimate volatility,> the traditional method has been to calculate volatility based on settlement-to-settlement price changes. Using this approach, when we say a one standard deviation daily price change is ¥% point, we mean a 3% point price change from one day’s settlement price to the next day’s settlement price. The high/low or open/close price change may have been either more or less than ¥% point, but it is the settlement-to-settlement price change on which we focus. 3. See: Parkinson, Michael, “The Extreme Value Method of Estimating the Variance of the Rate of Return,” Journal of Business, 1980, vol. 53, no. 1, pp. 61-64. Garman, Mark B. and Klass, Michael J., “On the Estimation of Security Price Volatilities from Historical Data,” Journal of Business, 1980, vol. 53, no. 1, pp. 67-78. Beckers, Stan, “Variance of Security Price Returns Based on High, Low, and Closing Prices,” Journal of Business, 1983, vol. 56, no. 1, pp. 97-112. Volatility 67 VOLATILITY AND OBSERVED PRICE CHANGES Why is it important for a trader to be able to estimate daily or weekly price changes from an annual volatility? Volatility is the one input into a theoretical pricing model which cannot be directly observed. Yet many option strategies, if they are to be successful, require an accurate assessment of volatility. Therefore, an option trader needs some method of determining whether his expectations about volatility are indeed being realized in the marketplace. Unlike directional strategies, whose success or failure can pe immediately observed from posted prices, there is no posting of volatilities. A trader must determine for himself whether he is using a reasonable volatility input into the theoretical pricing model. For example, suppose a certain underlying contract is trading at 40 and a trader is using a 30% volatility for theoretical evaluation. A one standard deviation daily price change is approximately 30%/16 x 40 = .75. Over five days of trading a trader notes the following five settlement-to-settlement price changes: +.43, —.06, —.61, +.50, -.28 Are these five price changes consistent with a 30% volatility? The trader expects to see a price change of more than .75 (one standard deviation) about one day in three, or between one and two times over a five-day period. Yet during this five-day period he did not see a price change of this magnitude even once. What conclusions can be drawn from this?4 One thing is certain: these five price changes are not consistent with 30% volatility. The trader might explain the discrepancy in one of two ways. On the one hand, perhaps this was expected to be an abnormally quiet week (perhaps it was a holiday week); and next week when trading returns to normal the market will go right back to making moves which are more consistent with a 30% volatility. If the trader comes to this conclusion, perhaps he ought to continue to use a 30% volatility for his",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals"
  ],
  "created_at": "2026-02-05T08:09:54.426918"
}