{
  "id": "442c300e0e38",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 108,
  "content": "the price bars themselves. @TU - Daily 2 Year U.S. Treasury Notes Conmuous Contract 105'04.0 105'00.0 104'28.0 104'24.0 104'20.0 104'16.0 ~ O~M Modified MACO --- - -- - - -- - --- - 0.1000 ~ ~-- --- - _, ---[\\ ~~ 00000 ~ Vlf~ ~0.1000 Mar Apr May 170 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing Appendix B: A Deeper Look at Moving Averages and the MACD 421 FIGURE B.12 Note That Inﬂections in the Fast Line of the MACD Include Some Artifacts Due to the Indicator’s Construction The modiﬁed MACD is constructed from simple moving averages, so it suffers from the problem of dual inﬂections to single price shocks. In fact, the multiple moving aver- ages result in a complex reaction to single large events. This is rarely a signiﬁcant prob- lem when we are actually using the tool, but it can be an issue in some situations—for instance, in applying the tool to intraday data following a large overnight gap. Figure B.14 shows a situation that would be absurd in a real market: an otherwise ab- solutely ﬂat market with a single large price shock, immediately reversed the following day. Note that the MACD’s two lines have 12 inﬂections in response to this single bar! Again, this is not a tradable feature, but it does highlight the folly of trying to follow ev- ery move of the indicator too closely. In a real market situation, the indicator is nearly always irrelevant after a large price shock, and attention should be focused on other factors such as price action following the movement. So far, these theoretical data sets have been so clean that it may be difﬁcult to re- late them to situations that are likely to occur in actual trading. Consider next what happens when the MACD is applied to a data set that begins to more closely approxi- mate real market conditions, as in Figure B.15. This data set alternates uptrending and C D 171 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing 422 APPENDIX B: A DEEPER LOOK AT MOVING AVERAGES AND THE MACD FIGURE B.13 Consider the Inﬂections of the MACD Applied to an Actual Market downtrending legs, though it reduces them to consistent, idealized linear changes. Specif- ically, the down legs (BC and DA) are the same rate and length, while the up leg CD moves at a rate equal to 75 percent of AB’s changes. The indicator registers a lower peak at D compared to B, which would suggest to many traders that trend leg CD, though it made a new high relative to the point B, did so on lower momentum; this is an example of a so-called momentum divergence on the MACD. This example shows precisely what lower momentum means for the MACD: here it means that the lower-momentum leg had smaller daily changes compared to the higher-momentum leg. Note that, in this case, both legs were the same length in terms of number of bars, so the lower-momentum leg, overall, covered a smaller range of prices than the higher-momentum leg. If the lower- momentum leg had continued for more days it would eventually have moved the same distance as the higher-momentum leg, but it still would have shown a divergence with the indicator at the second peak. There is, however, another possibility, shown in Figure B.16, which has two uptrend- ing legs (AB and CD) that both move with the same rate of change. Here, the second leg (CD) is shorter, including fewer bars than the longer leg, and the indicator again registers AAPL • Daily Apple Inc i r ----------..... 9 16 23 I L • r I L l • L I I I B 30 Sep 7 13 - r . I I I C 20 L I I • 27 Oct4 2 .. . 2 .. . 2 .. . 2 .. . 2 .. . 2 .. . 2 .. . 2 .. . 2 .. . 2 .. . 2 .. . 1 .. . 6 .. . 2 .. . 172 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing Appendix B: A Deeper Look at Moving Averages and the MACD 423 FIGURE B.14 Multiple Inﬂections on the MACD Following a Single Price Shock FIGURE B.15 Momentum Divergence Due to Lower Rate of Change on the Second Leg l I t 1- 1- 1-t 1-t- 1-t -t - 1- , Ht - 1- 1-t 1-t -t-tH 1- 1- D 173 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp02 JWBT634-Grimes May 10, 2012 8:27 Printer: Hamilton Printing 424 APPENDIX B: A DEEPER",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options"
  ],
  "created_at": "2026-02-05T00:37:53.712373"
}