{
  "id": "10e64446768d",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 10,
  "content": "risk/reward characteristics of these positions are similar to long call positions, but now the limited risk is on the upside and the unlimited profit potential is on the downside. The position will break even if the underlying contract falls below the exercise price by exactly the amount of the option’s trade price. Below that break-even price the potential profit to the position is unlimited, increasing by one point for each point drop in the price of the underlying contract. Elementary Strategies 17 Figure 2-3 107 | long a 95 call at 5.50 — —— 8 long at 100 call at 2.70 64 long at 105 call at 1.15 --~~--~ = 44 ° a 2+ 95 100 / Lf | | | 0 1.15 {| y -24 { a a -5.50 ~ 8 / a -44 m4 y ~~ — -64 -8- -10 T T T T T 85 90 95 100 105 110 115 Figure 2-4 10 8+ short a 95 call at 5.50 short a 100 call at 2.70 ————— 64 «~— - short a 105 call at 1.15 ----- -- 5 ao Loss 85 90 95 100 105 110 115 18 Chapter 2 Figure 2-5 10 3 long a 95 put at 1.55 long a 100 put at 3.70 64 long a 105 put at 7.10 — ——~ — ge 4 2 a 41 0 se | { ~, 100 105 } -1.56 wo -25 \\ 3.70 wo “ . So! = — 7.10 -6 a . ee -85 -10 t 1 t ; 85 90 95 100 105 110 115 The short put positions in Figure 2-6 are inversions of the graphs in Figure 2-5. Each position has upside profit potential limited to the amount of the trade price, and a potentially unlimited loss similar to a long position in the underlying contract. Figures 2-3 through 2-6 illustrate two of the most important characteristics of options: buyers of options have limited risk and potentially unlimited reward; sellers of options have limited reward and potentially unlimited risk. More specifically, net buyers (sellers) of calls have unlimited upside reward (risk}, and net buyers (sellers) of puts have unlimited downside reward (risk). At this point, new traders tend to have a common reaction. Why would anyone ever want to do anything other than buy options? After all, a buyer of options has limited risk and unlimited profit potential, while a seller of options has limited profit potential and unlimited risk. Who in their right mind would choose the latter over the former? The prospect of unlimited risk certainly seems a good reason to avoid a trade. However, if a trader gives some thought to the matter, he will realize that almost any trade in a stock or commodity market carries with it unlimited risk. A violent adverse move which does not give a trader time to cover his position is always possible. Yet traders take long and short positions in stocks and commodities all the time. The only explanation must be that they believe the chances of sustaining a catastrophic loss must be small, so small that the potential profit justifies the risk of unlimited loss. Option traders learn that the limited or unlimited risk/reward characteristics of a trade are not the only considerations. At least as important is the probability of that Elementary Strategies 19 Figure 2-6 107 short a 95 put at 1.55 ~---> ~~~ short a 100 put at 3.70 short a 105 put at 7.10 ———_ va > a 8 > +7.10 Profit 105} +1.55 Loss 85 90 95 100 105 110 115 unlimited profit or loss. As an example, suppose a trader is considering a trade which has only two possible outcomes. In one case the trader will double his money; in the other case he will go broke. It may seem that a rational trader will avoid such a trade because the reward does not appear to justify the risk. But suppose the probability of the second outcome is only one chance in a million. Suppose in fact that the exact circumstances which will cause the trader to go broke have never before occurred. Now how does the trade look? The reward is still limited and the risk unlimited. Yet most traders would probably make the trade in spite of the potentially disastrous results. In addition to the potential risk and reward associated with any trade, a trader must also consider the likelihood of the various outcomes. Is the reward, even a limited one, Sufficient to offset the risk, albeit an unlimited one? Sometimes it is; sometimes it isn’t. COMBINATION STRATEGIES When considering an option trade we need not restrict ourselves to the purchase or sale of individual options. We can also combine option positions to form new positions with their own unique characteristics. Figure 2-7 shows the profit and loss at expiration from the combined purchase of a 100 call for 2.70, and a 100 put for 3.70. Here we have Paid a total of 6.40, which will be our maximum loss if both options expire worthless. This will happen only if the underlying contract is right at 100 at expiration. If the underlying contract is above 100 at expiration the put will be worthless, but the call 20 Chapter 2 Figure 2-7 8+ long a 100 call at 2.70 long a 100 put at 3.70 / 6 \\ Profit Loss -10 T T T T T 85 90 95 100 105 110 115 will act like a long underlying position, gaining one point in value for each point the underlying contract rises. If the underlying contract is below 100 the call will be worthless, but the put will act like a short underlying position, gaining one pointin value for each point the underlying contract falls. In order for the position to do no worse than break even, it must be worth at least the 6.40 we originally paid. This will occur if either the 100 call or the 100 put turns out",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management"
  ],
  "created_at": "2026-02-05T08:09:54.423752"
}