{
  "id": "f3191821d949",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 38,
  "content": "for less than its theoretical value can only expect to show a profit if he is allowed to play many, many times. On any one bet he will most likely lose, since there is only one way for him to win but 37 ways for him to lose. The same is true of our hedge. The odds may be on our side because we have purchased undervalued options. But in the short run our hedge might very well result in a loss. Is there anything we can do to offset the possibility of short-term bad luck? We know that in the long run the laws of probability are on our side. We can be fairly certain of making a profit if we are given the chance to make many bets at the same favorable odds. The more bets we make, the better our chances of making a profit identical to that predicted by the theoretical pricing model. One way to accomplish this is to approach the initial hedge as a continuing series of small bets. We can replicate the long-term probability by reassessing our position at regular intervals, and then making appropriate changes in the position so that each new interval represents a new bet. Suppose that one week later the price of the June futures contract has moved up to 102.26. At this point we can feed the new market conditions into our theoretical pricing model: June futures price = 102.26 Interest rate = 8.00% Time to June expiration = 9 weeks Volatility = 18.3% Note that we have made no change in the interest rate or volatility. The theoretical pricing model we are using, the Black model, assumes that these two inputs remain constant over the life of the option. Based on the new inputs we can calculate the new deita for the 100 call, in this case 62. The delta position is now: Contract Contract Delta Delta Position Long 100 June 100 calls 62 +6200 Short 57 June futures 100 -5700 Our total delta position is now +500. This is the end of one bet, with another about to begin. 84 Chapter 5 Whenever we begin a new bet we are required to return to a delta neutral position, In our example it will be necessary to reduce our position by 500 deltas. As we shall see later, there are a number of different ways to do this. But to keep our present calculations as simple as possible we will make the necessary trades in the underlying futures market, since an underlying contract always has a delta of 100. Here we wish to sell off 500 deltas, and we can do this by selling 5 futures contracts. Our delta position is now: Contract Contract Delta Delta Position Long 100 June 100 calls 62 +6200 Short 62 June futures 100 -6200 We are again delta neutral and about to begin a new bet. As before, our new bet depends only on the volatility of the underlying futures contract, and not on its direction. The extra five futures contracts we sold were an adjustment to our position. Adjustments are trades which are not necessarily made for the purpose of adding to the theoretical edge, although they may also have that effect. Rather, they are made primarily to ensure that a position remains delta neutral. In our case, the sale of the five extra futures contracts has no effect on our theoretical edge since futures contracts have no theoretical value.? The trade was made solely for the purpose of adjusting our hedge to remain delta neutral. The steps we have thus far taken illustrate the correct procedure in using an option’s theoretical value: 1. Purchase (sell) undervalued (overvalued) options. 2. Establish a delta neutral hedge against the underlying contract. 3. Adjust the hedge at regular intervals to remain delta neutral. Since volatility is assumed to compound continuously, theoretical pricing models assume that adjustments are also made continuously, and that the hedge is being adjusted at every moment in time. Such continuous adjustments are not possible in the real world, since a trader can only trade at discrete intervals. By making adjustments at regular intervals, we are conforming as best we can to the principles of the theoretical pricing model. Using the proper procedure, how would the adjustment process look if we were to carry the hedge to expiration? The results are shown in Figure 5-1. In our example adjustments were made at weekly intervals. At the end of each interval the delta of the June 100 call was recalculated from the time remaining to expiration, the current price of the underlying futures contract, the fixed interest rate of 8.00%, and the known volatility of 18.3%. Note that we have not changed the volatility, even though other market conditions may have changed. Volatility, like interest rates, are assumed to be 2. While a futures trader might talk about the theoretical value of a futures contract, from an option trader’s point of view the underlying contract has no theoretical value. The theoretical value is whatever price the trader thinks he can trade the contract at. Using an Option’s Theoretical Value as ‘ constant over the life of the option. In practice, a trader may, and often does, change his opinion about volatility. What will we do with our position at the end of ten weeks when the options expire? At that time we plan to close out the position by: 1. Letting any out-of-the-money options expire worthless. 2. Selling any in-the-money options at parity (intrinsic value) or, equivalently, exercising them and offsetting them against the underlying futures contract. 3. Liquidating any outstanding futures contracts at the market price. Let’s go through this procedure step by step and see what the complete results of our hedge were. Original Hedge: At June expiration (week 10) we can liquidate our June 100 calls by either selling them at 2.54, or by selling futures at 102.54 and exercising the calls. Either method will result in a",
  "word_count": 1000,
  "topics": [
    "options",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.428235"
}