{
  "id": "ce10576fcdcb",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 172,
  "content": "assumes. A trader typically encounters periods of high volatility where all the two and three standard deviation price changes seem to be bunched together. Or he encounters periods of low volatility where all the one standard deviation price changes seem to be bunched together. A graph of historical volatility is never a straight line. (For a good example of this, the reader should look again at Figure 14-2.) But the theoretical pricing model cannot differentiate between our two volatility scenarios. The model simply sees a volatility of 16.7% and assumes that all price changes are evenly distributed, and consistent with this volatility, over the life of the option. Suppose a trader were to buy a 105 straddle and assumed, correctly, a volatility of 16.7%. If he bought and sold underlying contracts in order to remain delta neutral over the life of the option, the model tells him, because it assumes a constant volatility of 16.7%, that the profit or loss to the trader will be identical in either of our scenarios. Is this likely to be the case? Notice that the underlying market is moving through 105 both at the beginning and at the end of the options’ life. We can therefore consider the 105 call and put as being at-the-money during these periods. Since at-the-money options have the highest gamma, the 105 straddle will be a relatively high gamma position both early and late in the spread’s life. Short-term at-the-money options always have greater gammas than long-term at-the-money options, so any increase in volatility which occurs during the latter part of the option’s life, as it does in Figure 18-2b, will have a much greater impact on the position than volatility which occurs during the early part of the option’s life, as it does in Figure 18-2a. Because the gamma of a position determines both the magnitude and frequency of the adjustment process, the 105 straddle will be much more valuable under the movement represented in Figure 18-2b. The movement back and forth through the 391 Models and the Real World ee ee ee ee a ee ee 0 ee DO s6 +00} +SOL FOL StL ez-eh einbi4 392 FOE OAT OO OO OO OO OO S6 -OOL SOL Olt StL qz-8) einbi4 Models and the Real World 393 exercise price late in the option’s life will require larger and larger adjustments, each of which is favorable to the holder of the 105 straddle. The scenario in Figure 18-2a will also require adjustments. But the adjustments now will be relatively small because the movement in the underlying contract is much less dramatic. Through experience most traders have come to the conclusion that the order in which volatility occurs does matter. It matters especially for at-the-money options, because they have the greatest gammas. Any period of high volatility which occurs near expiration will have a greater impact on an at-the-money option than the same high volatility which occurs when the option has a great deal of time remaining to expiration. Consequently, even if one knows the actual volatility over the life of an option, a model will tend to undervalue at-the-money options in a rising volatility market, and overvalue at-the-money options in a falling volatility market. We have only considered one alternative volatility scenario, where volatility is either increasing or decreasing. But there are an infinite number of paths which volatility might follow over the life of an option. A trader might even assume that volatility is itself random, and that predicting volatility with any degree of accuracy is not possible. Models which assume stochastic volatility do exist and might, under some conditions, be more suitable than a traditional pricing model. At the same time, such models add another dimension of complexity to a trader’s life, and for this reason are not widely used. Some contracts, by their very nature, are known to change their volatility charac- teristics over time. Interest rate products, in particular, fall into this category. As a bond approaches maturity, the price of the bond moves inexorably towards par. At maturity, regardless of interest rates, the bond will have a fixed and known value. Clearly, one cannot assume that the price of the bond follows a random walk through time. Even if one assumes that interest rates move randomly, and that the volatility of interest rates is constant, interest rate instruments will change their volatility over time because instruments of different maturities have different sensitivities to changes tn interest rates. If we take into consideration the fact that interest rates also vary for different maturities, a traditional Black-Scholes type model is obviously inadequate for the evaluation of such products. This has led to the development of special models to evaluate interest rate instruments.° 4. For amore detailed discussion see: Hull, John and White, Alan, “The Pricing of Options with Stochastic Volatilities,” Journal of Finance, Vol. 42, No. 2, June 1987, pages 281-300. Scott, Louis D., “Option Pricing when Variance Changes Randomly: Theory, Estimation, and Application,” Journal of Finance and Quantitative Analysis, No. 22, December 1987, pages 419-438. Wiggins, J.B., “Option Values under Stochastic Volatility: Theory and Empirical Results,” Journal of Financial Economics, No. 19, December 1987, pages 351-372. 5. See for example: Ho, Thomas, T.S.Y. and Lee, Sang-Bin, “Term Structure Movements and the Pricing of Interest Rate Contingent Claims,” Journal of Finance, Vol. 41, No. 5, December 1986, pages 1011-1029. Heath, David; Jarrow, Robert; and Morton, Andrew, “Bond Pricing and the Term Structure of Interest Rates: A New Methodology,” Econometrica, Vol. 60, 1992, pages 77-105. 394 Chapter 18 TRADING IS CONTINUOUS A theoretician trying to develop a realistic price distribution for use in a theoretical pricing model might first ask how the prices of an underlying contract change over time. Perhaps not all contracts change prices in the same way. Price changes might, for example, follow a diffusion process (see Figure 18-3). In a diffusion process there are smooth and continuous changes from one price to the next, with no gaps between consecutive prices. Moreover, the",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.448704"
}