{
  "id": "c77454fe7384",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 82,
  "content": "to meet our profit expectations. Alternatively, we may be able to execute part of the spread at favorable prices, but as we increase the size, the prices may become less satisfactory. Moreover, for a retail customer the increased size may entail significantly greater transaction costs. If trading considerations make spread 3 impractical, we may have to choose between spreads 1 (the straddle} and 2 (the ratio vertical spread). If that happens, spread 2 is the clear winner. It allows for a much greater margin for error in both volatility (vega risk} and underlying price change (gamma risk}. A trader who is given a choice between these two spreads will strongly prefer spread 2. The choice of spreads may not always be as clear as in this example. The superiority of spread 3, at least from the theoretical standpoint, was relatively obvious. Sometimes, 2. The options which comprise a spread position are sometimes referred to as the /egs of the spread. 182 Chapter 9 however, one spread may be superior with respect to one type of risk, while a different spread may be superior with respect to a different risk. Let’s consider three new spreads, 4 (a ratio vertical spread), 5 (a short time spread), and 6 (a diagonal spread). The total theoretical edge of each spread, as well as their risk sensitivities (all taken from the theoretical evaluation table in Figure 9-1), are shown in Figure 9-7. In order to again focus on the risks associated with each spread, the size of each spread has been adjusted to yield approximately the same theoretical edge. Since each spread has a negative vega, we will want to consider the volatility risk if volatility should turn out to be greater than our estimate of 15%. The sensitivity of each spread to increasing volatility is shown in Figure 9-8. We can see that spread 4 has an implied volatility of approximately 18.1%, spread 5 approximately 17.0%, and spread 6 approximately 17.2%. if an increase in volatility is our primary concern, then spread 4 (the ratio vertical spread} seems to offer the best risk characteristics. In addition to the volatility risk, we can see that spread 4 also has a negative gamma, so that it will be adversely affected by a sudden large move in the underlying contract. If we are Concerned about the possibility of such a move we may want to determine exactly how a large move in the price of the underlying contract will affect the value of the spread. Figure 9-9 shows the sensitivity of each of our spreads, 4, 5, and 6, to a change in the price of the underlying contract. Note that spread 4 has the narrowest profit range of the three spreads, in theory losing all its theoretical value if the market should immediately drop below 46.50 or rise above 52.20, On the other hand, spread 6 has very little downside risk and can still stand an immediate move upward to about 52.30. If a trader were worried about the possibility of a swift fall in the market, he might be willing to give up the extra volatility cushion offered by spread 4 over spread 6 (18.0% vs. 17.2%) for the additional downside protection offered by the latter spread. This is reflected in the smaller negative gamma associated with spread 6 as compared with spread 4. Finally, we can see that spread 5, while having the least desirable volatility risk, also has a positive gamma. This means that any large move in the underlying contract will increase the value of the position. If a trader were worried about the possibility of a sudden large move in the underlying contract, but were not overly concerned with an increase in volatility, he might be willing to accept the less desirable volatility risk associated with spread 5 for the more desirable positive gamma characteristics. A trader who executes spread 5 will have a positive gamma, so he has no gamma risk. But he will have a theta risk if the underlying contract fails to move. How great is the risk? Figure 9-10 shows the sensitivity of all three spreads to the passage of time. Since spreads 4 and 6 have negative gammas, they can only gain value with the passage of time. On the other hand, spread 5 loses value as each day passes. Looking at the graph associated with this spread, we can see that if no movement occurs in the underlying contract, the spread loses all its theoretical edge after about 18 days, This is the price one has to pay for the privilege of having a positive gamma. 3. We assume here that the May and July underlying contracts maintain the same approximate relationship. That is, the July contract Is always 1.0123 times the May contract since 50.11/49.50 = 1.0123. The x-axis in Figure 9-9 is the price of the May contract. 183 Risk Considerations Ove’ I- OLy0'+ o'9s- 0+ o06'2+ OO X Oe- §900— * 0c- 98 X0e- pet x Oe- Sot X0e 990° x OL+ £800'— OF+ OEE xX Ol+ OL+ x OL+ LV-x Ob 0se\"t- osel— o'08}+ os- 00'e+ Sor <0s- 0900— x 05- 08 X05- Be OG vet X05 990° x OSt 2800'~ x 0S+ 9O'b x OS+ 62- x OSt 8t'-* 0S ore'— 0250+ O'eL- oz+ oL'z+ OOF X 06— §900— < 0e— 98 x 0o- pet X OG— Set xX Oo 801\" X O@+ 6900°- x 0+ £6 X 02+ Zt X Oet 1Z- x02 uonisod UoRSOd uopisodg uonisod e6pa eben eyoUuL BUIWwery esg jeopesoeyL syyeo 2g Aine 02—- seo ep ABW OL+ sind gp Ain¢ og— sind gp ABW ost sijeo 2g Aine of- sire0 Og Ajn¢ oot 7g peaids 1g peaids tp peaids 2-6 einbig 184 Chapter ¢ Figure 9-8 45 2a, ™“ spread 6 (diagonal spread) a — | o . S So, spread 4 | 2 . (atio vertical spread) a -44 : © 2 2 6 9 . © Se spread 5 oN -10- (short time",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.435021"
}