{
  "id": "fe84e28fd40e",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 111,
  "content": "to futures-type settlement, as they are on many non-U.S. exchanges, no cash flow results from the early exercise of an option. With an 80 call trading at 20 and the underlying futures contract trading at 100, if the option is subject to futures-type settlement when exercised, 20 points will be credited to the trader’s account from the settlement of the futures contract. But 20 points will simultaneously be debited from his account when the 20-point value of the option disappears. Since the cash credits and debits exactly offset each other, no additional interest earnings can accrue. In futures markets where the options are subject to futures-type settlement there is never any economic justification for early exercise, and early exercise can never be an optimal choice. A trader will always be better off either holding the option or selling it, rather than exercising it early. STOCK OPTIONS Early Exercise of Calls for the Dividends We can separate a stock option call into its components, as we did with a futures option. Now we have the additional consideration of dividends: call value = intrinsic value + interest rate value + volatility value ~ dividend value Since the intrinsic value, interest rate, and volatility components can never be less than zero, these factors always enhance the call’s value. As any one of them rises, the call value rises. Only the dividend component might affect the option’s value negatively. As the dividend rises, the call option’s value falls. If the underlying stock pays no dividend, or no dividend is expected prior to expiration of the option, a call option can never have a value less than parity (intrinsic value}. If, however, the negative effects of the dividend are greater than the positive effects of interest rates and volatility, it might be possible for a call, if it is European, to be worth less than parity. For example, suppose a certain stock is trading at 100 and that the stock will go ex-dividend two points tomorrow. Suppose also that there is a 90 call available which will expire in two weeks. When we evaluate the option, we find that it has a theoretical value of 10 and a delta of 100. This means that the option has essentially the same 244 Chapter 12 characteristics as the stock. If the option is American, and we want to maintain the same delta position, we have three possible choices: 1. Hold the option 2. Exercise the option 3. Sell the option and buy stock Which of these choices is best? Suppose we simply hold the option. Certainly we will maintain our delta position. But what will happen tomorrow when the stock gives up its dividend? If the stock opens unchanged, it will open ex-dividend at 98,2 since the two-point dividend will be deducted from its price. Since the option has a value of parity, it will open not at 10, the previous day's parity price, but at 8, today’s parity price. In other words, if we hold the option we can be certain of losing two points on our position. Can we do any better with the second choice, exercising the option? If we exercise the option, we will pay the exercise price of 90 for the stock, and we will discard the 10-point value of the option, effectively purchasing the stock at 100. When the stock goes ex-dividend we will lose two points when it opens two points lower the next day, but we will also receive the dividend since we now own the stock. We will break even because the two-point loss on the stock price will be offset by the two-point dividend we receive. Clearly, we are better off exercising the option than holding it, not because we will show some additional profit, but because we will avoid a two-point loss. We must exercise the option to ensure that we break even. What about the third choice, selling the option and buying stock ourselves? This seems to be very similar to early exercise. In both cases we are replacing the option with the stock. If the option is trading at parity, in this case 10, there is no difference between exercising the option, or selling the option and buying the stock. In each case the cash flow will be identical and we will own the stock when it goes ex-dividend. But suppose the 90 call is trading at a price other than 10. Suppose, for example, it is trading at 91. Clearly, this price is not possible in a market where the options are American and can be exercised at any time. Purchasing a 90 call for 91% is equivalent to purchasing the stock for 991, If the stock is trading at 100, this means the call is trading at less than parity. If this were indeed true, all traders would buy the call, sell the stock, and immediately exercise the call. This would result in a riskless profit of 1% point, the amount by which the option was below parity. In a market where options are subject to early exercise, no option ought to be trading at less than parity. What if the 90 call is trading for more than parity, say 101? Now if we sell the option and purchase the stock we will still receive the dividend, since we will own the stock. But we will end up with an additional 1% point which we would not have 2. On the day a stock gives up its dividend, prices are typically disseminated with the dividend already deducted from the stock’s price. Hence, a 100-point stock which gives up a 2-point dividend overnight and opens the next day at 98 would be deemed to have opened unchanged since the 2-point drop in its price results from the dividend payout, not from any change in investor demand. Early Exercise of American Options 245 collected through exercise of the call. Therefore, our third choice, selling the call and buying the stock, is the optimum choice.",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.439263"
}