{
  "id": "3cd6374c2b10",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 24,
  "content": "65.00 1tlit✓,,, t -- ~\" ~· __ ./ .... ,Jl,lf .-· __ / \"-\" l r ... •• ,, \"1 '!,'/J!\"-4 - ~ , ,,- 50.00 -r1------ hf'11Hr11'- 1n, - fl _\\!!i1- ., ,,l ,_,H!~'11,---' I I ll1tff( , qrlf ''- 45.00 40.00 -1 .00 Mar Apr 29 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 71 FIGURE 3.18 Erratic Pullbacks in JPM, Late 2009 surmising that the patterns in X would have been much more tradable, and that they probably offered better opportunity for most trend traders. Common Characteristics of Failed Pullbacks As important as it is to understand the patterns associated with successful pullbacks, it is probably equally important to understand the patterns that hint at impending failure. Understanding how patterns fail lets traders look for warning signs to exit losing trades, sometimes taking a smaller than expected loss. In addition, some very good trades are driven by traders trapped in failed patterns. This is especially common with failed break- outs, which will be covered in the next chapter, but some traders look for trades to set up around failed pullbacks as well. In general, pullback trades fail in one of three ways: 1. There is no momentum out of the pullback, and the market goes into a more or less ﬂat trading range somewhere in the level of the pullback. ase & Co JPM -Daily J PMorgan Ch 48.00 .00 ~,_.- -1 00 [I 11 n ,.,,--- • 00 11 ,Jid~ll 111 lfltt• ·- --- ,- 00 / 11/j jjf11lt-.. 1'-• • • - \" 00 t 1 ij11i' 36.00 34.00 32.00 30.00 30 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 72 MARKET STRUCTURE FIGURE 3.19 More Consistent Pullbacks in X, Mid-2009 2. The pullback fails dramatically as sharp, countertrend momentum emerges. The challenge is to distinguish between this scenario and the more common complex consolidation. 3. The next trend leg emerges out of the pullback, but it fails in the neighborhood of the previous swing (i.e., the high of the setup leg in an uptrend or the low of the setup leg in a downtrend). Flat Pullback One of the most common pullback failure patterns occurs when the market begins what looks like a good pullback but then there is simply no move out of that pullback. Instead, the market goes into a ﬂat range, indicating that buyers and sellers are in relative balance. Trading in this new range is usually a bad idea since price action will be random and not driven by any real order ﬂow. Also, breakouts from this new range are treacherous, with the potential for fake-outs in either direction. In most cases, the best course of action is to recognize the pattern once it has developed, book a small loss or gain on the trade, and move on to other opportunities. Figure 3.20 shows an example of a pullback in AAPL that failed to continue the trend and instead transitioned X- Daily u .S. Steel Corporation 3.00 -. - \\ , 1.00 -1 .00 -3. 00 Mar Apr May Jun 31 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 73 FIGURE 3.20 A Pullback in APPL That Failed by Transitioning to a Flat Trading Range into a sideways range. Though it is difﬁcult to set a precise point at which a trader should have recognized that the pullback was not working as expected, it should have been obvious no later than four or ﬁve bars after the point marked A on the chart. In this case, the pullback eventually failed dramatically as sharp downside momentum came into the market, but it could just as easily have resolved to the upside. The point is that this pattern indicates that whatever edge existed in the pullback is now gone. Sharp Countertrend Momentum as Pullback Is Violated The previous exam- ple showed a case where a pullback failed via sharp contratrend momentum after ﬁrst going into a sideways range. However, the market is not always so polite. Some of the most dangerous pullback failures, at least in terms of the possibility of creating large losses, occur when the pullback simply fails sharply by breaking to the “wrong side.” Pullbacks that were anticipated to have been continuation patterns in uptrends may fail through sharp breakdowns, and vice versa. These are the patterns that make risk man- agement based solely on pattern geometry difﬁcult—how far away do you put the stop? No matter where you might think it should go, there will, in some subset of these pat- terns, be spikes to that level and beyond. Figure 3.21 shows an example of a continuation 8.00 --------, 2.00 Feb Apr May 32 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.698878"
}