{
  "id": "6d693610b730",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 100,
  "content": "common language is take the offer , and the reverse is to hit the bid). Though much simpliﬁed, these are the two options available to traders and they correspond to the two most commonly used order types. Limit orders are orders where buyers try to buy at a cheaper price than the offer and sellers offer to sell at prices above the bid. A trader wanting to buy XYZ with a limit order might say, “Bid for it” or “Join the bid,” as in “We’re in no hurry here—just bid for it.” A seller might say, “Okay, ﬁne, offer it out. Put it up on the offer.” Market orders are orders that will execute immediately. Buyers will pay the offer and sellers will end up hitting the bid. These orders usually reﬂect some degree of urgency—the order must be done immediately and a better price (trade location) is sacriﬁced for speed of execution. Though the buyer bidding with a limit order will get a better price if ﬁlled, the trade-off is that the order may never be ﬁlled if the market moves higher. Now we have arrived at something subtle and very important. Imagine XYZ is again 49.95 at 50.05, and then it trades at 50.05. What just happened? A buyer wanted to buy the stock so much that he was willing to pay the spread or take the offer; we can say that this is a buyer-motivated trade. By analyzing the number of orders that hit the bid (seller-motivated trades) compared to those that take the offer (buyer-motivated trades), whether through computer-aided analysis or careful observation, traders can get a deeper sense of the conviction levels and urgency behind price moves. For instance, a stock may move from 50 to 51 in a series of back-and-forth motions with orders printing on both the bid and the offer. At another time, the same price change could occur in a straight line as buyers keep paying the offer and keep that buying pressure on the offer for the entire move. Simple observation would note that both moves began at 50 and ended at 51, and perhaps even occurred in the same amount of time and with the same amount of volume being done, but each of these moves suggests something different about the underlying conviction in the market. A trader who buys something in anticipation of it going higher is said to be long that instrument. For most people, this is a natural and intuitive concept: buying something relatively cheaply, planning to sell it later for a higher price, and pocketing the difference (minus any costs of ﬁnancing or insurance incurred in the interim). One of the divisions 152 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bapp01 JWBT634-Grimes May 11, 2012 8:31 Printer: Hamilton Printing Appendix A: Trading Primer 403 between professional and amateur traders is that professionals are often just as willing to go short (or just to short) a market, but the public often has a bias against shorting. There are several reasons for this; most equity traders have a natural inclination toward own- ing stocks, and think that shorting is a very complex transaction, or that it is somehow immoral to bet on a company’s value going down. (In some markets it is theoretically complex, as the instrument must ﬁrst be borrowed, then sold, later bought back, and ﬁnally returned to the lender.) This prejudice is unfounded and is one of the key dif- ferences between the public and most professionals. Shorting is nothing more than the opposite of being long. Whereas the buyer seeks to make a proﬁt as prices rise, the short seller anticipates falling prices and hopes to cover the short (buy it back) at lower prices. Short selling is an important part of the trader’s tool set. Spread Trading It is also worth considering that a certain amount of the buying and selling pressure in the market represents more complex interests than simple buying and shorting. Imagine a farmer who knows he will have a grain crop coming in September. This farmer might sell his grain in the futures market before the harvest comes in (technically, a short sale), but this does not in any way mean that he expects that prices will be going down. This is a simple example of a hedging transaction, and more complicated examples exist in all markets. Spread trading is another type of transaction involving buying one asset and selling another, looking to proﬁt from the change in value between the two. Imagine that a trader feels that Assets A and B should trade in a more or less predictable relationship, perhaps with Asset A at a premium due to production costs and so forth. This trader could track the spread, or the difference between Assets A and B. If she feels that the premium is too small, she can go long the spread by buying Asset A and shorting Asset B. This is not a bullish or bearish bet on either of the assets, but a bet that the spread between the two will widen. She will make money if A goes up and B goes down, if they both go up but A goes up more, or even if they both decline as long as B declines more. The key is that the percentage change of A must be greater than the percentage change of B (assuming an equal-weighted position) from the time the trade is entered. Conversely, if the trader felt the spread was too wide, she could short the spread by doing the reverse of this transaction. This just scratches the surface of these complex, multileg transactions, which exist in and between",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "market_structure"
  ],
  "created_at": "2026-02-05T00:37:53.711017"
}