{
  "id": "26d1381945a9",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 14,
  "content": "S&P 500 Continuous Col!)ract [Jun11] , l ll 11~ 1,330.00 I ,.,~.00 I i'' l'-,,,w.oo j_,,-- ' I I '·\"'\" t '·\"'·' 0 , , 1,320.00 1,260.00 1,250.00 1,315.00 Apr 4/3 4/5 416 4/7 4/8 4/10 Apr 10 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing 26 THE FOUNDATION OF TECHNICAL ANALYSIS FIGURE 1.15 The Small Bars on the 15-Minute EURUSD Chart (Right Pane) Hide a More Signiﬁcant Pullback on the 2-Minute Lower Time Frame in extended trends, and will be explored in much more detail later. Figure 1.16 shows an example of a two-legged complex pullback. On the higher trading time frame, it is not so obvious and has to be inferred from the presence of one or two with-trend candles in the middle of the pullback, but the complete structure is clearly visible on the lower time frame. One of the quantiﬁable tendencies of price motion is for markets to make directional moves out of periods of contracted volatility. Even if the normal expectation for a market is mean reversion and reversal (as it is in the short term for equities), there is usually at least a slight edge for continuation out of areas of volatility compression. One simple way to quantify volatility contraction is by looking for inside bars, which are bars whose entire range is enclosed within the range of the previous bar—in other words, a bar whose high is equal to or lower than the previous high and whose low is above or equal to the previous low. A series of multiple inside bars on one time frame usually contains a 1.43300 1.43400 1.43200 1.43300 ' ' r -- --- - 1.43200 1.43100 1.43100 ' ' 1.43000 I 1.43000 ' ' ' ' 1.42900 1.42900 ' ' ' ' ' 1.42800 ' ' ' 1.42800 ' ' ' · 1.42700 l '--ol--._ 1.42700 1.42600 ' ' 1.42500 ' ' ' 1.42600 1.42400 1.42500 1.42300 1.42400 1.42200 6:00 6:30 7:00 6:00 11 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing The Trader’s Edge 27 FIGURE 1.16 The Daily Chart of X (Left Pane) Shows a Clear Two-Legged Complex Pullback The weekly chart hints at this structure, but it must be inferred from the single upward-closing candle in the middle of the pullback. triangle on the lower time frame, which is a visual pattern that strongly suggests volatility contraction. Trading within triangles is usually a losing proposition, as the market is in equilibrium and the actual movement within the pattern is highly random. However, they can set up good breakouts with expectations for strong, extended moves away from the pattern. It is easy to overlook multiple inside bars (see Figure 1.17), but this is a powerful and subtle pattern that is worth some attention. The examples in this section were deliberately chosen to be less than perfect be- cause it is important to start thinking about these concepts in the context of actual mar- ket action, which is always less clear and noisier than we wish. Remember that charts are artiﬁcial structures that we impose on market data. They are useful because they organize the data, but we are always dealing with a trade-off between effective summa- rization and loss of detail. There is no perfect answer, but many of the limitations can be overcome if we work to constantly remember what the chart actually is, and to try to understand the buying and selling pressure that each bar represents. The chart is not the market; the chart is a representation of the market. X - Daily U.S. Steel Corporation 50.00 42.00 40.00 45.00 i t t 38.00 11 \" 00 I n . . . _ _ ij 36.00 j 0 I !,.,-/- ----,,J 3'.00 \\,____ t JI -3500 ,' Q ~ 25.00 f 26.oo 24.00 20.00 I Jun Jul Apr Jul 12 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing 28 THE FOUNDATION OF TECHNICAL ANALYSIS FIGURE 1.17 Multiple Inside Bars on the Hourly Chart of the E-mini S&P 500 Futures (Right Pane) Hide a Clear Lower Time Frame Triangle on the 10-Minute Chart CHARTING BY HAND I started trading in the 1990s, in the twilight years of the old, classic paper chart books. A book would come in the mail at the beginning of the week, printed on newsprint; each day it was up to the trader to track down prices for each of the markets and update the charts by drawing a new price bar. At the beginning of the next week, a new book would arrive with the past week’s prices ﬁlled in, and the process would repeat. Actually, in my very early trading days I did not even have the chart book, but I bought a pad of graph paper, went to the library, and started building charts from histories I found in back issues of newspapers. I did not realize the value of what I was doing at the time,",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options"
  ],
  "created_at": "2026-02-05T00:37:53.697194"
}