{
  "id": "a2f7553062da",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 156,
  "content": "(%) AuneloA pezipenuuy 345 Intermarket Spreading z6-Bny e6-1dy L6-AON i bene 16-484 06790 o6-AeWw 68-98q 68-ny e68-idy se-AON 88INt Ll Ll 1 1 1 L 1 WSL — -%08 ooh GB + %06 + %&6 ern ene ne ee ena %O00t AUINEIOA XAO Jo USD B se AUINEIOA WAN ‘8-91 eanbi4 346 Chapter 16 number of OEX straddles x OEX $delta x .87 must equal number of NYA straddles x NYA $delta Suppose the OEX is at 440 and the NYA is at 260. Since both contracts have the same point value of $100, the $deltas for the two indexes are: OEX $delta = 440 x $100 / 100 = $440 NYA $delta = 260 x $100 / 100 = $260 For each NYA straddie which we sell, we must purchase .87 x 260/440, or approxi- mately .51 OEX straddles. If we were to purchase 20 OEX 440 straddles, a balanced intermarket volatility spread would require us to sell approximately 39 NYA 260 straddles, since 39 x .51 = 20. Our spread might consist of: long 20 OEX 440 calls / long 20 OEX 440 puts short 39 NYA 260 calls / short 39 NYA 260 calls If the OEX straddles are purchased and the NYA straddles sold at the same implied volatility, the value of the position at expiration is shown in Figure 16-9. Note that if both contracts move in the same direction and, as we expect, NYA volatility is 87% of OEX volatility, the position shows a constant profit equal to the expected 13% difference in the volatilities. Even if we double or triple volatility, the profit to the position will be identical, as long as NYA volatility is 87% of OEX volatility. We can see from Figure 16-8 that NYA volatility need not be exactly 87% of OEX volatility. What will our position look like if NYA volatility turns out to be near the upper range of OEX volatility, perhaps 95%, or near the lower range of OEX volatility, perhaps 80%. These two possibilities have also been plotted in Figure 16-9. In the former case our position will begin to act like a short straddle, and any increase in volatility will reduce the value of the position. In the latter case our position will begin to act like a long straddle, and any increase in volatility will increase the value of the position. Obviously, if we were to focus on a risk to our position, the risk would be that NYA volatility would increase relative to OEX volatility. Even with this risk the spread still looks very attractive since we have considerable margin for error. In a typical volatility spread a trader often focuses on the delta, gamma, theta, and vega characteristics of the spread. We might also want to consider these sensitivities with respect to an intermarket spread. Just as we found it convenient to calculate a $delta to compare contracts in different markets, we will also find it convenient to calculate the $gamma, $theta, and $vega. The definitions and interpretations are: $gamma = underlying $delta x option’s gamma x underlying point value / 100 (the change in an option’s $delta for a one-percent change in the price of the underlying contract} $theta = underlying point value x option’s theta (the doliar change in an option’s theoretical value with the passage of one day) Profit & Loss Intermarket Spreading 347 Figure 16-9: Long 20 OEX 440 Calls/Long 20 OEX 440 Puts Short 39 NYA 260 Calls/Short 39 NYA 260 Puts se ma NYA volatility is 80% ree of OEX volatility _- ~ x - o ™ a NYA volatility is 87% ae of OEX volatility aa NYA volatility is 95% a“ of OEX volatility ~ T TT T T T T T T T T T T T T T 400 405 410 415 420 425 430 435 440 445 460 455 460 465 470 475 480 OEX Price $vega = underlying point value x option’s vega (the dollar change in an option’s theoretical value for a one-percentage-point change in volatility) If we use implied volatilities of 11%, an interest rate of 5%, and assume 70 days remaining to expiration, the dollar sensitivities for several OEX and NYA options might be approximately the following:% OEX = 440.00; time to expiration = 70 days; volatility = 11%; interest rate = 5% NYA = 260.00; time to expiration = 70 days; volatility = 11%; interest rate = 5% Option $delta $gamma $theta $vega OEX 425 call 364 23 8.57 49 OEX 440 call 259 36 -9.29 75 OEX 455 call 140 33 —6,87 69 These figures are approximations only. While early exercise was taken into cons{deration through the use of the Cox-Ross-Rubenstein model, no dividends were used. In addition, the numbers have been rounded for convenience. 348 Chapter 16 Option $delta § $gamma ‘$theta $vega OEX 425 put -81 25 -3.09 51 OEX 440 put ~196 42 4,00 74 OEX 455 put -339 43 2.36 54 NYA 250 call 221 13 -4,93 27 NYA 260 call 152 21 5.49 44 NYA 270 call 75 18 -4.05 39 NYA 250 put -4] 13 ~1.85 28 NYA 260 put ~117 24 ~2.36 44 NYA 270 put 211 26 -1.26 28 The total dollar sensitivities of our OEX/NYA position is: Position $delta $gamma $theta $vega long 20 OEX 440 calls 5180 720 -185.80 1500 long 20 OEX 440 puts -3920 840 —80.00 1480 short 39 NYA 260 calls 5928 ~819 214.11 -1716 short 39 NYA 260 puts 4563 -936 92.04 -1716 Totals -105 ~195 +40.35 -452 How can we interpret these sensitivities? Although the $delta of -105 indicates a preference for the market to fall rather than rise, in practice most traders would consider the position essentially $delta neutral since the preference is only very slight. In relative terms the $delta of -105 represents a position which is short only about 24% of an OEX contract (with a $delta of 440), or about 40 percent of an NYA contract (with",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "crypto",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.446345"
}