{
  "id": "4b9ca0d92b07",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 42,
  "content": "oppo- site position. Either way, you have used a new, more recent entry signal as an exit signal for your existing position. This is a common way to generate exit signals when a trading model can be run in shorter intervals than the optimal holding period. Notice that this strategy of exiting a position based on running an entry model also tells us whether a stop-loss strategy is recom- mended. In a momentum model, when a more recent entry signal is opposite to an existing position, it means that the direction of momentum has changed, and thus a loss (or more precisely, a draw- down) in your position has been incurred. Exiting this position now is almost akin to a stop loss. However, rather than imposing an arbitrary stop-loss price and thus introducing an extra adjustable parameter, which invites data-snooping bias, exiting based on the most recent entry signal is clearly justified based on the rationale for the momentum model. Consider a parallel situation when we are running a reversal model. If an existing position has incurred a loss, running the rever- sal model again will simply generate a new signal with the same sign. Thus, a reversal model for entry signals will never recommend a stop loss. (On the contrary, it can recommend a target price or profit cap when the reversal has gone so far as to hit the opposite entry threshold.) And, indeed, it is much more reasonable to exit a position recommended by a mean-reversal model based on hold- ing period or profit cap than stop loss, as a stop loss in this case often means you are exiting at the worst possible time. (The only exception is when you believe that you have suddenly entered into a momentum regime because of recent news.) SEASONAL TRADING STRATEGIES This type of trading strategy is also called the calendar effect. Gener- ally, these strategies recommend that you buy or sell certain securi- ties at a fixed date of every year, and close the position at another Chan800064_c07.indd 174 6/7/2021 7:16:58 AM Special Topics in Quantitative Trading 175 fixed date. These strategies have been applied to both equity and commodity futures markets. However, from my own experience, much of the seasonality in equity markets has weakened or even disappeared in recent years, perhaps due to the widespread knowl- edge of this trading opportunity, whereas some seasonal trades in commodity futures are still profitable. The most famous seasonal trade in equities is called the Jan- uary effect. There are actually many versions of this trade. One version states that small-cap stocks that had the worst returns in the previous calendar year will have higher returns in January than small-cap stocks that had the best returns (Singal, 2006). The rationale for this is that investors like to sell their losers in Decem- ber to benefit from tax losses, which creates additional downward pressure on their prices. When this pressure disappeared in Janu- ary, the prices recovered somewhat. This strategy did not work in 2006–2007, but worked wonderfully in January 2008, which was a spectacular month for mean-reversal strategies. (That January was the one that saw a major trading scandal at Société Générale, which indirectly may have caused the Federal Reserve to have an emer - gency 75-basis-point rate cut before the market opened. The turmoil slaughtered many momentum strategies, but mean-reverting strat- egies benefited greatly from the initial severe downturn and then dramatic rescue by the Fed.) The codes for backtesting this January effect strategy are given in Example 7.6. Example 7.6: Backtesting the January Effect Here are the codes to compute the returns of a strategy applied to S&P 600 small-cap stocks based on the January effect. Using MATLAB The MATLAB codes can be found at epchan.com/book/example7_6.m, and the input data is also available there. clear; load('IJR_20080131'); onewaytcost=0.0005; % 5bp one way transaction cost years=year(datetime(tday, 'ConvertFrom', 'yyyymmdd')); months=month(datetime(tday, 'ConvertFrom', 'yyyymmdd')); nextdayyear=fwdshift(1, years); Chan800064_c07.indd 175 6/7/2021 7:16:58 AM 91 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 176 QUANTITATIVE TRADING nextdaymonth=fwdshift(1, months); lastdayofDec=find(months==12 & nextdaymonth==1); lastdayofJan=find(months==1 & nextdaymonth==2); % lastdayofDec starts in 2004, % so remove 2004 from lastdayofJan lastdayofJan(1)=[];% Ensure each lastdayofJan date after each % lastdayofDec date assert(all(tday(lastdayofJan) > tday(lastdayofDec))); eoy=find(years~=nextdayyear); % End Of Year indices eoy(end)=[]; % last index is not End of Year % Ensure eoy dates match lastdayofDec dates assert(all(tday(eoy)==tday(lastdayofDec))); annret=.. (cl(eoy(2:end),:)-cl(eoy(1:end-1),:))./.. cl(eoy(1:end-1),:); % annual returns janret=.. (cl(lastdayofJan(2:end),:)- cl(lastdayofDec(2:end),:))./cl(lastdayofDec(2:end),:); % January returns for y=1:size(annret, 1) % pick those stocks with valid annual returns hasData=.. find(isfinite(annret(y,:))); % sort stocks based on prior year's returns [foo sortidx]=sort(annret(y, hasData), 'ascend'); % buy stocks with lowest decile of returns, % and vice versa for highest decile topN=round(length(hasData)/10); % portfolio returns portRet=.. (smartmean(janret(y, hasData(sortidx(1:topN))))-.. smartmean(janret(y, hasData(.. sortidx(end-topN+1:end)))))/2-2*onewaytcost; fprintf(1,'Last holding date %i: Portfolio return=%7.4f\\n', tday(lastdayofJan(y+1)), portRet); end % These should be the output % Last holding date 20060131: Portfolio return=-0.0244 % Last holding date 20070131: Portfolio return=-0.0068 % Last holding date 20080131: Portfolio return= 0.0881 This program uses a number of utility programs. The first one is the assert function, which is very useful for ensuring the program is working as expected. Chan800064_c07.indd 176 6/7/2021 7:16:58 AM 92 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 177 function assert(pred, str) % ASSERT Raise an error if the predicate is not true. % assert(pred, string) if nargin<2, str = ''; end if ~pred s = sprintf('assertion violated: %s', str); error(s); end The second one is the",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:43.610549"
}