{
  "id": "2bd859cfaa9f",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 17,
  "content": "do you call your YouTube channel Dumb Money? “Dumb money” is how Wall Street refers to ordinary people like me. I didn’t graduate from an Ivy League school. I didn’t work for a financial firm. So, I would be considered an outsider. I’m dumb money. What prompted you to start the YouTube channel? Part of my life mission is to pull as many people as I can into the investor class. Turning ordinary people into investors is the only way to solve the wealth gap. If we are going to depend on the education system to get 54 people excited about investing, it’s just not going to happen. It’s going to be YouTubers. It’s going to be TikTokers. It’s going to be people like me sharing their success and sharing their knowledge with the world. That’s why I do Dumb Money. How many subscribers do you have to your YouTube channel? Not that many. We have two YouTube channels: Dumb Money and Dumb Money Live. We have near 200,000 subscribers combined. It’s not a business for me. We don’t sell anything. We don’t even have any ads. Thousands of subscribers, though, are doing the same thing I do. They’re on TikTok. They’re looking for ideas the same way I do. Have you gotten ideas from your audience? Sixty percent of the trades I do were either surfaced by or vetted by people in the Dumb Money community who are now using my investing style. So, even though you started this endeavor to help people, it has come back to benefit you as well. Absolutely! If I have a trade idea, I’ll present it and say that I need help vetting it. I’ll then have people around the country walking into stores and talking to clerks. I now have over 100 people doing this stuff and other research, which probably makes me more powerful than the best hedge fund on Wall Street. It’s wild. When we were invested in Peloton, I had one guy in my community fly his single-engine plane to one of their warehouses to talk to a worker on the dock to see how things were going. I used to feel isolated in the type of trading I do. I’m not a technical trader. I’m not a fundamental trader. So, when I went to investor conferences, there was nobody like me, and nobody was talking about the things that I wanted to talk about. Now, for the first time, I have people that do things the way I do them. Having had such a successful run, do you have any goals? One of the things I’m most proud of was starting a foundation to help kids with leukemia and autism, which has been a primary goal in my life. If I didn’t do it after a year like 2020, I would never do it. So, I decided to take $5 55 million of my gains and start the Camillo Foundation. Through my trading, I hope to grow that foundation to be substantially larger than it is today. Any final words? I’ve never been more excited about the future than I am right now. I also believe there has never been a better time for an ordinary person to be an investor. I don’t care if you’re a dentist, janitor, or homemaker. Pay attention to videos and comments on platforms like TikTok. You can beat the professionals by learning how to identify the change happening around you. 56 Marsten Parker Don’t Quit Your Day Job Three years later Has anything changed significantly for you since our original interview? The Covid lockdown allowed me to work hard on my backtesting software to get it to the point where I felt like I could market it. What is the software called? RealTest. The description of the product is on my website, mhptrading.com. How many users are there? I’m up to about 200 users. Many of the users I have are from Australia. There’s a lot of interest in systematic trading in Australia. I think that is because the U.S. markets are open when they are asleep. Is there anything about your software that differentiates it from other system testing software? What makes it unique is that it lets you define any number of trading strategies and combine them into one system. So, it supports the kind of trading I like to do, which is strategy diversification. Is it designed just for equity systems, or does it also support futures? RealTest supports futures as well. In fact, it includes the original Turtle system, as defined in Curtis Faith’s book. [The Turtles were two groups of traders trained by Richard Dennis and his partner William Eckhardt. The Turtle name originated on a trip Richard Dennis took to Asia. At one point, he visited a turtle farm where turtles 57 were raised in huge vats. In Dennis’s mind, the image of growing thousands of squirming turtles in a huge vat was a perfect analogy for training traders. The name stuck. Dennis and Eckhardt taught the Turtles a trend-following system based on price breakouts to new highs and lows. Curtis Faith, one of the Turtles, wrote a book, W ay of the Turtle, in which he detailed the Turtle system rules.] I’m curious. What does the performance of the Turtle system look like over the years? It’s not bad, and like any futures trend-following system, it has been great this year [2022]. I believe there was a long period beginning in 2011 and lasting through 2018 when trend-following systems of this type performed poorly. Yes, that was the era of the “Fed put” [the belief that the Federal Reserve would step in with accommodative monetary policy to support U.S. equity markets whenever they came under severe pressure]. This era was detrimental for trend-following systems and a time when buying the dips in stock prices was the optimal strategy. The problem with these futures trend- following strategies is they have big drawdowns. I’ve never tried trading",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "strategies",
    "crypto",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.180779"
}