{
  "id": "bc96f7989e87",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 56,
  "content": "2.5) + (-2x 4.0) = 44.5 Similarly, if he has purchased nine options with a theta of -.05 each, and sold four options with a theta of ~.08 each, his total theta position is (+9 x -.05) + (-4 x ~.08) =-.13 New traders sometimes find it difficult to remember whether a delta, gamma, theta, or Vega position is long or short. The various positions and their respective signs are given in Figure 6-26. The sign of the delta, gamma, theta, or vega, together with the magnitude of the numbers, tell the trader which changes in market conditions will either help or hurt his position, and to what degree. The positive or negative effect of changing market conditions is summarized in Figure 6-27. Even though a trader can analyze the effect of changing market conditions on his position through its delta, gamma, theta, and vega characteristics, his first and primary concern is that the position be profitable if his assumptions about market conditions are correct. This means that the position ought to have a positive theoretical edge. The theoretical edge can be calculated in the same way as the total delta, gamma, theta, and vega. One need only multiply the theoretical edge of each individual option (the difference between its trade or settlement price and theoretical value) by the number of contracts traded, and add up all the contracts involved. The amount of positive or negative theoretical edge is a reflection of the position’s potentia) profit or loss. The top portion of Figure 6-28 shows a theoretical evaluation table for individual options on a hypothetical futures contract. Beneath the table are several possible option positions for which the total theoretical edge, delta, gamma, theta, and vega have been calculated. The reader should take a moment to look at the arithmetic of each position, and to consider the risk characteristics associated with each position. Are all the positions likely to be profitable if the assumptions used for theoretical evaluation are correct? What will help or hurt each position? There is one other option sensitivity that is not generally used by traders, but which the reader may encounter in other option texts. An option’s elasticity, sometimes denoted with the Greek letter omega (Q) (or less commonly the Greek letter lambda (A}), is the relative percent change in an option’s value for a given percent change in the price of the underlying contract. For example, suppose a call has a theoretical value of 2.50 with the underlying contract at 50. If the cail has a delta of 25, and the underlying contract rises one point to 51, the call should rise to 2.75. In percent terms the call has 124 Chapter 6 Figure 6-26 Your delta Your gamma Your theta Your vega (hedge ratio (curvature) (time decay) (volatility) If you are... position ls... positionis... positionis... positionis... long the underlying positive 9) 9) (0) short the underlying negative (8) 0 9) long calls positive positive negative positive short calls negative negative positive negative jong puts negative positive negative positive short puts positive negative positive negative Figure 6-27 If your delta position is... you want the underlying contract to... positive rise in price negative fall in price If your gamma positionis... positive negative If your theta positionis... positive negative If your vega position is... positive negative If your rho position is... positive negative you want the underlying contract to... move very swiftly, regardless of direction move slowly, regardless of direction the passage of time will generally ... increase the value of your position decrease the value of your position you want volatility to... rise fall you want interest rates to... rise fall changed its value five times as fast as the underlying: the underlying rose 2% (1/50), while the call rose 10% (.25/2.50). We say that the call has an elasticity of 5. The elasticity is sometimes referred to as the option’s leverage value. The greater an option’s elasticity, the more highly leveraged the option. An easy method of calculating an option’s elasticity is to divide the price of the underlying contract by the option’s theoretical value, and multiply this by the option’s delta (when calculating the elasticity, we use the decimal format for the delta): elasticity = underlying price x delta theoretical value 125 Option Values and Changing Market Conditions 6L'e+ oss- Z'96+ 0 0 0 g0\" x e- ZLO- x 8 9Zx &- 80\" x 8+ yl0'-x 8+ gz Bt bh x sit ZzZ0'- S1+ lp St+ gb x Ol+ 9z0-x OL+ 6b x Olt ex 0Z0- x L- Bex L- LOX Zh+ LLo\"—x Zh+ 0% ZL+ L0'X ZI- 600\"— x Z1— Oe xzZl- os'+ 00} — o'at+ oT XOr— ze-< Or TeX Ol gl\" x Oat 9z0\"- x z+ 6b x 0+ eb xX Ol 0Z0\"- x O1- BEX Ol- og'+ 0g0\"- o'si+ 80 x OF PIO-X Ol Tex Ol ph x Olt Z20'- x OL+ ex Olt O2's~ o6s'+ GZbb- OLX ST 90 XST- Spx SI eb x Ol- 0Z0- x O1- BEX OlL- Sp- $90'+ Obie ZO=* Se= IT0- x Se- Tex Se— el x Ol+ }20\"— x OL+ BE x Ol+ oz'e+ ozs— org6t 0 0 0 91\" x Oat 9Z0\"— x O@+ 6'p x 0@+ uopsodg BBaA uon|sog Boul uop|sog ewwey go zko- 8% 98- 9¢'0l prot ple bzO- Nb OZ- Le\" 629 9 9Z0- SP 8b ele zie et «bzO- Ss 'E S2- Se\" ve'l Lo = HO- 6- ge\" oP\" eBapn Bou, eBwwer eyeQ onjeaA aod [eonesoeyL bOc~ be l+ OOL+ xX cht 0 98- x o- g0'+ X& Eb+ x gt SO'-x8 Bat xX Spt OxGl 8r-x Ol+ Z40+x Ob bit x L- gsO+xZ 6-—X ght bh- xX 2b 06+ xX JI- Ebt+xab 0 Q0'e+ Bot X OL- OxOl bS+ x Oot 90+ x 02 blt+xOl- go'+x Oh OS b+ og'+ CT+X OL- SO'+ xX OF Bat x OE+ OxOl oz- Gc- 8p- x SI- Z0-xSt blt+xOl- g0'+x Oh Sc- Selt 6- X $2—- Lt x Ge Gcé- x OL+ 60-*X Ol e+ 02 1+",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.430971"
}