{
  "id": "c9adada8d611",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 136,
  "content": "up the index. The holder of a short position would be required to make delivery of the stocks. In fact, very few stock index futures contracts are settled through the physical delivery of the stocks making up the index. Such a process, requiring the delivery of the correct number of shares of many different stocks, would be unmanageable for most Clearing organizations. To be perfectly fair, such a settlement procedure might require the delivery of fractional shares of stock, which is impossible. For all these reasons, exchanges have chosen to settle stock index futures at expiration in cash. Since futures contracts are settled daily in cash, the final cash transfer between the buyer and seller of a stock index futures contract is equal to the difference between the expiration value of the index and the previous day’s settlement price. For example, suppose an index is at 462.50 at the moment of expiration and the previous day’s settlement price for the futures contract was 461.00. If each point in the index is worth $100, the holder of a long position will be credited with a final payment of $150, Since (462.50 — 461.00) x $100 = $150. The holder of a short position will be debited by the same amount. What should be the fair value of a stock index futures contract? Recall from Chapter 1 that an important difference between a futures contract and Stock is the settlement procedure. Whereas the purchase of stock requires the buyer to actually pay cash, the purchase of a futures contract requires only an initial margin deposit. The cash paid for the stock will result in an interest cost, while the margin deposit results in no such interest loss. Moreover, any profits or losses resulting from 306 Chapter 15 stock trading are only paper profits or losses until the stock position is liquidated. In futures markets, however, profits and losses accrue whenever the price of the futures contract fluctuates, regardless of whether the position is closed out. These profits or losses are typically calculated daily from the settlement price of the futures contract, Such profits and losses result in variation, the amount of cash which is credited to or debited from a trader’s account based on the daily price fluctuation. Variation and margin requirements are separate and distinct. Margin in theory entails no carrying costs, while credits or debits resulting from daily variation do indeed earn (in the case of a credit) or lose (in the case of a debit} interest. Clearly, the purchase of a futures contract offers one important advantage over the purchase of the component stocks: no cash outlay is required to purchase a futures contract. Consequently, there is an interest rate savings equal to the cost of borrowing sufficient cash to purchase all the stocks in the index. The amount of interest saved by purchasing a stock index futures contract rather than the actual stocks in the index can be calculated by multiplying the current index value by the risk-free interest rate, and then multiplying this number by the amount of time remaining to expiration of the futures contract. By adding the resulting number to the index value, we have the fair value of the futures contract based on carrying costs. For example, suppose there are three months remaining to expiration with our four-stock index at 274.00. If the risk-free interest rate over this period is 8%, what are the carrying costs on the index? 8% x 3/12 x 274.00 = 2% x 274.00 = 5.48? If carrying costs are the only consideration, the fair value for the futures contract will be the 274.00 value of the index plus the 5.48-point carrying cost to expiration, or 279.48, What other advantages or disadvantages are associated with holding a futures contract? If we buy a futures contract, we may have a very good substitute for the stocks in the index, but we don’t actually own the stocks. Since ownership of a stock is necessary for the receipt of a stock dividend, if we buy a futures contract we will have to give up any dividends which the stocks in the index might pay. If the stocks in the index are non-dividend paying, or will not pay any dividends prior to expiration of the futures contract, no further calculations are necessary. The fair value will simply be the current index value plus carrying costs to expiration. More often, however, some, and perhaps all of the stocks in the index will pay dividends prior to futures expiration. In this case we must deduct the amount of dividends lost by holding a futures position rather than the actual stocks. Suppose that the stocks in our four-stock index are expected to pay the following dividends prior to expiration of the futures contract: 2. For simplicity we assume simple interest payments. We can be slightly more accurate by assuming compound interest (see Appendix B). Stock Index Futures and Options 307 Stock Price Expected Dividend 1 125 $1.80 2 80 0 3 52 $.90 4 «17 $.35 If we buy one share of each of the four stocks which make up the index, we will receive by futures expiration a total dividend payout of: $1.80 + $.90 + $.35 = $3.05 If we buy the futures contract instead of the stocks we will have to forego this 3.05. Therefore, we will want to pay 3.05 less for the futures contract. Taking into considera- tion carrying costs, we showed that with the index at 274.00, the fair value of the futures contract was 279.48. Deducting the dividends, the fair value of the futures contract is: 274.00 (index value) + 5.48 (carrying costs} ~ 3.05 (expected dividends) = 276.43 If we own the stocks in the index we not only receive the dividends paid by the stocks, we also have use of the dividend funds. If we own stock 1, we will receive a dividend of $1.80 on the ex-dividend date and, in theory, we can also earn interest on",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.443259"
}