{
  "id": "40d47bd05ad5",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 33,
  "content": "remain focused on wha t was productive and to sta y awa y from other new indicators and methods as the y were essentially a distraction. Use Exercise 9.2 to assess your personal stren g ths and limitations. When assessin g your strengths and limitations, write down trading related mental and technical skills and abilities that you do well and thin g s that need work. Under mental skills and abili - ties, consider your mindfulness skills and abilities at mental parkin g . Also consider how well you can hold a trade to its logical conclusion. Can you stick to your trading plan? Are you able to set aside losin g trades? Can you maintain an overall even mental keel while tradin g ? After you have completed the remainder of this chapter alon g with Chapters 10 and 11, return to this exercise so you can include your abilities in each of the mental domains we are discussin g within the Before‐During‐Aftermatrix.r For technical stren g ths, consider such thin g s as identifyin g choice trade setups, bein g c l ear on entries an d exits, a b i l ity to mana g e your tra d es w h i l e t h ey are h appenin g , your un d erstan d ing o f mar k et b e h avior, l eve l o f expertise wit h respect to in d icators you use, your a b i l ities at tra d ing in mu l tip l e time f rames, an d ot h er tec h nica l consi d erations. In t h e Other Considerations category , inc l u d e t h ings l i k e socia l an d f ami l y suppor t (e.g., d o you h ave goo d communication wit h your spouse or partner regar d ing your tra d ing; h ow are you at sustaining your signi fi cant ot h er ’s support), p h ysica l strengt h s an d l imitations ( fi tness, a b i l ity to sit in f ront o f t h e screen), p h ysica l h ea l t h , nutritional habits, and anything else that may aff ect your trading that does not fi t into t h e menta l an d tec h nica l categories. Exercise 9.2 My Current Strengths and Limitations Use an asterisk to denote whether the limitation is something you can easily avoid or if it is a developmental need. Current Strengths Current Limitations Mental Technical Other Considerations 38 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 229THE TRADING PSYCHOLOGY PROCESS: HIGH-QUALITY PREPARATION g oa l . It is h e l p f u l to remin d yourse lf w h y you are wor k in g so h ar d to ac h ieve your g oa l . T h is wi ll a dd to your menta l d iscip l ine. T h e b ottom l ine is t h at tra d ers nee d to pa y attention to t h eir menta l d iscip l ine an d monitor it. Min df u l se lf -monitorin g b e g ets se lf -contro l . T h e more you min df u ll y mon - itor y ourself and y our performance, the better y our mental discipline will be. Avoid multitaskin g , as this disperses our focus and can aff ect our discipline. Get suffi cien t s l eep an d eat we ll - b a l ance d mea l s. Avoi d sugary d rin k s or snac k s. T h ese wi ll cause g l ucose to roc k et, b ut just as quic kl y a l so cause it to cras h . Snac k on comp l ex car b o h y - drates that enter the bloodstream more evenly , such as fruit and raw ve g etables durin g t h e tra d ing d ay . Be sure to esta bl is h a game p l an in a d vance f or t h e tra d ing d ay (or wee k f or swing tra d ers). I f you s k ip it or ot h erwise f ai l to d o it, your min d wi ll natura ll y b e t h in k ing a b out h ow t h e next d ay is l i k e l y to tra d e an d w h at you s h ou ld d o. Baumeister ex p lains this as the Zeigarnik eff ect —the mind will continue to focus on an uncompletedtt task and this competes with other mental resources, potentially a ff ecting willpower. The good news is that the eff ect abates once concrete plans are made. Having a game plan not just prepares you for tradin g , but helps keep you mentally fresh as well. This completes our discussion of the fi rst component of Charlie Maher’s three ‐ part Before‐During‐After trading process. T able 9.2 summarizes the mental domainsr (HVMSs) and several of the Hi g h‐Value Actions encompassed in the Before principle of High‐Quality Preparation. The next exercise provides a basic set of questions you can ask yourself that are specifi c to the HV AMS of Hi g h‐Quality Preparation. When TABLE 9.2 High‐Value Mental Skills and Some",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:45.721471"
}