{
  "id": "0e6a0ebca819",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 22,
  "content": "strategy, which will be covered in the next chapter. Chan800064_c04.indd 90 5/20/2021 10:55:00 AM Setting Up Your Business 91 REFERENCES Economist. 2007. “Too Much Information.” July 12. www.economist.com /finance/displaystory.cfm?story_id=9482952. Markoff, John. 2007. “Faster Chips Are Leaving Programmers in Their Dust.” New York Times, December 17. www.nytimes.com/2007/12/17 /technology/17chip.html?ex=1355634000&en=a81769355deb7953&ei=5124 &partner=permalink&exprod=permalink. Oldfield, Richard. 2007. Simple but Not Easy. Doddington Publishing. Chan800064_c04.indd 91 5/20/2021 10:55:00 AM 45 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 93 CHAPTER 5 A t this point, you should have backtested a good strategy (maybe something like the pair-trading strategy in Example 3.6), picked a brokerage (e.g., Alpaca or Interactive Brokers), and have set up a good operating environment (at first, nothing more than a good computer and a high-speed internet connection). You are almost ready to execute your trading strategy—after you have implemented an automated trading system (ATS) to generate and transmit your orders to your brokerage for execution. This chapter is about building such an automated trading system and ways to minimize trading costs and divergence with your expected performance based on your backtests. WHAT AN AUTOMATED TRADING SYSTEM CAN DO FOR YOU An automated trading system will retrieve up-to-date market data from your brokerage or other data vendors, run a trading algorithm to generate orders, and submit those orders to your brokerage for execution. Sometimes, all these steps are fully automated and imple- mented as one desktop application installed on your computer. Execution Systems Chan800064_c05.indd 93Chan800064_c05.indd 93 20-05-2021 21:00:3520-05-2021 21:00:35 93 CHAPTER 5 A t this point, you should have backtested a good strategy (maybe something like the pair-trading strategy in Example 3.6), picked a brokerage (e.g., Alpaca or Interactive Brokers), and have set up a good operating environment (at first, nothing more than a good computer and a high-speed internet connection). You are almost ready to execute your trading strategy—after you have implemented an automated trading system (ATS) to generate and transmit your orders to your brokerage for execution. This chapter is about building such an automated trading system and ways to minimize trading costs and divergence with your expected performance based on your backtests. WHAT AN AUTOMATED TRADING SYSTEM CAN DO FOR YOU An automated trading system will retrieve up-to-date market data from your brokerage or other data vendors, run a trading algorithm to generate orders, and submit those orders to your brokerage for execution. Sometimes, all these steps are fully automated and imple- mented as one desktop application installed on your computer. Execution Systems Chan800064_c05.indd 93Chan800064_c05.indd 93 20-05-2021 21:00:3520-05-2021 21:00:35 Execution Systems 95 I will discuss some details of the two kinds of systems in the following sections. I will also discuss how to hire a programming consultant in case you would like someone to help automate the execution of your trading strategy. Building a Semiautomated Trading System In a semiautomated trading system (shown in Figure 5.1), a user typically generates a list of orders using familiar and easy-to-use software such as Excel, MATLAB, Python, or R. Often, the program that generates this order list is the same as the backtest program: After all, you are implementing the same quantitative strategy that you have backtested. Of course, you must remember to update the input data file to reflect the most recent data. This is usually done with either a program that can directly go to retrieve the appropriate data from a broker (such as Alpaca or Interactive Brokers), quanti- tative trading platform (such as QuantConnect or Blueshift), or data vendor’s (such as Algoseek or Quandl) API. Sometimes, the API is as simple as a DDE link that can update an Excel spreadsheet. Many brokerages that cater to semi-quantitative traders provide such DDE links. Interactive Brokers and Goldman Broker or data vendor’s historical and live market data API Excel/MATLAB/Python/R Orders file (.xlsx, .csv) Basket / spread trader app from broker Orders received by broker FIGURE 5.1 Semiautomated trading system. Chan800064_c05.indd 95Chan800064_c05.indd 95 20-05-2021 21:00:3520-05-2021 21:00:35 46 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 98 QUANTITATIVE TRADING I also used RediPlus’s DDE link for submitting orders for another basket trading strategy. I used MATLAB to generate the appropriate DDE link formula in each Excel cell so that it could automatically update the appropriate data for the particular symbol on that row. After the market opened, I ran a macro attached to that spreadsheet, which scanned through each symbol and submitted it (together with other order information contained in the spreadsheet) to my account at REDIPlus. Typically, a semiautomated trading system is suitable if you need to run this step only a few times a day in order to generate one or a few waves of orders. Even if your brokerage’s API provides an order submission function for your use in an Excel Visual Basic macro, its speed is usually too slow if you have to run this program frequently in order to capture the latest data and generate wave after wave of orders. In this case, one must build a fully automated trading system. But there is one reason why you may want a semi-automated instead of a fully automated system: the ability to sanity-check your orders before they went on their merry way to the broker. (Just do a search for Knight Capital Group, now part of the HFT firm Virtu Financial, about their $440 million software error on August 1, 2012.) Building a Fully Automated Trading System A fully automated trading system (see Figure 5.2) can run the trading algorithm",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:43.607261"
}