{
  "id": "17da4e21b048",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 135,
  "content": "occurs in the stocks making up the index, the divisor is changed to reflect the relative value of index, and to ensure that the index value represents a true picture of price changes in the marketplace. Regardless of the method used to calculate an index, prices for each of the component stocks must be determined. If a stock is traded on only one exchange, there is never any doubt as to the stock’s price. It is simply the last trade price. But what if a stock is traded on more than one exchange? If the last trade for a stock on one exchange is $52, while the last trade on a different exchange is $52!/, what price should be used in calculating the index? The answer is usually specified in the index prospectus, and is Most commonly the primary marketplace for that stock. In the United States the primary Marketplace for many stocks is the New York Stock Exchange, although this is not always the case. Some stocks may be primarily traded on the American, Chicago, Pacific, or Philadelphia Stock Exchanges, or in the over-the-counter market. A trader who follows a stock index should always know the source of the stock prices used to calculate that index. 304 Chapter 15 REPLICATING AN INDEX Suppose a trader wanted to create a holding of stocks that exactly replicated the value of the index. What would he have to do? If each point in our four-stock price weighted index is worth exactly $1, then the total value of the index is $274. A trader could simply purchase one share of each stock in the index to exactly replicate the index. Very often, however, for trading purposes the value of each point is assigned a value other than $1. If, for example, each point in the index is assigned a value of $100, the total dollar value of the index is: 274 x $100 = $27,400 Now in order to exactly replicate the index, a trader would have to purchase 100 shares of each stock. The value of his holding would then be: (125 + 80 + 52+ 17) x 100 = $27,400 Not only must a trader consider the value of each point in an index, he must also consider the effect the divisor will have on the index. Suppose that instead of 274, the index in our example has been set to 100 by using a divisor of 2.74. If the point value of the index is still $100, then the total value of the index is: 100.00 (index value) x $100 (point value) = $10,000 Now if we purchase 100 shares of each stock, the dollar value of our stock holding ($27,400) greatly exceeds the dollar value of the index ($10,000). Clearly, our stock holding does not replicate the index. Notice, however, that the index value of $10,000 is simply our stock value of $27,400 divided by the divisor of 2.74. In other words, if we divide each purchase of 100 shares of stock by 2.74, we will have a stock holding equal to the value of the index. To achieve this, we need to purchase 100/2.74, or approximately 361/2 shares of each stock.! If we do, the value of our stock holding will replicate the value of the index since: (125 + 80 + 52 + 17) x 36.5 = $10,000 The procedure is slightly more complex if we are attempting to replicate a capitalization weighted index. Consider our four-stock capitalization weighted example with a divisor of 36,300. Suppose each point in the index has a value of $500, so that the dollar value of the index is: 100.00 {index value) x $500 (point value) = $50,000 How can we create a capitalization weighted stock holding with a value of $50,000? In our price weighted example, we purchased shares of stock equal to the point value divided by the divisor. We can take the same approach with a capitalization weighted index, with one important change: we must multiply the resulting number by 1, Obviously, one cannot trade fractional shares of stock. In the real world, a trader attempting to replicate the sample index would have to buy either 36 or 37 shares of each stock. Stock Index Futures and Options 305 the total number of outstanding shares of the stock. The proper number of shares of each stock required to replicate our capitalization index is: Outstanding Point Required Shares Value Divisor Shares stock t: 10,000 x 500 + 36300 = 137.7 stock 2: 5,000 x 500 + 36300 = 68.9 stock 3: 25,000 x 500 + 36300 = 344.4 stock 4: 40,000 x 500 + 36300 = 551.0 We can see that this replicates the $50,000 value of the index since: (137.7 x 125) + (68.9 x 80) + (344.4 x 52) + (551.0 x 17) = 50,000 Summarizing, the number of shares of each stock required to replicate an index for a price weighted index: point value / index divisor for a Capitalization weighted index: outstanding shares x point value / index divisor STOCK INDEX FUTURES In theory one can create a futures contract on a stock index in exactly the same way that futures contracts have been created on traditional commodities. At expiration, the holder of a long stock index futures position would be required to take delivery of all the stocks, in their correct proportions, which make up the index. The holder of a short position would be required to make delivery of the stocks. In fact, very few stock index futures contracts are settled through the physical delivery of the stocks making up the index. Such a process, requiring the delivery of the correct number of shares of many different stocks, would be unmanageable for most Clearing organizations. To be perfectly fair, such a settlement procedure might require the delivery of fractional shares of stock, which is impossible. For all these reasons, exchanges have chosen to settle stock index futures at expiration in cash. Since futures",
  "word_count": 1000,
  "topics": [
    "options"
  ],
  "created_at": "2026-02-05T08:09:54.443092"
}