{
  "id": "c6bdc9f63670",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 91,
  "content": "the inside exercise price, the trader will now want the market to fall back from 120 to 110. Whenever the underlying market is below 110, the position will be bullish; whenever the underlying market is above 110, the position will be bearish. Conversely, if the trader is bearish, he can always choose to buy a butterfly where the inside exercise price is below the current price of the underlying market. But again, if the market moves down too quickly and goes through the inside exercise price, the position will invert from a negative to a positive delta. In a similar manner, a trader can choose time spreads that are either bullish or bearish. A long time spread always wants the near-term contract to expire exactly at-the-money. A long time spread will be initially bullish if the exercise price of the time spread is above the current price of the underlying market.! With the underlying market at 100, the June/March 110 call time spread (buy the June 110 call/sell the March 110 call} will be bullish since the trader will want the underlying market to rise to 110 by March expiration. The June/March 90 call time spread (buy the June 90 call/sell the March 90 call} will be bearish, since the trader will want the underlying market to fall to 90 by March expiration. However, like a long butterfly, a long time spread has a negative gamma, so that if the market moves through the exercise price, the delta can invert. If the market moves from 100 to 120, the June/March 110 call time spread, which was initially bullish, will become bearish. If the market moves from 100 to 80, the June/March 90 call time spread, which was initially bearish, will become bullish. 1. In the futures market the situation may be complicated by the fact that different futures months may be trading at different prices. Instead of choosing a traditional time spread where both options have the same exercise price, the trader may have to choose a diagonal spread to ensure that the position is either bullish (delta positive) or bearish (delta negative). 202 Chapter 10 VERTICAL SPREADS Tt is common for traders to take bull or bear market positions by choosing appropriate ratio spreads, butterflies, or time spreads, but in each of these positions volatility is still the primary concern. A trader can be right about market direction, but if he is wrong about volatility, the spread may not retain the directional characteristics that the trader intended. If a trader focuses initially on the direction of the underlying market, he might look for a spread where the directional characteristics of the spread are the primary concern, and volatility is of secondary importance. He would like to be certain that if the spread is initially bullish (delta positive) it will remain bullish under all possible market conditions. If it is initially bearish (delta negative) it will remain bearish under all possible market conditions. The class of spreads which meet the above requirements are known as vertical spreads. A vertical spread always consists of one long (purchased) option and one short (sold) option, where both options are of the same type (either both calls or both puts) and expire at the same time. The options are distinguished only by their different exercise prices. Typical vertical spreads might be: buy 1 June 100 call sell 1 June 105 call or buy 1 March 105 put sell 1 March 95 put Vertical spreads are not only initially bullish or bearish, but they remain bullish or bearish no matter how market conditions change. Two options which have different exercise prices but which are identical in every other respect cannot have identical deltas. In the first example, where the trader is long a June 100 call and short a June 105 call, the June 100 call will always have a delta greater than the June 105 call. If both options go deeply into-the-money or very far out-of-the-money, the deltas may be almost identical. Even then, the June 100 call will have a delta fractionally greater than the June 105 call. In the second example, no matter how market conditions change, the March 105 put will always have a delta greater than the March 95 put. At expiration, a vertical spread will have a minimum value of zero, if both options are out-of the-money, and a maximum value of the amount between exercise prices, if both options are in-the-money. If the underlying market is below 100 at expiration, the June 100/105 call spread will be worthless because both options will be worthless. If the market is above 105, the same spread will be worth five points because the June 100 call will be worth exactly five points more than the June 105 call. Similarly, the March 95/105 put spread will be worthless if the underlying market is above 105 at expiration, and it will be worth 10 points if the market is below 95. The expiration values of typical bull and bear vertical spreads are shown in Figures 10-1 and 10-2. Bull and Bear Spreads 203 Figure 10-1 sell a call (put) at a higher exercise price = [e) — oO a 7) fe] a ~<a buy a call (put) at a lower exercise price Figure 10-2 sell a call (put) at a lower exercise price ~< F— J 4 a g pa buy a call (put) at a higher exercise price 204 Chapter 10 Since a vertical spread at expiration will always have a value between zero and the amount between exercise prices, a trader can expect the price of such a spread to be somewhere within this range. A 100/105 call vertical spread will trade for some amount between zero and five points; a 95/105 put vertical spread will trade for some amount between zero and 10 points. The exact value will depend on the likelihood of the underlying market finishing below the lower exercise price, above the higher exercise price, or somewhere in",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.436292"
}