{
  "id": "47aa77574867",
  "source": "Thinking_In_Bets.pdf",
  "source_type": "pdf",
  "title": "Thinking In Bets",
  "chunk_index": 1,
  "content": "is where Nick the Greek went wrong. We can update the learning loop to represent this like so: Think about this like we are an outfielder catching a fly ball with runners on base. Fielders have to make in - the- moment game decisions about where to throw the ball: hit the cutoff man, throw behind a base runner, throw out an advancing base run- ner. Where the outfielder throws after fielding the ball is a bet. We make similar bets about where to “throw” an outcome: into the “skill bucket” (in our control) or the “luck bucket” (out - side of our control). This initial fielding of outcomes, if done well, allows us to focus on experiences that have something to teach us (skill) and ignore those that don’t (luck). Get this right and, with experience, we get closer to whatever “-ER” we are striving for: better, smarter, healthier, happier, wealthier, etc. It is hard to get this right. Absent omniscience, it is difficult LEARNING LOOP 2 BET sKILL OUTCOME LUCKBELIEF 9780735216358_ThinkingIn_TX.indd 84 12/1/17 1:24 AM i i i i i i i 192 THINKING IN BET s for the long run. Look at this chart of Berkshire’s performance since 1964: Now zoom in on a random day in late January 2017. The upticks and downticks look large and potentially frightening. You can imagine sitting at the low point around 11:30, feeling like your losses are spiraling. 10AM 12PM 2PM 4PM 9780735216358_ThinkingIn_TX.indd 192 12/1/17 1:24 AM 192 THINKING IN BET s for the long run. Look at this chart of Berkshire’s performance since 1964: Now zoom in on a random day in late January 2017. The upticks and downticks look large and potentially frightening. You can imagine sitting at the low point around 11:30, feeling like your losses are spiraling. 10AM 12PM 2PM 4PM 9780735216358_ThinkingIn_TX.indd 192 12/1/17 1:24 AM Look at this chart of Berkshire’s performance since 1964: Now zoom in on a random day in late January 2017. The upticks and downticks look large and potentially frightening. Y ou can imagine sitting at the low point around 11:30, feeling like your losses are spiraling. - Berkshire Hathaway - S&P 500 10,000,000 i 1,000,000 ~ \"' .!! 100,000 o· 0 \" 10,000 ... ; 1,000 i 100 ~ ·c 0.. 10 '64 '66 '68 70 72 '74 76 78 '80 '82 '84 '86 '88 '90 '92 '94 '96 '98 '00 '02 '04 '06 '08 '10 '12 '14 '16 A D v ENTURE s IN M ENTAL T IME T RA v EL 209 to, given what they knew about each of those things (and, of course, numerous others)? Just as they relied on reconnaissance, we shouldn’t plan our future without doing advance work on the range of futures that could result from any given decision and the probabilities of those futures occurring. For us to make better decisions, we need to perform recon- naissance on the future. If a decision is a bet on a particular fu- ture based on our beliefs, then before we place a bet we should consider in detail what those possible futures might look like. Any decision can result in a set of possible outcomes. Thinking about what futures are contained in that set (which we do by putting memories together in a novel way to imagine how things might turn out) helps us figure out which decisions to make. Figure out the possibilities, then take a stab at the probabil- ities. T o start, we imagine the range of potential futures. This is also known as scenario planning. Nate Silver, who compiles and interprets data from the perspective of getting the best strategic use of it, frequently takes a scenario- planning approach. Instead of using data to make a particular conclusion, he sometimes takes BET (sET OF OUTCOMEs)BELIEF BETTING ON A FUTURE BET FUTURE C FUTURE D ETC. FUTURE B FUTURE A BELIEF 9780735216358_ThinkingIn_TX.indd 209 12/1/17 1:24 AM9780735216358_ThinkingIn_TX.indd 208 12/1/17 1:24 AM A D v ENTURE s IN M ENTAL T IME T RA v EL 209 to, given what they knew about each of those things (and, of course, numerous others)? Just as they relied on reconnaissance, we shouldn’t plan our future without doing advance work on the range of futures that could result from any given decision and the probabilities of those futures occurring. For us to make better decisions, we need to perform recon- naissance on the future. If a decision is a bet on a particular fu- ture based on our beliefs, then before we place a bet we should consider in detail what those possible futures might look like. Any decision can result in a set of possible outcomes. Thinking about what futures are contained in that set (which we do by putting memories together in a novel way to imagine how things might turn out) helps us figure out which decisions to make. Figure out the possibilities, then take a stab at the probabil- ities. T o start, we imagine the range of potential futures. This is also known as scenario planning. Nate Silver, who compiles and interprets data from the perspective of getting the best strategic use of it, frequently takes a scenario- planning approach. Instead of using data to make a particular conclusion, he sometimes takes BET (sET OF OUTCOMEs)BELIEF BETTING ON A FUTURE BET FUTURE C FUTURE D ETC. FUTURE B FUTURE A BELIEF 9780735216358_ThinkingIn_TX.indd 209 12/1/17 1:24 AM9780735216358_ThinkingIn_TX.indd 208 12/1/17 1:24 AM A D v ENTURE s IN M ENTAL T IME T RA v EL 193 If you zoomed in on the performance of Berkshire Hathaway stock during the banking crisis, September 2008 to March 2009, you would feel terrible most days : Yet we know from the first chart, the big picture, that all those minute - to -minute and even day- to -day changes had little effect on the investment’s general upward trajectory. Our problem is that we’re ticker watchers of our own lives. Happiness (however we individually define it)",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "crypto"
  ],
  "created_at": "2026-02-05T00:37:47.321559"
}