{
  "id": "abe64daa8c3d",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 33,
  "content": "reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing CHAPTER 4 On Trading Ranges The heavy is the root of the light. The unmoved is the source of all movement. —Daodejing (ca. 6 BCE) P rice action in trends is often not that difﬁcult to read, as there are a number of patterns that give insight into the integrity of the trend at any moment; trading ranges are more complicated because price action in those ranges is much more random. The deﬁning patterns of trading ranges are the tests of support and resistance near the conﬁnes of the range, but price action around support and resistance is complex. Much of the conventional wisdom about support and resistance is not correct, and many support or resistance levels used by traders are probably no better than any random level in the market. The study of trading ranges must begin with a careful look at support and resistance, with a willingness to question some long-held beliefs about these levels. SUPPORT AND RESISTANCE In their venerable bible of technical analysis, Edwards and Magee (1948; 4th ed., 1964) deﬁne support as “the price level at which a sufﬁcient amount of demand is forthcoming to stop, and possibly turn higher for a time, a downtrend”; they give the inverse deﬁnition for resistance. The idea is that, as price declines, lower prices will naturally ﬁnd more willing buyers. At some point, price declines far enough that buyers are willing to soak up all the sell orders in the market, and the market will stop going down. This theoretical concept is sound, but there is another important point to consider: real markets have so many competing inﬂuences and so much noise that prices frequently stop at random levels. That, coupled with our innate tendency to ﬁnd patterns in random data, can cause support and resistance areas to appear on charts for no signiﬁcant reason. 97 P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing On Trading Ranges 99 A B FIGURE 4.1 Resistance Becomes Support intraday charts of Baidu, Inc. (Nasdaq: BIDU), a fairly volatile and active stock at the time. Notice how well these levels are deﬁned, and how well they hold on the retests. Figure 4.2 shows a classic example where a resistance level held at A, was broken at B, and then held cleanly as support on a retest at C. Figure 4.3 shows another example where previous support was broken, but then held as resistance on three successive retests. Note in particular that the last retest saw FIGURE 4.2 Resistance Breaks (B) and Holds as Support on the Retest 47 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing On Trading Ranges 99 A B FIGURE 4.1 Resistance Becomes Support intraday charts of Baidu, Inc. (Nasdaq: BIDU), a fairly volatile and active stock at the time. Notice how well these levels are deﬁned, and how well they hold on the retests. Figure 4.2 shows a classic example where a resistance level held at A, was broken at B, and then held cleanly as support on a retest at C. Figure 4.3 shows another example where previous support was broken, but then held as resistance on three successive retests. Note in particular that the last retest saw FIGURE 4.2 Resistance Breaks (B) and Holds as Support on the Retest BOU - 3 min Baidu Inc 103.00 102.50 102.00 101.50 101.00 10:00 10:30 11:00 11:30 12:00 12:30 13:00 13:30 14:00 14:30 15:00 15:30 48 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing 100 MARKET STRUCTURE FIGURE 4.3 Support Breaks, but Holds as Resistance on Three Retests price trade well through the level, but sellers quickly won and drove the market lower. It is common to see price penetrate a level just enough to lure traders into making the wrong decisions at these points. In this case, shorts using the level to manage their risk would have likely bought to cover, as it seemed resistance was failing; this type of action and reversal is often a catalyst for a strong move when the trapped traders panic out of their positions. Last, Figure 4.4 shows an example in which a level was engaged nine times in the space of two trading days, holding cleanly on all but two of the tests. These are textbook examples of price action around support and resistance levels, but there is one small problem: the levels in these examples are random price levels! These are not actual support and resistance levels; they were drawn by hiding the price bars and randomly drawing lines on the chart without regard to prices or market struc- ture. (This was done on a live video available at http://adamhgrimes.com/blog/2011/12/04/ randomsrlevels/) You can, and should, reproduce this experiment yourself. This is an ex- periential process—you must actually do this yourself, ideally several times. You may be very surprised to see that many of the standard patterns around support and resistance 115.00 114.50 114.00 113.50 113.00 A 112.50 112.00 111.50 111.00 110.50 110.00 14:00 15:00 11/12 10:00 11:00 12:00 13:00 14:00 49 This PDF file is part of the audiobook THE ART",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "risk_management"
  ],
  "created_at": "2026-02-05T00:37:53.700433"
}