{
  "id": "8e877c333b82",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 138,
  "content": "implied index value is therefore 434.93 — 3.00 = 431.93. INDEX ARBITRAGE In theory, the price of a futures contract should always reflect the fair value of holding the futures contract rather than holding the stocks making up the index. But markets are not always one hundred percent efficient. If the futures price doesn’t reflect the fair value, a trader can execute a profitable arbitrage by purchasing the undervalued asset, either the basket of stocks or the futures contract, and selling the overvalued asset. If a trader believes that the fair value of a stock index futures contract is 386.75, and finds that the futures contract is trading at 387.40, he will attempt to buy all the stocks in their correct proportion and simultaneously sell the futures contract. If the trader succeeds, and if the point value of the futures contract is $500, for each futures contract he executes he will show a theoretical profit of: (387.40 - 386.75) x $500 = .65 x $500 = $325 310 Chapter 15 Of course, this profit will only be fully realized at expiration, when the futures contract is automatically settled at the index value. At the same time, the trader will also have to liquidate his stock holdings to ensure that at the moment of expiration both his futures position and stock position zero out. This can be done by placing a market on close order, guaranteeing that the last trade price for each stock which determines the final index value will be the liquidatton price for the trader’s stock holdings. What would happen if the fair value for the stock index futures contract were 386.75, but the futures contract were actually trading at 385.95? Now the trader would take just the opposite position, buying the undervalued futures contract and selling the basket of stocks. The theoretical profit would be: (386.75 — 385.95) x $500 = .80 x $500 = $400 Unfortunately, some practical problems might affect the workability of this strategy. If the trader wants to sell stock which he doesn’t own, he will have to borrow it. If no stock is available, or if the market in which he is dealing does not freely permit the short sale of stock, he may not he able to execute the arbitrage, no matter how mispriced the futures contract. Finally, a trader might not earn full interest on the short sale of stock. If the actual interest earned is less than the interest rate used to calculate the fair value of the futures contract, the fair value of the futures contract, for trading purposes, may be less than the presumed fair value of 386.75. This type of trading strategy, where one buys or sells a mispriced stock index futures contract and takes an opposing position in the underlying stocks, is one type of index arbitrage. Since computers can often be programmed to calculate the fair value of a futures contract, and to execute the arbitrage when the futures contract is mispriced, such a strategy is also commonly referred to as program trading. A buy program consists of buying the stocks and selling the futures contract, anda sell program consists of selling the stocks and buying the futures contract. How great a mispricing of a futures contract relative to the price of the underlying stocks justifies futures arbitrage? If markets are totally frictionless, a trader would attempt to execute an arbitrage if there were any mispricing, no matter how small. Unfortunately, markets are not totally frictionless. An arbitrage which in theory is profitable because of a mispriced futures contract may be unprofitable when transaction costs are factored in. If a trader believes that it will cost approximately 4 index point to execute all the trades required for an arbitrage, he will not attempt to enter into a program trade unless the futures contract is at least 50 too expensive or too cheap. If he also considers the problems associated with the short sale of stock, he may decide that the futures contract must be .75 too cheap before he will initiate a sell program. With the fair value of the futures contract at 386.75, the trader will initiate a program trade only if the price of the futures contract is outside the range 386.75 —.75 and 386.75 + .50 or less than 386.00 and more than 387.25. Even if the quoted index price is 386.75, and the futures contract is higher than 387.25 or lower than 386.00, the trader cannot be certain that a profit opportunity Stock Index Futures and Options 311 exists. In order to execute an arbitrage, it is necessary to trade all the stocks at a price consistent with the index value of 386.75. But there is a bid price and an offer price for each individual stock, and it is likely that the last trade price for some of the stocks in the index took place at the bid price, some at the ask price, and some at prices in petween. If a trader wants to immediately execute a buy program, he will have to purchase every stock in the index at the ask price, and this may be at a price well above the quoted index value. Moreover, the quoted index price can sometimes present a distorted picture of actual market conditions. The index itself may be quoted at 386.75, but does that represent the price at which all the stocks in the index are trading? Perhaps trading in some of the stocks has been halted due to pending news. Or perhaps the last sale for one or more of the stocks took place at a price outside the current market for the stock. The last sale in a stock may have been at 381/4, but if the market in the stock is falling very quickly, the offered price for the stock may be 37%. The index value is based on the last sale price of 38/4, but the actual price is at least as low as 37%4, and",
  "word_count": 1000,
  "topics": [
    "options",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.443551"
}