{
  "id": "2ed2350120a7",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 42,
  "content": "63.00, exactly the amount predicted by the theoretical pricing model. If we could do all this, there would be no reason to hold the position for the full ten weeks. 90 Chapter 5 How likely is an immediate reevaluation in implied volatility from 14.6% to 18.3%? While violent changes in implied volatility are possible, they are the exception rather than the rule. Changes usually occur gradually over a period of time, and are the result of equally gradual changes in the volatility of the underlying contract. As the volatility of the underlying contract changes, option demand either rises or falls, and this demand is reflected in a corresponding rise or fall in the implied volatility. In our example, if market participants realized that the price of the underlying futures contract were fluctuating at a volatility greater than 14.6%, we would expect implied volatility to begin to rise. If implied volatility ever reached our target of 18.3%, we could sell out our calls and buy in our futures, thereby realizing our expected profit of 63.00 without having to hold the position for the full ten weeks. However, option prices are subject to a wide variety of market forces, not al! of them theoretical. There is no guarantee that implied volatility will ever reevaluate up to 18.3%. In that case, we will have to hold the position for the full ten weeks and continue to adjust in order to realize our profit. Every trader hopes for quick reevaluation of implied volatility towards his volatility forecast. It not only enables him to realize his profits more quickly, but it eliminates the risk of holding a position for an extended period of time. The longer a position is held, the greater the possibility of error from the inputs into the model. Not only might implied volatility not reevaluate favorably, it might actually move against us, even if the true volatility of the underlying contract moves in our favor. Suppose that after initiating our hedge, implied volatility immediately falls to 13.5% from 14.6%. The price of the June 100 call will fall from 3.25 to 3.06. Now we have a paper loss of 100 x -.19 =—19.00. Does this mean we made a bad trade and should close out the position? Not necessarily. If the volatility forecast of 18.3% turns out to be correct, the options will still be worth 3.88 by expiration. If we hold the position and adjust, we can eventually expect a profit of 63.00. Realizing this, we ought to maintain the position as we originally intended. Even though an adverse move in implied volatility is unpleasant, it is something with which all traders must learn to cope. Just as a speculator can rarely hope to pick the exact bottom or top at which to take a long or short position, an option trader can rarely hope to pick the exact bottom or top in implied volatility. He must try to establish positions when market conditions are favorable. But he must also realize that conditions might become even more favorable. If they do, his initial trade may show a temporary loss. This is something a trader learns to accept as a practical aspect of trading. Let’s look at a somewhat more complex hedge, this time in the form of mispriced stock options. Suppose current market conditions are as follows: Stock price = 4814 Interest rate = 8.00% Time to March expiration = 10 weeks Expected dividend = 50¢ in 40 days Note that we now have an additional input, the expected dividend. Of course, we still need the volatility over the life of the option. Again looking into our crystal ball, we Using an Option’s Theoretical Value 91 see that the volatility over the next 10 weeks will be 32.4%. Again, we decide to look at a call which is close to at-the-money, specifically the March 50 call. Feeding all of our inputs into the Black-Scholes model, we find that the March 50 call has a theoretical value of 2.17 and a delta of 46. Having determined the theoretical value of the call, we still need its price in order to see if there is any profit opportunity available. In this case, it turns out that the call is trading for 3 (an implied volatility of 42.2%). Since the option is overpriced, we want to sell it and establish a delta neutral hedge against the underlying contract. We might, for example, sell 100 March 50 calls and simultaneously buy 46 stock contracts. Assuming this option is trading on a U.S. stock options exchange where each underlying contract consists of 100 shares of stock, it will be necessary to buy 4600 shares of stock. Asin alt hedges based on a theoretically mispriced option, it is necessary to maintain a delta neutral position throughout the life of the option. As before, we will make our adjustments at weekly intervals, but now the underlying contract is shares of stock. Figure 5-2 shows the adjustment process for this hedge. Let’s go through the hedge step by step and see what the final results are. Original Hedge: At expiration, with the stock at 523%, the 50 calls were worth 2%. So on the option we showed a profit of $300 - $237.50, or $62.50. The 4600 shares of stock we purchased at 48. we were able to sell at 524, for a profit of 37% ($3.875} per share. The total hedge profit was therefore +(100 x $62.50) +(4600 x $3.875) = +$24,075. Adjustments: The adjustment process forced us to buy and sell stock to remain delta neutral. At week one we bought 600 shares of stock at 4954; at week two we bought 1400 shares at 521%; at week three we sold 200 shares at 5134; and so on. At week ten we sold out our remaining 900 shares of stock at 523%. The result of all these Figure 5-2 Stock Deltaof Total Delta Adjustment Total Share Interest on Week Price 50 call Position inShares Adjustment Cash",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.428847"
}