{
  "id": "9518cf6fc51c",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 65,
  "content": "greater than if he had sold one straddle or done a moderate sized ratio vertical spread. If, however, the market makes an unexpectedly large move, short strangles also entail the greatest risk. All option positions are a tradeoff Volatility Spreads 145 between risk and reward. Jf the reward is great, so is the risk; if the risk is small, so is the reward. Based on their similar characteristics, it is sometimes convenient to classify long straddles and long strangles as special types of backspreads. This follows logically from the definition of a backspread: long more contracts than short, with all options expiring in the same month. A long straddle or strangle consists only of long options (long calls and long puts), with all options expiring at the same time. Hence, these positions are backspreads. (Even though the owner of a put has a short market position, he is said to be long the put because he has purchased it.) The same reasoning leads us to classify short straddles and strangles as special types of ratio vertical spreads. Short straddles and strangles consist only of short options, with all options expiring at the same time. Hence, the positions conform to our definition of a ratio vertical spread. BUTTERFLY Thus far we have looked at spreads which involve buying or selling two different option contracts. However, we need not restrict ourselves to two-sided spreads. We can also construct spreads consisting of three, four, or even more different options. A butterfly consists of options at three equally spaced exercise prices, where all options are of the same type (either all calls or all puts) and expire at the same time. In a long butterfly the outside exercise prices are purchased and the inside exercise price is sold, and vice versa for a short butterfly.! Moreover, the ratio of a butterfly never varies. It is always 1 x 2 x 1, with two of each inside exercise price traded for each one of the outside exercise prices, If the ratio is other than 1 x 2 x 1, the spread is no longer a butterfly. Typical examples of long and short butterflies are shown in Figures 8-9 and 8-10. Since a butterfly consists of equal numbers of long and short options, it does not fit conveniently into the backspread or ratio vertical spread category. However, as com- monly traded, a long butterfly tends to act like a ratio vertical spread and a short butterfly tends to act like a backspread. To understand why, consider a trader who buys a 95/100/105 call butterfly (long a 95 call, short two 100 calls, long a 105 call}. What will be the value of this position at expiration? If the underlying contract is below 95 at expiration all the calls will expire worthless, and the value of the position will be zero. If the underlying contract is above 105 at expiration, the value of the 95 and 105 calls together will be identical to the value of the two 100 calls. Again, the value of the butterfly will be zero. Now suppose the underlying contract is somewhere between 95 and 105 at expiration, specifically, right at the inside exercise price of 100. The 95 call will be worth 5 points, while the 100 and 105 calls will be worthless. The position will therefore be worth 5 points. If the underlying moves away from 100 the value of the butterfly will decline, but its value can never fall below zero. 1. The inside exercise price is sometimes referred to as the body of the butterfly, while the outside exercise prices are referred to as the wings. 146 Chapter 8 Figure 8-9: Long Butterfly long 10 March 95 calls (78) short 20 March 100 calls (51) long 10 March 105 calls (24) long 30 June 90 puts (-17) short 60 June 95 puts (-30) long 30 June 100 puts (-46) = 2 ou ” ~<a —_» 3 a) buy a sell two buy a call (put) calls (puts) cail (put) at a lower at a middle at a higher exercise price exercise price exercise price Figure 8-10: Short Butterfly sella buy two sell a call (put) calls (puts) call (put) at a lower at a middle at a higher exercise price exercise price exercise price = 2 a. _<- a n o — short 20 March 100 puts (-48) long 40 March 105 puts {-75) short 20 March 110 puts (-91) short 25 June 95 calls (67) long 50 June 100 calls (51) short 25 June 105 calls (36) Volatility Spreads 147 At expiration a butterfly will always have a value somewhere between zero and the amount between exercise prices. It will be worth zero if the underlying contract is below the lowest exercise price or above the highest exercise price, and it will be worth its maximum if the underlying contract is right at the inside exercise price. Since a butterfly has a value between zero and the amount between exercise prices (5 points in our example}, a trader should be willing to pay some amount between zero and 5 for the position. The exact amount depends on the likelihood of the underlying contract finishing right at or close to the inside price at expiration. If there is high probability of this occurring, a trader might be willing to pay as much as 41% or 414 for the butterfly, since it might very will expand to its full value of 5 points. If, however, there is a low probability of this occurring, and consequently a high probability that the underlying contract will finish outside the extreme exercise prices, a trader may only be willing to pay 14 or 3%, since he may very will lose his entire investment. Now we can see why a long butterfly tends to act like a ratio vertical spread. If a trader feels that the underlying contract will remain within a narrow range until expiration, he can buy a butterfly where the inside exercise",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.432252"
}