{
  "id": "b9f0390f9fda",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 57,
  "content": "HO- 6- ge\" oP\" eBapn Bou, eBwwer eyeQ onjeaA aod [eonesoeyL bOc~ be l+ OOL+ xX cht 0 98- x o- g0'+ X& Eb+ x gt SO'-x8 Bat xX Spt OxGl 8r-x Ol+ Z40+x Ob bit x L- gsO+xZ 6-—X ght bh- xX 2b 06+ xX JI- Ebt+xab 0 Q0'e+ Bot X OL- OxOl bS+ x Oot 90+ x 02 blt+xOl- go'+x Oh OS b+ og'+ CT+X OL- SO'+ xX OF Bat x OE+ OxOl oz- Gc- 8p- x SI- Z0-xSt blt+xOl- g0'+x Oh Sc- Selt 6- X $2—- Lt x Ge Gcé- x OL+ 60-*X Ol e+ 02 1+ 001+ 9 O1- 0 {G+ x Ogt+ 90°+ x 02 Uonsod &}]/9q efpy jeojaioey | 80° plo 92 et og’ pL 220 ip 82 set OL 920- 6'P bg 6L'€ eb 0z0\"- 6'e bl 8l'9 20° 600°- or 06 2c'Or eBe, eyuL ewweyg = eyeg onjea [Bop esoout sainyny zp Buoy sind gL} € yous SHES OLL g Buc] s$|129 SOL $1 Buoy sind Oo} 0} Buo| sileo $6 2 yoys sind 06 Z} Buoy SHES O6 21 UOYS s|je9 SOL OF WoYs sy29 001 Og Buoy Seo G6 OL YoYs sifeo OL OL Yous S129 SO} 0} Bud} sind ool S} Hous SHPO SE OL Hous sind 06 Sz yoys snd s6 0} Buoy seniny OF oys $1129 001 OZ Buo| uonlsod gs Obl scl sol ere ool 92°9 $6 sear 06 89d 39d es|o1axXy SLAd ST1V9 92-9 aunbi4 126 Chapter 6 In our example we have: ; 50 elasticity = 2.50 x 25 =5 One final observation for the prospective trader. All the numbers we have discussed in this chapter, the theoretical value, delta, gamma, theta, vega, and rho, are constantly changing, so that the profitability and risks associated with different strategies are also changing. The importance of analyzing risk cannot be overemphasized. The great majority of traders who fail at option trading do so because they fail to fully understand risk and how to manage it. But there is another type of trader, one who attempts to analyze every possible risk. When this happens, the trader finds it difficult to make any trading decisions at all; he is stricken with paralysis through analysis. A trader who is sO concerned with risk that he is afraid to make a trade cannot profit, no matter how well he understands options. When a trader goes into the marketplace he has chosen to take on some risk. The delta gamma, theta, and vega enable him to identify risk; they do not eliminate risk. The intelligent trader uses these numbers to help him decide beforehand which risks are acceptable and which risks are not. a 7 & Introduction to Spreading In option markets, as in all markets, there are many ways to trade profitably. One type of trading strategy, common among floor traders, is scalping. A scalper attempts to buy at the bid price and sell at the offer price as often as possible, without regard to the contract’s theoretical value. Although the profit from each trade may be small, ifa trader can do this enough times each day he can expect to show a reasonable profit. Scalping, however, requires a highly liquid market, and option markets are rarely sufficiently liquid to support this type of trading. A different type of trading strategy involves speculating on the direction in which the underlying contract will move. If a speculator correctly anticipates the market direction, and takes an appropriate position, he can also expect to show a profit. But even when the market moves in the expected direction, taking a directional position in an option market will not necessarily be profitable. Many different forces beyond directional considerations can affect an option’s price. If a trader’s sole consideration is direction, he will usually be better off taking a position in the underlying market. If he does, and he is right, he is assured of making a profit. The majority of successful option traders engage in spread trading. Since option evaluation is based on the laws of probability, and because the laws of probability can be expected to even out only over long periods of time, option traders must often hold positions for extended periods. Unfortunately, over short periods of time, while the trader is waiting for the option price to move towards theoretical value, the trader may be at risk from a wide variety of changes in market conditions which threaten his potential profit. Indeed, over short periods of time there is no guarantee that an option will react in a manner consistent with a theoretical pricing model. Spreading is simply a way of enabling an option trader to take advantage of theoretically mispriced options, while at the same time reducing the effects of short-term changes in market conditions so that he can safely hold an option position to maturity. WHAT IS A SPREAD? A spread is a strategy which involves taking simultaneous but opposing positions in different instruments. A spread trader makes the assumption that there is an identifiable price relationship between different instruments and, although he may not know in 127 128 Chapter 7 which direction the market will move, the price relationship between the instruments ought to remain relatively constant. When the relationship appears to be temporarily mispriced, the spread trader will take a long position in the instrument which appears to be underpriced and a short position in the instrument which appears to be overpriced. The trader hopes to profit when the prices of the instruments return to their expected relationship. Among futures traders the most common type of spread involves taking opposing positions in different delivery months for the same commodity. A trader might purchase October crude oil and sell November crude oil on the New York Mercantile Exchange. Or he might buy December corn and sell July corn on the Chicago Board of Trade. The value of this type of intra-market spread depends on a variety of factors, the most important of which is usually the cost of carrying",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.431086"
}