{
  "id": "e107998a2410",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 149,
  "content": "greater than fair value. But this is by far the exception. In stock index markets around the world, there tends to be constant downward pressure on derivative Products. 8. The Chicago Stock Exchange has tried to facilitate the trading of index products by introducing the Chicago Basket (CMX), a basket of 20 major U.S. stocks which can be traded at one time, and which is not subject to the uptick rule. Hence, a trader who wants to be short all 20 stocks can sell the basket without worrying about finding an uptick in each individual stock. Chapter 15 328 e6-uer 26 1nr eo-uer Leiner Le-uer o6-Inr oe-uer s8inr ao AyjneloA jeou0ys!H (%) AWEIOA pezienuuy xapul AUIE|OA Paljduuyy SE (xtA) Xepul AHeloA paiduy XIO snssea AyHeloA [eo140;s1H Aeq-of XAO :F-Sb esnbly Stock Index Futures and Options 329 Finally, there also tends to be a consistent bias in premium levels in index option markets. This can be seen in Figure 15-4, a comparison of the 30-day historical volatility of the OEX with the OEX implied volatility index from 1989 to 1992.9 Note that the implied volatility is almost always greater than the historical volatility. If one believes that the traditional theoretical pricing models are reasonably accurate, it is clear that those who purchase index options are consistently overpaying for them. While a professional trader would not expect to be very successful if he consistently paid more for options than their theoretical values, such an approach is not necessarily unreasonable for a hedger. If one thinks of options as insurance protection, there are definite benefits that go with owning options. In particular the owner of an option has limited risk with unlimited profit potential. Regardless of theoretical value, these are benefits for which hedgers are very often willing to pay an extra amount. To see why, consider a homeowner who buys insurance to protect his family. Since the insurance company is in business to make a profit, the homeowner knows that the premiums being charged are more than the policy’s theoretical value. Nonetheless, the homeowner is willing to pay the extra premium for the privilege of knowing his family is protected against calamity. In the same way, a portfolio manager who believes that his selection of stocks will outperform the market may be willing to pay something more than theoretical value to protect the value of the portfolio when the market moves against him. If he believes that his portfolio will consistently appreciate by more than the cost of the options, he may be willing to overpay since the options will protect him, while at the same time leaving him ahead in the long run. 9. The OEX volatility index (VIX), disseminated by the Chicago Board Options Exchange, represents the implied volatility of a theoretical at-the- money OEX option with 30 days remaining to expiration. S 16 & Intermarket Spreading While most spreading takes place within one underlying stock, commodity, or index (intramarket spreading}, a trader need not limit himself to such a narrow playing field. If a trader can identify a relationship between contracts in two different markets, and finds that the instruments are mispriced relative to each other, it is possible to spread one instrument or its derivative products against another instrument or its derivative markets (intermarket spreading). For example, suppose a trader follows two instruments, ABC and XYZ, and decides that ABC will be stronger than XYZ over the next several months. Based on this assessment, the trader might create a spread by purchasing ABC and selling XYZ. Let’s assume the trader purchases ABC at its current price of 50, and sells XYZ at its current price of 100. If ABC rises to 53 and XYZ falls to 98, the trader will show a five-point profit since he can buy back the spread, which he originally sold for 50, at 45. Note that it is not necessary for ABC to rise and XYZ to fall. If ABC rises to 60 and XYZ rises to 105, the trader will still realize a five-point profit. Or if ABC falls to 47 and XYZ falls to 92, the trader will realize the same five-point profit. All that is necessary is that in total points ABC is stronger, or less weak, than XYZ. Suppose that after initiating the spread, the trader finds that ABC has risen to 60, while XYZ has risen to 115. The spread seems to have gone against the trader as it has widened from the original price of 50 to 55. In point terms the trader was wrong since XYZ was five points stronger than ABC. But many traders would still contend that ABC was stronger than XYZ since ABC rose 20% (10/50) while XYZ only rose 15% (15/100) over the same period. If a trader chooses to measure movement in percent terms, he cannot simply buy ABC and sell XYZ. In order to equalize the percent price changes, his spread must be long and short an equal number of points. In order to accomplish this, for each 100-point XYZ contract the trader sells, he must purchase two 50-point ABC contracts. Now he is long and short an equal number of points. If ABC rises to 60 (a 20% gain) and XYZ rises to 115 (a 15% gain), he will show a profit of: 2 x (60 - 50) - 1 x (115-100) =5 If ABC falls 6% to 47 and XYZ falls 10% to 90, the trader will likewise realize a profit Since: -2 x (50 — 47) + 1 x (100 - 90) = 4 Now in order to make a profit, ABC need only be stronger (or less weak) than XYZ in Percent terms. 331 332 Chapter 16 In our example we tried to ensure that we were long and short the same number of points on each side of our spread. However, the situation can be further complicated if the point values of the instruments are unequal. Suppose that each point in ABC is worth $400,",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.445261"
}