{
  "id": "5161e796a6e4",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 110,
  "content": "cash must be greater than the insurance value of the option. Because the cash flow which results from the exercise of a stock option is significantly different from the cash flow which results from the exercise of a futures option, the conditions under which early exercise will be desirable are different. For this reason, we will look at these two situations separately. FUTURES OPTIONS From previous discussions (see Chapter 6) we know that in evaluating an option there are some factors which make the option more valuable and there are some factors which make the option less valuable. Consider a futures option. We might list the factors which affect its value as follows: option value = intrinsic value + volatility value — interest rate value Since the intrinsic value and volatility components can never be less than zero, these factors always enhance the option’s value. As either rises, the option value rises. Only the interest rate component might affect the option’s value negatively. As interest considerations rise, the option’s value falls. If the negative effects of interest rates are greater than the positive effects of volatility, it might be possible for an option, if it is 241 242 Chapter 12 European, to be worth less than parity.! In such a case, if the option were an American option it would become an early exercise candidate. For example, suppose a certain futures contract is trading at 100. Suppose also that we own an 80 call which will expire in two months, and that this option is subject to stock-type settlement. When we evaluate the option, we find that it has a theoretical value of 20 and a delta of 100. This means that the option has essentially the same characteristics as the futures contract. If the option is American, and we want to maintain the same delta position, we have three possible choices: 1. Hold the option 2. Exercise the option 3. Sell the option and buy a futures contract Which of these choices is best? If we choose the first alternative and hold the position, there is no change to our account. The position we take home is identical to the one with which we begin the next trading day. If we choose the second alternative and exercise the 80 call, it is as if we had gone into the futures market and purchased a futures contract at 80. Since we now have a futures position, we are subject to futures-type settlement. If the futures contract which we purchased at 80 settles at 100, 20 points will be credited to our account—20 points on which we can earn interest. How much interest will we earn? That depends on the level of interest rates as well as the amount of time remaining to expiration. If interest rates are 6%, with two months remaining to expiration, we will earn: 20 x 2/12 x 6% = .20 Through early exercise of the option we will earn an additional .20 in interest over the time remaining to expiration. Since no trader wants to throw away an additional profit, exercising the option early makes better sense than simply holding the position. What about the third choice, selling the option ourselves and buying a futures contract? If the 80 call is trading at exactly its intrinsic value of 20 points, there is no difference between exercising the call, or selling the call and buying a futures contract. Both strategies will result in a 20-point credit, and over the time remaining to expiration we will earn the same interest of .20. But suppose the 80 call is trading at a price other than 20. Suppose it is trading at 19.50. Clearly, this price is not possible in a market where the options are American and can be exercised at any time. Purchasing an 80 call for 19.50 is equivalent to purchasing the futures contract for 99.50. If the futures contract is trading at 100, this means the call is trading at less than parity. If this were indeed true, all traders would buy the call, sell the futures contract, and immediately exercise the call. This would result in a riskless profit of .50, the amount by which the 1. Note that a European option with a theoretical value less than parity will have a positive theta. Its value will gradually rise to parity as expiration approaches. Early Exercise of American Options 243 option was below parity. In a market where options are subject to early exercise, no option ought to be trading at less than parity. What if the option is trading for more than parity, say 20.50? If we sell the 80 call for 20.50 and buy the futures contract for 100, we will have the same position we would nave had through early exercise. But now, instead 20 points, we will have 20.50 points credited to our account. We will realize an additional profit of 50 through the sale of the option, as well as the slight additional interest earnings which go with it. A trader who exercises a futures option early does so to capture the interest on the option’s intrinsic value. This intrinsic value will be credited to his account only if the option is subject to stock-type settlement. When he abandons the option through exercise, he receives the variation resulting from settlement of the futures contract. If, however, futures options are subject to futures-type settlement, as they are on many non-U.S. exchanges, no cash flow results from the early exercise of an option. With an 80 call trading at 20 and the underlying futures contract trading at 100, if the option is subject to futures-type settlement when exercised, 20 points will be credited to the trader’s account from the settlement of the futures contract. But 20 points will simultaneously be debited from his account when the 20-point value of the option disappears. Since the cash credits and debits exactly offset each other, no additional interest earnings can accrue. In futures markets where",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.439111"
}