{
  "id": "f6f3f1d43f5e",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 69,
  "content": "sit still so that time decay will have a beneficial effect on the spread. Second, he wants everyone to think the market is going to move so that implied volatility will rise. This may seem an impossible scenario, the market remaining unchanged but everyone thinking it will move. In fact, this happens quite often because events which don’t have an immediate effect on the underlying market could be perceived to have a future effect on the market. Suppose an announcement is made that the finance ministers of the major indus- trialized countries plan to meet to discuss exchange rates. If no one knows what the Volatility Spreads 153 outcome of the meeting will be, there is unlikely to be any significant move in the currency markets when the initial announcement is made. On the other hand, all traders will assume that major changes in exchange rates could result from the meeting. This possibility will result in an increase in implied volatility in the currency option market. The lack of movement in the underlying market, together with the increase in implied volatility, will cause time spreads to widen. Suppose that, as a result of the meeting, the finance ministers decide to maintain the status quo. Now expectations of a major change in exchange rates fade, implied volatility falls, and, as a result, time spreads narrow. Scenarios with similar consequences also occur in the interest rate options market when a policy statement is expected from the Federal Reserve in the United States, or when a company’s earnings are due to be reported in the stock option market. These events are unlikely to have an effect on the underlying market before the fact, but they could have significant repercussions after the fact. The effect of implied volatility is what distinguishes time spreads from the other types of spreads we have discussed. Backspreads (including long straddles, long stran- gles, and short butterflies} and ratio vertical spreads (including short straddles, short strangles, and long butterflies) want real volatility (price movement in the underlying market) and implied volatility (a reflection of expectations about future price movement in the underlying market) to either both rise or both fall. A swift move in the underlying market or an increase in implied volatility will help a backspread. A quiet market or a decrease in implied volatility will help a ratio vertical spread. With time spreads, however, real and implied volatility have opposite effects. A big move in the underlying market or a decrease in implied volatility will help a short time spread, while a quiet market or an increase in implied volatility will help a long time spread. This opposite effect is what gives time spreads their unique characteristics. While the foregoing characteristics of time spreads apply to all option markets, there may be other considerations, depending on the specific underlying market. We previously assumed that the price of the underlying contract for both the short- and long- term option was the same. In the stock option market this will always be true because the underlying for every expiration is the same stock. The underlying contract for all IBM options, regardless of the expiration month, is always IBM stock. And IBM stock can only have a single price at any one time. In contrast, the underlying for a futures option is a specific futures contract. Consider this situation for Eurodollar futures and options traded at the CME: March Eurodollar Futures = 93.90 June Eurodollar Futures = 93.75 Suppose a trader initiates a long time spread: long 10 June 94.00 calls short 10 March 94.00 calls The underlying for March Eurodollar options is a March Eurodollar futures con- tract; the underlying for June Eurodollar options is a June Eurodollar futures contract. 154 Chapter 8 While the March and June Evrodollar futures contracts are related, they are not identical. It is not impossible fo: one futures contract to go up while the other goes down. As a result, in additior to volatility considerations, a trader who buys a June/March Eurodollar option all time spread also has to worry about the risk of the June futures contract falling whik the March futures contract is rising. Is there any way to offset this risk? If, in our example, the spread between the March and June futures contracts, which is currently .15, begins b widen, the option spread will narrow regardless of volatility considerations. If, however, when the trader initiates the option spread, he also executes a futures spread bypurchasing March futures and selling June futures, he will have a position which willoffset any loss to the option spread resulting from a widening in the futures spread. How many futures spread: should the trader execute? He ought to trade the number of futures spreads required to be delta neutral. If the delta of both options is 40 and the trader executes the optien spread ten times, he will be long 400 deltas in June and short 400 deltas in March. Tierefore, he should buy 4 March futures contracts and sell 4 June futures contracts. “he entire spread will look like this (deltas are in parentheses): long 10 June 94.00calls (40) short 4 June futures (100) short 10 March 94.0 calls (40) long 4 March futures (100) This type of balancing is 10t necessary, indeed not possible, in stock options because the underlying for all maths is identical. There is no such thing as March IBM stock or June IBM stock. THE EFFECT OF CHANGING INTEREST RATES AND DIVIDENDS Thus far we have considered ony the effects of changes in the price of the underlying market and changes in volatilityon the value of volatility spreads. What about changes in interest rates and, in the case f stocks, dividends? Because there is no carryinj cost associated with the purchase or sale of a futures contract, interest rates have onlya minor impact on futures options, and, consequently, a negligible effect on the value o futures option volatility spreads.‘ If, however, we are trading stock options and changethe",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.432955"
}