{
  "id": "d0df76b10d1f",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 12,
  "content": "purchase the 100 call. Now our potential profit is limited to 6.65 if the market finishes below 90, and our potential loss is limited to 3.35 if the market finishes above 100. We can also create a bearish position with both limited risk and limited reward by purchasing a put with a higher exercise price and selling a put with a lower exercise price. For example, we might buy a 105 put for 7.10 and sell a 100 put for 3.70, for a total debit of 3.40 (Figure 2-11). If the underlying contract is below 100 at expiration, Elementary Strategies 23 Figure 2-10 10 long a 90 call at 9.35 8 short a 100 call at 2.70 6-4 oe 4 ° l > oO. 4 2 90 96.68% 4100 f +3.36 | | | _ 0 | | | -275 % -6.65 S.A -64 ~ -84 -10 T T 1 T T 85 90 95 100 105 110 115 the 105 put will be worth exactly 5 points more than the 100 put, and we will realize our maximum profit of 1.60. If the underlying contract is above 105 at expiration, both options will be worthless and we will lose our entire investment of 3.40. The position will do no worse than break even if the underlying contract is at or below 101.60, for then the 105 put will be worth at least 3.40. Like the outright purchase of a put, this position is bearish. However, we have chosen to give up the unlimited downside profit potential associated with the outright purchase of the 105 put in return for the partial upside protection afforded by the sale of the 100 put. CONSTRUCTING AN EXPIRATION GRAPH From the foregoing examples, we can formulate some simple rules for drawing expira- tion profit and loss graphs: 1. If the graph bends, it will do so at an exercise price. Therefore, we can calculate the profit or loss at each exercise price involved and simply connect these points with straight lines. 2. If the position is long and short equal numbers of calls (puts), the potential downside (upside) risk or reward will be equal to the total debit or credit required to establish the position. 24 Chapter 2 Figure 2-11 10 84 long a 105 put at 7.10 short a 100 put at 3.70 Profit A +1 60f | \\ aa | _ 100 105 340 -2- Loss -10 T T T T T 85 90 95 100 105 110 115 3. Above the highest exercise price all calls will go into-the-money, so the entire position will act like an underlying position which is either long or short underlying contracts equal to the number of net long or short calls. Below the lowest exercise price all puts will go into-the-money, so the entire position will act like an underlying position which is either long or short underlying contracts equal to the number of net long or short puts. To see how we can use these rules to construct an expiration graph, consider the following position: long one 95 call at 5.50 short three 105 calls at 1.15 The first step is to determine the profit or loss at each exercise price (95 and 105). If the underlying contract finishes at 95, both the 95 and 105 calls will be worthless. Since the entire position was established for a debit of 2.05 (-5.50 + 3 x 1.15), at 95 the position will show a loss of 2.05. If the underlying contract finishes at 105, the 95 call will be worth 10.00 and the 105 calls will be worthless. Since we own the 95 call, the position will be worth 10 points less the initial debit of 2.05, or 7.95. We can plot and connect these two points on a graph (Figure 2-1 2a). Elementary Strategies 25 Figure 2-12a 10 84 long 1 March 95 call at 5.50 short 3 March 105 calls at 1.15 +7.95 Profit Loss -10 85 90 95 100 105 110 115 Next, we note that there are no puts involved in this position, so the maximum downside loss we can incur is the 2.05 debit required to establish the position. This loss will occur anywhere below 95 (Figure 2-12b). Finally, above 105 both the 95 and 105 calls will go into-the-money, so that all options will begin to act like long underlying contracts. We will be long one underlying contract in the form of a 95 call, and short three underlying contracts in the form of three 105 calls. The net result is that above 105 we have a position which is equivalent to being short two underlying contracts. For each point increase in the price of the Underlying contract, our position will lose two points (Figure 2-12c). Applying this method to a more complex example, what would be the expiration graph of the following position? short one 90 call at 9.35 long two 100 calls at 2.70 short four 95 puts at 1.55 long two 100 puts at 3.70 26 Chapter 2 Figure 2-12b 10 g| long 1 March 95 call at 5.50 short 3 March 105 calls at 1.15 Profit 105 Loss -10 y 85 90 95 105 110 115 Figure 2-12c 10 84 long 1 March 95 call at 5.50 Profit short 3 March 105 calls at 1.15 105 +4 Loss 85 90 95 100 105 110 115 Elementary Strategies 27 First, what happens at the three exercise prices involved? At 90 we have: 90 call +935 100 calls —2 x 2.70 95 puts ~4 x 3.45 100 puts +2 x 6.30 Total +2.75 At 95 we have: 90 call 44,35 100 calls -2 x 2.70 95 puts +4x 1.55 100 puts +2 x1.30 Total +7.75 And at 100 we have: 90 call -.65 100 calls -2 x 2.70 95 puts +4x 1.55 100 puts -2 x 3.70 Total -7.25 We can plot and connect these profit and loss points at each of the exercise prices (Figure 2-13a).",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.424060"
}