{
  "id": "6cd0a643dfee",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 49,
  "content": "B, the stock attempted to break to new highs, but there was not enough buying pressure to hold it above the resistance level and it failed on the same day. A long entry would have been justiﬁed on the close of A, and a short on the close of B. Figure 6.2 shows another classic example of this trade, in the EURUSD. In the bar preceding A, all systems seemed to be “go” for a continued trend run above the previous highs, and the market actually closed solidly above the resistance level. However, at A P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 151 FIGURE 6.1 Two Failure Test Entries in FOSL the market failed dramatically, and the subsequent sharp selling shows that this point did in fact mark a major structural inﬂection in this currency. Stop The stop for this trade is clearly deﬁned: a hard stop must be entered just beyond the extreme of the test beyond the level. For instance, the stops on the two trades in Figure 6.1 would have been placed below the low of the bar marked A and above the high of B. The EURUSD trade in Figure 6.2 is only slightly more complicated; the failure occurred on the close of the day marked A, but the previous day set the high-water mark for the excursion above resistance. Therefore, you would have had to place the stop above the high of the bar preceding the entry bar. In all cases, the stop goes just outside the most extreme test beyond the triggering support or resistance level. Because this is an aggressive countertrend trade, it is important to not add to losing trades. Respect the stop level without question. In addition, there is signiﬁcant gap risk with trades held overnight. On losing trades, there is sometimes enough pent-up pressure to cause gap opens beyond the stop, so it may make sense to trade these on smaller size and risk compared to other setups. FOSL - Daily Fossil Inc B ffl ~~~l\\h.~I ::::: 95.00 A 90.00 85.00 80.00 75.00 70.00 (\\ 7.00 ~ ____ ___ l---\\.----?S,--- t. 1.00 ,-....__ ~ ,c,, A:-:.- - v C'.7 ~~z:; •• ,\";! '\"\" Apr Feb Mar 69 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing 152 TRADING STRATEGIES FIGURE 6.2 A Failure Test Short in the EURUSD Proﬁt Target Most traders ﬁnd best success with a plan that allows for taking partial proﬁts as the market makes them available. For instance, one plan would be to take proﬁt on the ﬁrst part when the proﬁt equals the initial risk on the trade. The proﬁt target on the second portion is discretionary, but consider the possibility of a longer, complex correction that leads to continuation of the original trend. Some of these trades will turn into dramatic trend reversals, but this should not be your baseline expectation. In general, consolidation near the level, particularly if the ﬁrst proﬁt target is not reached, is a bad sign. For instance, if you enter short on B in Figure 6.1 and the market spends two to three days trading above 105, this is most likely a precursor of a losing trade. Reduce exposure or close out these trades if they do not work quickly in your favor. Failure Patterns While it is certainly important to know what the pattern should look like if it’s working, from a pedagogical standpoint it probably makes more sense to focus energy and attention on what should not happen. If these early signs of failure can be recognized, it is often possible to reduce position sizes and to reduce the size of the ultimate loss. In addition, careful study of the typical patterns associated with failure can lead to a deeper understanding of the dynamics behind the trade. The key to most failure P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing 154 TRADING STRATEGIES PULLBACK, BUYING SUPPORT OR SHORTING RESISTANCE Trade Type Trend continuation. Concept Pullbacks are probably the most important structural feature of trends. For many traders, pullbacks are the quintessential with-trend trade, using the countertrend pullback to position in the larger trend at an advantageous price. The broad termpullback encompasses a large number of speciﬁc patterns: ﬂags, pennants, wedges, continuation triangles, and many others, but the exact shape of the pattern is not that important. In reality, these are all functionally the same—they are continuation patterns in trends. It is not necessary, nor is it constructive, to have separate trading plans for each of these patterns. Understand what the pattern is and what it does, and trade it accordingly. Setup The most important condition for this trade is that the market must be trending. Though it is not always possible to separate trending from nontrending environments with precision, many losing trades are the result of attempting pullbacks in nontrending environments. Objective tools to identify trends have been discussed in Chapter 3, but the problem can be reduced to whether the setup leg preceding the pullback shows good momentum—it must be a move that should see continuation after consolidation. At the risk of oversimplifying, if the market is in an established trend, the preceding setup leg should be at least as strong as previous trend legs in the same direction. In other words, it should not break the pattern of the trend and should not show momentum divergence. Pullback trades are also possible on trend changes or following breakouts of trading ranges, though this more properly falls under the Anti trade category. In these cases, there will be no established trend, but the setup leg should show a",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.703051"
}