{
  "id": "362c575cfac7",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 5,
  "content": "you could call it minor in terms of P&L, but it’s major in terms of its psychological impact. In event trading, you can go through periods where nothing is happening, which can be quite boring. During such times, it’s nice to have another strategy to keep me busy. Does having this technical strategy to keep you busy help prevent you from taking suboptimal trades when event trading opportunities are sparse? Maybe a little bit, but I have worked hard over the years to become more disciplined and wean out those suboptimal trades. I’m much more comfortable with knowing what my edge is in event-driven trading, and 21 I’m good at not trading when I don’t think there is an edge. I’m still trying to work out what my edge is on the technical side. The main benefit I have received from technical trading is that it has gotten me used to riding winners over weeks, and even months, which I never did before. At times, I try to combine my event and technical trading. For example, earlier this year [2022], I was bearish the S&P and looking for a place to sell. The S&P rallied a bit, and it looked like it was at a good spot to sell on the chart. At the same time, there was a slightly hawkish statement by Lael Brainard, the Fed vice chair. By itself, this event was not sufficient to take a trade. But given the technical setup, I used the statement as a trigger for the trade. I went short with a stop at the day’s high. I risked only about 13 basis points on the trade. I held that trade and ended up making over 600 basis points. So, it was a nearly 50-to-1 trade. It sounds like you take much smaller positions on your technical trades than on your event trades. Yes, purposely so, because I’m not anywhere near as comfortable with my edge in technical trades as I am in my event trades. By what factor does the size of your event trades exceed the size of your technical trades? I risk ½% on my technical trades. The risk on my event trades is far more variable, ranging from ¼% to 5%, depending on my conviction o n the trade. On the technical side, is there any pattern or event you particularly like? My favorite trades are when markets move from periods of low volatility to high volatility. If you’re in a low volatility regime, then the distance to your stop can be much smaller, and your lot size much larger, relative to a higher volatility regime. So, if the market moves from low volatility to high volatility, it provides a highly asymmetric risk/reward ratio—the potential gain far exceeds the required risk because of the increasing volatility. If the market is super volatile, then your stop will be about as wide as your target, and your risk will be about the same as your profit. The perfect environment for me is when the markets are quiet, and traders switch off because they are bored by the lack of volatility, but then there’s an increase in volatility. The volatility 22 increase could be triggered by prices moving out of a consolidation area or an event that shakes things up, such as Covid or Russia invading Ukraine. Anything else that is particularly important on the technical side? You always want to be aligned with the dominant trend. 23 Amrit Sall The Unicorn Sniper Three years later The last time we spoke, you were planning to take time off from trading with the birth of your son. Yes, I decided to take some time out to spend with my newborn son, Reuben, and reassess what I wanted to do with my career. That break lasted for about three months, and then I got the itch to get back to trading as a lot was going on. Did that period of reassessment lead to any changes? I built a team around me, mostly because I thought the markets would be attractive for event trading for the foreseeable future. We were getting a combination of both fiscal and monetary stimulus. If there was ever a time when there was going to be inflation, it’s when you send money straight into people’s bank accounts. It felt like only the beginning of a favorable environment for the sort of trades I was good at. So, I decided to take on a very smart trader I had previously worked with—his name is Ray—as a full-time analyst, and I also hired a more junior researcher. I was looking at how I might be able to scale some of the strategies I already used. Now, I can sometimes run positions into events, whereas before, I mainly reacted to events. We also did a deep dive into using options in trades, whereas previously, I had just traded futures. Has your methodology changed to hold positions longer instead of being almost totally focused on the events themselves with an exit on the same day? 24 I will now hold some positions longer, for weeks and even months. Was the inflation wave you saw coming the catalyst for that change? It was. The central banks at that point were still easing, even though inflation was picking up. It just screamed policy excess. You knew that inflation would likely not be transitory, which would create havoc. Then, the central banks would have to pull back easing and overdo it the other way, which would probably crash the economy or trigger a credit event, forcing a potential policy pivot. My support team and I developed proprietary leading indicators and pricing models for certain asset classes. It’s all coming together now so that I can hold positions for more extended time frames based on the most probable outcome indicated by my models. I use events to get short-term leverage on my positions if those events validate my long- term view. If the event trade runs",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.179041"
}