{
  "id": "d2a9bd142542",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 137,
  "content": "futures contract. Taking into considera- tion carrying costs, we showed that with the index at 274.00, the fair value of the futures contract was 279.48. Deducting the dividends, the fair value of the futures contract is: 274.00 (index value) + 5.48 (carrying costs} ~ 3.05 (expected dividends) = 276.43 If we own the stocks in the index we not only receive the dividends paid by the stocks, we also have use of the dividend funds. If we own stock 1, we will receive a dividend of $1.80 on the ex-dividend date and, in theory, we can also earn interest on this amount to expiration of the futures contract. If the dividend will be paid two months prior to expiration and interest rates are 8%, the interest earnings are: 1.80 x 2/12 x 8% = .02 To calculate an exact futures price, in addition to deducting the dividends themselves, we must also deduct the interest earnings from each dividend payment. This could become a rather complicated exercise, but in practice the interest earnings on dividends are so small in relation to the actual index that most traders simply deduct the dividend payments themselves from the index value, and ignore the accompanying interest earnings. If the index is price weighted, replication of the index requires an equal number of Shares of each stock. So the total dividend payout is simply the sum of all the dividends. If the index is capitalization weighted, replication of the index requires a different number of shares for each stock. In that case, the total dividend payout will be the dividend payout for each stock multiplied by the number of shares required for replication. Given the apparently complex dividend calculations, as well as the interest consid- erations on the index and dividends, determining the exact fair value of a futures contract might seem a daunting task. In practice, however, active trading firms have computers which can quickly, and continuously, calculate the fair value for futures contracts on most commonly traded stock indices. Even when it is not possible to calculate the exact fair value, many traders find it almost as effective to estimate the fair value by adding the carrying cost to the index and subtracting the average dividend payout, For example, suppose there are nine weeks 308 Chapter 15 (63 days) to expiration on a stock index futures contract with the underlying index currently at 425.00. If interest rates are 8% annually, and the average annual dividend payout on the stocks making up the index is 6%, we have: (8% — 6%) x 63/365 x 425.00 = 1.47 Therefore, the approximate fair value of the futures contract is 425.00 + 1.47 = 426.47, The reader should be aware that this is only an estimate. If it turns out that a large number of stocks do not pay their regular dividends during this nine-week period, or if the dividend payout is unusually large, this estimate could prove to be far from accurate. The daily dividend payout for the S&P 500 index for one quarterly cycle, from March 1993 to June 1993 expiration, is shown in Figure 15-1. Note the large amounts which were paid at the beginning of May, compared to the relatively small amounts paid during April. The cumulative effect of this dividend payout, in terms of the total of dividends expected to June expiration, is shown in Figure 15-2. The line drops only slightly during April, but declines sharply during the first two weeks in May. A trader who intended to initiate some type of arbitrage strategy either just prior to, or just after, a large dividend payout, would need more than a rough estimate of the fair value of an S&P 500 futures contract. If he were not aware of the exact dividend payout, a strategy which he expected to be profitable might turn out to be just the opposite. It is also possible to reverse the calculations and ask, given an observed futures price, where would the index have to be for the futures to be fairly valued? For example, Figure 15-1: S&P 500 Index Dividend Payout (March 1993 to June 1993 Expiration) 0.25 0.20 2 £ 3 ao x g 018 £ £ 0 ne} c 3 5 0.10 a = B ° | 005 0.00 as TPT TTT 25 30 5 10,15 20 25 30 5§ 10 15 20 25 30 65 10 15 March Aoril May June Stock Index Futures and Options 309 Figure 15-2: S&P 500 Dividends to Expiration (March 1993 to June 1993 Expiration) 3507 30075 | 250 2 & 3 a & 2007 ne} £ £ S 1.504 c o 3 2 faa) 1.004 0.50 O00 STATA AA TTT TTT TTT TTT TTT TTT TT TT TTT TTT TTT TTT TI TIT Tt 30 5 10 15 20 25 30 5 10 #15 20 25 30 5 10 #15 March April May June if the futures price is 432.70, and we assume that it is trading at fair value, what should the index price be if there are 6 weeks (42 days) to expiration, interest rates are 6%, and the expected dividend payout is 2.23? First we can add the dividend payout of 2.23 to the futures price of 432.70, giving a value of 434.93, Then we can deduct the carrying costs on this amount over the next six-weeks: 434.93 x 42/365 x 6% = 3.00 The implied index value is therefore 434.93 — 3.00 = 431.93. INDEX ARBITRAGE In theory, the price of a futures contract should always reflect the fair value of holding the futures contract rather than holding the stocks making up the index. But markets are not always one hundred percent efficient. If the futures price doesn’t reflect the fair value, a trader can execute a profitable arbitrage by purchasing the undervalued asset, either the basket of stocks or the futures contract, and selling the overvalued asset. If a trader believes that the fair value of a stock index futures contract is 386.75,",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.443395"
}