{
  "id": "802cad49aaa7",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 16,
  "content": "test set: If you do, you have effectively used the test set as your training set and possibly reintroduced data- snooping bias to your model.) When one has reduced the set of parameters and conditions that trigger a trade to the minimum, and after one has ascertained that small variations in these parameters and conditions do not drasti- cally alter the out-of-sample performance, one should consider dividing the trading capital across the different parameter values and sets of conditions. This averaging over parameters will further help ensure that the actual trading performance of the model will not deviate too much from the backtest result. TRANSACTION COSTS No backtest performance is realistic without incorporating trans- action costs. I discussed the various types of transactions costs (commission, liquidity cost, opportunity cost, market impact, and slippage) in Chapter 7 and have given examples of how to incorpo- rate transaction costs into the backtest of a strategy. It should not surprise you to find that a strategy with a high Sharpe ratio before adding transaction costs can become very unprofitable after adding such costs. I will illustrate this in Example 3.7. Example 3.7: A Simple Mean-Reverting Model with and without Transaction Costs Here is a simple mean-reverting model that is attributable to Amir Khandani and Andrew Lo at MIT (available at web.mit.edu/alo/www/Papers/august07. pdf). This strategy is very simple: Buy the stocks with the worst previous one-day returns, and short the ones with the best previous one-day returns. Despite its utter simplicity, this strategy has had great performance since 1995, ignoring transaction costs (it has a Sharpe ratio of 4.47 in 2006). Chan800064_c03.indd 72 6/7/2021 2:04:51 PM 72 QUANTITATIVE TRADING constraints, and parameters as possible as long as there is no sig- nificant decrease in performance in the test set, even though it may decrease performance on the training set. (But you should not add conditions and parameters, or adjust the parameter values, so as to improve performance on the test set: If you do, you have effectively used the test set as your training set and possibly reintroduced data- snooping bias to your model.) When one has reduced the set of parameters and conditions that trigger a trade to the minimum, and after one has ascertained that small variations in these parameters and conditions do not drasti- cally alter the out-of-sample performance, one should consider dividing the trading capital across the different parameter values and sets of conditions. This averaging over parameters will further help ensure that the actual trading performance of the model will not deviate too much from the backtest result. TRANSACTION COSTS No backtest performance is realistic without incorporating trans- action costs. I discussed the various types of transactions costs (commission, liquidity cost, opportunity cost, market impact, and slippage) in Chapter 7 and have given examples of how to incorpo- rate transaction costs into the backtest of a strategy. It should not surprise you to find that a strategy with a high Sharpe ratio before adding transaction costs can become very unprofitable after adding such costs. I will illustrate this in Example 3.7. Example 3.7: A Simple Mean-Reverting Model with and without Transaction Costs Here is a simple mean-reverting model that is attributable to Amir Khandani and Andrew Lo at MIT (available at web.mit.edu/alo/www/Papers/august07. pdf). This strategy is very simple: Buy the stocks with the worst previous one-day returns, and short the ones with the best previous one-day returns. Despite its utter simplicity, this strategy has had great performance since 1995, ignoring transaction costs (it has a Sharpe ratio of 4.47 in 2006). Chan800064_c03.indd 72 6/7/2021 2:04:51 PM 33 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Backtesting 73 Our objective here is to find out what would happen to its performance in 2006 if we assume a standard 5-basis-point-per-trade transaction cost. (A trade is defined as a buy or a short, not a round-trip transaction.) This example strategy not only allows us to illustrate the impact of transaction costs, it also illustrates the power of MATLAB, Python, or R in backtesting a model that trades multiple securities—in other words, a typical statisti- cal arbitrage model. Backtesting a model with a large number of symbols over multiple years is often too cumbersome to perform in Excel. But even assuming that you have MATLAB, Python, or R at your disposal, there is still the question of how to retrieve historical data for hundreds of symbols, especially survivorship-bias-free data. Here, we will put aside the question of survivorship bias because of the expensive nature of such data and just bear in mind that whatever performance estimates we obtained are upper bounds on the actual performance of the strategy. Whenever one wants to backtest a stock selection strategy, the first question is always: Which universe of stocks? The typical starting point is the S&P 500 stock universe, which is the most liquid set of stocks avail- able. The current list of stocks in the S&P 500 is available for download at the Standard & Poor’s website (www.standardandpoors.com). Since the constituents of this universe change constantly, the list that you down- load will be different from mine. For ease of comparison, you can find my list saved as epchan.com/book/SP500_20071121.xls. The easiest way to download historical data for all these stocks is to modify example3_1.m, example3_1.py, or example3_1.R, and save only the Date and Close fields for each stock symbol, into a file SPX_20071123.txt (downloadable from epchan.com/book). Next, we can use this historical data set to backtest the mean-revert- ing strategy without transaction cost: Using MATLAB clear; startDate=20060101; endDate=20061231; T=readtable('SPX_20071123.txt'); tday=T{:, 1}; cl=T{:, 2:end}; % daily returns dailyret=(cl-lag1(cl))./lag1(cl); % equal weighted market index return marketDailyret=smartmean(dailyret, 2); % weight of a stock is proportional to the negative % distance to the",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "market_structure",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T00:37:43.606147"
}