{
  "id": "f467c30d5835",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 2,
  "content": "that pattern. So, I made up the name myself. What is a recent example of the chair-and-ottoman pattern? A recent example was a chair-and-ottoman bottom in gold. The chair was formed between September 28 and October 21 [2022]. The ottoman formed between October 21 and November 4 when gold broke out on the upside of the pattern, which is when I went long. I was bullish on gold anyway. Why was that? The bearish sentiment in gold was very high. The Commitment of Traders report showed that at the gold low in late September 2022, commercials had their smallest short position since May 2019, while speculators had their smallest long position since May 2019. Also, there had been large liquidation of long positions in gold ETFs, such as GLD. Retail investors just didn’t want to be long gold anymore. 12 If you could only trade one market, which market would it be? Eurodollars,* if we’re not at a zero interest-rate policy with the Fed. I’ve always loved the Eurodollar market. Do you like that market so much because it trends better than most? It has wonderful trends, and once it starts moving, it tends to continue to move in that direction. I like soybean oil for the same reason. The Japanese yen also sometimes trends very well. Any mistakes you have made since our last interview that might be instructive? Yes, there’s one that comes to mind that I made very recently. Last week, I bought the five-year T-notes. It was a good buy, meaning I bought the five-year T-notes for a good reason. Then a couple of days later, the Fed came out with a statement that caused the market to turn volatile, and it spooked me. In response, I jammed my stop. I have legitimate rules for moving stops, but this was not one of those cases. I moved my stop up for emotional reasons, not based on any rule I could identify. It was a totally unnecessary action because I had already tightened my stop the first day I was in the trade. It is much harder dealing with a winning trade than a losing trade. For me, the recipe for handling a losing trade is simple. I don’t want to be in it. If it’s digging into my pocket, I don’t want it to dig any further. But in a winning trade that is not near my target, I sometimes may get spooked out of the trade for some reason. I was upset by the fact that I reacted emotionally, not by the outcome of the trade. When I look back and say to myself, “What a stupid move,” it has nothing to do with whether the trade was profitable. I can make a stupid move and have a profitable trade come out of it, or I could do everything right and end up with a loss. I have more emotional and intellectual satisfaction over a trade that had a loss for which I did things right than over a trade that I accidentally made money out of by being stupid. * The Eurodollar futures contract will be replaced with the similar SOFR futures contract in April 2023. 13 Although I may get upset when I do something wrong, I also recognize that, as a trader, you have to be able to forgive yourself. If you can’t, you’re in trouble because a mistake can then impact your next trade, which can then affect the trade after that, and so on. 14 Jason Shapiro The Contrarian Three years later Did your methodology catch the 2022 bear market? Speculators got super long in November 2021. So, I was looking to get short. Then, I specifically remember one of my favorite fades on CNBC, who had been a bear forever—he had been bearish all the way up from the March 2020 bottom—saying, “The Russell has broken out, and I want to get long this breakout.” That was the exact top! I am not exaggerating. The market reversed the very next day. I was surprised to see you start writing a weekly market letter and, more recently, doing YouTube videos. What prompted you to take this more public profile and do this extra work? After Unknown Market Wizards came out, every day, I received multiple requests from people asking me to mentor them. I like the idea of mentoring people, but I don’t have the time to do it. I told them there was no way I could mentor hundreds of people. One of them replied, “If there are that many interested people, why don’t we start a centralized web page?” He offered to take care of all the mechanics if I wrote the content. I thought that sounded like a good idea. I write a market letter every weekend and have been doing it for 20 years. Do you mean you were writing a weekly letter just for yourself all those years? It started as something I would write for myself every weekend to crystallize what I was looking for in the markets. When I worked at a hedge fund, my 15 letter went out to some portfolio managers who seemed to like it. Then when I ran my hedge fund, I sent it out to some clients. Was your analysis similar to what you do now for the newsletter? It was exactly what I do now. So, I figured that if this guy was willing to set up a web page and all I had to do was give him the weekly letter that I was writing anyway, I might as well try it and see what happens. I assume your partner handles the business end as well? Yes, he does everything except write the content. We split the subscription revenue 50/50. Just for the record, my half goes to a local charity. So I’m not making any money personally off of this thing. I watched some of your recent videos. I noticed you thought this bear market",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "fundamentals",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.178676"
}