{
  "id": "94a0b21c9953",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 8,
  "content": "41 6/7/2021 2:04:49 PM 42 QUANTITATIVE TRADING called a reverse split. Similarly, when a company issued a dividend $d per share with an ex-date of T, all the prices before T need to be multiplied by the number (Close(T – 1) – d)/Close(T – 1), where Close(T – 1) is the closing price of the trading day before T. Notice that I adjust the historical prices by a multiplier instead of sub- tracting $d so that the historical daily returns will remain the same pre- and post-adjustment. This is the way Yahoo! Finance adjusts its historical data, and is the most common way. (If you adjust by subtracting $d instead, the historical daily changes in prices will be the same pre- and postadjustment, but not the daily returns.) If the historical data are not adjusted, you will find a drop in price at the ex-date’s market open from previous day’s close (apart from normal market fluctuation), which may trigger an erroneous trad- ing signal. I recommend getting historical data that are already split and dividend adjusted, because otherwise you would have to find a sepa- rate historical database of splits and dividends and apply the adjust- ments yourself—a somewhat tedious and error-prone task, which I will describe in the following example. Example 3.2: Adjusting for Splits and Dividends Here we look at IGE, an ETF that has had both splits and dividends in its history. It had a 2:1 split on June 9, 2005 (the ex-date). Let’s look at the unadjusted prices around that date (you can download the historical prices of IGE from Yahoo! Finance into an Excel spreadsheet): Date Open High Low Close 6/10/2005 73.98 74.08 73.31 74 6/9/2005 72.45 73.74 72.23 73.74 6/8/2005 144.13 146.44 143.75 144.48 6/7/2005 145 146.07 144.11 144.11 We need to adjust the prices prior to 6/9/2005 due to this split. This is easy: N = 2 here, and all we need to do is to multiply those prices by 1/2. The following table shows the adjusted prices: Chan800064_c03.indd 42 6/7/2021 2:04:49 PM 11 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Backtesting 43 Date Open High Low Close 6/10/2005 73.98 74.08 73.31 74 6/9/2005 72.45 73.74 72.23 73.74 6/8/2005 72.065 73.22 71.875 72.24 6/7/2005 72.5 73.035 72.055 72.055 Now, the astute reader will notice that the adjusted close prices here do not match the adjusted close prices displayed in the Yahoo! Finance table. The reason for this is that there have been dividends distributed after 6/9/2005, so the Yahoo! prices have been adjusted for all those as well. Since each adjustment is a multiplier, the aggregate adjustment is just the product of all the individual multipliers. Here are the divi- dends from 6/9/2005 to November 2007, together with the unadjusted closing prices of the previous trading days and the resulting individual multipliers: Ex-Date Dividend Prev Close Multiplier 9/26/2007 0.177 128.08 0.998618 6/29/2007 0.3 119.44 0.997488 12/21/2006 0.322 102.61 0.996862 9/27/2006 0.258 91.53 0.997181 6/23/2006 0.32 92.2 0.996529 3/27/2006 0.253 94.79 0.997331 12/23/2005 0.236 89.87 0.997374 9/26/2005 0.184 89 0.997933 6/21/2005 0.217 77.9 0.997214 (Check out the multipliers yourself on Excel using the formula I gave above to see if they agree with my values here.) So the aggregate multi- plier for the dividends is simply 0.998618 × 0.997488 × . . . × 0.997214 = 0.976773. This multiplier should be applied to all the unadjusted prices on or after 6/9/2005. The aggregate multiplier for the dividends and the split is 0.976773 × 0.5 = 0.488386, which should be applied to all the unadjusted prices before 6/9/2005. So let’s look at the resulting adjusted prices after applying these multipliers: Chan800064_c03.indd 43 6/7/2021 2:04:49 PM 12 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 44 QUANTITATIVE TRADING Are the Data Survivorship-Bias Free? We already covered this issue in Chapter 2. Unfortunately, databases that are free from survivorship bias are quite expensive and may not be affordable for a startup business. One way to overcome this problem is to start collecting point-in-time data yourself for the ben- efit of your future backtest. If you save the prices each day of all the stocks in your universe to a file, then you will have a point-in-time or survivorship-bias-free database to use in the future. Another way to lessen the impact of survivorship bias is to backtest your strategies on more recent data so that the results are not distorted by too many missing stocks. Date Open High Low Close 6/10/2005 72.26163 72.35931 71.6072 72.28117 6/9/2005 70.76717 72.02721 70.55228 72.02721 6/8/2005 70.39111 71.51929 70.20553 70.56205 6/7/2005 70.81601 71.33858 70.38135 70.38135 Now compare with the table from Yahoo! around November 1, 2007. Date Open High Low Close Volume Adj Close 6/10/2005 73.98 74.08 73.31 74 179300 72.28 6/9/2005 72.45 73.74 72.23 73.74 853200 72.03 6/8/2005 144.13 146.44 143.75 144.48 109600 70.56 6/7/2005 145 146.07 144.11 144.11 58000 70.38 You can see that the adjusted closing prices from our calculations and from Yahoo! are the same (after rounding to two decimal places). But, of course, when you are reading this, IGE will likely have distributed more divi- dends and may have even split further, so your Yahoo! table won’t look like the one above. It is a good exercise to check that you can make further adjust- ments based on those dividends and splits that result in the same adjusted prices as your current Yahoo! table. Chan800064_c03.indd 44 6/7/2021 2:04:49 PM 13 This PDF file is part",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:43.604577"
}