{
  "id": "be892da4ea21",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 12,
  "content": "thought in technical analysis. One approach is to catalog every possible chart pattern and variation of those patterns. A trader using this approach might look for wedges, pennants, ﬂags, boxes, ledges, head and shoulders patterns, and double tops and bottoms—these are only a few of the traditional patterns, and many more have worked their way into modern practice. These traders spend a lot of time studying these patterns and variations, and they usually have speciﬁc trading plans for each pattern. Richard Schabacker was the ﬁrst writer to codify this approach, in the late 1920s, and it was crystallized in his landmark 1932 Technical Analysis and Stock Market Proﬁts . Upon his early death in 1935, his brother-in-law, Robert Edwards, took over the com- pany he had founded and continued his work of market analysis. Later, Edwards teamed up with John Magee, and the two wrote Technical Analysis of Stock Trends(1948; 4th ed., 1964), which is now considered to be the ultimate, authoritative source on chart patterns. The Schabacker approach (which is not known by that name because few people know the history behind Edwards and Magee) is the predominant school of modern technical analysis, but there is another path. The second broad school of technical analysis is Richard Wyckoﬀ’s approach. The core concept here is that chart patterns have very limited utility, and what predictive power they do have is highly dependent on the context in which they appear. The only real purpose of (Continued ) 7 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing 22 THE FOUNDATION OF TECHNICAL ANALYSIS chart patterns is to quantify and to deﬁne the buying and selling pressure in the market. In many cases, traders using both approaches will arrive at similar conclusions. These are two diﬀerent means to the same end, but many traders ﬁnd a richness and depth in the Wyckoﬀ approach that surpasses a simplistic focus on chart patterns. We trade the underlying buying and selling imbalance, which is what will move price in our favor if we are correct. Reading Inside the Bars One skill that is often overlooked in chart reading is the ability to look at a bar on a chart and to infer what price action might have created that bar. In practical terms, this means being able to look at a bar on one time frame and immediately understand the most likely lower time frame scenarios that could have created that bar. In almost every case, there are multiple possibilities, but some are much more likely than others. It is not necessary to be 100 percent correct on this; sometimes we will simply guess wrong, but working to develop this skill will greatly increase the trader’s intuitive grasp of price charts. For instance, consider the single candle in Figure 1.11 with an empty body (meaning that the close was higher than the open) and with moderately small shadows on the top and bottom. There are three things we know with certainty about this candle: the close was higher than the open; at some point, the market traded lower than the open; and, at some point, it traded higher than the close. Most people with a little bit of trading experience would assume the candle opened, traded down to put in the low, trended up to make a high, and backed off to close under FIGURE 1.11 A Candle Is a Snapshot in Time—How Was This Candle Formed? P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing The Trader’s Edge 23 #1 #2 #3 #4 FIGURE 1.12 Some of the Many Possibilities of Lower Time Frame Action That Could Have Produced Figure 1.11 that high. This is the most obvious possibility (scenario #1 in Figure 1.12), but there are many others, some of which are also shown. Traders developing a sense for price action need to spend a lot of time contemplating all of the lower time frame scenarios that could produce each bar. Being locked into a single interpretation without considering the context can blind us to what might really be going on in the market. Though charts contain a lot of noise and random action, there are points where struc- tures within individual bars, or a small set of bars, are very important. One simple pattern to think about is that the location of the closing point relative to the high and the low of the bar may give some insight into the buying or selling conviction within that bar. For instance, a close near the high of the bar usually shows that buyers were in control going into the end of the time period. Yes, there are other possibilities and patterns that could have created the close near the high, but, more often than not, buyers were in control. Conversely, closes near the middle of the bar, visible as long shadows on candle charts, show a certain neutrality and lack of conviction. It is also worth considering the extreme case where several bars in a row close on their absolute highs. Many traders would as- sume that this is indicative of a very strong market, but, statistically, this condition more often indicates short-term exhaustion and at least a slight reversal—be careful of enter- ing with the trend after several bars close on their highs. Trend and Trading Range Bars Large bars relative to recent bars on one time frame most likely contain trends on the lower time frame, especially if the close and open are near opposite ends of the bars. Small bars on one time frame are probably trading ranges on lower time frames, and, in general, bars that have their",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.696838"
}