{
  "id": "21b8d96fa8c7",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 2,
  "content": ". . . . . . . . . . . . . . . . 43 Chapter 11 44 Ex ercise 11.1 . . . . . . . . . . . . . . . . . . . . . . . . . . . . 44 T able 11.1 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 45 Ex ercise 11.2 . . . . . . . . . . . . . . . . . . . . . . . . . . . . 45 Chapter 12 46 F igure 12.1 . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 46 R EFERENCES 47 1 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. U nderstanding Your M ind PART I 9 Colin had been watching the S&P e‐mini futures all morning, waiting patiently for a trade. Finally, he saw one setup. He looked carefully at both the price ac- tion and the indicators he used to qualify his trades. Everything met his criteria. Price had turned bullish and all indicators were signaling long. “There’s no fl aw in the setup,” he thought. The trade started working almost immediately. The market moved up smartly, breaking a nearby resistance level and then moved into “clear air” where no other resistance was located. The S&Ps rallied for twelve points from the trade entry—an excellent intrada y run for this market. But, Colin was not on board. He didn’t take the trade. When discussin g this later, he said, “The same setup occurred yesterday. I guess I was thinking of that trade, which I took, but it didn’t work out. I had a loss. There was even a slight difference in favor of to- day’s trade. One of the indicators did not confi rm yesterday. Today’s setup was picture‐perfect. I kicked myself for not taking the trade. I don’t really understand why I didn’t take it. I wasn’t feeling any big emotions; I certainly wasn’t fearful. I just thou ght that since yesterday’s trade failed, this one would, too. I was wrong. Why didn’t I take the trade?” W h at f ai l e d Co l in was not h is emotions or misrea d in g t h e mar k et. W h at f ai l e d Colin was his thinkin g . Colin’s mind entered a natural mental blind spot psycholo g ists call the recency eff ect . The recency eff ect is a co g nitive bias where our min d wei gh s t h e l atest in f ormation wit h g reater importance t h an ot h er d ata w h en ma k ing d ecisions. In Co l in ’ s min d , yester d ay ’ s outcome weig h e d more h eavi l y t h an today’s “picture‐perfect” criteria, leadin g him to shun the trade. T r a d ers ’ Menta l B l in d S p ots CHAPTER 1 2 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 14T RADE MINDF U LLY heuristics involve the substitution of an easier mental task for a more di ffi cult one . W e ask a question that is easy to answer: Does this look like a bull fl ag? The correc t question is: W h at is t h e l i k e ly next move o f t h e mar k et? T h e eas y answer to t h e eas y question h as us ta k in g a l on g position. T h e correct question was never as k e d b ecause it requires more involved thinkin g . The correct question may lead us to the conclu - sion that the market is overbou g ht, has stalled at a hi g her time frame resistance level, an d w h at initia ll y l oo k e d l i k e a b u ll fl ag is now seen as a mar k et una bl e to ra ll y f ar- t h er an d a b out to f a ll . W e wi ll use t h e f o ll owing case examp l e invo l ving Zoe, a swing trader, to illustrate re p resentativeness further. Case Example: Zoe Zoe was tra d ing EZU, t h e Exc h ange Tra d e d Fun d f or t h e MSCI European Monetary Union Index. She saw the weekly Bullish En g ulfi n g Candle pattern in late June and went l ong. Y ou can see w h at s h e h a d seen in Figure 1.1 . S h e anticipate d a continua - tion of the weekly uptrend, which looked stron g to her. Zoe noted that every bullish en g ulfi n g pattern in this uptrend worked well. Thus, she expected a winnin g trade FIGURE 1.1 Zoe ’ s W ee kl y C h art Depicting an Uptren",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:45.717514"
}