{
  "id": "e3c915251b01",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 58,
  "content": "the breakout as the market never returns to the bottom of the base. In these cases, you will miss the trade. However, the times that the order is ﬁlled will result in the best possible trade location, at or very near the bottom of the range. r Once the base establishes itself, wait for springs (i.e., drops below the support at the bottom of the base that immediately recover back above the support level) and enter on the close of those bars. Though you will now probably be entering with the short- term momentum due to the recovery back above support, not every range features FIGURE 6.18 Higher Lows into a Resistance Level: Another Form of Prebreakout Accumulation P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 179 FIGURE 6.19 A Failure below the Bottom of a Range in 5-Minute EURUSD anticipating a breakout that may or may not happen, so when do we exit if the planned- for breakout does not develop? One simple strategy might be to put a stop below the lowest point reached while the market was in the base, with the plan that if you are stopped out on a temporary drop you probably must reenter the trade. Another approach is to set a much wider stop for the purposes of position sizing and risk management (see Chapter 8), with the idea to stop out before the level is reached if developing price action contradicts the trade. For instance, in Figure 6.19, a trader using the second plan would not have been stopped out when the bottom of the range dropped at A. Quick drops be- low previous support are to be expected, and rapid recoveries are actually ideal buying opportunities. However, once the market consolidated below that support level at B, the probabilities began to favor a breakdown and another trend leg down, so there was no sense in riding the trade to the initial stop level. The second issue to consider is how you will manage the trade after the breakout occurs. Here, knowledge of the pullback patterns that occur after breakouts is essential. There are many possible choices, but the plan must be consistent with the realities of market action. If watching $50.00 as a potential breakout level, many traders would move their stop up to $50.00 or right under that level once the breakout actually happens. Their logic is that, if the breakout was actually valid, price should not come back below $50.00. This would seem to make sense, but the market does not work like this. Many excellent EURUSD - 5 min Euro I US Dolar I 1.43300 , ~ 1.43250 1.43200 ::C\\-------~ ~ -----&D ~ 0.000800 -=::;> -- =.:; ---- ~y~ :.:,;;·-~ 0.000000 - 0.000800 12130 1:00 2:00 3:00 4:00 5:00 6:00 83 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 181 BREAKOUTS, ENTERING ON FIRST PULLBACK FOLLOWING Trade Type Support/resistance breaking. Concept The ﬁrst pullback after a breakout offers a spot to initiate a position in the direction of the new trend supported by the conﬁrmation of a successful breakout. This entry also avoids the volatility of the actual breakout area, and the uncertainty inherent in positions established in the prebreakout base. Setup The market has made a successful breakout of an important level. Furthermore, there is good activity (volume, volatility, and price action) beyond the level, proving that it was a valid breakout. The initial upthrust exhausts itself, the market rolls over, and a pullback begins. Trigger This pullback can be treated as a standard pullback, with any of the standard pullback trigger entries. Stop If the pullback is treated like any other pullback, the logical choice is to use the same stops you would apply to any pullback trade. There are two other levels worth considering here: the actual breakout level itself and any prebreakout reference level (e.g., support in the base, or the highest low preceding the breakout). Many traders will work with the idea that the breakout level should be a good price for stops, but it is not. Some of the strongest continuations will drop back below the level, stopping out naive weak-hand short-term traders, and then turn to trade much higher. These traders, now trapped out of the market, will have to chase it higher, adding additional impetus to the move. However, a good prebreakout level usually is a serviceable reference, and it is usually possible to tighten stops enough that a loss does not have to be taken to this level. (This level may still serve a useful purpose as a last-ditch exit and as a reference for position sizing.) It is very hard to justify holding a simple breakout pullback that drops below the pivot low of the prebreakout base, as this type of action is much more indicative of a P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 183 FAILED BREAKOUTS Trade Type Support/resistance holding. Concept Most breakouts fail. Setup When most traders think of breakout trades, they think of big, dramatic win- ning trades, and it is not hard to ﬁnd examples like this. However, the trader actually trading breakouts quickly comes face-to-face with a harsh reality: failed breakouts are more common than winning breakouts. This is not an indictment of the breakout trading concept, because exceptional reward/risk ratios can compensate for lower probability. Furthermore, good breakout traders know how to prequalify their trades by focusing on the patterns that tend to support successful breakouts and may have a higher winning percentage than might be expected. There certainly is money to be made trading",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.704499"
}