{
  "id": "165c4397fd78",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 117,
  "content": "describe relative price movements between markets. Skilled traders and analysts can ﬁnd clues to institutional conviction and large-scale money ﬂows in relative strength. Relative Strength Index (RSI) A technical indicator that seeks to identify overbought or oversold markets by measuring the relative distribution of up and down closes. Note that it does not measure relative strength, nor is it an index. resistance A term attached to price areas that may provide a barrier to advancing prices, or areas where sufﬁcient supply may exist to stop prices. resistive force See motive force. retracement Another general term for consolidation, pullback, or a pause in an estab- lished trend. return series Most ﬁnancial markets generate data as a series of price changes. It can be difﬁcult to compare price changes across different price levels (e.g., a $5 change in a $10 asset is very different from a $5 change in a $1,000 asset). The ﬁrst task of any market analysis is usually to convert the price changes into a return series. This can be either a percent return ( P today/Pyesterday − 1) or a continuously compounded return: log(Ptoday/Pyesterday). reverse pyramid A type of pyramid plan common in marketing literature for trading systems, but unacceptable for practical application. In these plans, the trader starts with 187 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing 438 GLOSSARY a small position and then adds more units as proﬁts from the trend allow the trader to pay for new units. For instance, a trader might start with one contract, adding two, four, and then eight at successive steps. These plans incur unmanageable volatility and drawdowns. reward/risk ratio This ratio has many uses and applications, but a few points must be kept in mind. First, much of the literature uses “risk/reward ratio” when authors actually mean reward/risk ratio in nearly all cases. This book’s terminology, while perhaps slightly awkward, is precise. Second, there is no innate bias to high reward/risk trades; this ratio must be understood in the context of expected value. Last, it is meaningful only over a large set of trades. risk-adjusted returns It is possible to increase returns in a portfolio or trading system by increasing leverage, but true outperformance must come on a risk-adjusted basis, meaning that returns increase more than risk. Simplistic measures like the Sharpe ratio can help to build intuition about this concept. risk-free rate In ﬁnance, the rate an investor could have realized in a theoretically risk-free investment. In practice, a U.S. Treasury bond, bill, or note with a maturity ap- proximately equal to the intended holding period of the investment is usually used as a proxy for the risk-free rate. An investor must achieve higher returns than what she could have attained in a risk-free investment, so this is used as a hurdle rate in many applications. R multiple If the risk (R) for every trade is known before the trade is entered, the proﬁt and loss (P&L) can be expressed as an R multiple. For instance, 1 × (one times R) would mean that the proﬁt was exactly equal to the initial risk taken on the trade. R-squared or R 2 In a regression or correlation analysis, a measure of goodness of ﬁt that shows how well the line ﬁts the data. Often understood to be the percentage of the dependent variable’s changes that are explained by the model. rule of alternation In Elliott wave theory, the idea that retracements in trends tend to alternate between simple and complex consolidations. sample In inferential statistics, samples are smaller sets taken from populations. scaling in Refers to a style of trade entry where the trader builds a position, usually as it moves against the intended trade direction. For instance, a trader scaling into a long trade will usually be buying small pieces (perhaps 20 percent to 33 percent at a time) of the total position size into declines. This can be an effective entry technique for some styles of trading, but ﬁrm risk management rules are essential. scalping A style of trading that takes very small but consistent proﬁts. Scalpers need to focus on low transaction costs and on avoiding sizable losses, as a single large loss can wipe out many proﬁtable trades. This term is also sometimes generalized to other time frames and styles of trading if the proﬁts and losses are a small percentage of the average range on that time frame. scatterplots A tool used to visualize the relationship between data sets. seasonal Many markets exhibit somewhat predictable tendencies at certain times. Tra- ditionally, this term applies to, for instance, grains at harvest time or natural gas spreads at certain times of the year. However, it can be generalized to time of month (are some 188 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing Glossary 439 markets strong or weak near the beginning or end of the month?) or even time of day for some markets. second-order pivot A pivot point that is preceded and followed by lower ﬁrst-order pivots for a second-order pivot high (reversed for pivot lows). semistrong form EMH A variant of the efﬁcient markets hypothesis that postulates that all publicly available information is incorporated in price. If this is true, it would not be possible to achieve superior risk-adjusted returns based on",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.713734"
}