{
  "id": "32402ded2d31",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 90,
  "content": "the time premium in the option. If we sell options, we face the prospect of unlimited risk if the market moves violently against us. An experienced trader will always look for a way to improve the risk/reward characteristics of his position by looking for positions with the greatest possible margin for error. This philosophy applies no less to directional strategies than to volatility strategies. In directional strategies, as in volatility strategies, this can often be done by finding an appropriate spread. BULL AND BEAR RATIO SPREADS If a trader believes that implied volatility is too high, one sensible strategy is a ratio vertical spread. For example, with the underlying market at 100 suppose a June 100 call has a delta of 50 and a June 110 call has a delta of 25. A delta neutral spreader can: buy 1 June 100 call (50) sell 2 June 110 calls (25) 199 200 Chapter 10 Since the spread is delta neutral, it has no particular preference for upward or downward movement in the underlying market. Now suppose the same trader believes that this ratio vertical spread is a sensible strategy, but at the same time he is also bullish on the market. There is no law that requires him to do this spread in a delta neutral ratio. If he wants this spread to reflect his bullish sentiment, he might change the ratio slightly: buy 2 June 100 calls (50) sell 3 June 110 calls (25) The trader has essentially the same ratio vertical spread, but with a bullish bias. This is reflected in the total delta for the position of +25. There is, however, an important limitation using this type of ratio strategy to create a bullish or bearish position. In our example the trader is initially bullish, but the position is still a ratio vertical spread. As such, it has a negative gamma. If the trader has underestimated volatility, and the underlying market moves up too quickly, the spread can invert from a positive to a negative delta. If the market rises far enough, to 130 or 140, eventually all options will go deeply into-the-money and the deltas of both the June 100 and June 110 calls will approach 100. Eventually, the trader will be left with a delta position of -100. Even though the trader was correct in his bullish sentiment, the position was primarily a volatility spread, so that the volatility characteristics of the position eventually outweighed any considerations of market direction. The delta can also invert with a backspread. Unlike a negative gamma position, where the inversion is caused by swift price movement in the underlying contract, a backspread can invert when the market is less volatile than expected. For example, suppose that with the underlying market at 100 a trader believes that implied volatility is too low. He might decide on a delta neutral backspread: buy 2 June 110 calls (25) sell 1 June 100 call (50} If, however, he is bullish on the market, he can, as in the last example, change the ratio to reflect this sentiment: buy 3 June 110 calls (25) sell 1 June 100 call (50) His delta position of +25 reflects this bullish bias. We know that as time passes, or as volatility declines, all deltas move away from 50. If time begins to pass with no movement in the underlying contract, the delta of the June 100 call will remain at 50, but the delta of the June 110 call will start to decline. If, after a period of time, the delta of the June 100 call declines to 10, the delta of the position will no longer be +25, but will instead be —20. Since this spread is a volatility spread, the primary consideration, as before, is the volatility of the market. Only secondarily are we concerned with the direction of movement. If the trader overesti- mates volatility, and the market moves more slowly than expected, the spread which was initially delta positive can instead become delta negative. Bull and Bear Spreads 201 BULL AND BEAR BUTTERFLIES AND TIME SPREADS Butterflies and one-to-one (non-ratioed) time spreads can also be chosen in such a way as to reflect a trader’s bullish or bearish bias. Like ratio spreads, however, their delta characteristics can also invert as market conditions change. With the underlying market at 100, a delta neutral trader might buy the June 95/100/105 call butterfly (buy a 95 call, sell two 100 calls, buy a 105 call). The trader hopes that the market will sit still at 100 so that at expiration the butterfly will widen to its maximum value of five points. If, however, a trader wants to buy a butterfly, but is also bullish on the market, he can choose a butterfly where the inside exercise price is above the current price of the underlying contract. If the underlying market is currently at 100, he might choose to buy the June 105/110/115 call butterfly. Since this position wants the underlying market at 110 at expiration, and it is currently at 100, the position is a bull butterfly. This will be reflected in the position having a positive delta. Unfortunately, if the underlying market moves too swiftly, say to 120, the butterfly can invert from a positive to a negative delta position. Since at expiration the butterfly always has its maximum value with the underlying contract right at the inside exercise price, the trader will now want the market to fall back from 120 to 110. Whenever the underlying market is below 110, the position will be bullish; whenever the underlying market is above 110, the position will be bearish. Conversely, if the trader is bearish, he can always choose to buy a butterfly where the inside exercise price is below the current price of the underlying market. But again, if the market moves down too quickly and goes through the inside exercise price, the position will invert from a negative to a positive delta. In a similar",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.436110"
}