{
  "id": "6bb8acb735de",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 57,
  "content": "ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing 176 TRADING STRATEGIES FIGURE 6.16 A Gap Opening Above a Breakout Level in CREE The best and strongest breakouts will usually be preceded by a formation that in- dicates buying pressure may be building against the resistance level. (Though this dis- cussion focuses on buying breakouts, the exact patterns apply, inverted, for breakdowns below support.) One common form of this pattern is a tight range near the top of a larger range, as in Figure 6.17. This is another form of accumulation in which the pressure from buyers has pinned the market at a relatively high price. This small range near a resistance level, usually inside of a larger range, is referred to as a breakout base. Another variation of this same idea has a market holding successively higher highs into the resistance level, as in Figure 6.18. This is yet another variation on the accumu- lation theme, as buyers have been willing to buy the market at higher prices on each decline. Though not a bidding war, this pattern does suggest that large buying interests are watching this market and may be building substantial positions. In these cases, the base is not as clearly deﬁned by a chart pattern, which can make stop location more challenging, but the important factor is still the coiling of buying pressure against resis- tance. Also, the classic cup and handle formation is a variation on this same idea. This is also an illustration of the principle that most classic chart patterns can be better under- stood in the context of simple length of swing analysis. CREE - Daily Cree Inc 70.00 65.00 60.00 55.00 50.00 '10 Feb Mar Apr 82 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 177 Base FIGURE 6.17 Schematic of a Breakout Base Trigger The actual entry is in the consolidation preceding the breakout. Positioning in this prebreakout base allows us to avoid having to play in the extreme volatility of the breakout itself. As a rule of thumb, entries in consolidations are usually less precise than entries in trends. Conceptually, we would like to buy as close to the bottom of the base as possible, but the most important thing is to get the position on. There are at least three logical entry triggers, each with some potential drawbacks. (These examples are for long trades, but apply, reversed, to shorts as well.) r Once the base establishes itself, bid near the bottom of the smaller range. One po- tential drawback is that this order will be ﬁlled only in a declining market, meaning that you are buying against the short-term momentum. Another drawback is that the order may not be ﬁlled at all, so it may not be possible to get the position. Sometimes you will identify the range, bid near the bottom, and then watch the breakout as the market never returns to the bottom of the base. In these cases, you will miss the trade. However, the times that the order is ﬁlled will result in the best possible trade location, at or very near the bottom of the range. r Once the base establishes itself, wait for springs (i.e., drops below the support at the bottom of the base that immediately recover back above the support level) and enter on the close of those bars. Though you will now probably be entering with the short- term momentum due to the recovery back above support, not every range features FIGURE 6.18 Higher Lows into a Resistance Level: Another Form of Prebreakout Accumulation P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 177 Base FIGURE 6.17 Schematic of a Breakout Base Trigger The actual entry is in the consolidation preceding the breakout. Positioning in this prebreakout base allows us to avoid having to play in the extreme volatility of the breakout itself. As a rule of thumb, entries in consolidations are usually less precise than entries in trends. Conceptually, we would like to buy as close to the bottom of the base as possible, but the most important thing is to get the position on. There are at least three logical entry triggers, each with some potential drawbacks. (These examples are for long trades, but apply, reversed, to shorts as well.) r Once the base establishes itself, bid near the bottom of the smaller range. One po- tential drawback is that this order will be ﬁlled only in a declining market, meaning that you are buying against the short-term momentum. Another drawback is that the order may not be ﬁlled at all, so it may not be possible to get the position. Sometimes you will identify the range, bid near the bottom, and then watch the breakout as the market never returns to the bottom of the base. In these cases, you will miss the trade. However, the times that the order is ﬁlled will result in the best possible trade location, at or very near the bottom of the range. r Once the base establishes itself, wait for springs (i.e., drops below the support at the bottom of the base that immediately recover back above the support level) and enter on the close of those bars. Though you will now probably be entering with the short- term momentum due to the recovery back above",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.704355"
}