{
  "id": "8a999683c093",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 147,
  "content": "usually means a similar mispricing in all related markets. If it can be traded at the right price, a futures contract on an index is perhaps the best substitute an option trader can find. If such a contract is not available, a trader might instead consider a futures contract on a different, but similar, index. For example, the largest index option market in the United States is the S&P 100 (OEX) market at the Chicago Board Options Exchange. Traders in this market are always searching for an acceptable substitute for the underlying basket of 100 stocks. A futures contract on this 6. Options on S&P 500 futures are also traded at the CME. Because there Isso little early exercise premium in futures options, and because the S&P 500 cash options traded at the CBOE are European, it turns out that the markets for both the futures options and cash options are almost identical. 324 Chapter 15 index would be an ideal substitute but, unfortunately, one does not exist.” However, there is a strong correlation between the S&P 100 and S&P 500 indices and, as noted earlier, a futures contract on the latter index is actively traded at the Chicago Mercantile Exchange. Using an alternative index futures contract as a substitute for the actual underlying index presents several problems. The first is correlation. Just as a pseudo-basket may not correlate exactly, not all indices correlate exactly, even those with many of the same stocks, Figure 15-3 shows the spread between two highly correlated indices, the S&P 500 and the S&P 100, during 1992 and 1993. Note that the spread had a range of almost 20 index points over this period. Moreover, it was not uncommon for the spread to change by as much as five points over a period of several weeks. This highlights the trading risk that can arise when one index is used as a substitute for another. In addition, not all indices expire at the same time. S&P 100 options are settled from the closing stock prices on the last trading day, while the S&P 500 futures are settled from the opening stock prices on the same day. Because of this, holding an S&P 100 option versus an S&P 500 futures position to expiration represents a substantial and, for most traders, unacceptable risk. If a trader uses S&P 500 futures as a hedge against S&P 100 options, he will almost certainly close one side of the position prior to expiration. Traders have found that using S&P 500 futures contracts as a hedge against S&P 100 options is a short-term solution at best. The best solution for most index option traders is to avoid using substitute index contracts whenever possible, and to attempt to execute all strategies within the same index market. For arbitrage traders, this means focusing on boxes and jelly rolls, and the time spreads, vertical spreads, and butterflies from which these strategies are con- structed. For example, a trader might buy a call time spread, and then try to sell the companion put time spread, thereby creating a jelly roll. Or he might buy a bull vertical call spread, and then try to buy the companion bear vertical put spread, thereby creating a box. Or he might look for butterflies which he believes are mispriced, and try to combine them later with other butterflies to create relatively low risk strategies which act much like an arbitrage. But even boxes and jelly rolls can present problems. Both carry the risk of early exercise. And a trader who executes a jelly roll still has to decide what to do with his near-term synthetic position as near-term expiration approaches. For example, suppose a trader is long the March/June 410 jelly roll: short March 410 call long June 410 call long March 410 put short June 410 put At March expiration the March synthetic will be settled in cash, and the trader will be left with the June synthetic position. If he wants to hold the position and convert it into a reverse conversion, he will have to sell the underlying basket or a suitable substitute. When he tries to do this he will encounter the same problems we have already 7. In the early 1980s the Chicago Mercantile Exchange did trade an S&P 100 futures contract. But the contract was delisted due to insufficient activity. 325 Stock Index Futures and Options v6-uer £6200 e6-1nr +. e6udy e6-uer 26-0 ze-Ine ze-ady ce-uer | ii 1 L L 0d GG LOE 14 (001 dS Snull 00S d¥S) PRedS COL d¥S / 00S dS :e-St eunbly 326 Chapter 15 discussed. This means that jelly rolls, involving two expiration months, can be mispriced in the same way a simple synthetic relationship can be mispriced within one expiration month. If the March 410 synthetic is 1.00 too cheap, while the June 410 synthetic is 1.50 too cheap, the March/June 410 jelly roll will be .50 too cheap. But this is only in theory, since to take advantage of the mispricing, a trader would have to be able to carry the underlying index from March to June expiration. But there is usually no true underlying available, only reasonable substitutes. BIASES IN THE INDEX MARKET Although there can be widespread mispricing of synthetic relationships in an index option market, especially where early exercise is a possibility and options are subject to cash settlement, we might assume that this mispricing is random. Sometimes synthetic markets will be too expensive and sometimes they will be too cheap compared to their theoretical values. In the real world, however, synthetic markets always seem to be under pressure. That is, the synthetic market tends to trade at less than theoretical value. If the synthetic market (the difference between a call price and its companion put price) is worth 1.00, the actual market price usually seems to be something less than 1.00. What causes this systematic, downward bias? Index markets, with their great liquidity, are the most popular ofall option markets. They",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.444970"
}