{
  "id": "004279b49910",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 158,
  "content": "that implied volatilities were too low? In this case we would try to create a position with a positive $gamma, negative $theta, and positive $vega. For example, we might buy the OEX 425/455 strangle and sell the NYA 260 straddle: buy 20 OEX 4235 calls sell 18 NYA 260 calls buy 20 OEX 455 puts sell 14 NYA 260 puts Since the OEX 455 call has a $delta of 140 and the NYA 260 call has a $delta of 152, for each OEX 455 call we buy, we must sell 140/152, or approximately .92 NYA 260 calls. In the same way, since each OEX 425 put has a $delta of -81 and each NYA 260 put has a delta of-117, for each OEX 455 put which we buy, we must sell 81/117, or approximately .69 NYA 260 puts. Having purchased 20 OEX 425/455 strangles, to establish a $delta neutral intermarket spread we must sell approximately 18 NYA 260 calls and 14 NYA 260 puts. The sensitivities of this position are: Position $delta $gamma $theta $vega long 20 OEX 455 calls 2800 660 ~137.40 1380 long 20 OEX 425 puts -2736 500 -61.80 1020 short 18 NYA 260 calls -1620 378 98.82 -792 short 16 NYA 260 puts 1638 ~336 33.04 -616 Taking into consideration the multiplication factor of .87 for the NYA $gamma, $theta, and $vega, the total sensitivities for our spread are: $delta = 2800 ~ 2736 - 1620 + 1638 = +82 $gamma = 660 + 500 — .87 x (378 + 336) =-1781 $theta = -137.40 - 61.80 + .87 x (98.82 + 33.04) = +84.48 $vega = 1380 + 1020 - .87 x (792 + 616) =-1175 The positive $gamma, negative $theta, and positive $vega suggest that the spread will act like a long straddle: any large move in the underlying market or increase in Intermarket Spreading 351 volatility will help the position, and the passage of time or a decline in volatility will hurt the position. If we do such a spread, we are not only taking a position on the relative volatilities of the two underlying markets, we are also taking a position that the implied volatilities in the two markets are too low. While intermarket volatility spreads begin with a trader’s opinion about the relative volatilities in two different markets, such spreads can be carried one step further. When the implied volatilities appear to be incorrect with respect to each other, the trader can simply buy straddles in the market which is relatively cheap and sell straddles in the market which is relatively expensive. However, if the trader also has an opinion that implied volatilities in the two markets are generally too high or too low, by taking an appropriate $gamma and $vega position the trader can create volatility spreads which also exploit this mispricing. Depending on his opinion, he will want to create one of the four basic types of volatility spreads: positive $gamma / positive $vega (backspread) negative $gamma / negative $vega (ratio vertical spread) negative $gamma / positive $vega (long time spread) positive $gamma / negative $vega (short time spread) For a more detailed discussion of volatility spreads and their characteristics, the reader should refer to Chapter 8. OPTIONS ON SPREADS There is one last type of intermarket spread worth mentioning, Even though such spreads are not currently traded on exchanges, it is possible to create an option where the value of the option at expiration depends on a spread between two different underlying markets. For example, suppose two underlying markets, ABC and XYZ, are trading at 175 and 150, respectively. The ABC over XYZ spread is therefore trading at 25. If a trader believes this spread might widen to as much as 60 points, he might like to buy an option on the spread with an exercise price below the projected spread of 60. If he buys a spread with an exercise price of 25, and the spread does widen to 60 at expiration, he will receive a payoff of 35, the difference between the 60-point spread and the 25-point exercise price. Such a spread is not as exotic as it sounds, since there are many situations where a trader might believe that a spread will expand or contract over time. A portfolio Manager might believe that the stock market of one country will outperform the stock market of another country. If such an option were available, the manager might want to buy a call option on the spread between the stock indexes of the two countries. If the spread widened to the point where it was greater than the chosen exercise price, the Call would go into-the-money and would have unlimited profit potential. If the spread either failed to widen or narrowed, the call would finish out-of-the-money and the manager’s loss would be limited to the amount he paid for the call.” 7. Ofcourse, such an option would be complicated by the relative values of the currencies involved. The buyer of the option would have to devise a method of offsetting the currency risk. 352 Chapter 16 Note that the underlying value of an option on a spread might take on a negative value. The ABC over XYZ spread, with ABC at 175 and XYZ at 150, has a value of 25. But if ABC rises to 185 while XYZ rises to 200, the spread will have a value of -15, Most traditional theoretical pricing models, with their assumption of a lognormal distribution, do not allow for negative prices for the underlying contract. If one were to create a pricing model to evaluate options on spreads, a more realistic assumption might be a normal distribution, which does allow for negative prices. Such a variation on the Black-Scholes model has been suggested in a paper prepared by Darrell Wilcox. This variation is reproduced in Appendix B. a 17 & Position Analysis When a trader first enters an option market, his initial concern is usually finding strategies with sufficient profit",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.446668"
}