{
  "id": "56c435c0a70c",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 20,
  "content": "want to focus more on. Another benefit of trading the short side, which is relevant now that I am managing money, is that the liquidity on the open is higher when stocks are down after an earnings report than when they are up. Why didn’t you trade the short side before? When I started trading, I also traded from the short side until 2009, when shorts stopped working because of the massive uptrend. I stopped taking short trades because they kept losing money. I said, “OK, I don’t know how to short. I just have to accept it.” Are you using a different system to trade shorts now than you did in your early years as a trader? Yes, back then, I was using a very simple system. I developed the system I use now to trade shorts based on what I learned from trading from the long side. Did you research the short-selling method you’re using now going back in time? Yes, I always test anything I will trade going back at least 10 years. I discovered that my shorting method worked well even when markets were in uptrends, which gave me the confidence to add this shorting strategy to my trading. 64 What percent of your trades are shorts now? A little less than 30%. Are you entering your trades with a limit, or do you go in at the market? I use a limit order on the open because that is when the liquidity is best. Does that mean that you no longer execute trades before the open, as you sometimes did at the time of our original interview? Yes. Is that because now that you’re managing money, you’re much more conscious about liquidity? Yes, and also because I use the opening price when I do a backtest. So, I can test how something would have worked if I entered on the open. I don’t know how the results would have differed if I entered during the pre-opening. What is the most important lesson you’ve learned in trading? How not to lose money. How do you not lose money? I always play defense; I don’t play offense. I don’t think it is something that you can learn from a book or seminar. It must come with experience. What are the things that you do to not lose money? Well, the most important thing is to have an exit strategy. I always know the price where I will get out. 65 Not A Market Wizard Chapter Jack Schwager Interviewed A uthor ’s Note: After several decades of writing Market Wizards books, my son, Zachary, thought readers would be interested in hearing my story and suggested including a bonus chapter in which he would interview me. I was both reluctant and unsure about the idea of my being the interview subject, since it was a suggestion that, by definition, was impossible for me to assess objectively. I therefore bounced the concept off my editor, Craig Pearce, who was particularly enthusiastic. So here is the chapter. I want to make clear that I am a chronicler of Market Wizards and not a Market Wizard myself, nor have I ever claimed to be. And it is in that vein that this chapter should be read. Introduction by Zachary Schwager Sometimes we pick up a book that changes our lives. Occasionally, there is a much rarer moment. We pick up a book that changes our perspective on life. I can always spot these people because they take a deep breath when they learn my dad is Jack Schwager, the author of Market Wizards. They almost always double check to make sure I’m not joking. Then, when the comfort sets in, they share their story. As with each Market Wizard, their story is unique, but there is one thing they have in common. This book created a defining moment in their lives. Sometimes they will show me their copy so that I can get it signed. The copies are always worn with love, pages folded, highlights all over, and sometimes the pages have waves from being carried in the rain or handed down from person to person. 66 In pursuit of creating something timeless, there is a bit of irony, since we are trying to duplicate truths or concepts that have already stood the test of time. Consequently, emulation itself is rarely timeless because it is a replication. My dad would never describe himself as a trendsetter, and my mom certainly wouldn’t. While my dad embarked on the journey of putting this book together, he had a sense of conviction – even though he had no idea how the book would be formatted, who he would encounter, and most importantly, how many readers he would reach. He knew this book would be special in the least arrogant manner. All my life, I have never understood how someone could be so driven by purpose in pursuit of an uncertain and unproven outcome. You may have seen my father in person, at the office, or on television. At first glance you see a highly articulate man in a suit possessing a unique perspective, to which he is the sole expert. I think most of my family members would struggle to imagine my dad wearing anything other than a flannel shirt and comfortable hiking shoes. In most cases, my dad would prefer to be prepared for a pleasant walk than a business meeting. His humility, quietness, and inquisitive nature mask his success. His immediate circle would never guess he is the best-selling author of one of Wall Street’s most-read books. My dad visited my house earlier this week. I recognized him as the same dad I’ve known all my life. A colorful plaid shirt, REI hiking pants, and comfortable Merrell slip-ons. We were walking to the Boca Raton Synagogue to hear Yossi Cohen, the former head of Mossad, give a talk. It was my duty to lend my dad a yarmulke and explain that this congregation",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "market_structure",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T00:37:44.181153"
}