{
  "id": "1a40b4af25ce",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 118,
  "content": "March 95/100 box 4.90 0 4.94 +.1 June 95/100 box 4.81 0 4.86 +.1 March/June 95 jelly roll 1.85 0 1.71 +11 March/June 100 jelly roll 1.95 0 1.71 +1.6 Many new traders seem to worry unduly about the possibility of early exercise: “If Tsell an option, what happens if I am suddenly assigned?” It is true that sometimes early assignment can cause a loss. But there are many factors which can cause a trader to lose money; early exercise is only one such factor. A trader should be prepared to deal with the possibility of early exercise just as he should be prepared to deal with the possibility of movement in the price of the underlying contract, or the possibility of changes in volatility. Margin requirements established by the clearing houses usually require a trader to keep sufficient funds in his account to cover the possibility of early assignment. But this is not always true. If he is short deeply in-themoney options, an early assignment notice may cause a cash squeeze. If this happens, he will need sufficient Capital to cover the situation. Otherwise, he may be forced to liquidate some or all of the remaining position. And forced liquidations are invariably losing propositions. 256 Chapter 12 An experienced trader should be able to foresee the likelihood of early exercise. He need only ask himself: “If I] owned this option, would I logically exercise it now?” If the answer is “yes,” then the trader ought to be prepared for assignment. Early exercise rarely comes as a surprise. If it does, it is probably good for the trader who was assigned. If an option is exercised too early, someone has erroneously abandoned the time value or protective characteristics associated with the option. When that happens, the trader who is assigned will find that he has just received an unexpected gift. 13 % Hedging with Options The original justification for introducing options and futures was to enable market participants to transfer part or all of the risk associated with holding a position in the underlying instrument from one party to another. Options and futures act as insurance contracts. Unlike a futures contract, an option transfers only part of the risk from one party to another. In this respect an option acts much more like a traditional insurance policy than a futures contract. Even though options were originally intended to function as insurance policies, option markets have evolved to the point where, in most markets, hedgers (those wanting to protect an existing position), make up only a small portion of market participants. Other traders, including arbitrageurs, speculators, and spreaders, typically outnumber true hedgers. Nevertheless, hedgers still represent an important force in the marketplace, and any sophisticated market participant must be aware of the strategies hedgers use to protect their positions. Many hedgers come to the marketplace as either natural longs or natural shorts. Through the course of normal business activities they will profit from either a rise or fall in the price of some underlying instrument. The producer of a commodity (grain, oil, precious metals) is a natural long; if the price of the commodity rises, he will receive more when he goes to sell it in the marketplace. The user of a commodity is a natural short; if the price of the commodity falls, he will have to pay less for it when he goes to buy it in the marketplace. In the same way, lenders and borrowers in the financial markets are natural longs and shorts in terms of interest rates. A rise in interest rates will help lenders and hurt borrowers. A decline in interest rates will have the opposite effect. Other potential hedgers come to the marketplace because they have voluntarily chosen to take long or short positions, and now wish to lay off part or all of the risk of that position. A speculator may have taken along or short position in a certain contract, but wishes to temporarily reduce the risk associated with an outright long or short position. For example, a portfolio manager is usually paid to choose which stocks to buy for a portfolio. He is a voluntary long. If he wants to continue to hold certain stocks, but believes that the stocks might decline in the short term, he may find it cheaper to temporarily hedge the stocks with options or futures than to sell the stocks and buy them back ata later date. As with insurance, there is a cost to hedging. The cost may be immediately apparent because it requires an immediate cash outlay. But the cost may also be more subtle, either in terms of lost profit opportunity, or in terms of additional risk under some 257 258 Chapter 13 circumstances. Every hedging decision is a tradeoff: what is the hedger willing to give up under one set of market conditions in order to protect himself under another set? A hedger with a long position who wants to protect his downside will almost certainly have to give up something on the upside; a hedger with a short position trying to protect his upside will have to give up something on the downside. PROTECTIVE CALLS AND PUTS The simplest way to hedge an underlying position using options is to purchase either a call to protect a short position, or a put to protect a long position. In each case, if the market moves adversely, the hedger is insulated from any loss beyond the exercise price. The difference between the exercise price and the current price of the underlying is analogous to the deductible portion of an insurance policy. And the price of the option is analogous to the premium which one has to pay for the insurance policy. For example, suppose an American firm expects to take delivery of DM 1,000,000 worth of German goods in six months. If the contract requires payment in Deutsche- marks at the time of delivery, the American firm has automatically acquired a short position in",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.440327"
}