{
  "id": "4e2b53f7c634",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 26,
  "content": "space. My office, which I shared with Shisko, was on the side, separated from the main office 78 space by a glass partition. From my desk, I could see both the board and the brokers. What was your reaction on the first day on the job? I was intrigued. Serendipitously, that first day also proved pivotal in laying the seeds for the first Market Wizards book and, by implication, the entire series. The commodity research department consisted of the director, Irwin Shisko, and two analysts—one in the New York office and the other in the Chicago office. I was hired to replace the New York analyst who was leaving to become a trader. That analyst was Michael Marcus, who would later be the subject of the first trader chapter in the first Market Wizards book. Michael was also the contact for other traders in the first Market Wizards book. When I arrived, Michael was cleaning out his desk. We chatted a bit. Thanks to that initial meeting, Michael and I maintained contact. For the next few years, while he remained in New York, we got together for lunch every few weeks. What was your job? I was assigned four commodity markets: cotton, sugar, hogs, and cattle. My main job was to write weekly commentaries and special reports on these markets. These reports were mailed out to clients, and many brokers used the reports for marketing and trade generation. About two weeks into the job, I got a call from the Los Angeles Times asking me for a comment on the sugar market, which I provided. I thought it was ironic that I was being quoted by a newspaper as a market expert when I had all of two weeks’ experience. Covering the markets and seeing the price board in front of you all day, did you want to trade yourself? I did. I think that is a natural inclination. Reynolds, however, had a company policy against analysts trading. I spoke to Michael, and he told me how he traded when he had my job. He had an account at another brokerage, and whenever he wanted to place an order, he would call his broker and use code words—something like “sunny” might mean buy, and “rainy” might mean sell. Michael put me in touch with his broker, and I opened an account for 79 $3,000 in my brother’s name. It was his account, technically, but it was my money, and I placed all the trades. Were you using the same type of code language method to place trades as Michael did? No, I wasn’t comfortable making the call from my office. When I wanted to place a trade I would take the elevator down to the lobby to use the pay phones to make the call. How did you monitor your trades? They were staring me in the face all day long. I could see the commodity quote board from my desk. Did you have a method for trading? Fundamental analysis. It was as simple, or simplistic, as: The market should go higher because my analysis indicates prices are too low; the market should go lower because my analysis indicates prices are too high. I thought I knew what I was doing, but I didn’t. There were high commissions at this time, right? Yes, they were something like $60 or $70 per contract. Did you know how long you would hold a trade? No, I didn’t. I didn’t know anything about risk management at the time. I also didn’t know technical analysis. How did the account do? I made money; I lost money. But ultimately, I lost. There was one trade in which I was dead wrong, and I blew out the account. Do you remember the trade that wiped you out? Oh, sure. It was a trade in the cotton market, one of the markets I covered. Incidentally, that trade provides a stark contrast between a great trader and someone like me who didn’t know anything about trading. One of the things I did as a cotton analyst was to review the cotton market for every post-WWII year. I discovered that in almost every year, the determinant of 80 the cotton price was the government loan program, which as a nonrecourse loan, acted as a price support. Effectively, the market declined to the area of the loan price and stayed there. There were only a handful of years when the market traded freely based on supply and demand. I knew there wasn’t enough data to draw a statistically meaningful conclusion, but it was all the relevant data that was available. One of those past years was a shortage year, in which the season-ending carryover supply was very similar to the then-current year. I took an unwarranted leap of faith, assuming the prices in the two years would be roughly similar. Since in the past bullish year prices failed somewhere around the mid-30 cent region, once cotton prices reached that level, I thought they should top out. I remember discussing the cotton market with Michael at one of our lunches. I said, “Well, cotton is up to the same high where prices failed in the past similar bull market.” He said, “No, cotton prices are going much higher.” Michael didn’t do any of the analysis I did, but he had the uncanny ability to look at a market with 50 different factors and latch onto the one factor that was most important. That year was the first year China was a significant buyer of U.S. cotton, and Michael understood that one factor would dominate everything else. I went short in the low-30s, attempting to pick a top, and the market kept moving steadily higher. Somewhere in the mid-to-high-30s, my account was wiped out. I was extremely fortunate that I didn’t have much risk capital. Otherwise, my loss could have been many times worse. Cotton ultimately ended up going to a high of 99 cents! Michael, of course, made a fortune on",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals"
  ],
  "created_at": "2026-02-05T00:37:44.182099"
}