{
  "id": "99d0c1398266",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 102,
  "content": "above or below 100 at expiration, there is no problem. He will either be assigned on the call or will exercise the put. In either case he will offset his long underlying position so that he will have no market position on the day following expiration. Now suppose that at the moment of expiration the underlying market is right at 100. The trader would like to be rid of his underlying position. If he doesn’t get assigned on the call, he plans to exercise his put; if he does get assigned on the call, he will let the put expire worthless. In order to make a decision, he must know whether the call will be exercised. Unfortunately, he won’t know this until the day after expiration, when he either does or does not receive an assignment notice. But then it will be too late because the call will have expired. It may seem that an option which is exactly at-the-money at expiration will never be exercised since, in theory, it has no value. In fact many at-the-money options do get exercised. Even though such an option has no theoretical value, it does have some Option Arbitrage 225 practical value. For example, suppose the owner of a call which is exactly at-the-money at expiration wants to take a long position in the underlying contract. He has two choices. He can either exercise the call or buy the underlying contract. Since most exchanges where options are traded include the right of exercise in the original transaction cost, it is almost always cheaper to exercise the call. Even if there is a charge for exercise, it will be less than the cost of trading the underlying contract. Anyone owning an at-the-money option, and choosing to take a long or short position at expiration, will find that it is cheaper to exercise the option than buy or sell the underlying contract. Clearly, the trader who is short an at-the-money option at expiration has a problem. What can he do? One course might be to guess whether the trader will be assigned. If the market appears to be strong on the last trading day, the trader might assume that it will continue higher on the day following expiration. If the person who holds the call sees the situation similarly, it is logical to assume that the call will be exercised. Hence, the trader will choose not to exercise the put. Unfortunately, if the trader is wrong, and he does not get assigned on the call, he will find himself with a long underlying position which he would rather not have. Conversely, if the market appears to be weak on the last trading day, the trader might make the assumption that he will not be assigned on the call. He will therefore choose to exercise the put. But again, if he is wrong and does get an assignment notice, he will find himself with an unwanted short underlying position on the day following expiration. The risk of a wrong guess can be further compounded by the fact that conversions and reversals, because of their low risk, are usually done in large size. If the trader guesses wrong, he may find himself naked long or short not one, but several hundred underlying contracts. There can be no certain solution to the problem of pin risk. With many, perhaps thousands, of open contracts outstanding, some at-the-money options will be exercised and some won't. If the trader lets the position go to expiration and relies on luck, he is at the mercy of the fates, and that is a position which an intelligent option trader prefers to avoid. The practical solution is to avoid carrying conversions and reversals to expiration when there is a real possibility of expiration right at the exercise price. If the trader has a large number of June 100 conversions or reversals, and expiration is approaching with the underlying market close to 100, the sensible course is to reduce the pin risk by reducing the size of the position. If the trader doesn’t reduce the size, he may find that he is under considerable pressure to get out of a large number of risky positions at the last moment. Sometimes even a careful trader will find that he has some at-the-money conver- sions or reversals outstanding as expiration approaches. One way to eliminate the pin risk which still exists is to liquidate the position at the prevailing market prices. Unfortunately, this is likely to be a losing proposition since the trader will be forced to trade each contract at an unfavorable price, either buying at the offer or selling at the bid. Fortunately, it is often possible to trade out of such a position all at once at a fair price. 226 Chapter [1 Since conversions and reversals are common strategies in all option markets, a trader who has an at-the-money conversion and is worried about pin risk can be fairly certain that there are also traders in the market who have at-the-money reversals and are also worried about pin risk. If the trader with the conversion could finda trader with a reversal and cross positions with him, both traders would eliminate the pin risk associated with their positions. This is why, on option exchanges, one often finds traders looking for other traders who want to trade conversions or reversals at even money. This simply means that a trader wants to trade out of his position at a price which is fair to everyone involved, so that everyone can avoid the problem of pin risk. Whatever profit a trader expected to make from the conversion or reversal presumably resulted from the initial trade, not from the closing trade. Certain options, such as stock indices and Eurodollars, are settled at expiration in cash rather than with the delivery of an actual underlying contract. When such an option expires, the amount of cash which flows into or out of a trader’s account is simply the amount by",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management"
  ],
  "created_at": "2026-02-05T08:09:54.437964"
}