{
  "id": "324f8bd6ca4f",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 129,
  "content": "“Predicting Interest Rate Volatility: A Conditional Heteroskedastic Model of Interest Rate Movements,” Journal of Fixed Income, Val. 1, No. 4, March 1992, pages 21-27. 282 Chapter 14 (25% x 24%) + (75% x 20%) = 21% Finally, if the trader decides to give the implied volatility half the weight, his final forecast will be: (50% x 24) + (50% x 20) = 22% A PRACTICAL APPROACH No matter how painstaking a trader’s method, he is likely to find that his volatility forecasts are often incorrect, and sometimes to a large degree. Given this difficulty, many traders find it easier to take a more general approach. Rather than asking what the correct volatility is, a trader might instead ask, given the current volatility climate, what’s the right strategy? Rather than trying to forecast an exact volatility, a trader will try to pick a strategy that best fits the volatility conditions in the marketplace. To do this, a trader will want to consider several factors: 1. What is the long-term mean volatility of the underlying contract? What has been the recent historical volatility in relation to the mean volatility? What is the trend in the recent historical volatility? Where is implied volatility and what is its trend? Are we dealing with options of shorter or longer duration? SAF WY How stable does the volatility tend to be? For example, suppose there are ten weeks (approximately 50 trading days) to expiration and we are trying to decide on an appropriate volatility strategy. To make a decision, we might look at the 50-day historical volatility (the historical volatility which corresponds to the amount of time remaining to expiration), its relationship to the long-term mean volatility, and of course the implied volatility. Having done this, suppose we find the conditions shown in Figure 14-5A. What are our conclusions? Clearly we are coming off a period of high volatility and seem to be moving downward. The recent 50-day historical volatility (approx. 20.6%} is still above the long-term historical mean (approx. 18.7%), so there is reason to believe that the volatility will continue to decline. The implied volatility is also declining, but still appears to be about 1% percentage points higher (22.1%) than the 50-day historical volatility. All volatility conditions seem to be pointing in the same direction. The historical volatility is above the mean but declining, and the implied volatility is above the historical volatility and also declining. A short volatility position (negative gamma/negative vega} is strongly indicated. There are of course a variety of short volatility strategies available, and the best strategy will still depend on a trader’s experience in the market and the amount of risk he is willing to take. Suppose we have additional volatility data (perhaps a volatility cone of the type in Figure 14-3) showing that the 50-day volatility can easily vary by as much as 10 percentage points. We still want to sell volatility, but given this instability and the 283 Volatility Revisited 09 ~<- ainyn jse@d x _ os Or oe z Ob ) Oi- 60@ = iOE-—sO—iCiisC- CS I l 1 i i it it L J 4 1 at gL Aypyejoa ueau Wa} Buoy} | BL uolyeaidxa 02 Aynye|on perdu Ayye|OA jeOUOysIY tbe Aep 0g Hee LE? Loe L oz es-p1 aunbiy (%) ANINE|OA 284 Chapter 14 fact that implied volatility at 22.2% is only slightly above the 50-day historical volatility, perhaps the wisest choice is a less risky strategy such as the purchase of butterflies. If a riskier strategy is chosen, perhaps it should be done only in small size. On the other hand, if implied volatility is currently 25% and we find that the volatility tends to be quite stable, varying only five or six percentage points for any 50-day period, a trader may be willing to take on a much riskier position, perhaps selling a straddles or strangles, In real life the situation is rarely as simple as in Figure 14-5A. For example, consider Figure 14-5B. Now the historical volatility is above the historical mean and declining, but the implied volatility has already moved ahead of the historical volatility. A trader may still choose a short volatility position, but he is unlikely to have the same degree of confidence. Indeed, the situation may be even more confused. Suppose the historical volatility is above the long-term mean but seems to be increasing (Figure 14-5C}. Or suppose implied volatility is moving in the opposite direction of the historical volatility (Figure 14-5D}. In each of these situations some factors dictate one type of position, while other factors dictate a different position. Consider the situation in Figure 14-6A where we are thinking of taking a position in six-week options (approximately 30 trading days}. The 30-day historical volatility, currently at 15.8%, is well above the long-term mean of 11.2%. However, the trend in volatility seems to be up, and there is no telling how long it will take for the volatility to revert to its mean of 11.2%. The current implied volatility of 14.6% is also well above the long term mean volatility, but is lower than the 30-day historical volatility. Corresponding to the upward trend in historical volatility, there also seems to be an upward trend in the implied volatility. With so many contradictory signals, a trader is unlikely to have a strong opinion about whether he should buy or sell volatility. He may choose to take no position at all, preferring to wait for clearer indications. Suppose, in addition to six-week options, we also have available 19-week options (approximately 95 trading days). Volatility data for this contract is shown in Figure 14-6B. While a trader may be hesitant to take a position in six-week options alone, when combined with 19-week options, he may be able to construct a strategy with much more acceptable risk characteristics. Here the 95-day historical volatility of 12.6% is above the 11.2% mean volatility. Moreover the current implied volatility of 19-week options, at 14.5%, is well above both the 95-day historical volatility and",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.442128"
}