{
  "id": "d3b4e37bd765",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 100,
  "content": "cost on the two-point debit resulting from the option trades. Based on the simple synthetic relationship, we expected to break even on Option Arbitrage 221 the conversion. In fact we will end up losing 2% x 2.00, or .04, because of the cost of carrying the debit to expiration. If we really want to break even, we will have to find some way to offset this interest cost of .04. We might, for example, purchase the call for .04 less (4.96), or sell the put for .04 more (3.04), or sell the futures contract for .04 more {102.04}. Or we might use a combination of these three transactions, for example by purchasing the call for 4.98, selling the put for 3.01, and selling the futures contract for 102.01. The result is a savings of .04, an amount equal to the carrying cost on the debit resulting from the option trades. Assuming that all options are European (no early exercise permitted), we can now express the synthetic relationship in futures markets where the options are settle in cash as follows: call price — put price = futures price - exercise price — carrying costs where the carrying costs are calculated on either the difference between the futures price and the exercise price, or the difference between the call! price and put price, both of which will be approximately the same. In our example, if the call is trading for 4.98, the put for 3.01, and the futures contract for 102.01, the synthetic market is exactly balanced since: 4.98 — 3.01 = 102.01 - 100.00 - .04 1.97 = 1.97 Using put-call parity, we can always calculate a call, put, or underlying futures price when we know the prices of any two of the other contracts. For example, with a June futures contract at 102.00, and the June 100 put at 2.75, we have: call price = futures price — exercise price + put price — carrying costs = 102.00 — 100.00 + 2.75 — .04 = 4.71 With the June 100 cal! at 5.35 and the June futures contract at 101.90, we have: put price = call price + exercise price — futures price + carrying costs = 5.35 + 100.00 — 101.90 + .04 = 3.49 Finally, with the June 100 call at 3.25 and the June 100 put at 1.25, we have: futures price = call price— putprice + exercise price + carrying costs = 3,25- 1.25 + 100.00 + .04 = 102.04 Stock Option Markets Consider a stock trading at 103, with aJune 100 call trading at six and a June 100 put trading at three. If there are no interest or dividend considerations, the synthetic market seems to be balanced since: 222 Chapter 11 call price - put price = stock price — exercise price 6-3 = 103 - 100 3=3 Suppose we decide to do a conversion by purchasing the stock for 103 and selling the synthetic for three points (call price minus put price). We will lay out 103 for the stock, take in six for the call, and lay out three for the put. These trades will create a total debit of 100, a debit which we will have to carry to expiration, at which time we will sell the stock for 100, either through exercise of the put or assignment of the call. Since interest rates in the real world are not zero, there will be a cost associated with carrying this debit. If interest rates are currently 8% per annum, and there are three months remaining to expiration, there will be a 2% carrying cost on the 100-point debit resulting from the trades. Based on the simple synthetic relationship, we expected to break even on the conversion. But in fact we will end up losing 2% x 100, or two points, because of the cost of carrying the debit to expiration. If we really want to break even, we will have to find some way to offset this two-point interest cost. We might do this by selling the call for two points more (8), or by purchasing the put for two points less (1), or by purchasing the stock for two points less (101). Or we might use a combination of these three transactions, for example by selling the call for 7, purchasing the put for 2, and purchasing the stock for 10214. The result is a savings of two points, an amount equal to the carrying cost on the debit resulting from the trades. Taking into consideration the interest rate component, we can express the syn- thetic relationship as: call price — put price = stock price — exercise price + carrying costs where the carrying costs are calculated on the exercise price.! In our example, if the call is trading for 7, the put for 21%, and the stock for 10214, the synthetic market is exactly balanced since: 7 -2\\4=102'4-1004+2 A4l,= Aly Now suppose that prior to expiration the stock will pay a dividend of 114. When we did our conversion we purchased stock, so we will receive an extra 114 points when the dividend is paid. Given this, we can afford to pay up to 11% points more for the conversion and still do no worse than break even. We could, for example, sell the call for 514, or buy the put for four, or buy the stock for 104. Or, as before, we might combine these three trades by selling the call for six, buying the put for 314, and buying the stock for 10314. Assuming that all options are European (no early exercise permitted), and taking into consideration both interest rates and dividends, we can now express the full value of the synthetic relationship in the stock option market as: 1. The exact value depends on the discounted price, or present value, of the exercise price. For a more detailed explanation, see Appendix B. Option Arbitrage 223 call price — put price = stock price — exercise",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.437657"
}