{
  "id": "14291700c951",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 175,
  "content": "or two days to expiration, most traders simply make decisions based on experience and intuition. While this is perhaps unscientific, it sometimes makes better sense than trading from model-generated values when the model is known to be incorrect. AS a result of the gaps which occur in the real world, both a trader’s experience and empirical evidence seem to indicate that a traditional model, with its built-in diffusion assumption, tends to undervalue at-the-money options as expiration ap- proaches. From a risk standpoint, this means that it can be very dangerous to sell a large number of at-the-money options close to expiration, since any gap in the underlying market can have devastating results. New traders, in particular, are advised to avoid such positions. No risk manager will appreciate even experienced traders being short large numbers of at-the-money options as expiration approaches. Expiration Straddles If it is dangerous to sell at-the-money options going into expiration, perhaps there is some sense in taking the opposite position by purchasing at-the-money options as expiration approaches. This may seem to contradict conventional option wisdom, which contends that a trader should sell at-the-money options in order to take advantage of the rapid time decay associated with such options. What traders tend to forget is that there is always a tradeoff between risk and reward. If one sells at-the-money options, the reward may be an accelerated profit if the market doesn’t move (high positive theta). But the risk is an increased loss if the market does move (high negative gamma). Because the model does not know about the possibility of a gap in the underlying market, the risk is often greater than the reward. If one sells at-the-money options, the losses from an occasional gap will more than offset the profits resulting from increased time decay. An experienced trader will therefore tend to do the opposite of conventional wisdom. If conditions are right, he will tend to buy at-the-money options close to expiration. This is not to suggest that every time expiration approaches, a trader should run out and buy at-the-money options. As with any strategy, conditions must make the strategy attractive. But because so many traders are intent on selling time premium as expiration approaches, it is often possible to find cheap at-the-money options. For example, suppose that with three days remaining to expiration the Black-Scholes model generates a value for an at-the-money call of .50, but that it is priced at .45. What can we say about this call? While we may not know the exact value, we can certainly say that the call is likely to be worth more than .50, since there is always the possibility of a gap in the market. Clearly, if the call is trading at .45, but has a value in excess of .50, it must be a good buy. As with any strategy based on volatility, the trader who buys these calls will try to establish a delta neutral position. Because of the synthetic relationship, if the calls are Models and the Real World 399 underpriced the puts at the same exercise price will also be underpriced. A logical strategy might be the purchase of at-the-money straddles. This enables a trader to buy both underpriced calls and underpriced puts, and to profit if the underlying market gaps either up or down. In theory all volatility strategies, including an expiration straddle, ought to be periodically adjusted in order to remain delta neutral. However, with little time remaining to expiration the model is not only unreliable with respect to theoretical values, it is also unreliable with respect to deltas. Because it is impossible to say what the right delta is, it is also impossible to say what the correct adjustment is. For this reason, traders who initiate expiration straddles often forget about trying to adjust, and simply sit on the position to expiration. This may not be the theoretically correct way to handle a volatility position. But it may be the practical choice given all the uncertain- ties associated with theoretical evaluation as expiration approaches. Even if a trader carefully chooses his expiration straddles, the great majority of time no gap will occur in the market, In any single case he is more likely to show a loss than a profit. A trader needs to remember that the primary concern is not the profit or loss from any single trade, but what happens in the long run. Going back to the roulette example in Chapter 3, a player who buys a number at a roulette table can expect to win only once in 38 plays. But if the theoretical value of the bet is 95¢, and the player can buy the bet for less than 95¢, he expects to be a winner in the long run. If he pays a very low price for the bet, say 50¢, he still expects to lose 37 times out of 38. But now the bet is very attractive because even if he only wins once in 38 plays, this will still be often enough to more than offset the small losses he takes each time he loses. The same logic is true of expiration straddles. A trader may lose several times before winning. When he does win, he can expect a return great enough to more than offset all the previous losses. Because a trader knows that he will lose much more often than he will win, a trader should only invest an amount in expiration straddles which he is prepared to lose. But when conditions are right, a trader ought to be willing to make the investment. Even if he loses several times in succession, in the long run he will encounter gaps in the market, or sudden increases in volatility, often enough to make such strategies profitable. VOLATILITY IS INDEPENDENT OF THE PRICE OF THE UNDERLYING CONTRACT When a trader feeds a volatility into a theoretical pricing model, the volatility defines a One standard deviation price change at any time during the",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.449198"
}