{
  "id": "64f6fdc866e0",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 161,
  "content": "the delta and gamma of a position, we can see in Figure 17-2c that in this spread the delta and gamma are generally unaffected by changes in volatility. Regardless of volatility, the delta position remains neutral at the current stock price of 100, becomes shorter anywhere below 100, and becomes longer anywhere above 100. Moreover, the graphs all have the same general shape, reflecting the fact that the position’s gamma is not particularly sensitive to changes in volatility. GRAPHING A POSITION Every trader should know what a graph of his position looks like, if not in minute detail at least the approximate characteristics of the position. Sometimes, if a computer is unavailable to do the graphing for us, we might have to mentally visualize such a graph. Position Analysis 359 Figure 17-2c: Long 20 June 105 Calls @ 1.88 Short 20 September 110 Calls @ 3.13 100 volatility = 15 vA i “ 604 / / volatility = a theoretical profit & loss bh ° 1 . volatility = 25% volatility = 30% | | -20 T T T t T T 80 85 90 95 100 105 110 115 120 125 130 stock price From the foregoing examples, perhaps we can formulate some rules which will enable us to do this. Using, as before, a grid where the horizontal axis (x-axis) represents movement in the underlying contract and the vertical axis (y-axis) represents profit or loss, we can interpret the theoretical edge, delta, and gamma as follows: 1. Theoretical Edge—The graph of a position with a positive theoretical edge will cross the current underlying price at a point above the zero profit & loss line. This is the first thing a trader should look for. When a trader is right about market conditions, he wants to know that his position will be profitable. 2. Delta (igure 17-3a)—A positive delta is theoretically equivalent to a long position in the underlying contract. The graph of such a position will cross the current underlying price at an angle extending from the lower left to the upper right. A negative delta is theoretically equivalent to a short position in the underly- ing contract. The graph of this position will cross the current underlying price at an angle extending from the upper left to the lower right. The exact slope of the graph as it crosses the current underlying price is determined by the magnitude of the delta. As the delta position becomes larger, the slope becomes more severe; as the delta position becomes smaller, the slope becomes less severe. The graph of a 360 Chapter 17 Figure 17-3a: Positive and Negative Delta (Slope) positive delta negative delta (graph extends from lower (graph extends from upper left to upper right) ; left to lower right) x position which is delta neutral will be exactly horizontal as it crosses the current price of the underlying contract. 3. Gamma (Figure 17-3b]—A positive gamma position will begin to bend upward as the underlying price moves away from the current price in either direction. This reflects the fact that a positive gamma position likes movement. The graph of such a position will take on a generally convex shape (a smile). A negative gamma position will begin to bend downward as the underlying price moves away from the current price in either direction. This reflects the fact that a negative gamma position prefers for the market to sit still. The graph of such a position will take on a generally concave shape (a frown). In order to complete a graph there is one other piece of information we need. Suppose the underlying contract makes such a large upward move that all calls go into-the-money and all puts go out-of-the-money, or such a large downward move that all puts go into-the-money and all calls go out-ofthe-money. In other words, what will the graph of a position look like at the extreme right or left tail? We can determine this by adding up our contract or lot position. This is a measure of how many contracts a position will be naked long or short if the underlying market makes such a large move that either all calls or all puts act like underlying contracts. On the upside (extreme right tail) all puts will collapse to zero while all calls will eventually act like long underlying contracts. The graph of a position which is long more Position Analysis 361 Figure 17-3b: Positive and Negative Gamma (Curvature) positive gamma (a smile) negative gamma (a frown) calls than short will angle up and to the right infinitely far (unlimited upside profit). The graph of a position which is short more calls than long will angle down and to the right infinitely far (unlimited upside risk). If the number of long and short calls are equal, or if the position consists only of puts, the position will eventually flatten out (limited upside risk/reward). On the downside (extreme left tail) all calls will collapse to zero while all puts will eventually act like short underlying contracts. The graph of a position which is long more puts than short will angle up and to the left infinitely far (unlimited downside profit). The graph of a position which is short more puts than long will angle down and to the left infinitely far (unlimited downside risk). If the number of long and short puts are equal, or if the position consists only of calls, the position will eventually flatten out (limited downside risk/reward]. The value of a position may also change over time or as volatility conditions change. The changes will be determined by the theta and vega associated with the position: 4. Theta (Figure 17-3c)—As time passes a positive theta position will become more valuable, and the graph of such a position will shift upward. As time passes a negative theta position will become less valuable, and the graph will shift downward. 5. Vega (Figure 17-3d}—A positive vega position will be helped by increasing volatility and hurt",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.447129"
}