{
  "id": "7c530af345f0",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 60,
  "content": "to 5 (9 NYSE = 4 S&P 500), and the current prices are 220 and 396, the price relationship is, as expected, 9:5 (9 x 220 = 5 x 396). There does not seem to be any reason to either buy or sell the spread. If, however, a trader believes that in percent terms the 500 stocks in the S&P will outperform the 1500 stocks in the NYSE, he can buy five S&P contracts and sell nine NYSE contracts. If, in percent terms, the S&P rises more quickly, or declines less quickly, the trader will profit from the better performance of the contracts which he owns. Spread relationships need not be restricted to two instruments. Sometimes three, or even more, different instruments may define a spread relationship. We calculated that if February gold is at $360, and interest rates are 9%, the spread between February and April gold ought to be $5.40. If interest rates rise, the carrying costs will also rise, and the February/April spread will widen. If a trader is long February gold and short April gold, and he feels that Eurodollar interest rates correlate closely to his cost of carry, he can sell Eurodollar futures to protect himself against a rise in interest rates. If interest rates do rise, he will lose on his February/April spread, but this will be offset by the profit on his Eurodollar position. He has made the assumption that there is a three-sided spread relationship between the price of February gold, April gold, and Eurodollars. Much of the most sophisticated trading in derivative markets involves identifying and following spread relationships. When a trader decides that a spread relationship is 132 Chapter 7 mispriced in the marketplace, it can be just as profitable to buy or sell the spread as to take an outright long or short position in a single instrument. In the foregoing examples the price relationship between instruments was defined in point or currency terms. In some cases, however, it may be more practical to define the relationship in other terms. In Chapter 4 we used a theoretical pricing model to determine an option’s implied volatility, and we noted that for an option trader the implied volatility might be a more accurate reflection of an option’s price than its dollar price. An option trader might therefore express the spread value between two options in terms of the spread between their implied volatilities. An option with an implied volatility of 15% and a different option with an implied volatility of 17% havea two-point volatility spread, regardless of the difference in their dollar prices. If both options have the same underlying instrument, a trader might purchase the option with an implied volatility of 15% and sell the option with an implied volatility of 17%, hoping to profit when the spread between the implied volatilities narrows. As we shall see, the foregoing example is simplistic. An option trader cannot simply buy options with low implied volatilities and sell options with high implied volatilities. Not only is the spread between implied volatilities important, but also the general level of implied volatility. A two-percentage-point volatility spread may mean one thing if the implied volatilities are 6% and 8%, and something else if the implied volatilities are 26% and 28%. Moreover, there are important considerations of risk arising from difficulties in predicting volatility, as well as the possible inaccuracies in the models themselves. In spite of these factors, volatility spreads form one of the most important classes of option trading strategies. Much of an option trader’s education is spent studying volatility relationships, and learning to create spreads based on mispriced volatility. In the previous examples we assumed that a spreading strategy was static, that once the spread was initiated it was only necessary to wait for the spread to reach its expected value. Spreads can also be dynamic, requiring action over the life of the spread in order to profit from the mispricing. This was the method used in Chapter 5 to take advantage of a mispriced option. The option was spread against the underlying contract, and the position was adjusted over the life of the option. At expiration, the resulting profit was approximately equal to the amount by which the option was originally mispriced. WHY SPREAD? We saw in Chapter 3 that most theoretical pricing models depend on the laws of probability to generate option values. Even if we have correctly estimated the prob- abilities, i.e., volatility, we know that probability theory is only valid over many occurrences or, in the case of options, over long periods of time. A trader will sometimes have to hold an option position for an extended period in order to profit from the option’s mispricing. Unfortunately, while he is holding the position, over short periods of time he may have to put up with adverse fluctuations in the position’s value. The fluctuations might be severe enough that the trader, because of capital requirements, will not be able to maintain the position. If he is forced to liquidate the position prior to Introduction to Spreading 133 expiration, there is no guarantee that he will profit from the option’s mispricing, even if he has accurately estimated all the inputs into the pricing model. By spreading, a trader is attempting to reduce the effect of short-term “bad luck” that goes with any investment based on the laws of probability. Spreading strategies not only take advantage of the laws of probability by enabling a trader to hold option positions over long periods of time, but such strategies also have the effect of protecting the trader against incorrectly estimated inputs into the theoreti- cal pricing model. Suppose a trader estimates that over the life of an option the volatility of an underlying Deutschemark futures contract will be 13%. Based on this estimate he finds that a certain call trading at the Chicago Mercantile Exchange has a theoretical value of 1.75 but is actually trading for 2.00. If the call has a delta of 25,",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "crypto",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.431512"
}