{
  "id": "f1fad49c5b6c",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 37,
  "content": "first assumption is also highly questionable. But for the time being, rather than focus on the assumptions in the model, we want to focus on its use by a trader. If we make these assumptions, and the Black-Scholes Model does indeed work, then we ought to be able to turn any difference between an option’s price and its theoretical value into a profit. How should we go about doing this? Suppose that a series of options are available on a certain futures contract with the following conditions: June futures price = 101.35 Interest rate = 8.00% Time to June expiration = 10 weeks Suppose also that the options are subject to stock-type settlement, requiring full payment of the premium, as they currently are on U.S. markets. Given that we can choose any exercise price we want, and that we can choose the type of option we want (call or put), the only input we still need for accurate evaluation of options on this futures contract is volatility. Since we have made the assumption that we actually know the future volatility of the underlying futures contract, let’s imagine 8! 82 Chapter 5 that we have a crystal ball which will tell us the future volatility. When we look into the crystal bali we see a volatility figure of 18.3% over the next 10 weeks. Now we have all the necessary inputs for theoretical evaluation, and it only remains to choose a specific option. The June 100 call, being close to at-the money, is likely to be actively traded, so let’s focus on that option. Feeding our inputs into the Black Model (the futures variation of the Black-Scholes Model}, we find that the June 100 call has a theoretical value of 3.88. When we check its price in the marketplace, we find that it is being offered at 3.25. How can we profit from this discrepancy? Clearly, our first move will be to purchase options since they are underpriced by .63. Can we now walk away from the position and come back at expiration to collect our money? We noted in Chapter 3 that the purchase or sale of a theoretically mispriced option requires us to establish a hedge by taking an opposing position in the underlying contract. When this is done correctly, for small changes in the price of the underlying, the increase (decrease) in the value of the option position will exactly offset the decrease (increase) in the value of the opposing position in the underlying contract. Such a hedge is unbiased, or neutral, as to the direction of the underlying contract. The number which enables us to establish a neutral hedge under current market conditions is a by-product of the theoretical pricing model and is known as the hedge ratio or, more commonly, the delta. We will discuss the delta in greater detail in the next chapter, but certain characteristics will be important in our present example: 1. The delta of a call option is always somewhere between 0 and 1.00. 2. The delta of an option can change as market conditions change. 3. An underlying contract always has a delta of 1.00. Option traders commonly drop the decimal point when discussing deltas, a convention which we will also follow. Therefore, the delta of a call will fall in the range of 0 to 100, and an underlying contract will always have a delta of 100.! Going back to our example, in order to make correct use of the option’s theoretical value, we also need to know the delta, in this case 57 (.57). This means that for each option which we purchase we must sell 57% of an underlying contract to establish an unbiased or neutral hedge. Since the purchase or sale of fractional futures contracts is not permitted, we intend to purchase 100 June 100 calls and sell 57 June futures contracts. This maintains the proper neutral ratio but allows us to deal in whole numbers of contracts. We have established the following position: Contract Contract Delta Deita Position Buy 100 June 100 calls 57 +5700 Sell 57 June futures 100 -5700 1. This convention originated in the U.S. stock option market where an underlying contract typically consisted of 100 shares of stock. It became common to equate one delta with each share of stock. Using an Option’s Theoretical Value 83 Note that the delta position on each side of the hedge is the number of contracts multiplied by the contract delta, keeping in mind that the purchase of a contract is represented by a positive sign and the sale of a contract is represented by a negative sign. The option delta position is therefore +100 x 57 = +5700 and the futures position is -57 x 100 = -5700. When we add these two numbers together, +5700 and -5700, the total delta position is zero, and we say that the position is delta neutral Within a small range, a delta neutral position has no particular preference for either upward or downward movement in the underlying market. If the total delta position is a positive number, this indicates an upward bias; if the total delta position is a negative number, this indicates a downward bias. Having established a delta neutral hedge we must still deal with the fact that a theoretical value is based on probability. The roulette player who is able to purchase a roulette bet for less than its theoretical value can only expect to show a profit if he is allowed to play many, many times. On any one bet he will most likely lose, since there is only one way for him to win but 37 ways for him to lose. The same is true of our hedge. The odds may be on our side because we have purchased undervalued options. But in the short run our hedge might very well result in a loss. Is there anything we can do to offset the possibility of short-term bad luck? We know that in",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "fundamentals",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.428058"
}