{
  "id": "63c3269616b0",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 74,
  "content": "trading and that value will be presented as the terminal value for that run. The number of the 1,000 traders who go bankrupt is recorded, and the percentage is presented at the bottom of the table. Percent of accounts bankrupt = Number of accounts with terminal balance ≤ $0/1,000 We also will record the number of accounts than end up with a greater than 75 per- cent loss from the starting value. Though this is an arbitrary cutoff, it will serve to mea- sure some of the downside risks in some of the more extreme scenarios later on. In reality, an account is in trouble long before it reaches a 75 percent drawdown. Consider the results in Table 9.1. On average, we end up with $149,259, which is close to the theoretical $150,000 from the expected value equation. (Keep in mind that 1,000 test runs is actually a small num- ber; had we done 100,000 or 1,000,000 runs, this number would almost certainly have TABLE 9.1 Results of 1,000 Monte Carlo Runs Risking $2,000 per Trade in $100,000 Account Mean Terminal Value 149,259 Median Terminal Value 152,000 Standard Deviation of Terminal Value 33,760 Coeﬃcient of Variation 0.23 Mean of Maximum Value 159,070 Mean of Minimum Value 89,254 Highest Terminal Value 253,200 Lowest Terminal Value 50,800 Percent Terminal Drawdown ≥75% 0.0% Percent of Accounts Bankrupt 0.0% 112 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing Risk Management 271 FIGURE 9.1 Fifty Sample Runs through the Monte Carlo Tree trading results. Figure 9.1 shows the paths of the ﬁrst 50 runs through this test. Though it is difﬁcult to read such a crowded graph, notice that most of the paths do cluster around a rising central value, as would be expected. However, also notice that there are upside and downside outliers, some of which are quite extreme. So, with that background, let’s consider what would happen if we reran the test, changing only the amount risked on each trade. Table 9.2 shows results for several TABLE 9.2 Monte Carlo Risking $ x per Trade x = 2,000 x = 3,000 x = 4,000 x = 5,000 Mean Terminal Value 149,259 173,854 198,286 221,894 Median Terminal Value 152,000 178,000 204,000 230,000 Std Dev of Terminal Value 33,760 50,746 68,107 86,911 Coeﬃcient of Variation 0.23 0.29 0.34 0.39 Mean of Max Value 159,070 188,604 218,139 247,448 Mean of Min Value 89,254 83,912 78,650 73,638 Highest Terminal Value 253,200 329,800 406,400 483,000 Lowest Terminal Value 50,800 (1,400) (3,200) (4,000) Percent Terminal DD ≥75% 0.0% 0.1% 0.8% 2.3% Percent of Accounts Bankrupt 0.0% 0.1% 0.7% 2.2% Terminal Value − E () (741) (1,146) (1,714) (3,106) P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing Risk Management 271 FIGURE 9.1 Fifty Sample Runs through the Monte Carlo Tree trading results. Figure 9.1 shows the paths of the ﬁrst 50 runs through this test. Though it is difﬁcult to read such a crowded graph, notice that most of the paths do cluster around a rising central value, as would be expected. However, also notice that there are upside and downside outliers, some of which are quite extreme. So, with that background, let’s consider what would happen if we reran the test, changing only the amount risked on each trade. Table 9.2 shows results for several TABLE 9.2 Monte Carlo Risking $ x per Trade x = 2,000 x = 3,000 x = 4,000 x = 5,000 Mean Terminal Value 149,259 173,854 198,286 221,894 Median Terminal Value 152,000 178,000 204,000 230,000 Std Dev of Terminal Value 33,760 50,746 68,107 86,911 Coeﬃcient of Variation 0.23 0.29 0.34 0.39 Mean of Max Value 159,070 188,604 218,139 247,448 Mean of Min Value 89,254 83,912 78,650 73,638 Highest Terminal Value 253,200 329,800 406,400 483,000 Lowest Terminal Value 50,800 (1,400) (3,200) (4,000) Percent Terminal DD ≥75% 0.0% 0.1% 0.8% 2.3% Percent of Accounts Bankrupt 0.0% 0.1% 0.7% 2.2% Terminal Value − E () (741) (1,146) (1,714) (3,106) $210,000 ,----- $190,000 -------------- $170,000 ,-----­ $150,000 $90,000 $70,000 sso,ooo 0 so 100 150 200 113 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c09 JWBT634-Grimes May 10, 2012 7:52 Printer: Hamilton Printing 272 TRADING STRATEGIES different per-trade risks (x = ). Note that the only thing that changed is this risk level; the trades for these runs were generated with a pseudo-random number generator, and the same random sequence was used in each set of 1,000 trades. The win/loss sequences are the same for the set of 1,000 trials and for each column in Table 9.2. (On a technical note, this kind of reproducibility is important in Monte Carlo testing, and is a strong argument against building these tests using Excel’s built-in random number generator.) What do we notice here? First, the simplistic understanding that some traders have that “the more you risk, the more you make” does seem to have some validity. As we increase the amount risked per trade, the average terminal value increases, as does the mean of the maximum value; risking $5,000 per trade gives us almost 50 percent more proﬁt than our initial $2,000 risk. However, there is a cost. The standard deviation of ter- minal values increases faster than the mean, which can be seen by the steadily risking coefﬁcient of variation. If we accept, for a moment, the standard deviation as a measure of risk, we",
  "word_count": 1000,
  "topics": [
    "risk_management"
  ],
  "created_at": "2026-02-05T00:37:53.707036"
}