{
  "id": "c75cffdc5517",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 80,
  "content": "the greater the likelihood of showing a profit. Spread { has only a 2-percent- age-point margin for error, while spread 3 has a margin for error more than three times greater, at 7 percentage points. Spread 2 falls somewhere in between. Why are we so concerned about our volatility estimate being too low? A trader might take the view that he is just as likely to overestimate as underestimate volatility. If this happens, how will it affect the potential outcome of each spread? Suppose we decide to do spread 1 and volatility turns out to be 18%, three percentage points higher than our estimate of 15%. Looking at Figure 9-4 we can see that if this happens we will lose approximately 1.21. Suppose, however, that there is an equal chance that volatility will turn out to be 12%, three percentage points lower than our estimate. In Figure 9-5, where we have extended volatility down to 10%, we can see that in this case we will make approximately 6.95. In a more extreme case, when volatility turns out to be 20% we will lose 3.95. But if volatility turns out to be 10% we will make 9.64, For each time we underestimate volatility and show an unexpected loss, we might assume there will be an equal number of times when we overestimate volatility and show an unexpected profit. The end result of all these outcomes will be an average profit of approximately 2.86, the predicted profit of the spread at a volatility estimate of 15%. Suppose that the average result of doing any one of our spreads, 1, 2, and 3, isa profit of approximately 2.80. If the outcome in each case is identical, why should it Make any difference which spread we choose? While the end result is certainly an important theoretical consideration, how the end result comes about may be an equally important practical consideration. Every trader knows that there are times when he shows a profit and times when he shows a loss. No one wins all the time. In the long run, however, a good trader’s profits will more than offset his losses. For example, suppose a trader chooses a Strategy which will show a profit of $7,000 half of the time, and which will show a loss of $5,000 the other half of the time. In the long run he will show an average profit of $1,000. But 178 Chapter 9 Figure 9-4 Theoretical Profit & Loss 104 spread 3 (long butterfly) spread 1 (short straddle) spread 2 (ratio vertical spread) a -124— 15 T 16 17 18 #19 20 Volatility (%) + 21 Figure 9-5 105 spread 3 (long butterfly) Theoretical Profit & Loss spread 1 (short straddle) spread 2 (ratio vertical spread) 120 16 18 Volatility (9%) 14 24 Risk Considerations 179 suppose the first time the trader executes the strategy he loses $5,000 and the trader only has $3,000? Now the trader will not be able to stay in business for all those times when he is fortunate enough to show a profit of $7,000. Every trader knows that it is only over long periods of time that good luck and bad luck even out. No experienced trader will initiate a strategy where short-term bad luck might terminate his trading career. This is the reason an experienced option trader will tend to avoid spread 1. Any financial officer knows that it is much easier to manage a steady cash flow rather than one that swings wildly. This is equally true for an option trader. He must sensibly manage his finances so that he can avoid being ruined by the periods of bad luck which will inevitably occur, no matter how skillfully he trades. An incorrect volatility estimate may not be the only risk with which an option trader must be concerned. Every input into a theoretical pricing model represents a risk to the trader since an incorrect input may alter an option’s theoretical value. These risks are reflected in the delta, gamma, theta, vega, and rho associated with a spread. We can summarize these risks as follows: Delta (Directional) Risk—The risk that the underlying market will move in one direction rather than another. When we create a position which is delta neutral, we are trying to ensure that initially the position has no particular preference as to the direction in which the underlying instrument will move. A delta neutral position does not necessarily eliminate all directional risk, but it usually leaves us immune to directional risks within a limited range. Gamma (Curvature) Risk—The risk of a large move in the underlying contract, regardless of direction. The gamma position is a measure of how sensitive a position is to such large moves. A positive gamma position does not really have gamma risk since such a position will, in theory, increase in value with movement in the underlying contract. A negative gamma position, however, can quickly lose its theoretical edge with a large move in the underlying contract. The consequences of such a move must always be a consideration when analyzing the relative merits of different positions. Theta (Time Decay) Risk—The risk that time will pass with no movement in the underlying contract. This is the opposite side of gamma risk. Positions with positive gamma become more valuable with large moves in the underlying. But if movement helps, the passage of time hurts. A positive gamma always goes hand in hand with a Negative theta. A trader with a negative theta will always have to consider the risk in terms of how much time can pass before the spread’s theoretical edge disappears. The position wants movement, but if the movement fails to occur within the next day, or next week, or next month, will the spread, in theory, still be profitable? Vega (Volatility) Risk—The risk that the volatility which we input into the theoretical pricing model will be incorrect. If we input an incorrect volatility, we will be assuming an incorrect distribution of underlying prices",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.434697"
}