{
  "id": "fe4bc01aab6d",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 35,
  "content": "104 MARKET STRUCTURE FIGURE 4.6 Sloppy Tests of Support in NFLX FIGURE 4.7 Clean Support and Resistance in FCX NFLX - Doily Netnix Inc Oct Nov Dec '11 Feb FCX- 5 min Freeport-McMoRan Copper&Gold B II\\ ~ 1J11lllif\\H . ( ,,• lfl[·\\ I / .., 140.0() 130.0() 57.0() 5680 5660 5640 5620 I --- -l · r,,11 -- rrrll-- I ' ' - MOO lqw!!!l l,11 , 1111 --i' ¼W 1111~ 55 • 5 o 13:00 14:00 15:00 2/7 10:00 11:00 12:00 13:00 51 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing On Trading Ranges 105 Stop Placement for Support and Resistance In considering stop placement, there is a trade-off between close stops that allow tight risk points with lower probability and wider stops that result in larger, infrequent losses. At ﬁrst glance, it would seem like further stops are always preferable since they give the market more room to ﬂuctuate and a higher probability of the trade being proﬁtable, but there is another factor to consider: many traders will size positions based on the risk in the trade. (See Chapters 8 and 9.) Tighter stops allow larger position sizes and potentially better reward/risk ratios, so there is good reason to use stops that are as tight as is reasonably possible. The right answer depends on a combination of your style and personality, and the reality of the speciﬁc market you are trading. In general, there are three speciﬁc areas where you might consider placing stops against support levels. In Figure 4.8, imagine that you have established a long position in Natural Gas futures somewhere near the right edge of the chart. The three possible stop areas are marked on this chart. Stop B is probably the most logical stop, a tick beyond the most extreme level reached in the support area. This stop has the beneﬁt of respecting the geometry of the FIGURE 4.8 Three Stop Levels .L____,-- Apr 0.1500 . 0.0500 - - \" -0.0500- -0.1500- Jun 52 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing 108 MARKET STRUCTURE Spring Upthrust break below Confirmed support FIGURE 4.9 A Spring and an Upthrust in an Idealized Trading Range Figure 4.9 shows examples of both springs and upthrusts, with a conﬁrmed break below support at the end of the chart. The key to both of these patterns is that they are quick probes beyond support and resistance. A trader watching the market around these areas would probably comment that there was “no conviction” beyond the level, or that prices did not want to “hang out” at the new extremes. Psychologically, these formations usually suggest that there are a number of traders who are afraid of being trapped out of the market. Imagine you are a large buyer looking to buy as close to a speciﬁc price (the bottom of the range) as possible; your goal is to get the best price you can by buying as low as you can. If the market trades down to that price, you may buy a little, but if it is weak you might hold off a bit to see if it will fall even lower. If the market then trades through your buy point, you may buy a little more, but you might also be willing to let the market continue to fall. Why hold it up with your own buying if you can buy lower? However, if the market drops below your target price and other traders buy aggressively, you may now be concerned about having to chase prices higher. In this case, you would be forced to buy very aggressively, quickly driving prices back above support. This type of thought process, in the aggregate from thousands of traders, drives much of the price action around these levels. There are always two sides to every trade, and it is a good mental exercise to cul- tivate the practice of trying to see price action from as many different perspectives as possible. Imagine that you are a trader shorting the market into the same level where the previous buyer was willing to buy. You are looking for weakness and further ex- tension below the level, so what do you do in the same scenario? Once price drops be- low the level and now is back above, you realize that the breakdown has failed. Rather than hold a failed trade, most traders would elect to buy back the short. Your cover- ing is buying pressure; it makes no difference whether traders are buying to establish positions or to cover shorts. Buying is buying, and, all other things being equal, it will push prices higher. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing 110 MARKET STRUCTURE FIGURE 4.10 Price Rejection in the AUDJPY watch for trend termination patterns on lower time frames when one of these patterns is underway. Multiple Tests This is not to say that price will touch the level once, never to re- turn. It is certainly possible for a level to have multiple tests, and it can be difﬁcult to read the balance of buying and selling conviction on these subsequent tests. Each test actually weakens the level because price should not be able to return to the level if it is going to hold. If there is",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management"
  ],
  "created_at": "2026-02-05T00:37:53.700766"
}