{
  "id": "20ddc9cf9c28",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 29,
  "content": "futures market analysis and trading. I thought I could write one that was better than anything else that was available. So, I took a sabbatical to finish the book I had inadvertently started. I called Perry and told him that what I had written so far was too lengthy to be offered as a chapter in his book. I told him I had decided to write my own book and could offer him one of the chapters in that book as a chapter in his. He understood and was fine with the substitution. I then took a sabbatical to work on the book called A Complete Guide to the Futures Markets. Did you think you would make enough on the book to justify giving up a year’s salary? I never thought about it in monetary terms. If I had been motivated by money, I would have avoided including an extensive section on regression analysis, which would have both significantly reduced the time needed to complete the book and increased sales. I believe there is an inverse correlation between the number of equations in a book and sales. It was more about the objective of writing the best book on the subject and establishing a reputation. How did the book do? A 750-page book on market analysis will never be a best-seller, but it did reasonably well for a professional book. In fact, the book’s positive reception was the catalyst for the first Market Wizards book. How so? An editor for another publisher invited me to lunch. He told me he was impressed by my first book and pitched me the idea of writing a series of books, each covering a single futures market or market group. I told him I had no desire to do another professional book. “If I write another book, I want it to reach a much larger audience,” I said. 86 “Do you have anything specific in mind?” he asked. I told him about my idea for Market Wizards. “Great,” he said. “Do that.” How did you get the idea for Market Wizards, and why didn’t you do the book before this lunch meeting? I don’t remember when I first came up with the idea for Market Wizards. I knew some great traders, and I thought the book would be a fun project and a good excuse to pick their brains. I didn’t pursue the idea because being a research director was more than a full-time job. I knew it would mean working crazy hours to do both. I needed the extra push. I wrote the book on nights and weekends, frequently working through the entire night. Was it easier to succeed in trading in the 1970s and 1980s, when the traders in the first Market Wizards were active, than now? Logically, it would seem that’s true because there were far fewer professional traders then. There was a lot less competition. Now you have trading firms with a hundred Ph.D. quants, and well over 20,000 hedge funds globally. However, some of the traders in Unknown Market Wizards have performance records that are among the best of any traders I have ever encountered. Even though there’s a lot more competition now, apparently, the opportunity to excel in trading is still there. In sports, anyone who excels is going to have exceptional physical capabilities. But I assume an analogous assumption does not hold in trading. That is, great traders don’t necessarily have extremely high IQs. Is that right? Yes, to an extent, I believe that’s true. Having a very high IQ is not a prerequisite, or perhaps even correlated, to being a great trader. Some of the Market Wizards I interviewed, such as Ed Thorpe or David Shaw, to name only two, were obviously brilliant. I assume most of the people I interviewed had above-average IQs. But I am sure many traders I interviewed didn’t have exceptional IQs. And is the converse also true—that is, many people with super high IQs might be terrible traders? 87 Yes, I believe so. As long as they are subject to the same emotional pitfalls that are natural to most people, they would not be good traders. The Market Wizards books are unique in their interview format. I can’t think of any other books I have read or that have had prominent success and have remained widely read for such a long time that had this format. I didn’t know the structure when I started working on the first Market Wizards book. When you work on a book, ultimately, the structure defines itself. What seemed to work well for each trader chapter was a main interview section sandwiched between a narrative beginning and a conclusion. And in turn, these trader chapters were sandwiched between prose chapters at the beginning and end of the book. Oddly enough, I don’t typically like reading interview-format articles because they’re often too pat, too predictable, and dull. I didn’t choose this format because I liked it; I chose it because it worked. It’s important that the interviews contain narratives. If you go through the Market Wizards books, you’ll see many lengthy answers that are essentially narratives. Chunks in many chapters are stories, which is how many people like to learn. In my interviews, I’m always trying to drag stories out of people— stories that are engaging and usually, but not always, related to trading. In editing the interviews, which is 90% of the work, I am cognizant of three goals: staying true to the traders’ comments, relaying trading insights, and creating a chapter that is a good read. I believe the last of these goals helps me overcome the limitations of the interview format. You wrote the first Market Wizards book pre-internet. How did you find the people to include in the book? I knew some of the traders in the first book personally. I already mentioned how I met Michael Marcus. Michael, when he was managing money for Commodities Corp, hired Bruce Kovner, and through Michael,",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "crypto",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.182541"
}