{
  "id": "183dfe5ef328",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 11,
  "content": "draw the structure on a few hundred charts until it becomes somewhat intuitive; eventually you want to be able to glance at a chart and see this structure immediately. Like everything else, it gets easier only with continued practice and familiarity. It is impossible to overstate the importance of this skill. Once the individual swings are delineated, we can start to consider what the market structure actually tells us about the balance of buying and selling pressure in the market. The core concepts are simple: r When buyers are stronger than sellers, upswings will be longer, both in price and in time, than downswings. r When sellers are in control, downswings will be longer than upswings. r Signiﬁcant support and resistance levels are visible as rough areas (not precise lines) beyond which pivots have been unable to penetrate. r When there is relative equilibrium, there is no clear pattern to the swings. There is nothing mysterious about market structure and price action. They grow from these simple patterns, which then combine in a nearly inﬁnite number of variations. Focusing on the variations is difﬁcult because they are legion—it is an exercise in futility to try to catalog all of the complexities and variations of patterns, though this attempt has been repeated many times throughout history. Understand the root. Understand the market structure. There are a handful of common patterns and templates that provide the foundation for most of the signiﬁcant patterns in the market. We will spend much of the rest of this book reﬁning these templates, looking at speciﬁc ways to trade around them, and considering how to manage the risk of those trades. Here is a brief introduction to a few of the most important of these patterns. Commit them to memory; you will be seeing them again. Figure 1.6 shows the basic uptrend template: upswings are longer than the down- swings, creating a consistent pattern of higher pivot lows and higher pivot highs. This pattern, inverted, would become a downtrend. Figure 1.7 shows a market in a trading range. This is a random environment in which the conviction of buyers and sellers is relatively equal and there is no clear pattern to FIGURE 1.6 An Uptrend P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing 20 THE FOUNDATION OF TECHNICAL ANALYSIS FIGURE 1.7 A Trading Range ??? FIGURE 1.8 A Break in the Uptrend Pattern prices. There can be sudden, sharp moves within trading ranges, but they are often more or less unpredictable. Figure 1.8 shows a pattern that gives a warning of a break in an uptrend’s established pattern. This is often the ﬁrst step of a trend change, but you cannot trade based only on this pattern; this is a warning sign to pay careful attention to what comes next. There is great value in knowing when patterns have broken, as this suggests a potential change in the balance of buyers and sellers in the market. Figure 1.9 shows an example of a classic breakout above resistance. This suggests one of two things: On one hand, markets in trading ranges (see Figure 1.7) are highly random and this type of move may be nothing more than a random (and temporary) move beyond previous levels. On the other hand, it could be an early warning that buying FIGURE 1.9 A Breakout of the Trading Range P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing 20 THE FOUNDATION OF TECHNICAL ANALYSIS FIGURE 1.7 A Trading Range ??? FIGURE 1.8 A Break in the Uptrend Pattern prices. There can be sudden, sharp moves within trading ranges, but they are often more or less unpredictable. Figure 1.8 shows a pattern that gives a warning of a break in an uptrend’s established pattern. This is often the ﬁrst step of a trend change, but you cannot trade based only on this pattern; this is a warning sign to pay careful attention to what comes next. There is great value in knowing when patterns have broken, as this suggests a potential change in the balance of buyers and sellers in the market. Figure 1.9 shows an example of a classic breakout above resistance. This suggests one of two things: On one hand, markets in trading ranges (see Figure 1.7) are highly random and this type of move may be nothing more than a random (and temporary) move beyond previous levels. On the other hand, it could be an early warning that buying FIGURE 1.9 A Breakout of the Trading Range P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing The Trader’s Edge 21 FIGURE 1.10 A Breakout Preceded by Higher Lows into Resistance pressure is now stronger than selling pressure in this market, and it is possible that prices could trend signiﬁcantly higher from this point. Figure 1.10 shows a particular pattern that often precedes the best breakouts. If buy- ers are able to hold the market higher on successive declines, a pattern of higher pivot lows pressing against the resistance area will result. This suggests real buying conviction supporting the move and the potential breakout. This is certainly not a complete encyclopedia of swing patterns, but it does highlight the basic concept: the length of swings and the relative position of pivot points can give insight into the character of the market. Market Structure versus Traditional Chart Patterns There are two broad schools of thought in technical analysis. One approach is to catalog every possible chart pattern and variation of those patterns. A trader using this approach might look for wedges, pennants, ﬂags, boxes, ledges, head and shoulders patterns, and double tops and bottoms—these are only a few of the traditional patterns, and many more have worked their way into modern practice. These traders spend a lot of time studying these patterns and variations, and they usually have speciﬁc trading plans for each pattern. Richard Schabacker was the ﬁrst writer to codify this approach, in the late 1920s, and it was crystallized in his",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.696667"
}