{
  "id": "6a9c5fc4476c",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 48,
  "content": "because, at some level, they are just a type of trend continuation. Realize that they derive their power from potentially trapped traders who were aggressively anticipating trend reversal (see Figure 5.16). Anytime too many people are leaning in the same direction, the market is vulnerable to an outsized move in the opposite direction. FIGURE 5.16 Failed Breakdown (Arrow) Leads to a Retest of Highs with the Possibility of Contin- uation into Another Trend Leg VHC - Daily V,metx Holding Corp ~IJ ··pi .. _ l l11,!-·4 ·-... l!¼h, ·-- jlt lllit1tlh1 - - tti\\;nl« .---......_., 111 '11 Apr 30.00 I \\ Ii, I I _/I :: 1.~.J.l~!Jl[i!\\~-' :: .. -..................... u .... .. 20.00 18.00 16.00 14.00 12.00 5.00 3.00 1.00 -1.00 67 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing PART III Trading StrategiesP1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing CHAPTER 6 Practical Trading Templates Do not [just blindly] repeat the tactics which have gained you one victory, but let your methods be regulated by the inﬁnite variety of circumstances. —Sun Tzu, The Art of War (ca. 210 CE) T his chapter presents eight speciﬁc trading patterns that should be seen as guide- lines for actual trades. They are also concrete expressions of quantiﬁable, di- rectional edges in the market; they highlight points in market structure around which there are sometimes imbalances of buying and selling pressure that can set up proﬁtable trading opportunities. These are not a simple set of patterns to be memorized, found in the market, and then traded proﬁtably. We do not trade these patterns; we trade the underlying buying and selling pressure that sometimes creates these patterns. This is an important and subtle distinction that sets my approach apart from that of many other traders. There are reliable, repeatable patterns in the markets, but these patterns are useful only inasmuch as they reveal the buying and selling pressure that shapes evolv- ing market structure. The true value in these patterns is that they deﬁne precise points for your entries and exits and give you tools to manage the risk in each trade, but en- during success will follow only if these are part of a larger analytical framework that encompasses a complete understanding of market structure, price action, and the psy- chological dynamics that create them. These patterns are introduced in order of complexity: Failure tests, though they are aggressive countertrend trades, are clearly deﬁned with relatively few subjective ele- ments. The next three patterns are variations of pullbacks; the ﬁrst two are distinguished by whether they enter with or against the direction of the short-term trend. The last pull- back pattern is the complex pullback, which is often the source of consistent losses for ill-prepared trend traders. The ﬁfth pattern in this chapter is the Anti, which offers a rigidly disciplined entry at a potential trend change. Last, three variations of breakout trades bring up the rear and close out the chapter. 149 68 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing 150 TRADING STRATEGIES FAILURE TEST Trade Type Support/resistance holding or trend termination. Concept Markets probe for stop orders and activity beyond signiﬁcant price levels. Many times, there is no real conviction behind these moves, and the moves fail and re- verse quickly once the stop orders are triggered. Entering after such a move allows for excellent reward/risk potential with a clearly deﬁned risk point. Setup The market must be overextended or in some way primed for reversal. The best examples of this trade occur in mature, extended trends, and will usually be accompa- nied by momentum divergence on the trading time frame. Another common variation occurs in an extended consolidation just under resistance. This type of consolidation would normally have a high expectation of producing another trend leg above that resis- tance, so many traders are monitoring the area and will enter on a potential breakout. If this breakout occurs and fails, there will be many trapped traders, which can add mo- mentum to a downside trade off that level. Trigger For a short entry, the market trades above a clearly deﬁned resistance area, but immediately reverses on the same or the following bar and closes back under the re- sistance. There can be signiﬁcant volatility, volume, and activity on the breakout, but there should be no real conviction beyond the level. Enter short on the close of the bar that closes back below resistance. The buy setup is exactly symmetrical. Figure 6.1 shows examples of long and short failure test entries in Fossil, Inc. (Nasdaq: FOSL). Point A marks a brief probe below support, but the same day immediately closed back above the support level. At B, the stock attempted to break to new highs, but there was not enough buying pressure to hold it above the resistance level and it failed on the same day. A long entry would have been justiﬁed on the close of A, and a short on the close of B. Figure 6.2 shows another classic example of this trade, in the EURUSD. In the bar preceding A, all systems seemed to be “go” for a continued trend run above the previous highs, and the market actually closed solidly above the resistance level. However, at A P1: OTA JWBT634-c06 JWBT634-Grimes May",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.702921"
}