{
  "id": "da4b54279eb3",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 29,
  "content": "correctly and expeditiously? As with most human endeavors, the way to do this is to start with a small portfo- lio and gradually gain psychological preparedness, discipline, and confidence in your models. As you become emotionally more able to handle the daily swings in profit and loss (P&L) and rein in the primordial urges of the psyche, your portfolio’s actual performance will hew to the theoretically expected performance of your strategy. I have certainly found that to be the case after getting over those aforementioned disastrous trades. My newfound discipline and faith in the Kelly formula has so far prevented similar disasters from hap- pening again. SUMMARY Risk management is a crucial discipline in trading. The trading world is littered with numerous examples of giant hedge funds and invest- ment banks laid low by enormous losses due to a single trade or in a very short period of time. Most of these losses are due to overlev- eraging positions and not to an inherently erroneous model. Typi- cally, traders will not overleverage a model that has not worked very well. It is a hitherto superbly performing model that is at the great- est risk of huge loss due to overconfidence and overleverage. This Chan800064_c06.indd 130 6/7/2021 2:06:04 PM Money and Risk Management 131 chapter therefore provides an important tool for risk management: the determination of the optimal leverage using the Kelly formula. Besides the determination of the optimal leverage, the Kelly for- mula has a very useful side benefit: It also determines the optimal allocation of capital among different strategies, based on the covari- ance of their returns. But no risk management formula or system will prevent disas- ters if you are not psychologically prepared for the ups and downs of trading and thus deviating from the prescriptions of rational decision making (i.e., your models). The ultimate risk management mind-set is very simple: Do not succumb to either despair or greed. To gain practice in this psychological discipline, one must proceed slowly with small position size, and thoroughly test various aspects of the trading business (model, software, operational procedure, money and risk management) before scaling up according to the Kelly formula. I have found that in order to proceed slowly and cautiously, it is helpful to have other sources of income or other businesses to help sustain yourself either financially or emotionally (to avoid the boredom associated with slow progress). It is indeed possible that finding a diversion, whether income producing or not, may actually help improve the long-term growth of your wealth. APPENDIX: A SIMPLE DERIVATION OF THE KELLY FORMULA WHEN RETURN DISTRIBUTION IS GAUSSIAN If we assume that the return distribution of a strategy (or security) is Gaussian, then the Kelly formula can be derived very easily. We start with the formula for a compounded, levered growth rate applicable to a Gaussian process: gf rf ms f22 2 / where f is the leverage; r is the risk-free rate; m is the average sim- ple, uncompounded one-period excess return; and s is the standard deviation of those uncompounded returns. This formula for com- pounded growth rate can itself be derived quite simply, but not as Chan800064_c06.indd 131 6/7/2021 2:06:04 PM 61 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Money and Risk Management 131 chapter therefore provides an important tool for risk management: the determination of the optimal leverage using the Kelly formula. Besides the determination of the optimal leverage, the Kelly for- mula has a very useful side benefit: It also determines the optimal allocation of capital among different strategies, based on the covari- ance of their returns. But no risk management formula or system will prevent disas- ters if you are not psychologically prepared for the ups and downs of trading and thus deviating from the prescriptions of rational decision making (i.e., your models). The ultimate risk management mind-set is very simple: Do not succumb to either despair or greed. To gain practice in this psychological discipline, one must proceed slowly with small position size, and thoroughly test various aspects of the trading business (model, software, operational procedure, money and risk management) before scaling up according to the Kelly formula. I have found that in order to proceed slowly and cautiously, it is helpful to have other sources of income or other businesses to help sustain yourself either financially or emotionally (to avoid the boredom associated with slow progress). It is indeed possible that finding a diversion, whether income producing or not, may actually help improve the long-term growth of your wealth. APPENDIX: A SIMPLE DERIVATION OF THE KELLY FORMULA WHEN RETURN DISTRIBUTION IS GAUSSIAN If we assume that the return distribution of a strategy (or security) is Gaussian, then the Kelly formula can be derived very easily. We start with the formula for a compounded, levered growth rate applicable to a Gaussian process: gf rf ms f22 2 / where f is the leverage; r is the risk-free rate; m is the average sim- ple, uncompounded one-period excess return; and s is the standard deviation of those uncompounded returns. This formula for com- pounded growth rate can itself be derived quite simply, but not as Chan800064_c06.indd 131 6/7/2021 2:06:04 PM 132 QUANTITATIVE TRADING simply as the Kelly formula, so I leave its derivation for the reader to look up in the Thorp article referenced earlier. To find the optimal f, which maximizes g, simply take its first derivative with respect to f and set the derivative to zero: dg df ms f/ 2 0 Solving this equation for f gives us f = m/s2, the Kelly formula for one strategy or security under the Gaussian assumption. REFERENCES Chan, Ernest. 2006a. “A ‘Highly Improbable’ Event? A Historical Analysis of the",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.608374"
}