{
  "id": "7242837ccf9f",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 26,
  "content": "stress or uncomfortable feelings or unwanted trad - in g thou g hts. In fact, you can have no further tradin g losses and never Exercise 8.2 Finding My Trading Values Part 1: If nothing could hold you back from being the trader you really want to be, what would that look like? How do you really want to be and act as a trader? Part 2: After a decade of living and trading as you describe in Part 1, write about what sort of trader you have been. Imagine you are a reporter writing an article on yourself. Describe 3 or 4 of your greatest qualities? Quality #1: Quality #2: Quality #3: Quality #4: 192T RADE MINDFULLY will fi nd this to be a practical and an e ff ective approach to overcoming the mental an d per f ormance c h a ll enges you may experience in your tra d ing. Be f ore turning to Exercise 8.4, h owever, we fi rst d iscuss a met h o d f or l earning to accept unwante d t h oug h ts an d f ee l i n g s . ■ Making Room for Uncomfortable Emotions and Thoughts Here is a speci fi c min df u l ness exercise geare d towar d acceptance o f uncom f orta bl e feelings. Any unwanted emotions or thoughts that cause you di ffi culty can be ad- d resse d in t h is min df u l ness training. A f orm o f t h is exercise was origina ll y d eve l ope d by Eifert and Forsyth for persons who su ff er from severe anxiety . 4 I’ve a d apte d it f or traders. Those who have used it have found it benefi cial when learning to make room for their di ffi cult thoughts and feelings. In t h e min df u l ness exercises d escri b e d in C h apter 6 , we pic k e d an o b ject o f f ocus, suc h as t h e b reat h , an d returne d to it eac h time t h e min d wan d ere d . T h is exercise wi ll be a little di ff erent. Here, we want to be fully aware of unwanted thoughts, as well as uncom f orta bl e b o d i l y sensations an d emotions. In t h is exercise, you wi ll “lean into ” unwante d t h ou gh ts an d f ee l in g s rat h er t h an appease or fi gh t t h em. T h is is a f orm o f ex p osure similar to that which we discussed in one of the earlier research studies on f ear an d anxiety t h at you can d o on your own. It is d esigne d to h e l p you d eve l op ac - ceptance, which simply means that we make room for unwanted thou g hts and feelin g s and experience them for exactly what they are—just passin g thou g hts and feelin g s, no t a certainty o f d oom, d an g er, or ca l amity t h at t h ey want you to b e l ieve t h ey are. Y ou wi ll need to set aside 15 to 20 undisturbed minutes to do this exercise. Below is m y adapta - tion of the Acceptance Exercise developed b y Eifert and Fors y th. Exercise 8.3 Challenging Trading Situations, My Internal State, and Values Challenging Situation Thoughts Feelings Bod y Sensations Relevant Value 32 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 196T RADE MINDFULLY situation in the live market. Its use will be explained through the case examples o f Ammar and Pri y anka (see T ables 8.2 and 8.3). At the top of the form, we want to state what’s important to us in our trading or what we want our trading to stand for. For Ammar, as he described in T able 8.2, this was a sense o f h is stea d iness in h is tra d ing. Regar dl ess w h at t h e mar k et d i d , h e va l ue d ri d ing t h e mar k et ’s waves as i f h e were a b oat, g l i d ing a l ong t h e sur f . T h e simp l e wor d “stea d iness, ” t h en, d escri b es w h at h e stan d s f or. Ammar ’s c h a ll enging situation occurs a f ter h e h as h a d a l osing tra d e or two. Because h e f ee l s pressure to ma k e up f or t h e l oss, h e d isregar d s money management an d increases position size su b stantia ll y. His initia l goa l is to re d uce oversizing h is tra d es b y 70 percent over t h e next two wee k s. T h ere are two t h ings to note h ere. T h e fi rst is t h at Ammar ’s goa l is state d in speci fi c terms against a sc h e d u l e.",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "psychology",
    "risk_management"
  ],
  "created_at": "2026-02-05T00:37:45.720545"
}