{
  "id": "facff5c7995d",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 132,
  "content": "implied delta of 40. Suppose we create a delta neutral position by purchasing ten 100 calls for 2.17 each, and selling four futures contracts at 97.73. What will happen to our position if implied volatility rises to 22%? If implied volatility immediately goes to 22%, the new price of the 100 call will be 2.47, and we will show a profit of 10 x (2.47 2.17) = +3.00 Suppose, however, that the increase in implied volatility occurs very slowly, over a period of 20 days, and during this period the price of the underlying futures contract remains at 97.73. Under these conditions, even if implied volatility rises from 20% to 22%, the 100 call will now be worth only 1.87. Our position will then show a loss of 10 x (1.87 — 2.17) = -3.00 Even though the implied volatility increased, the fact that the underlying futures contract failed to make any significant move resulted in the option’s price declining. Now suppose we have the same position (long ten 100 calls, short four futures contracts) but this time instead of rising to 22%, the implied volatility drops to 18%. What will be the effect on our position? If implied volatility immediately drops to 18%, the new price of the 100 call will be 1.86, and we will show a loss of 10 x (1.86 — 2.17) =-3.10 Suppose, however, that the decline in implied volatility is accompanied by a swift move in the underlying contract. If the underlying futures contract falls to 93.00, and implied volatility falls to 18%, the price of the 100 call will be .59, and we will show a profit of 4x (97.73 - 93.00) — 10 x (2.17 — 59) = +3.12 On the other hand, if the underlying futures contract rises to 102.50 while implied volatility falls to 18%, the price of the 100 call will be 4.32, and we will again show a profit 4 x (97.73 - 102.50) + 10 x (4.32 - 2.17) = +2.42 Volatility Revisited 295 In both cases the movement in the underlying contract has more than offset any decline in the option’s price due to a decline in implied volatility. The foregoing examples are of course simplified. As market conditions change-an active trader may very well make adjustments to his position in order to remain delta neutral. If so, the actual profit or loss will be affected by the cash flow from this adjustment process. The important point is that the volatility of the underlying contract, whether the contract moves or sits still over time, will eventually overwhelm any changes in implied volatility. This is not to say that implied volatility is unimportant. The price of a contract is always an important consideration in making trading decisions. But in order to trade intelligently, we need to know value as well as price. The value of an option is determined by the volatility of the underlying contract over the life of the option. Implied versus Future Volatility If, as many traders believe, prices in the marketplace reflect all available information affecting the value of a contract, the best predictor of the future volatility ought to be the implied volatility. Just how good a predictor of future volatility is implied volatility? While it would be impossible to answer this question definitively, since that would require a detailed study of many markets over long periods of time, we might still gain some insight by looking at a limited number of examples. Clearly, no one knows the future volatility. We can, however, record the implied volatility at any moment in time and then, when expiration arrives, look back and calculate the actual volatility of the underlying contract between the time we recorded the implied volatility and expiration. We can do this every day during an option’s life, recording the implied volatility and then at expiration calculating the actual volatility that occurred over this period. This has been done in Figures 14-9A, 9B, and 9C for the June 1992, March 1993, and December 1993 options on Treasury Bond futures. It is admittedly dangerous to generalize from such limited data, but are there any conclu- sions we might draw from these graphs? We can see that with a great deal of time remaining to expiration, the future volatility of the underlying contract (the solid line) is relatively stable. But as we get Closer to expiration the future volatility can become much less stable. This is logical if We again recall that the mean reverting characteristics of volatility are much less certain over short periods of time than over long periods. One large move in the underlying contract with only several days remaining to expiration will result in a sharp increase in the volatility to expiration (see Figure 14-9C). On the other hand, if the underlying contract is relatively quiet over the last several days in an option’s life, the volatility to expiration will collapse (see Figure 14-9B). How does the marketplace react to these volatility characteristics? With long Periods of time remaining to expiration, the volatility to expiration is relatively stable. One would therefore expect the implied volatility to also be relatively stable. Con- versely, with short periods of time remaining to expiration, the volatility to expiration Can be very unstable, and one would therefore expect the implied volatility to be Unstable. These conclusions are born out by the implied volatility (the broken line) in 296 z6-Aew 26-1dy ZouPN 26-094 zee 16-080 =~ LG-ACN 16-190 16-des Lepov uolyesidxse 2661 eunr dL O} Apiqyejoa penjoe +8 < o 2 lg = z S FOL EEE suoldo gee} eunr Ayyiyejon patjduul zt 86-71 aunbiy 297 Volatility Revisited 6-484 e6-uer 26-038 _ L 26-AON 26-190 z6-des 26-6ny 26-In¢ 1 suondo e661 yoseW Auge}on payduy} uoledidxe e66 i Youve o} Aqyejoa penjoe 26-une 9 re FS < o = le = Zz x +Ol ELL A Go a6-p1 einBi4 Chapter 14 298 €6-AON £6190 €6-das e6-Sny e6-1n¢ e6-unr e6-Aew e6-1dy e6eW I i i t 9 uonesndxe",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.442599"
}