{
  "id": "c0dd544d9220",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 27,
  "content": "factors and latch onto the one factor that was most important. That year was the first year China was a significant buyer of U.S. cotton, and Michael understood that one factor would dominate everything else. I went short in the low-30s, attempting to pick a top, and the market kept moving steadily higher. Somewhere in the mid-to-high-30s, my account was wiped out. I was extremely fortunate that I didn’t have much risk capital. Otherwise, my loss could have been many times worse. Cotton ultimately ended up going to a high of 99 cents! Michael, of course, made a fortune on that trade. Do you remember how you felt during that trade? I know I would have seen the quote board cotton prices clicking steadily higher all day. I’m sure it was a painful experience. Was the money in your commodity account all the money you had, or did you have a separate savings account? Did you have to worry about having enough money to pay the rent? 81 I definitely had a savings account. I was always conservative, which is a good thing because I didn’t know about risk management and would have lost all the money I had. OK. So now you’re back to being a research assistant. You have no trading account. What happens next? I was earning only $10,000 a year, which was a low salary even back then. I remember that I was making less than the department secretary. So, after two years, I asked for a raise. The head of the commodity department met with me and offered to give me a 20% raise, which sounds good percentage-wise, but still left me at a relatively low salary. I decided to see what else was out there. I went to an executive recruiter. Within a week, I had an interview that led to a job offer for a director of commodity research for Hornblower Weeks at more than triple my salary at Reynolds. Do you know why you got the job? I supplied them with samples of my reports. I also had started writing articles for an industry magazine called Commodities, which gave me some name recognition. So, once again, my writing was instrumental in propelling my career. What happened to your trading after you blew out your first account? Over the next few years, I tried trading again two or three times, starting with a few thousand dollars. I don’t remember any details, but the end result was the same as for my first account. By the way, even though I was clueless about successful trading, I was doing something right at the time: I was only risking a small amount each time I started trading, and if I lost my starting stake, I stopped trading. Even though I knew nothing about risk management in those early years, this small-starting-stake approach provided a strong risk control. It is the only element of my early trading that became a lifelong rule: Whenever I start trading, I always risk a small amount, and if I lose that small amount, then I’ll stop and come back at a later time. 82 I believe the recommendation to use this approach is good advice, especially for novice traders, because it creates an asymmetric payoff: If the trading attempt fails (the account wipes out), the loss will be relatively small. But if it succeeds, the account can grow to multiples of the initial starting equity. Although they achieve it differently, creating asymmetric payoffs is a critical element in the success of many of the Market Wizards I have interviewed. When did you start experiencing success in trading, and what changed? As a research director, I supervised a staff of analysts. I noticed that the only analyst who was significantly more right than wrong was the technical analyst, Stephen Chronowitz. Steve and I shared a large office, and we became close friends. At the time, I was still totally oriented toward fundamental analysis. Perhaps because of my academic background in economics, I had an inherent bias against technical analysis. I thought it was mumbo jumbo. But seeing that technical analysis worked for Steve, I reconsidered my prejudgment. Through my conversations with Steve, I understood that there was a rationale why technical analysis embedded real information: Market prices—the core input of technical analysis— reflected all the known fundamentals and the actions of all market participants. In effect, prices were the net result of all market information and everybody’s actions. So, there was a logical reason why technical analysis might work. I finally said to Steve, “OK, show me what you are doing.” Steve taught me the basics of chart analysis. Did you start using chart analysis, and how did that impact your trading? Yes, as I gained experience applying chart analysis, my opinion of the technique changed 180 degrees from my original skepticism. I also discovered that technical analysis was compatible with risk management, whereas the reverse was true for fundamental analysis. If, for example, I think cotton prices are overpriced at 33 cents, then if the fundamentals don’t change, cotton would be a better short at 38 cents and an even better short at 43 cents. So, with fundamental analysis, the more the market goes against you, the better the implied trade opportunity. It virtually implies you should add to a losing position. With technical analysis, if the market moves against you, by definition, the original rationale for the trade is contradicted. 83 So, it is difficult to combine risk management with fundamental analysis, but quite natural to do so with technical analysis. Once I switched from trading based on fundamental analysis to technical analysis, I went from consistently losing to becoming net profitable. When I started using technical analysis, I also started using risk management, and that made all the difference. One of the trades I remember best in my whole life was a losing trade. It was early on in my using the combination of technical analysis and risk management.",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "fundamentals",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.182250"
}