{
  "id": "d0c17dd3f390",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 4,
  "content": "percent a year, it is not too fantastic because investing in an index fund will generate as good, if not better, returns on average. However, if the strategy is a long–short dollar-neutral strategy (i.e., the portfolio holds long and short positions with equal capital), then 10 percent is quite a good return, because then the benchmark of comparison is not the mar - ket index, but a riskless asset such as the yield of the three-month US Treasury bill (which at the time of this writing is just about zero percent). Another issue to consider is the consistency of the returns gen- erated by a strategy. Though a strategy may have the same aver - age return as the benchmark, perhaps it delivered positive returns every month while the benchmark occasionally suffered some very bad months. In this case, we would still deem the strategy superior. Chan800064_c02.indd 20 6/7/2021 7:17:56 AM Fishing for Ideas 23 As a rule of thumb, any strategy that has a Sharpe ratio of less than 1 is not suitable as a stand-alone strategy. For a strategy that achieves profitability almost every month, its (annualized) Sharpe ratio is typically greater than 2. For a strategy that is profitable almost every day, its Sharpe ratio is usually greater than 3. I will show you how to calculate Sharpe ratios for various strategies in Examples 3.4, 3.6, and 3.7 in the next chapter. How Deep and Long Is the Drawdown? A strategy suffers a drawdown whenever it has lost money recently. A drawdown at a given time t is defined as the difference between the current equity value (assuming no redemption or cash infusion) of the portfolio and the global maximum of the equity curve occur - ring on or before time t. The maximum drawdown is the difference between the global maximum of the equity curve with the global minimum of the curve after the occurrence of the global maximum (time order matters here: The global minimum must occur later than the global maximum). The global maximum is called the high watermark. The maximum drawdown duration is the longest it has taken for the equity curve to recover losses. Maximum drawdown duration 3x104 2x104 1x104 Maximum drawdown 2000 2001 2002 2003 Time Equity in $ A drawdown FIGURE 2.1 Drawdown, maximum drawdown, and maximum draw- down duration. Chan800064_c02.indd 23 6/7/2021 7:17:56 AM 4 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 30 QUANTITATIVE TRADING Does the Strategy “Fly under the Radar” of Institutional Money Managers? Since this book is about starting a quantitative trading business from scratch, and not about starting a hedge fund that manages multiple millions of dollars, we should not be concerned whether a strategy is one that can absorb multiple millions of dollars. (Capacity is the technical term for how much a strategy can absorb without negatively impacting its returns.) In fact, quite the opposite—you should look for those strategies that fly under the radar of most institutional inves- tors, for example, strategies that have very low capacities because they trade too often, strategies that trade very few stocks every day, or strategies that have very infrequent positions (such as some seasonal trades in commodity futures described in Chapter 7). Those niches are the ones that are likely to still be profitable because they have not yet been completely arbitraged away by the gigantic hedge funds. SUMMARY Finding prospective quantitative trading strategies is not difficult. There are: • Business school and other economic research websites. • Financial websites and blogs focusing on the retail investors. • Trader forums where you can exchange ideas with fellow traders. • Twitter! After you have done a sufficient amount of Net surfing or scroll- ing through your Twitter feed, you will find a number of promising trading strategies. Whittle them down to just a handful, based on your personal circumstances and requirements, and by applying the screening criteria (more accurately described as healthy skepticism) that I listed earlier: • How much time do you have for babysitting your trading programs? • How good a programmer are you? Chan800064_c02.indd 30 6/7/2021 7:17:57 AM Fishing for Ideas 31 • How much capital do you have? • Is your goal to earn steady monthly income or to strive for a large, long-term capital gain? Even before doing an in-depth backtest of the strategy, you can quickly filter out some unsuitable strategies if they fail one or more of these tests: • Does it outperform a benchmark? • Does it have a high enough Sharpe ratio? • Does it have a small enough drawdown and short enough draw- down duration? • Does the backtest suffer from survivorship bias? • Does the strategy lose steam in recent years compared to its ear- lier years? • Does the strategy have its own “niche” that protects it from intense competition from large institutional money managers? After making all these quick judgments, you are now ready to proceed to the next chapter, which is to rigorously backtest the strategy yourself to make sure that it does what it is advertised to do. REFERENCES Duhigg, Charles. 2006. “Street Scene; A Smarter Computer to Pick Stock.” New York Times, November 24. Sharpe, William. 1994. “The Sharpe Ratio.” The Journal of Portfolio Management, Fall. Available at: www.stanford.edu/~wfsharpe/art/ sr/sr.htm. Chan800064_c02.indd 31 6/7/2021 7:17:57 AM 5 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Fishing for Ideas 31 • How much capital do you have? • Is your",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:43.603885"
}