{
  "id": "e8f73a0d0379",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 107,
  "content": "a synthetic. Consider the following situation. Dealing in a futures option market where the underlying March futures contract is trading very actively at 100.00, a trader wants to execute the following backspread for a one-point credit: buy 20 March 105 calls sell 10 March 100 calls That is, the amount he expects to receive for the sale of one March 100 call less the amount he expects to pay for two March 105 calls should equal one point. Suppose the current market in these options is: Option Bid/Ask March 100 call 2.70/2.90 March 105 call 857.95 If the trader were able sell the March 100 calls at the ask price of 2.90, he would be willing to pay the ask price of .95 for the March 105 calls, since 2.90 — (2 x .95) = 1.00. In the same way, if he were able to buy the March 105 calls at the bid price of .85, he would be willing to sell the March 100 calls at the bid price of 2.70, since 2.70 — (2 x 85) = 1.00. Suppose that an offer comes into the marketplace to sell March 105 cails at .85. The trader immediately buys these calls and is about to offer the March 100 calls at 2.70, when suddenly a bid of 2.80 is made for March 100 puts. Does this affect what the trader might do? Since the new bid is for the March 100 put, and the trader is interested in selling the March 100 call, it may seem that the put bid will have no affect on his strategy. But recall the synthetic relationship: synthetic short call = short put + short underlying 234 Chapter I | In the futures market, the value of the call is: call price = put price + futures price — exercise price — carrying costs If the underlying March futures contract is trading at 100, there is no carrying cost associated with a March 100 synthetic because the difference between the futures price and exercise price is zero. Therefore: March 100 call = March 100 put + 100- 100-0 March 100 call = March 100 put In other words, if the trader believes he can trade the March futures contract at 100, then the prices of the March 100 call and put ought to be identical. He originally intended to sell the March 100 call at 2.70 to complete his backspread. He is now given the chance to sell the March 100 call, synthetically, at 2.80. If he sells the March 100 put at 2.80, and simultaneously sells the March futures contract at 100.00, he has effectively sold the March 100 call at 2.80, which is .10 better than he originally intended. Whenever a trader is consideringa strategy, he ought to always ask himself whether he can do better by executing some part of his strategy synthetically. Usually he won’t be able to because synthetic relationships tend to be very efficient. But every now and then the trader will find that the synthetic position is slightly more favorable. Over a career of trading even small savings can add up. Using synthetic equivalents, we can also rewrite some volatility spreads in more familiar terms. For example, we said that call and put butterflies with the same exercise prices are identical. Suppose we take a typical call butterfly and rewrite it in terms of its synthetic equivalents: Contract Synthetic Equivalent long 1 March 95 call long 1 March 95 put/long an underlying contract short 2 March 100 calls short 2 March 100 puts/short 2 underlying contracts Jong 1 March 105 call long 1 March 105 put/long an underlying contract Since the long and short underlying contracts in our synthetic equivalent cancel out, we are left with a put butterfly: long 1 March 95 put short 2 March 100 puts long 1 March 105 put Using synthetic equivalents, we can also express the following strategy in a more familiar form: long 2 March 100 calls short an underlying contract This is simply a long straddle, since we can take one of the March 100 calls and rewrite it synthetically: long March 100 call = long March 100 put + long underlying contract Option Arbitrage 235 leaving: long 1 March 100 call short an underlying contract long 1 March 100 put long an underlying contract Since the jong and short underlying contracts cancel out, we ate left with a typical long straddle: ’ long 1 March 100 call long 1 March 100 put TRADING WITHOUT THEORETICAL VALUES Synthetic relationships can often enable a trader to make logical trading decisions without the aid of values generated by a theoretical pricing model. Usually all that is required is an ability to calculate the carrying cost on a position and, in the case of stocks, to determine the dividend payout. While a trader can’t always be as certain of a profit as he is with arbitrage strategies such as conversions, reversals, boxes, and jelly rolls, there are many logical relationships between options and underlying contracts, or between options and other options, which enable a trader to identify potentially profitable trading strategies without the use of a theoretical pricing model. Consider the following option prices with the underlying price at 101.50: 95 call 100 call 105 call 8.00 4.80 1.60 Is there anything wrong with these prices? If the trader purchases one 95 call for 8.00, sells two 100 calls at 4.80, and purchases one 1 05 call for 1.60, he has bought the 95/100/105 butterfly for zero since: (2 x 4.80) — (8.00 + 1.60) = 9.60 — 9.60 = 0 Since a butterfly can never be worth less than zero at expiration, and in this case might be worth as much as five points, the purchase of this butterfly represents a riskless trading opportunity. Another way of reaching the same conclusion is to realize that a butterfly is made up of two consecutive vertical spreads. In our example, the purchase of the",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.438674"
}