{
  "id": "10c70395f2b5",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 71,
  "content": "Put Spread Value 2.10 1.73 1.39 1.09 82 The Effect of Changing Dividends on Stock Option Time Spreads Stock Price = +00; Volatility = 20%; Interest Rate = 6.00% Time to March expiration = 6 weeks Time to June expiration = 19 weeks If the quarterly dividendls... 0 1.00 2.00 3.00 4,00 June 100 call 5.92 4.81 3.82 2.97 2.26 March 100 call 3.05 2.53 2.07 1.66 1.31 Call Spread Value 2.87 2.28 1.75 1.31 95 June 100 put 3.76 4.62 5.62 6.75 8.01 March 100 put 2.37 2.84 3.37 3.96 4.62 Put Spread Value 1.39 1.78 2.25 2.79 3,39 expiration months. This is only true, however, if a trader can carry a short stock position between expiration months. If a situation arises where no stock can be borrowed, the trader who owns a time spread may be forced to exercise his long-term option, thereby losing the time value associated with the option. As an example, suppose in February a company’s stock is trading at 70, when a tender offer is made to buy a portion of the outstanding stock at a price of 80. Ifa trader is long a June/March 70 call time spread, he will be assigned on the March 70 call because the holder of that call wants to tender his stock for sale at 80. The trader is now short stock and long a June 70 call. The June call should still carry some time value because of the interest which can be earned on the short stock to June expiration. But in order to carry a short stock position, the trader must deliver the stock to the exerciser of the March 70 call. To deliver the stock, he must borrow it from someone. Unfortu- nately, no one will lend stock to the trader because everyone wants to tender the stock for sale at the tender price of 80. Uniess the trader wants to go into the market and buy the stock at the tender price of 80, he will be forced to exercise his June 70 call. This is the only method by which the trader can obtain stock for delivery to the exerciser of Volatility Spreads 157 the March 70 call. Even though the June 70 call should in theory have some time value, the trader will be forced to discard the time value in order to fulfill his delivery obligation. In the foregoing situation, sometimes referred to as a short squeeze, a trader is forced to exercise calls with some time value remaining because no stock can be borrowed to carry a short stock position. Anyone who owns the June/March 70 call time spread will be forced to exercise the June 70 call, and the price of the time spread will collapse to zero. Note that this situation is not the same as a buy-out, where all the stock in a company is purchased at one price. Although a tender offer was made at 80, it was for only a portion of the company’s outstanding stock. When the tender is completed, the remaining stock will continue to trade, most likely at its pre-tender price of 70. DIAGONAL SPREADS A diagonal spread is similar to a time spread, except that the options have different exercise prices. While many diagonal spreads are executed one-to-one (one long-term option for each short-term option), diagonal spreads can also be ratioed, with unequal numbers of long and short market contracts. With the large number of variations in diagonal spreads, it is almost impossible to generalize about their characteristics as we can with backspreads, ratio vertical spreads, and long and short time spreads. Each diagonal spread must be analyzed separately, often using a computer, to determine the risks and rewards associated with the spread. There is, however, one type of diagonal spread about which we can generalize. If a diagonal spread is done one-to-one, and both options are of the same type and have approximately the same delta, the diagonal spread will act very much like a conven- tional time spread. An example of a such diagonal spread is shown in Figure 8-12. OTHER VARIATIONS The spreads we have thus far defined are the primary types of volatility spreads, and are the ones most commonly executed in the marketplace. There are, however, some variations of which the reader ought to be aware. A Christmas tree (also referred to as a ladder) is a term which can be applied to a variety of spreads. The spread usually consists of three different exercise prices where all options are of the same type and expire at the same time. In a long (short) call Christmas tree, one call is purchased (sold) at the lowest exercise price, and one call is sold (purchased) at each of the higher exercise prices. In a long (short) put Christmas tree, one put is purchased (sold) at the highest exercise price, and one put is sold (purchased) at each of the lower exercise prices. Christmas trees are usually delta neutral, but even with this restriction, there are many ways to execute the spread. Some examples of Christmas trees are shown in Figure 8-16. Long Christmas trees, when done delta neutral, can be thought of as particular types of ratio vertical spreads. Such spreads therefore increase in value if the underlying market either sits still or moves very slowly. Short Christmas trees can be thought of as 158 Chapter 8 Figure 8-16 Long Christmas Trees Short Christmas Trees long 10 March 95 calis (78) short § June 90 calls (81) short 10 March 100 calls (61) long 5 June 100 calls (51) short 10 March 105 calls (24) long 5 June 105 calls (36) long 25 June 110 puts (—75) short 50 March 110 puts (-91) short 25 June 100 puts (-47) long 50 March 105 puts (-75) short 25 June 95 puts (-31) long 50 March 95 puts (-21) particular types of backspreads, and therefore increase in value with big moves in the underlying market. It is possible",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.433265"
}