{
  "id": "65e2dfb7b583",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 3,
  "content": "figured that if this guy was willing to set up a web page and all I had to do was give him the weekly letter that I was writing anyway, I might as well try it and see what happens. I assume your partner handles the business end as well? Yes, he does everything except write the content. We split the subscription revenue 50/50. Just for the record, my half goes to a local charity. So I’m not making any money personally off of this thing. I watched some of your recent videos. I noticed you thought this bear market was different from past bear markets. Do you want to expound on that thought? I believe that we are in for a very long bear market. Probably the most important statistic is that we had more money flow into the stock market during 2021 than in the 20 prior years combined. So, you had massive amounts of retail money flow into the market. And to me, this is not money that will earn a positive return over time. I get it. People have been conditioned that buying on market weakness is what you do. They didn’t do it in 2002 when they should have. They didn’t do it in 2008 when they should have. And now, they have learned their lesson. The market rebounded in those past years because retail investors didn’t buy. The market is not going to rebound this time because they are buying. The government printing money and using it to buy its debt is just one giant Ponzi scheme. There is a limit to everything, including the amount of money the government can print. I don’t know what the limit is, but the market will tell us. Is there a historical analog to the current situation? I would say the closest analog is Japan 1989 forward. The Japanese stock market peaked in 1989, and here we are over 30 years later, and the Japanese equity index still hasn’t recovered to the 1989 high. 16 Does your long-term bearish view affect the way you trade the markets now? No, because I am not a fundamental macro trader. I trade a process. That is what I do. What I have sold to my investors is a non-correlated return stream. That is what my process produces, which is why they have given me money. That commitment keeps me disciplined in following my process. When the S&P goes from a high of over 4300 in mid-August to a low near 3500 six weeks later, and I am not short, even though I am Mr. Bear, does that piss me off? No, it doesn’t. The trade didn’t fit my process. I won’t catch every swing, but I will catch the bear move somewhere. I know that because I believe in my approach and am disciplined in my process. But I won’t chase a trade because I am bearish on the stock market, and the market is going down, and I’m not in it. You have some strong opinions about day trading. Can you explain your view? I see it all the time; people want to day trade. I think it’s the worst type of trading you can do. I have known hundreds of people who tried to be day traders; out of all of them, I know only one who is still doing it. The shorter the time frame, the more random the market. Why would you want to operate in the most random time period? When you did your video on day trading, did you get pushback from people saying that they were day traders and profitable? Of course. I got comments like, “You don’t know how to day trade.” “Stick to talking about what you know.” “I made a ton of money day trading.” I know lots of people who made money day trading—for a while. In the end, though, they’re not trading anymore. Lots of people started day trading after Covid. They would buy a bunch of stocks in the morning, the market would go up, and then they would sell at the end of the day. That worked great in a bull market. They never had to sell at a loss because if a stock went against them, all they had to do was hold, and it always came back. But then the market stopped going up, and rather than sell, they just held, which is what they had learned to do. Now, they are sitting on stocks that are down 70% or 80%. Suddenly they are not day trading anymore; they are “investing.” What advice do you give traders? 17 The three most important things to succeed in trading are patience—the ability to wait for the right trade rather than feeling you have to trade all the time—discipline, and risk management. I recently heard a great quote by Caroline Ellison [the CEO of Alameda Research, the trading firm affiliated with the FTX crypto exchange and allegedly instrumental in its spectacular collapse]. She said, “stop losses are a horrible risk management tool.” [Shapiro laughs loudly.] I love it! 18 Richard Bargh The Importance of Mindset Three years later With the advent of Covid and, more recently, the re-emergence of inflation, we’ve had some eventful markets since our original interview. How has your trading fared during the past three years? I was up around 50% in both 2020 and 2021. This year [2022], I had an amazing start. I was up about 100% through May, and then everything unraveled. I’m still trying to figure out what went wrong. I think part of the problem was that because there was so much going on, I spent more time than usual at my desk and not enough time away from it. During the first half of the year, I was forced to take time off from trading because I was attempting to pass my motorcycle test, which I kept failing. I failed four times before I finally passed. Training to",
  "word_count": 1000,
  "topics": [
    "psychology",
    "risk_management",
    "fundamentals",
    "crypto",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.178818"
}