{
  "id": "16bcfc925be0",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 68,
  "content": "is a much higher probability of a dramatic failure and reversal when the market is overextended on the higher time frame, so a trade taken under these conditions has a completely different risk proﬁle. Skip the trade altogether, take it and manage the risk with a tighter stop, or choose to get out at the ﬁrst sign you might be wrong—these are all acceptable alternatives. What is not acceptable is ignoring the clear message of the LULU - Oaiy Lululemon Alhletica Inc , , Dec '11 13:00 14:00 15:00 Feb 16:00 17:00 Mar 60.00 55.00 50.00 80.000 79.S00 79.000 78.S00 78.000 77.S00 / 77.000 Short? 76.S00 ' ~,i 75.00 70.00 65.00 L 60.00 55.00 50.00 45.00 -~ --- .... ., .,. .. 40.00 35.00 ~:::o ~ 2.00 '11 ~ 81.000 ~ t -~ 80.SOO t~tt,\\ 80.000 \\ 79.SO0 ~ 79.000 _ 78.SO0 78.000 77.S00 77.000 , .0.00 - ---- , -0.60 -1 .20 12:00 18:00 103 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 220 TRADING STRATEGIES higher time frame extension and taking an unnecessary large loss as you continue to short into the mean-reverting higher time frame. Higher Time Frame Pullbacks To understand the effects of higher time frame pullbacks on the trading time frame, ﬁrst review some of the characteristics that deﬁne high-probability pullbacks on a single time frame: r Presence of a good impulse setting up further continuation. r Market is not overextended. r Market is not on the third (or later) trend leg. r Absence of momentum divergence. r Absence of buying or selling climax. r Pullbacks show generally lower activity and volume than the trend legs. These conditions and patterns, when they appear on the higher time frame, can provide motivation for and add conﬁdence to trades on lower time frames. Figure 7.25 shows a pattern on the daily chart of Crude Oil futures that might not be compelling by itself. It is obviously some form of a pullback, but the move up off the lows was maybe a little too far too fast to justify shorting; it could also be read as a potential setup for a long Anti trade, but it is not an example of the best possible trade FIGURE 7.25 A Mediocre Pullback on the Daily Chart Is an Excellent Pullback on the Weekly Chart P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 221 FIGURE 7.26 The Weekly Anti Provides Bullish Context to the Daily Chart on this time frame. However, the weekly chart shows a clean bounce, which was the ﬁrst reaction after the collapse from the overextended highs and the ﬁrst pullback after a strong impulse move pushed prices below the lower channel. The weekly pattern added conﬁdence to the daily consolidation, and justiﬁed a short attempt on a breakdown out of this pattern. Figure 7.26 shows another example on weekly and daily charts of Goldman Sachs from October 2010. The pattern on the daily chart was anything but convincing: many large gaps and sudden reversals. Though the market was in an uptrend from the Septem- ber lows, it might have been difﬁcult to see this at the time. However, the weekly chart shows a pattern that we know well: several marginal new lows on slackening momen- tum followed by a sharp reversal off those lows. The upward reversal (not visible on the daily chart) made new momentum highs on the weekly chart and set up an Anti trade. This weekly chart pattern put a clearly bullish context on an otherwise difﬁcult daily chart, and traders would have been justiﬁed aggressively pursuing long setups on the daily chart. In this case, there were many small bullish setups on this time frame: failure tests of support, breakouts of small daily ﬂags, and, ﬁnally, an overextended climax just beyond the weekly measured move objective for the weekly Anti. At this point, realizing that the weekly chart had basically fulﬁlled its expectations for a measured move would have removed much of the bullish context from the daily patterns, justifying a reduction of risk or perhaps a complete exit from the trade. @CL - Daily Crude Oi Continuous Contract @CL- Wee.........,...__ / ~ ~ti 190.00 . 190.00 iii~ '1 ~~ . 185.00 ,ij,, ' 180.00 f / w 1------- \"'\" ;, ----~ --- \"'\" . ~ '·-,.,, 175.00 ir ·1tH -- 160.00 ~ t,.~tl,'',,,, Short on a 110.00 ,,,~ 1so.oo ./ ~ ~ 1 '·,,,, breakdown? 165.00 ] 140.00 ~ij;,;~1------... ::: ~~ ::: ~ !Tl.I ---~~ \"' 00 it \"'\" ,v ::::~, .. , ~,.____,-\"\\ 135.00 ~ -15.00 ~~~~------------~ Jul Aug Sep GS - Daily Goldman Sachs Group 104 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 222 TRADING STRATEGIES FIGURE 7.27 The Potential Breakout on the Daily Is Contradicted by the Weekly Complex Consolidation (Bear Flag) Higher time frame pullbacks can also be a ﬁlter to skip trades that set up against those pullbacks. Figure 7.27 is an important example that shows what might have been seen as a good setup for a breakout on the daily chart: the consolidation up against re- sistance normally suggests the possibility of a strong break above that level, and is the opposite of the price rejection that normally accompanies a level holding. However, the weekly chart provided context, showing",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.706055"
}