{
  "id": "f5aea6dace35",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 59,
  "content": "breakout trades, they think of big, dramatic win- ning trades, and it is not hard to ﬁnd examples like this. However, the trader actually trading breakouts quickly comes face-to-face with a harsh reality: failed breakouts are more common than winning breakouts. This is not an indictment of the breakout trading concept, because exceptional reward/risk ratios can compensate for lower probability. Furthermore, good breakout traders know how to prequalify their trades by focusing on the patterns that tend to support successful breakouts and may have a higher winning percentage than might be expected. There certainly is money to be made trading break- outs, but it is also worthwhile to spend some time thinking about the patterns associated with breakout failures. It is difﬁcult to nail these patterns down because it is not uncommon for good break- outs to have reactions that violate the breakout level. Imagine the frustration of the trader working with this ﬂawed plan: pay into the actual breakout, and ﬂip the position short if the breakout level does not hold. In the very common case of a volatile breakout with a pullback that violates the breakout level, this trader will ﬁrst take a loss on the long position, and will now be positioned short as the pullback in the new uptrend begins its advance. This is a futile plan, but many developing traders fall into this trap because they attach too much importance to the retest of the actual breakout level. It is important to understand how the market really moves, rather than clinging to some idea of how the market logically should work. There are two setup conditions to consider: the strength of the move beyond the breakout level, and the character of the ﬁrst reaction after the breakout. Good breakouts should have strong momentum, volume, and interest beyond the level. If this does not happen, it is more likely that the breakout will fail, perhaps painting a spring or upthrust outside the previous support or resistance level. In successful breakouts, the ﬁrst reac- tion should be controlled and in proportion to this breakout thrust. It should look like a good pullback in the new trend, for that is exactly what it is. If the breakout fails, it 84 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing 184 TRADING STRATEGIES FIGURE 6.20 A Failed Breakout Below Support in Crude Oil will be through a failure of this ﬁrst pullback; this is a critical point in breakout trading. If the ﬁrst reaction is very strong (i.e., the ﬁrst downswing after an upside breakout or vice versa for a breakdown through support), it suggests a failure of the break interest and greatly increased probability of trade failure. This is potentially confusing, so some examples may help to clarify. Figure 6.20 shows a failed breakdown attempt below support. The actual bar of the breakout was a good entry, showing strong momentum through support, and the subse- quent consolidation was also consistent with the breakout play. Most traders trading this pattern should have been short, and should have been holding through the three small bars following the point marked A. Though not a large pattern, these bars were a pull- back or consolidation near the extreme of the previous downthrust and below previous support. However, even with this generally constructive setup, the trade failed as buyers stepped in and swept the market back above support at B, possibly fueled by additional short-covering volatility. This is nothing more than a classic pullback failure via strong countertrend momentum emerging in the pullback. Figure 6.21 shows another example of a failed breakout, this time an upside break- out in Goldman Sachs (NYSE: GS). There were several elements that should have put @CL- Daily Crude m Continuous Contract [Aug11) 102.00 11 ~ !IU ::· /- ~! I ---- w - :: f 86.00 84.00 85 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 185 FIGURE 6.21 A Failed Upside Breakout Attempt in GS the long pullback trader on warning: the actual breakout at A was not on good momen- tum and did not show strong conviction. The pullback (four black candles beginning two bars after A) retraced most of the breakout thrust. Though the penetration back through the breakout level is not in itself cause for concern, it is not good to see so much of the breakout retraced so easily. The actual failure came at point B, as the stock put in a fail- ure test at the previous high. This is one of the standard ways in which pullbacks fail and a good opportunity to use another trading pattern (the failure test from the beginning of this chapter) in a supporting context. Good trading is nothing more than the disciplined application of a few relatively simple fundamental building blocks. Trigger Conceptually, this is the most problematic of the trade setups because we have to strike a balance between waiting for conﬁrmation that the breakout has failed while still getting a good trade location. In terms of actual execution, the breakout fail- ure is nothing more than a failed pullback. Breakout traders need to understand that the pullback pattern is a critical building block for these trades, and it is important to understand the patterns that suggest pullbacks failing and continuing.",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.704636"
}