{
  "id": "92752cd84bbf",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 109,
  "content": "anything wrong with these prices? We know that a time spread maintains its greatest value with the underlying contract at the exercise price. The 100 time spread, being more at-the-money, is trading for more than the 105 time spread, as one would expect. The 100 time spread should also be more valuable than the 95 time spread. Here the 95 time spread is trading at a greater price, and, again, if we assume random movement in the underlying contract, this is clearly not logical. Without a theoretical pricing model, we can’t be sure what each of these spreads is worth. But we do know that the 95 call time spread is too expensive with respect to the 100 call time spread. If we sell the former and buy the latter we can’t be certain of a profit, but we do have the laws of probability on our side. Note that in each of these examples we made an important assumption: Regardless of the exact theoretical value, there ought to be a uniform progression of both individual option prices and spread prices in the marketplace. If this uniform progression is violated, a trader can take advantage of the situation by purchasing the option or spread which is relatively cheap and selling the option or spread which Is relatively expensive. While the great majority of option traders work with theoretical values, a good habit for the new trader is to quickly check the relationship of option prices and spreads in the market to ensure that there are no obvious mispricings. The trader can start with 238 Chapter 11 conversions and reversals, then look at vertical spreads and butterflies, and finally consider straddles and time spreads. Usually there will not be any obvious mispricing. But if there is, the trader can exploit the situation by purchasing the cheap side of the relationship and selling the expensive. Two evaluation tables, demonstrating typical progressions of option prices and spreads in a stock option and futures option market, are shown in Figures 11-4 and 11-5. 239 ‘Z| 4a\\dey U! pessnosip 6q |IIM SenjeA peaids Uo asiolexe Aree Jo jOoye oYL ‘senjeA eageBou aney Aew speaids ewos pue Ajed ue) sso] aq ABW senjeA eanelooyy eos ‘peyluuied esiolexe Aves ou um ‘uvedoing oq 0} pewinsse ale suondo je aouls , 69\" we - - pe ge\" Zit Zb'h 66\" 9° 9¢\" speaids au ind 9\"! We Lg% 16% soe soe 99°2 92% 68'} spreads aun |e 08°61 Ores Bist Olbt ppl 02's} oma 0g'0z p0'Pe se|ppeas eunr 6e\" cr os\" rs zg\" cP’ ig\" seleyng une gZe ge'e 16% ip'2 cal ge'} 06\" eg\" sjeoen ynd eunr 50’! vb'h 68\"! 6e'2 e6'2 Pe oe'e lap sfeOMeA [ed euNr 99° L4 08'E1 pro} eS'Z zt'g gz'e 06'} 00°F Lr synd eunr gz'2 oe'e PL? €9'9 206 S6'ht OFS oe'6} £S'€% sjjeo eunr G88 | ESE LVet Ze'0t 166 ehh Ze} LPL) 6L 12 se|ppeys YoseW OP’ Lg’ OL\" 82’ LL 9s\" pe\" seleyng yore Zep zee gee g9'2 8°} oll 09\" 92’ S[eONeA ynd yoreW gg\" 86\" gg‘ g2'2 c0'e ple oe’ 9'P S[EOMAA [20 YOsRW »b2'8h »Z6'E} 00°01! s9'9 00°F ere 16 Ze\" Lh synd youew 19° 6th LV2 ZZe 16'S 00°6 pLel pO'L1 89°12 sled YoreW 021. StL OL SO} 00} 66 06 se 08 O=pusprniq ‘%ooe=eelsaajuy — *%Sz = AINEIOA syeom 9g =ounr ‘syoem ec] = Ye) :uOreudxe 0} OUI, OO} = soud yooIs p-L bE oanBi4 Option Arbitrage 6V ee ov'v 6l'P Lo bor OO\" O° vs 18° ZV So 0° ce\" 9c\" c8'e 30° S0'e 80° es SL eo 28° ov 9S BES Hh Bla es 99° ce\" ss 9° 96°2 Or 26°1 66° sey gt\" orl LS 9s\" og 6S\" 6s\" aie AL Ley bet vo} 0d\" cs\" ce\" st es Or 6S\" es es 06'2 bb 96° r6'l eel gl op Pit 6P re ‘Zp Jeldeyd ul passnosip aq |jIM senjeA peaids uo osjolexe Ayres jo yale eu “Aued ueU] ssa} oq Ae Sen|RA |EONaIOaU] aos ‘payed estolexe Ayee ou YIM ‘Ueedoiny aq 0} pewnsse ase suoKdo |[e souls , by oP’ oee ol B's be? eV Bl gle SP Syeem ZL = Aine ba’ by se Le 8h OLE 20° cer’ Lhe 20\" bore Lv %00'S = Syel SOLS] U} st vl ber ZV 1s le ely c0'P r0 sé\" £0\" 666 Sb ‘SWOOm p = ABW speeids awn ind spreads ouuly [feo selpperys Ain¢ seenng Aine sfeomed ind Aine SJeOMIOA jeo Aine sind Aine syeo Ain sopppens AeW selpeyng AeW sjeomea ind Aew S[ONJOA |yeo ACW sind Aew syeo AeW ‘%S1 = AUINBIOA uolyesdxe 0} Swi os’ = aoud saunjng ¢-L eunbi4 240 ge 12 % Early Exercise of American Options Thus far we have assumed that all option strategies involve holding a position to expiration. Since the great majority of exchange traded options are American, carrying with them the right of early exercise, it will be worthwhile to consider some of the characteristics of American options. Specifically, we will want to answer two questions: 1. Given the opportunity, under what circumstances might a trader consider exercising an American option prior to expiration? 2. How much more should a trader be willing to pay for an American option over an equivalent European option? In order for early exercise to be desirable, there must be some positive cash flow which will result from early exercise, and the value of this cash must be greater than the insurance value of the option. Because the cash flow which results from the exercise of a stock option is significantly different from the cash flow which results from the exercise of a futures option, the conditions under which early exercise will be desirable are different. For this reason, we will look at these two situations separately. FUTURES OPTIONS From previous discussions (see Chapter 6) we know that in evaluating an option there are some factors which make the option more valuable and there are some factors which make the option less valuable. Consider a",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.438961"
}