{
  "id": "731235498eed",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 72,
  "content": "8 Figure 8-16 Long Christmas Trees Short Christmas Trees long 10 March 95 calis (78) short § June 90 calls (81) short 10 March 100 calls (61) long 5 June 100 calls (51) short 10 March 105 calls (24) long 5 June 105 calls (36) long 25 June 110 puts (—75) short 50 March 110 puts (-91) short 25 June 100 puts (-47) long 50 March 105 puts (-75) short 25 June 95 puts (-31) long 50 March 95 puts (-21) particular types of backspreads, and therefore increase in value with big moves in the underlying market. It is possible to construct a spread which has the same characteristics as a butterfly by purchasing a straddle (strangle) and selling a strangle (straddle) where the straddle is executed at an exercise price midway between the strangle’s exercise prices. All options must expire at the same time. Because the position wants the same outcome as a butterfly, it is known as an iron butterfly. Like a true butterfly, at expiration an iron butterfly has a minimum value of zero and a maximum value of the amount between exercise prices. Note that if the straddle is purchased and the strangle is sold, the position will result in a debit (a long iron butterfly). Such a position will show its greatest profit at expiration if the underlying market finishes beyond the outside (strangle’s) exercise prices. A long iron butterfly is therefore equivalent to a short butterfly. If the straddle is sold and the strangle is purchased, the position will result in a debit (a short iron butterfly). Such a position will show its greatest profit at expiration if the underlying market finishes right at the inside {straddle’s) exercise price. A short iron butterfly is therefore equivalent to a long butterfly. Examples of long and short iron butterflies are shown in Figure 8-17. Another variation on a butterfly, known as a condor, can be constructed by splitting the inside exercise prices. Now the position consists of four options at consecutive exercise prices where the two outside options are purchased and the two inside options sold {a long condor), or the two inside options are purchased and the two outside options sold (a short condor). As with a butterfly, all options must be of the same type (all calls or all puts) and expire at the same time. At expiration a condor will have its maximum value, equivalent to the amount between consecutive exercise prices, when the underlying contract is at or anywhere between the two inside exercise prices. It will be worthless whenever the underlying contract is outside the extreme exercise prices at expiration. Note that this is very similar to a butterfly, except that a condor has a maximum value over a wider range of underlying prices. A butterfly will achieve its maximum value at expiration at only one underlying price, when the underlying contract is right at the inside exercise price. For this reason a condor will usually have a higher value than a butterfly with approximately the same exercise prices. Examples of long and short condors are shown in Figure 8-18. Volatility Spreads 159 Figure 8-17 Long Iron Butterfiles long 10 March 100 calls (51) long 10 March 100 puts (—48) short 10 March 105 calls (24) short 10 March 95 puts (-21) long 50 June 100 calls (51) long 50 June 100 puts (-47) short 50 June 110 calls (23) short 50 June 90 puts (-17) Short iron Butterflies short 15 June 100 calls (51) short 15 June 100 puts (-47) long 15 June 105 calls (36) long 15 June 95 puts (-31) short 25 March 105 calls (24) short 25 March 108 puts (—75) long 25 March 110 calls (8) Jong 25 March 100 puts (~48) SPREAD SENSITIVITIES Just as every individual option has a unique delta, gamma, theta, vega, and rho associated with it, every spread position has unique sensitivities. These numbers can help a trader determine beforehand how changing market conditions are likely to affect the spread. Before proceeding further the reader may want to review Figure 6-27, which summarizes the significance of the signs associated with the various option sensitivities. A trader who initiates a volatility spread is concerned primarily with the magnitude of movement in the underlying contract and only secondarily with the direction of movement. Therefore all volatility spreads will be approximately delta neutral (the deltas will add up to approximately zero). It is true that some volatility spreads may prefer movement in one direction rather than the other, but the primary consideration is whether movement of any type will occur. If a trader has a large positive or negative delta, such that directional considerations become more important than volatility considerations, then the position can no longer be considered a volatility spread. All spreads which are helped by movement in the underlying market have a positive gamma. These include backspreads, long straddles, long strangles, short butterflies, and short time spreads. All spreads which are hurt by movement in the underlying market will have a negative gamma. These include ratio vertical spreads, short straddles, short Figure 8-18 Long Condors Short Condors fong 10 March 90 calls (93) short 10 March 95 calls (78) short 10 March 100 calls (51) long 10 March 105 calls (24) long 25 June 95 puts (-31) short 25 June 100 puts (-47) short 25 June 105 puts (-62) long 25 June 110 puts (-75) short 50 March 95 puts (-21) long 50 March 100 puts (—48) long 50 March 105 puts (~75) short 50 March 110 puts (-91) short 5 June 90 calls (81) long 5 June 95 calls (67) long 5 June 100 calls (51) short 5 June 105 calls (36) 160 Chapter 8 strangles, long butterflies, and long time spreads. A trader who has a positive gamma is sometimes said to be /ong premiumand is hoping for a volatile market with large moves in the underlying contract. A trader who has a negative gamma is sometimes said to be",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.433447"
}