{
  "id": "c29076a71976",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 67,
  "content": "spread consists of opposing positions in two options of the same type (either both calls or both puts) where both options have the same exercise price. When the long-term option is purchased and the short-term option is sold, a trader is long the time spread; when the short-term option is purchased and the long-term option is sold, the trader is short the time spread. Since a long-term option will have more time value, and therefore a higher price than a short-term option, this is consistent with the practice of referring to any spread which is executed at a debit (credit) as a long (short) spread position. 2. This is not necessarily the case if the spreads consist of American options, where there is a possibility of early exercise. A sure profit would exist only if one were certain of carrying the position to expiration. 3. Expiration months were originally listed horizontally on exchange option displays. Hence the term horizontal spread. Volatility Spreads 149 Although time spreads are most commonly executed one-to-one (one contract purchased for each contract sold), a trader may ratio a time spread to reflect a bullish, bearish, or neutral market sentiment. For the present we will assume that all time spreads will be ratioed delta neutral. Typical long and short time spreads are shown in Figures 8-11 and 8-12. A time spread has different characteristics from the other spreads we have dis- cussed, because its value depends not only on movement in the underlying market, but also on other traders’ expectations about future market movement as reflected in the implied volatility. If we assume that the options making up a time spread are approxi- mately at-the-money, time spreads have two important characteristics. A long time spread always wants the underlying market to sit still. An important characteristic of an at-the-money option’s theta (time decay) is its tendency to become increasingly large as expiration approaches. As time passes, a short-term at-the-money option, having less time to expiration, will lose its value at a greater rate than a long-term at-the-money option. (Note the value of at-the-money options in Figures 6-13 and 6-14, and the theta values in Figure 6-15.} This principle has an important effect on the value of a time spread. For example, suppose two at-the-money calls, one with three months to expiration and one with six months to expiration, have values of 6 and 714, respectively. The value of the spread is therefore 11%. If one month passes and the underlying market is unchanged, both options will lose value. But the short-term option, with its greater theta, will lose a greater amount. If the long-term option loses '/, the short-term option Figure 8-11: Long Time Spread (Value at Near Term Expiration) long 20 June 100 calls (61) short 20 March 100 calls (51) long 10 June 95 puts (-31) short 10 March 95 puts (-21) Profit buy a long term option at one exercise price Loss sell a short term option of the same type at the same exercise price 150 Chapter 8 Figure 8-12: Short Time Spread (Value at Near Term Expiration) buy a short term option at one exercise price = sell a long term option e of the same type oO at the same exercise price | | | - | g *long 10 March 105 calls (24) | long 25 March 100 puts (-48) _ short 10 June 110 cails (23) | short 25 June 100 puts (-47) | *technically a diagonal spread, but with many of the same characteristics as a time spread may lose a full point. Now the options are worth 5 and 7%, and the spread is worth 2%. If another month passes and the market is still unchanged, both options will continue to decay, But, again, the short-term option, with less time remaining to expiration, will decay at a greater rate. If the long-term option loses 4, the short term option may lose 2 points. Now the options are worth 3 and 6%, and the spread has increased in value to 3%. Finally, if at expiration the market is still unchanged, the short-term option, since it is still at-the-money, will lose all of its remaining value of 3 points. The long-term option will continue to decay but will do so at a slower rate. If the long-term option loses %, it will be worth 6 points, and the spread will be worth 6 points (Figure 8-13). What will happen if the underlying market makes a larger move? Assume as before that both options are at-the-money and have values of 7% and 6. As the underlying market rises and options move more deeply into-the-money, they begin to lose their time value. If the move is large enough, it won’t matter that the long-term option has three more months remaining to expiration. Both options will eventually lose all their time value (see Figures 6-15 and 6-16). If the time spread consists of calls, both of which have exercise prices of 100, and the underlying market moves from 100 to 150, both options might trade at parity (intrinsic value), or 50 points. The spread will then go to zero. Even if the long-term option retains as much as 4 point, the spread will still have collapsed to 4. What about a large downward move in the underlying market? The situation is almost identical to an upward move. As an option moves further out-of-the-money its Volatility Spreads 151 Figure 8-13: The Effect of Time Passage on Time Spreads Time to Expiration Long-term option 6 months 5 months 4 months 3 months Short-term option 3 months 2 months + month none Option Value Long-term option Ti ™% 6% Short-term option 6 5 3 ) Spread Value 1% 2V, 3% 6 time value also begins to shrink. Here, however, neither option will have any intrinsic value, so that if the market moves down far enough both options will eventually be worthless. If that happens, the time spread will be worthless. If, as above, the",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.432632"
}