{
  "id": "a04f65697111",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 162,
  "content": "the position consists only of calls, the position will eventually flatten out (limited downside risk/reward]. The value of a position may also change over time or as volatility conditions change. The changes will be determined by the theta and vega associated with the position: 4. Theta (Figure 17-3c)—As time passes a positive theta position will become more valuable, and the graph of such a position will shift upward. As time passes a negative theta position will become less valuable, and the graph will shift downward. 5. Vega (Figure 17-3d}—A positive vega position will be helped by increasing volatility and hurt by declining volatility. The graph of such a position will shift 362 Chapter 17 Figure 17-3c: Positive and Negative Theta (Time Decay) positive theta - , \\,__ the graph shifts upward over time / \\ / \\ / \\ / negative theta - \\ the graph shifts downward over time * Figure 17-3d: Positive and Negative Vega (Volatility) positive (negative) vega - the graph shifts upward with higher (lower) volatility — negative (positive) vega - the graph shifts downward with higher (lower) volatility Position Analysis 363 upward when volatility increases and downward when volatility decreases. A negative vega position will be hurt by increasing volatility and helped by declining volatility. The graph of this position will shift downward when volatility increases and upward when volatility decreases. Note that time and volatility have similar effects on an option position. But unlike time, which can only move in one direction, volatility can either rise or fall. If a trader has a positive (negative) gamma position, he will necessarily have a negative (positive) theta position. He need only worry about one or the other, either gamma or theta. But a trader can have a positive or negative gamma position and still be concerned with volatility. A positive gamma position can still be hurt by a rise in volatility (e.g., a short time spread), while a negative gamma position can still be hurt by a decline in volatility (e.g., a long time spread). Let’s try to put these graphing principles together to analyze a position. Stock price = 98.75; Time to June expiration = 7 weeks Volatility = 20%; Interest rate = 6%; Dividend = 0 Option Option Option Option Position Price Th. Val. Delta Imp. Vol. long 20 June 105 calls 75 1.02 25 17.6 short 20 June 95 puts 1.38 112 2 22.1 short 10 stock contracts? Even though the position is delta neutral, it does not appear to fall into any easily recognized category. The calls appear to be underpriced and the puts appear to be overpriced, and the position combines trades in both these options. The total theoretical edge is: 20 x (1.02-.75) + 20 x (1.38-1.12) = +10.60 The sensitivities of the position are: Option Gamma Theta ’ Vega June 105 call 4.3 -.0270 114 June 95 puts 4,4 -.0192 115 position totals -2.0 -.1560 ~.020 First we ought to try to visualize what the graph of this position looks like. Since the position has a positive theoretical edge of 10.60, it will cross the current stock price of 98.75 at a point 10.60 above the zero P&L line. The position is delta neutral, so the graph will be exactly horizontal at this point. The position is also very close to gamma neutral at this point, so the graph will have no curvature. This means that it is bending neither upward (concave) nor downward (convex). 2. Since the number of shares in an underlying stock contract varles from market to market, we simply express the underlying in terms of contracts. In U.S. markets where one option contract typically controls 100 shares of stock, this position would be short 1,000 shares. 364 Chapter 17 To complete the graph we need the upside and downside contract position. If the market makes a large upward move, all the puts will eventually collapse to zero while the calls will act like long underlying contracts. In our example the 20 long calls will act like 20 long stock contracts. These will be partially offset by the actual 10 short underlying contracts, but the total will still be an upside contract position which is long 10. If the market moves up far enough the position will take on a slope of +10. For each point the stock price rises, the position will gain ten points in value. If the market makes a large downward move, all the calls will eventually collapse to zero while the puts will act like short underlying contracts. Since a short put is a long market position, our short 20 puts will act like 20 long stock contracts. These will be partially offset by the actual 10 short underlying contracts, but the total will still be a downside contract position which is long 10 contracts. If the market moves down far enough the position will take on a slope of +10. For each point the stock price falls, the position will lose ten points in value. The initial characteristics of our spread are shown in Figure 17-4a. We know that the characteristics of a position are likely to change as market conditions change. How might our position change as time passes? Since deltas move away from 50 with the passage of time, if no movement takes place in the underlying stock, the deltas of both the 95 put and 105 call (currently at -25 and +25) will move Figure 17-4a: Long 20 June 105 Calls @ .75 Short 20 June 95 Puts @1.38 Short 10 Stock Contracts @98.75 184 40 357 | | 305 | upside contract position of +10 | 257 | position is gamma neutral (graph is bending neither upward nor | 20°) downward at current underlying price) I | i | f position is delta neutral 104 —<——_———— (graph is horizontal at current underlying price) } +10.60 (theoretical edge) theoretical profit & loss downside contract position of +10 54 ‘4 -10 T T T T T T 90",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.447283"
}