{
  "id": "78f354089ecb",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 163,
  "content": "(currently at -25 and +25) will move Figure 17-4a: Long 20 June 105 Calls @ .75 Short 20 June 95 Puts @1.38 Short 10 Stock Contracts @98.75 184 40 357 | | 305 | upside contract position of +10 | 257 | position is gamma neutral (graph is bending neither upward nor | 20°) downward at current underlying price) I | i | f position is delta neutral 104 —<——_———— (graph is horizontal at current underlying price) } +10.60 (theoretical edge) theoretical profit & loss downside contract position of +10 54 ‘4 -10 T T T T T T 90 92 94 96 98 100 102 104 106 108 110 stock price Position Analysis 365 towards zero. This means our position will act more and more like a position which is naked short 10 stock contracts. Therefore, as time passes the slope of the graph is becoming more and more negative between the exercise prices of 95 and 105 (Figure 17-4b). What about changes in the gamma with respect to stock price movement? If the stock price remains near the current price of 98.75, the gamma (curvature) of the position remains near zero. As the price moves toward either the 95 or 105 exercise price, the position takes on greater gamma characteristics as time passes. As the stock approaches 95 the position begins to act like a short straddle (negative gamma), and as it approaches 105 the position begins to act like a long straddle (positive gamma). Since the gamma of our position at the current price of 98.75 is very close to zero, we might expect the theta to also be close to zero. In this case the theta is actually -.1560. This means the position is becoming less valuable each day. The reason is that the sale of stock has resulted in a cash credit, a credit on which we can earn interest. As time passes the amount of interest which we expect to earn declines, so the expected profit also declines. This would not be the case if the underlying instrument were a futures contract, since the sale of a futures contract does not result in a cash inflow, and consequently no interest can be earned. The theta of such a position would therefore be close to zero. Figure 17-4b: Long 20 June 105 Calls @ .75 Short 20 June 95 Puts @1.38 Short 10 Stock Contracts @98.75 50 4075 30- 104 va —s > 2 weeks to expiration a -2075 7 weeks to expiration theoretical profit & loss ° -40-4 at expiration -307 UZ % y ’ -50 T T T T 90 92 94 96 98 T T 1 00 102 104 stock price 110 366 Chapter 17 Changes in volatility will also affect the characteristics of the position. Falling volatility is similar to the passage of time. All deltas will move away from 50, and the total delta position will become shorter around the current price of 98.75. If volatility rises all deltas will move towards 50, and the total delta position will become longer. As volatility rises (falls), the position looks more and more like a position which is naked long (short) 10 stock contracts (Figure 17-4c). Regardless of changes in volatility, the gamma will stay close to zero near the midpoint price of 100. But as we move towards 95 or 105 the gamma begins to increase as either the 95 put or 105 call becomes more and more at-the-money. At the same time the gamma of an at-the-money option falls as volatility rises and rises as volatility falls. The result is that in a low-volatility market any move away from 100 can cause the gamma risk to increase very quickly, becoming negative as the stock price moves toward 95 and positive as the stock price moves toward 105. Finally, the contract position remains the same, regardless of the passage of time or changes in volatility. If the market makes a big move, rising far above 105 or falling far below 95, we still have the same contract position of +10 (long 10 underlying contracts). This last example illustrates an important aspect of spreading. Many traders, in addition to focusing on delta neutral strategies, will try to construct positions which are Figure 17-4c: Long 20 June 105 Calls @ .75 Short 20 June 95 Puts @1.38 Short 10 Stock Contracts @98.75 50 volatility = 25% a 407 \\ o volatility = 20% va o 8 8 — a L @ 104 va ee “ re) a 0 7 oo volatility = 15% 104 v ° -20 T T T T T T T T T 90 92 94 96 98 100 102 104 106 108 110 stock price Position Analysis 367 also gamma neutral or vega neutral. Such strategies may be sensible if a trader is concerned with a move in the underlying contract, or with a change in volatility. Buta trader should not make the assumption that if he is delta neutral, gamma neutral, and vega neutral, there is nothing that can go wrong. Even if a position has a positive theoretical edge and all the risk sensitivities are small, a profit is not necessarily certain. A position is only delta neutral, or gamma neutral, or vega neutral if the theoretical pricing model is itself correct, and if all the information which the trader has fed into the model is also correct. If any of these assumptions are wrong, the values generated by the theoretical pricing model are also likely to be wrong. Asa result, the trader might find that a position which initially appears to be neutral in terms of a risk sensitivity is in fact not neutral at all. A COMPLEX POSITION Each of our previous examples consisted of only two different options. A more complex position may consist of options at several different exercise prices. Consider the position shown in Figure 17-5. We can determine many of the characteristics of this position simply by looking at the total",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.447432"
}