{
  "id": "9bbdf43d6eba",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 39,
  "content": "a number of vendors from whom you can obtain historical factor data: • S&P Capital IQ: spgglobal.com/marketintelligence • Compustat: www.compustat.com • MSCI: www.msci.com • Sharadar: sharadar.com (This is the most affordable source.) A very comprehensive and technical introduction to factor models can be found in Ruppert (2015). Example 7.4: Principal Component Analysis as an Example of the Factor Model The examples of factor exposures I described above are typically economic (e.g., outperformance of value stocks), fundamental (e.g., book-to-price ratio), or technical (e.g., previous period’s return). However, there is one kind of factor model that relies on nothing more than historical returns to construct. These are the so-called statistical factors, obtained using meth- ods such as the principal component analysis (PCA). If we use PCA to construct the statistical factor exposures and factor returns, we must assume that the factor exposures are constant (time inde- pendent) over the estimation period. (This rules out factors that represent mean reversion or momentum, since these factor exposures depend on the prior period returns.) In a sense, this is more similar to the time-series factors such as SMB than the cross sectional factors such as P/E, because Chan800064_c07.indd 163 6/7/2021 7:16:58 AM 83 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 164 QUANTITATIVE TRADING the factor exposures of time-series factors are also assumed to be con- stant over a long lookback period. However, unlike time-series factors, the statistical factors are unobservable, and unlike cross-sectional factor exposures, the statistical factor exposures are also unobservable. More importantly, we assume that the factor returns are uncorrelated; that is to say, their covariance matrix ⟨bb T⟩ is diagonal. If we use the eigenvectors of the covariance matrix ⟨RR T⟩ as the columns of the matrix X in the APT equation R = X b + u, we will find via elementary linear algebra that ⟨bbT⟩ is indeed diagonal; and furthermore, the eigenvalues of ⟨RRT⟩ are none other than the variances of the factor returns b. But of course, there is no point to use factor analysis if the number of factors is the same as the number of stocks—typically, we can just pick the eigenvectors with the top few eigenvalues to form the matrix X. The number of eigenvectors to pick is a parameter that you can adjust to optimize your trading model. In the following programs, I illustrate a possible trading strategy applying PCA to S&P 600 small-cap stocks. It is a strategy based on the assumption that factor returns have momentum: They remain constant from the current time period to the next. Hence, we can buy the stocks with the highest expected returns based on these factors, and short the ones with the lowest expected returns. The average annualized return of this strategy is only 2% (MATLAB) to 4% (Python and R), and only when we assume no transaction costs. (The difference in returns among the pro- grams are essentially round off errors.) Using MATLAB You can download the MATLAB code as example7_4.m. clear; lookback=252; % use lookback days as estimation (training) period for determining factor exposures. numFactors=5; topN=50; % for trading strategy, long stocks with topN expected 1-day returns. onewaytcost=0/10000; load('IJR_20080114.mat'); % test on SP600 smallcap stocks. (This MATLAB binary input file contains tday, stocks, op, hi, lo, cl arrays. mycls=fillMissingData(cl); positionsTable=zeros(size(cl)); dailyret=(mycls-backshift(1, mycls))./backshift(1, mycls); % note the rows of dailyret are the observations at different time periods Chan800064_c07.indd 164 6/7/2021 7:16:58 AM 84 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 165 end_index = length(tday); for t=lookback+2:end_index R=dailyret(t-lookback:t-1,:)'; % here the columns of R are the different observations. hasData=find(all(isfinite(R), 2)); % avoid any stocks with missing returns R=R(hasData, :); [PCALoadings,PCAScores,PCAVar] = pca(R); X = PCAScores(:,1:numFactors); y = dailyret(t, hasData)'; Xreg = [ones(size(X, 1), 1) X]; [b,sigma]=mvregress(Xreg,y); pred = Xreg*b; Rexp=sum(pred,2); % Rexp is the expected return for next period assuming factor returns remain constant. [foo idxSort]=sort(Rexp, 'ascend'); positionsTable(t, hasData(idxSort(1:topN)))=-1; % short topN stocks with lowest expected returns positionsTable(t, hasData(idxSort(end- topN+1:end)))=1; % buy topN stocks with highest expected returns end ret=smartsum(backshift(1, positionsTable).*dailyret- onewaytcost*abs(positionsTable-backshift(1, positionsTa- ble)), 2)./smartsum(abs(backshift(1, positionsTable)), 2); % compute daily returns of trading strategy fprintf(1, 'AvgAnnRet=%f Sharpe=%f\\n', smartmean(ret,1)*252, sqrt(252)*smartmean(ret,1)/ smartstd(ret,1)); % AvgAnnRet=0.020205 Sharpe=0.211120 This program made use of a function mvregress for multivariate linear regression with possible missing or NaN values in the input matrix. Using this function, the computation time is under a minute. Otherwise, it may take hours. Using Python You can download the Python code as example7_4.py. # Principal Component Analysis as an Example of Factor Model import math import numpy as np Chan800064_c07.indd 165 6/7/2021 7:16:58 AM 85 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 166 QUANTITATIVE TRADING import pandas as pd from numpy.linalg import eig from numpy.linalg import eigh #from statsmodels.api import OLS import statsmodels.api as sm from sklearn.linear_model import LinearRegression from sklearn.multioutput import MultiOutputRegressor from sklearn.decomposition import PCA from sklearn.preprocessing import StandardScaler from sklearn import linear_model from sklearn.linear_model import Ridge import time lookback=252 # training period for factor exposure numFactors=5 topN=50 # for trading strategy, long stocks with topN exepcted 1-day returns df=pd.read_table('IJR_20080114.txt') df['Date']=df['Date'].astype('int') df.set_index('Date', inplace=True) df.sort_index(inplace=True) df.fillna(method='ffill', inplace=True) dailyret=df.pct_change() # note the rows of dailyret are the observations at different time periods positionsTable=np.zeros(df.shape) end_index",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "fundamentals",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:43.610033"
}