{
  "id": "438a994d5968",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 106,
  "content": "market around an assumed value of 3.80. He might, for example, make a market of 3.50 bid/4.10 ask. If he is able to buy the put vertical for 3.50, he can then try to buy the call vertical for 6.00. If he is successful, he will have paid a total of 9.50 for a box with a theoretical value of 9.80. Conversely, if he is able to sell the put vertical for 4.10, he can then try to sell the call vertical for 6.00. If he is successful, he will have sold a box with a theoretical value of 9.80 at a price of 10.10. JELLY ROLLS Another method of eliminating a position in the underlying contractis to take a synthetic position in a different expiration month, rather than at a different exercise price as with a box. For example, suppose we have executed the following reversal: long a June 100 call short a June 100 put short an underlying contract Suppose we now execute the following conversion: short a September 100 call long a September 100 put long an underlying contract If the underlying contract for both June and September is identical, they will cancel out, leaving us with: long a June 100 call short a September 100 call short a June 100 put long a September 100 put These combined long and short synthetic positions taken at the same exercise prices but in different expiration months is known as a jelly roll° or simply a roll. The strategy is 3. This very unscientific sounding term seems to have originated among traders on the Chicago Board Options Exchange. 232 Chapter 11 most common in the stock option market where the underlying for both months is the same, What should be the value ofa roll in the stock option market? In our example, the sale of the June/September 100 roll, the trader will buy stock at 100 at June expiration and sell the same stock at 100 at September expiration. The value of the roll is the cost of holding the stock for the three-month period from June to September. If interest rates are 8%, the holding costs are: 100 x 3/12 x 8% = 2.00 Therefore, the roll should have a value of two points. Expressed another way, the difference between the June 100 synthetic (the June 100 call less the June 100 put) and the September 100 synthetic (the September 100 call less the September 100 put) should be exactly two points. Now suppose that the stock pays a quarterly dividend of 4% point. Since the trader will own the stock for the period from June to September, he will receive the 3 point dividend. The value of the roll is now the two-point carrying cost less the 4% point dividend, or 14. The full value of the roll is: jelly roll = longterm synthetic — short-term synthetic = cost of carry — expected dividends where the cost of carry is calculated on the exercise price over the period between expiration months. In the same way that we evaluated a box as the combination of two vertical spreads, we can also evaluate a jelly roll as the difference between two time spreads: long a June 100 call short a September 100 call short a June 100 put long a September 100 put This is simply a short June/September 100 call time spread and a long June/September put time spread. Since the roll is a combination of the sale of a call (put) time spread and the purchase of put (call) time spread, the values of the call and put times spreads should differ by exactly the value of the roll. If the roll is worth 11/4, the difference between the call and put time spreads should also be 11%. If the call time spread is trading for 31/4, the put time spread should be trading for 2. This is logical when we realize that we can rewrite the jelly roll in a slightly different form: jelly roll = long-term synthetic — short-term synthetic = (long-term call — long-term put) — (short-term call ~ short-term put) = (long-term call — short-term call) — (long-term put — short-term put} = carrying costs — expected dividends The difference between the call and put time spreads should therefore be equal to the cost of carry on the exercise price less the expected dividends. Option Arbitrage 233 Since jelly rolls involve holding stock positions for some period of time, they have risks similar to those affecting conversions and reversals. If interest rates rise, or the dividend is cut, a jelly roll will become more valuable. If interest rates fall, or the dividend is increased, a jelly roll will become less valuable. Finally, we can create a time box by taking opposing synthetic positions at different exercise prices and expiration dates: longa June 90 call short a September 100 call short a June 90 put long a September 100 put The value of this position is the combined value of purchasing the June 90/100 box and selling the June/September 100 jelly roll. If the June 90/100 box is worth 994, and the June/September 100 jelly roll is worth 11/4, the time box should be worth 8. USING SYNTHETICS IN VOLATILITY SPREADS A trader need not restrict himself to using synthetics only in arbitrage strategies. He can also execute a volatility or directional strategy using a synthetic. Consider the following situation. Dealing in a futures option market where the underlying March futures contract is trading very actively at 100.00, a trader wants to execute the following backspread for a one-point credit: buy 20 March 105 calls sell 10 March 100 calls That is, the amount he expects to receive for the sale of one March 100 call less the amount he expects to pay for two March 105 calls should equal one point. Suppose the current market in these options is: Option Bid/Ask March 100 call 2.70/2.90 March 105 call 857.95 If the trader were",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.438530"
}