{
  "id": "dd3861eab0bb",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 19,
  "content": "right? Not so fast—there is a potential complication, and it is one of the most signiﬁcant problems in technical analysis. It is true that there should be follow-through (range ex- pansion) in the direction of previous impulse moves; however, extremely strong impulse 11 :00 12/7 10:00 13:00 12:00 7.00 4.00 19 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 55 FIGURE 3.5 Sugar Futures, November 2010—Two Large Downward Closing Days Break the Trend Pattern moves are more indicative of climax or exhaustion. This is one of the common ways that trends end, so it is important to fully understand these patterns. Figure 3.6 shows a classic example of a buying climax that ended a trend in silver futures. A naive trader might have noticed this action and read it as extreme strength. However, in these types of formations a type of short-term mania sets in as emotional buyers chase the market higher and higher. At some point, the last buyer who wants to buy has bought, and the market becomes extremely vulnerable to a sell-off. The slightest pause or speed bump will send a market like this crashing back into the vacuum on the other side, as there is no more natural buying pressure underneath the market. In addition, there may even be traders who bought into the last trend leg, and they are now the ultimate weak-hand longs. As soon as the pattern changes and real momentum emerges to the downside, they will run for the exits en masse, and their selling pressure will add fuel to the ﬁre. Note the classic signs of a buying climax in this example: an accelerated trend rate, large range bars, many free bars (bars with a low above the upper channel), and a subsequent collapse. 111uous Contract @SB-Daily s ugar No. 11 Conf 14.00 12.00 10.00 2.00 ' - 0.50 Aug Sep Oct Nov 20 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 56 MARKET STRUCTURE FIGURE 3.6 Daily Silver Futures, May 2011—A Near-Perfect Example of a Buying Climax This type of structure is often called a parabolic move or a blow-off. Notice also that the range of the bars in the blow-off becomes much larger than previous bars as the trend steepens and the bars pull away from the average; this is a reﬂection of expanded volatility, speciﬁcally intraday volatility. There will also often be a very large volume spike near the extreme of the climax move. It is not uncommon to see bars that trade four or ﬁve times the average volume for the instrument, but this information is also mirrored in lower time frame price action and volatility. Yet another common characteristic is that many more bars close at or near their high in a buying climax and on their low in a selling climax. This shows that the climactic conditions extend to the intraday (or intrabar if a weekly or monthly chart) time frame as well, which are probably showing exhaustion or climaxes on their own time frames. Last, it is extremely unusual to see bars that are completely outside the Keltner channels, called free bars; the presence of these bars is another sign of potential climax. The same pattern works symmetrically to the downside, as in Figure 3.7. In this par- ticular example, the panic was not quite as extreme as the mania in Figure 3.6, and traders might not have known until several weeks afterward that the market had bot- tomed. However, the message to not short into the pullback following the climax selling @SI - Daily Silver Continuous Contract [Jul11) 1.00 -;'--::c....::.;:..:.;:...:'-\"\"\".....,.==~-;,s = =-r7-'\"\"\" ~ \"------~-/----=.:.c.__ ___ -1i- ~ -1.00 -3.00 -5.00 Dec '11 Feb Mar Apr May 21 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 57 FIGURE 3.7 A Selling Climax in the EURJPY Following Multiple Downtrend Legs was clear. A climax, by itself, is probably not enough information to justify assuming a countertrend position (though it does have the advantage of deﬁning a clear risk point), but it should at least put trend traders on notice. Do not enter pullbacks following poten- tial climaxes. Notice that these examples have come after extended, mature trend runs; a potential climax out of a trading range is much more problematic. Climactic conditions can be de- ﬁned only by their proportional relationship to recent market history. Volatility contracts greatly in ranges, so any indicators measuring range expansion will also be skewed—in other words, it takes a much smaller movement to make a climax pattern on a breakout of a range. Furthermore, strong breakouts of ranges, even if they are apparently climac- tic, usually see continuation, so these are difﬁcult trades, and it is probably best to look for climaxes only after extended trends. Figure 3.8 shows the Dow Jones Industrial Average (cash index) in the days fol- lowing the terrorist attacks on the World Trade Center on September 11, 2001. Even in",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.698033"
}