{
  "id": "f29893d3b0e1",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 33,
  "content": "the daily settlement-to-settlement price changes for all the business days during that month. Historical and future volatility are sometimes referred to as realized volatility. Forecast Volatility Just as there are services which will attempt to forecast future directional moves in the price of a contract, there are also services which will attempt to forecast the future volatility of a contract. Forecasts may be for any period, but most commonly cover periods identical to the remaining life of options on the underlying contract. For an underlying contract with three months between expirations, a service might forecast volatilities for the next three, six, and nine months. For an underlying with monthly expirations, a service might forecast volatilities for the next one, two, and three months. Due to the relatively recent introduction of options, volatility forecasting is still in its infancy, and must be considered an inexact science at best. Nonetheless, a trader’s guess 71 Volatility 16-490 L6-Aew L6-uer o6-Bny 06-4eW 16-Bny Levey 06-20 06-Aew o6-uer _| L | i 1 | i it 1 g : LOL LOL |. 3 Hk 3 0 = a Ok < fo) a ; Ley = Kep pug Auena Log Rep Auano ‘seBueyo soud uo paseq LZe ve Anejo, jeoucysiy Aeq-o¢ xepuj 00S dS ‘ep einbi4 72 Chapter 4 about the future volatility of a contract might very well take into consideration any volatility forecast to which he has access. Implied Volatility Generally speaking, future, historical, and forecast volatility are associated with an underlying contract. We can talk about the future volatility of the S&P 500 index, or the historical volatility of U.S. Treasury Bonds, or a forecast volatility for IBM stock. In each case we are referring to the volatility of the underlying contract. There is, however, a different interpretation of volatility which is associated with an option rather than with the underlying contract. Suppose a certain futures contract is trading at 98.50 with interest rates at 8%. Suppose also that a 105 call with three months to expiration is available on this contract, and that our best guess about the volatility over the next three months is 16%. If we want to know the theoretical value of the 105 call we might feed all these inputs into a theoretical pricing model. Using the Black-Scholes Model, we find that the option has a theoretical value of .96,. Having done this we might compare the option’s theoretical value to its price in the marketplace. To our surprise, we find that the option is trading for 1.34. How can we account for the fact that we think the option is worth .96, while the marketplace seems to believe it is worth 1.34? One way to answer the question is to assume that everyone in the marketplace is using the same theoretical pricing model that we are, in this case the Black-Scholes Model. If we make this assumption, then the discrepancy between our value of .96 and the marketplace’s value of 1.34 must be due to a difference of opinion concerning one or more of the inputs into the model. We can therefore start going down the list of inputs and try to identify the culprits. We know that it can’t be either the amount of time to expiration or the exercise price, since these inputs are fixed in the option contract. What about the underlying price of 98.50? Perhaps we think the price of the underlying is at 98.50, but it is really trading at some higher price, say 99.00. Indeed, in such circumstances it is always wise to double check the inputs. But suppose we still find that the underlying is at 98.50. Even given that there is a spread between the bid and ask price, if the market is reasonably liquid it is unlikely that the spread would be wide enough to cause a discrepancy of .38 in the value of the option. Perhaps our problem is the interest rate of 8%. But, as we noted in the last chapter, the interest rate component is usually the least important of the inputs into a theoretical pricing model. And in the case of futures options, the interest rate component is often trivial. This leaves us with only one likely culprit, and that is volatility. In some sense, the marketplace must be using a volatility other than 16% to evaluate the 105 call. What volatility is the marketplace using? To find out, we can ask the following question: If we hold all other inputs constant (time to expiration, exercise price, underlying price, interest rates}, what volatility must we feed into our theoretical pricing model to yield a theoretical value identical to the price of the option in the marketplace? In our example, we want to know what volatility will yield a value of 1.34 for the 105 call. Clearly the volatility has to be higher than 16%, so we might sit down with a Volatility 73 computer programmed with the Black-Scholes Model and start to raise the volatility. If we do, we will find that at a volatility of 18.5% the 105 call has a theoretical value of 1,34. We refer to this volatility as the implied volatility of the 105 call. It is the volatility we must feed into our theoretical pricing model to yield a theoretical value identical to the price of the option in the marketplace. We can also think of it as the volatility being implied to the underlying contract through the pricing of the option in the marketplace. When we solve for the implied volatility of an option we are assuming that the theoretical value (the option’s price} is known, but that the volatility is unknown. In effect, we are running the theoretical pricing model backwards to solve for this unknown, as shown in Figure 4-9. In fact, this is easier said than done since most theoretical pricing models cannot be reversed. However, a number of computer programs have been written which can quickly solve for the implied volatility when all other",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.427390"
}