{
  "id": "d993dd4d29ce",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 103,
  "content": "means that a trader wants to trade out of his position at a price which is fair to everyone involved, so that everyone can avoid the problem of pin risk. Whatever profit a trader expected to make from the conversion or reversal presumably resulted from the initial trade, not from the closing trade. Certain options, such as stock indices and Eurodollars, are settled at expiration in cash rather than with the delivery of an actual underlying contract. When such an option expires, the amount of cash which flows into or out of a trader’s account is simply the amount by which the option is in-the-money, i.e., the difference between the underlying price and the option’s exercise price. There is no pin risk associated with options which settle in this manner because no underlying position results from exercise or assignment. Interest rate risk, execution risk, and pin risk are common to all markets, regardless of the underlying contract. There are, however, certain risks which are unique to a market depending on the characteristics of the underlying market. Settlement Risk in the Futures Market Let’s go back to our original conversion where a trader is short a June 100 call, long a June 100 put, and long an underlying contract. Suppose the underlying contract is a June futures contract which is trading at 102.00. If there are three months remaining to June expiration, interest rates are 8%, and all options are subject to stock-type (cash) settlement, the value of the June 100 synthetic market (the difference between the June 100 call and the June 100 put) is: futures price — exercise price — carry on 2 points for 3 months = 102 — 100 - (2 x 3/12 x 8%) = 1.96 Suppose a trader is able to sell aJune 100 call for 5.00, buy a June 100 put for 3.00, and sell a June futures contract for 102.00. If interest rates do not change, and assuming there will not be a problem with pin risk, at expiration the trader should realize a profit of .04, since he has done the June 100 conversion at .04 better than its value. Suppose that shortly after the trader initiates this conversion, the underlying June futures contract falls to 98.00. The synthetic (short) side of the position will now show a profit of four points: the short call and long put together will appreciate by four points. But because the options are settled like stock, the profit on the synthetic side will only be a paper profit, and will not be fully realized until expiration. On the other hand, the trader is also long a June futures contract, and this contract, since it is subject to futures-type settlement, will result in an immediate four point debit when the market drops four points. To cover this four point debit, the trader will either have to borrow Option Arbitrage 227 the money or take the money out of an existing, interest-bearing account. In either case there will be a loss in interest, and this interest loss will not be offset by the paper profit from the option position. If the loss in interest is great enough, it may more than offset the profit of .04 which the trader originally expected from the position. And in the most extreme case, where the trader does not have access to the funds required to feed the futures position, the trader may be forced to liquidate the position. Needless to say, forced liquidations are never profitable. Of course, this works both ways. A rise in the price of the underlying futures contract to 106.00 will result in a four point loss to the synthetic side: the short call and long put together will decline by four points. But the loss on the synthetic side will only be a paper loss, and will not be fully realized until expiration. On the other hand, the rise in the futures contract will result in an immediate cash credit, a credit on which the trader can earn interest. This interest will increase his potential profit beyond the original expected profit of .04. Most futures option traders think of conversions and reversals as being delta neutral, but in fact this is not necessarily true. With the underlying futures contract at 102, the deltas in our example might be: Option Position Delta Position short June 100 call ~60 long June 100 put ~38 long June futures contact +100 total +2 The two extra deltas reflect the fact that the trader would prefer the market to rise rather than fall, so that cash will flow into his account from the futures position. The interest from this cash flow can represent an unexpected profit or loss, in the case of a decline in the futures price. Two deltas are really no risk, except when we remember that conversions and reversals, because of their low risk, are often done in very large size. A trader who executes 500 conversions has a risk delta equal to 500 x +2 = +1000. This is the same as being naked long 10 futures contracts. The risk comes from the interest that can be earned on any cash credit, or which must be paid on any cash debit, resulting from movement in the underlying futures contract. The amount by which the delta of a synthetic futures position will differ from 100 depends on the interest risk associated with the position. This in turn depends on two factors: the general level of interest rates and the amount of time remaining to expiration. The higher the interest rate and the more time remaining to expiration, the greater the risk. The lower the interest rate and the less time remaining to expiration, the less the risk. A 10% interest rate with nine months to expiration represents a much greater risk than a 4% interest rate with one month remaining to expiration. In the former case, the deltas of a synthetic position may add up to 94, while",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.438117"
}