{
  "id": "5bf97e4c27f0",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 77,
  "content": "a trader’s volatility estimate is based on daily price changes, the trader might adjust daily. If the estimate is based on weekly price changes, he might adjust weekly. This is a trader’s best attempt to emulate the assumptions built into the theoretical pricing model, 2. Adjust when the position becomes a predetermined number of deltas long or short—Very few traders insist on being delta neutral all the time. Most traders realize that this is not a realistic approach, both because a continuous adjustment process is physically impossible, and because no one can be certain that all the assumptions and inputs in a theoretical pricing model, from which the delta is calculated, are correct. Even if one could be certain that all delta calculations were accurate, a trader might still be willing to take on some directional risk. Buta trader ought to know just how much directional risk he is willing to accept. If he wants to pursue delta neutral strategies, but believes that he can comfortably live with a position which is up to S00 deltas long or short, then he can adjust the position any time his delta position reaches this limit. Unlike the trader who adjusts at regular intervals, a trader who adjusts based on a fixed number of deltas cannot be sure how often he will need to adjust his position. In some cases he may have to adjust very frequently; in other cases he may go for long periods of time without adjusting. The number of deltas long or short a trader chooses for his adjustment points depends on the size of his positions and his capitalization. A small, independent trader may find that he is uncomfortable with a position which is even 200 deltas long or short, while a large trading firm may consider a position which is several thousand deltas long or short as being approximately delta neutral. 3. Adjust by fee-—This suggestion is not made facetiously. Some traders have good market feel. They can sense when the market is about to move in one direction or another. If a trader has this ability, there is no reason why he shouldn’t make use of it. For example, suppose that the underlying market is at 50.00 and a trader is delta neutral with a gamma of —200. If the market falls to 48.00, the trader can estimate that he is approximately 400 deltas long. If 400 deltas is the limit of risk he is willing to accept, he might decide to adjust at this point. If, however, he is also aware that 48.00 represents strong support for the market, he might choose not to adjust under the assumption that the market is likely to rebound from the support level. If he is right, he will have avoided an unprofitable adjustment. Of course, if he is wrong and the market continues downward through the support level, he will regret not having adjusted. If the trader is right more often than not, there is no reason why he shouldn’t take advantage of this skill. 170 Chapter 8 ENTERING A SPREAD ORDER In sophisticated option markets, spreads are traded as if they are one, single contract, This means that a spread is quoted with a single bid price and a single offer price. For example, suppose a trader is interested in buying a certain straddle and receives a quote from a market-maker of 3.45/3.55. If the trader wants to sell the straddle, he will have to do so at a price of 3.45 (the bid price); if he wants to buy the straddle, he will have to pay 3.55 (the ask price). If the trader decides he is willing to pay 3.55, neither he nor the market-maker care whether the trader pays 1.75 for the call and 1.80 for the put, or 1.55 for the call and 2.00 for the put, or some other combination of call and put prices. The only consideration is that the prices of the call and put taken together add up to 3.55. A market-maker will always endeavor to give one bid price and one ask price for an entire spread. If the spread is a common type, such as a straddle, strangle, butterfly, or time spread, a bid and ask can usually be given very quickly. Of course, marKet-mak- ers are only human. If a spread is very complex, involving several different options in unusual ratios, it may take a market-maker several minutes to calculate the value of the spread. But regardless of the complexity of a spread, the market-maker will make an effort to give his best two-sided (bid and ask) market. Spread orders, like individual option orders, can be submitted with qualifying instructions. The most common types are market orders (orders to be filled at the current market price) and limit orders (orders to be filled at a specified price). Other contingency orders may also include instructions specifying how the order is to be executed in the marketplace. The following contingency orders, all of which are defined in Appendix A, are often used in option markets: All Or None Fill Or Kill Immediate Or Cancel Market If Touched Market On Close Not Held One Cancels The Other Stop Limit Order Stop Loss Order Two typical spread orders, submitted with their contingency instructions, are shown in Figures 8-23a and 8-23b. A broker executing a spread order is responsible for adhering to any special instructions which accompany the order. Unless a trader knows exactly what current market conditions are, or has a great deal of confidence in the broker who will be handling the order, it is always a good practice to submit specific instructions with the order as to how it is to be filled. Additionally, when one considers all the information that must be communicated with a spread order (the expiration months, the exercise prices, the type of options, whether the order is a buy or sell, the ratio), it is easy to see Volatility Spreads 171 Figure 8-23a FUTURES",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.434221"
}