{
  "id": "7d0892a42cdc",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 28,
  "content": "Change #2 market to put in a lower high at B, hold a higher low than C, and then continue in an uptrend by trading through B. The only way to be certain that the market will show the lower high and lower low is for the previous low to fail to hold as support. It goes without saying that these patterns are simply inverted for a downtrend chang- ing to an uptrend. In the ﬁrst case, a downtrend fails to make a lower low, and then the trend change is conﬁrmed when the previous pivot high is violated. In the second case, a sharp rally takes out the previous pivot high, the subsequent decline falls short of new lows, and then the next rally makes a new high. An Important Complication: The Complex Consolidation Figure 3.29 shows an uptrending market with a complex consolidation, which is a powerful continuation pattern. Note that a naive application of the previous change-of-trend rules would have ﬂagged a downtrend at precisely the point you should have been buying this market. This complex consolidation pattern is very common, and it often leads to exceptional trade opportunities in the direction of the existing trend. If you were to use this structure in a vacuum, you would frequently ﬁnd yourself positioning short at precisely the point you should be buying in these complex consolidations. This does not compromise the validity of this simple labeling system, which does what it is designed to do very well: it identiﬁes breaks in the pattern of trends, and marks Trend change? FIGURE 3.29 A Complex Consolidation Will Flag a Trend Change According to a Strict Interpre- tation of Dow Theory Rules P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 80 MARKET STRUCTURE A B C FIGURE 3.28 Dow Theory Trend Change #2 market to put in a lower high at B, hold a higher low than C, and then continue in an uptrend by trading through B. The only way to be certain that the market will show the lower high and lower low is for the previous low to fail to hold as support. It goes without saying that these patterns are simply inverted for a downtrend chang- ing to an uptrend. In the ﬁrst case, a downtrend fails to make a lower low, and then the trend change is conﬁrmed when the previous pivot high is violated. In the second case, a sharp rally takes out the previous pivot high, the subsequent decline falls short of new lows, and then the next rally makes a new high. An Important Complication: The Complex Consolidation Figure 3.29 shows an uptrending market with a complex consolidation, which is a powerful continuation pattern. Note that a naive application of the previous change-of-trend rules would have ﬂagged a downtrend at precisely the point you should have been buying this market. This complex consolidation pattern is very common, and it often leads to exceptional trade opportunities in the direction of the existing trend. If you were to use this structure in a vacuum, you would frequently ﬁnd yourself positioning short at precisely the point you should be buying in these complex consolidations. This does not compromise the validity of this simple labeling system, which does what it is designed to do very well: it identiﬁes breaks in the pattern of trends, and marks Trend change? FIGURE 3.29 A Complex Consolidation Will Flag a Trend Change According to a Strict Interpre- tation of Dow Theory Rules \\ \\ \\ \\ ···········'-· · \\ \\ \\ \\ \\ \\ \\ \\ ·················\\-···· \\ ~ \\ ~ 36 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 82 MARKET STRUCTURE FIGURE 3.30 Trend Changes Flagged by the Slope of a 50-Period Moving Average results by learning to read price action and market structure, using simple tools to con- strain their actions to the realities of the marketplace, and always remembering that our tools are only tools. Go back through the last several charts, and notice how the trend changes given by each of the following tools usually lags the trend changes that you would have identiﬁed by simply reading the emerging price structure in each chart. There is no right or wrong here, but there is also no holy grail. Understanding Trend Integrity For most traders, the question of trend integrity is paramount. How strong is the trend? Are there any warning signs that suggest it could turn? How far might it go? What should our expectations be when it does turn? How can we monitor the strength of the trend as it waxes and wanes, and gain some more insight into the relative buying and selling pres- sure behind the trend? These are all important questions, and they all can be addressed by some very simple analyses. There are three primary points to consider: length of swings, rate of trend, and the character of each trend leg. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 83 A B FIGURE 3.31 In an Uptrend, Upswings Are Larger than Downswings Length of Swing Analysis Simple math tells us that in an uptrend the upswings must be longer than the down- swings, and the reverse is true in downtrends. If a market is gaining more on the up- swings than it is losing on the pullbacks, the net effect will be to move to a higher price level—this is a very elementary deﬁnition of a trend and is also consistent with the Dow Theory trend construct. One very simple way we can look at trends is to draw lines con- necting the",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.699545"
}