{
  "id": "5e0c576ac42b",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 150,
  "content": "and XYZ falls 10% to 90, the trader will likewise realize a profit Since: -2 x (50 — 47) + 1 x (100 - 90) = 4 Now in order to make a profit, ABC need only be stronger (or less weak) than XYZ in Percent terms. 331 332 Chapter 16 In our example we tried to ensure that we were long and short the same number of points on each side of our spread. However, the situation can be further complicated if the point values of the instruments are unequal. Suppose that each point in ABC is worth $400, while each point in XYZ is worth $100. Now if we buy two ABC contracts and sel] one XYZ contract to equalize the point values, we find that the dollar value of our ABC position is $400 x 2 x 50 = $40,000, while the dollar value of our XYZ position is $100 x 1 x 100 = $10,000. If ABC falls 6% to 47 and XYZ falls 10% to 90, the result will be: [-2 x (50 - 47) x $400] + [1 x (100 - 90) x $100} = -$2,400 Even though ABC outperformed XYZ in percent terms, we still ended up losing because the dollar values of each point were different. The trader’s ultimate goal is to equalize the dollar value of each side of his spread. If he wants to achieve this, he must ensure that: (ABC contracts) x (price of ABC) x (point value of ABC) = (XYZ contracts) x (price of XYZ) x (point value of XYZ) He must therefore sell two contracts of XYZ for each one contract of ABC which he buys, since: 1 x 50 x $400 = 2 x 100 x $100 Putting things in slightly different form, we can express the proper ratio of XYZ contracts to ABC contracts required for a balanced spread as: (price ABC / price XYZ) x (point value of ABC / point value of XYZ) = (50 / 100) x (40/10) = 2 (2:1 ratio) Now suppose that instead of creating his spread using the underlying instruments ABC and XYZ, the trader decides to create his spread using options on one or both instruments. That is, the trader wants to get long ABC and/or short XYZ by either buying or selling an appropriate number of options. A logical starting point might be to consider the delta positions of each spread. In traditional terms each underlying contract has a delta of 100, and if we buy one ABC contract and sell one XYZ contract we seem to have a neutral spread. But we already know that the price and the point value of the instruments are different. For purposes of intermarket spreading it might be useful to consider the dollar delta ($delta) of each instrument, the total dollar value of the contract divided by 100: $delta = (contract price x point value) / 100 We can interpret the $delta as the dollar value change for a one-percent change in the price of the underlying contract. This is slightly different than the traditional interpretation of the delta, the change in a contract’s value for a one-point change in the price of the underlying contract. However, the $delta makes it easier to create and evaluate delta positions between instruments trading at different prices and with different point values. Intermarket Spreading 333 Using the $delta calculations, for ABC we have a $delta of 50 x $400 / 100 = $200. For XYZ we have 100 x $100 / 100 = $100. For purposes of delta calculations we can see that each delta of ABC is worth two deltas of XYZ. A balanced spread therefore requires us to sell (buy) two deltas of XYZ for each one delta of ABC which we buy (sell). This is simply another way of expressing the proper ratio of underlying instruments required for a balanced spread. We can also assign a $delta to an option by multiplying the $delta of the underlying contract by the option’s delta, keeping in mind that, even though deltas are often expressed in whole numbers for convenience, they really represent a percent or decimal fraction: option $delta = underlying $delta x option’s delta An option’s $delta represents the dollar change in its theoretical value for a one percent change in the price of the underlying contract. An ABC call with a delta of 80 has a $delta of: $200 x .80 = $160 An XYZ put with a delta of -30 has a $delta of: $100 x -.30 = -$30 Given the $delta relationship, if we want to get long ABC and short XYZ, and we want to have the same number of dollars at risk on each side of the spread, we need to be long and short an equal number of $deltas. In other words, in a $delta neutral position: number of ABC contracts x contract delta x $delta of ABC must equal number of XYZ contracts x contract delta x $delta of XYZ Suppose ABC and XYZ are futures contracts with the following options available: ABC XYZ Exercise Call Put Exercise Call Put price delta delta price delta delta 45 80 -20 ° 95 70 3. -30 50 50 -50 100 50 -50 55 20 -80 105 30 -70 Some typical $delta neutral spreads might be: long 10 ABC futures / short 40 XYZ 100 calls long 10 ABC 45 calls / short 16 XYZ futures long 10 ABC 50 calls / long 20 XYZ 100 puts short 30 ABC 45 puts / long 40 XYZ 95 puts long 35 ABC 55 calls / short 20 XYZ 95 calls 334 Chapter 16 Each of these spreads is essentially balanced, because our $delta position in ABC options is exactly offset by an opposing $delta position in XYZ. Since we are always long ABC deltas and short XYZ deltas, for small movements in the underlying contracts, each spread will be profitable as long as ABC is stronger",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure"
  ],
  "created_at": "2026-02-05T08:09:54.445419"
}