{
  "id": "006982626e60",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 21,
  "content": "your actual trading. When applyin g mindfulness to these various, less demandin g tradin g activities, be sure to also notice what mindfulness does for you. See if distractin g thou g hts and feel - ings recede into the background. See if you are more attentive and aware of the tas k you are performin g . See if you start seein g thin g s you mi g ht normally miss. See if you are en g a g in g your deliberative mind, rather than jumpin g to quick and easy conclu - sions. Keep in mind, too, that being mindful when performing these activities will build mindfulness skills for more challen g in g situations later. Remember, mindfulness is a mental skill and, like an y skill, the more we practice it, the more profi cient and e ff ective we become in using it. Y ou will also likely fi nd that you will be more e ffi cien t and more observant as you mindfully perform these important tradin g tasks. ■Notes 1. Susan M. Pollack, “T eachin g Mindfulness in Therapy ,” in Mindfulness and Psychotherapy , ed.y Christopher K. Germer et al. (New Y ork: Guilford Press, 2013), 140. 2. Jo h n P . Forsyt h an d Georg H. Ei f ert, The Mindfulness and Acceptance Workbook for Anxiety: A Guide to Breaking Free from Anxiety, Phobias and Worry Using Acceptance and Commitment Therapy (Oakland, y CA: New Harbinger, 2007), 242 . 3 . Russ Harris , ACT made Simple: An Easy‐to‐Read Primer on Acceptance and Commitment Therapy (Oakland, CA: New Harbinger, 2009), 177–180. 4. Georg H. Eifert and John P . Forsyth, Acceptance and Commitment Therapy for Anxiety Disorders: A Practitioner’s Guide to Using Mind fulness, Acceptance and V alues‐Based Behavior Change Strategies (Oakland, CA: New Harbinger, 2005), 138–139. - ~---------- 25 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 145 D e f usion: An A d vance d Min df u l ness S k i ll CHAPTER 7 L et’s start with the followin g scenario: Y ou are drivin g alon g a deserted road late at ni g ht. Y ou are several miles from the nearest town and no other cars are traveling this road. Suddenly , you car loses power, the en g ine dies, and the car rolls quietly t o a stop. Y ou note that your g as tank is half full; so you realize there must be something wrong with the engine. Y ou take the fl ashlight from t he g love compartment and open the hood. Y our inspection reveals that t he fuel line has a small hole leaking gasoline. This has caused the engine t o die. Y ou try to call emer g ency road service, but your mobile phone h as no batter y life, so y ou look in y our car for tools to repair the leak. A ll you can fi nd is a ballpoint pen and a drinkin g g lass. How can you use what you have to fi x the problem so you can g et to the next town? Try t o so l ve t h is in t h e next f ew minutes b e f ore rea d ing on. If, after a minute or two, y ou haven’t solved the problem, consider that broken g lass can cut a plastic fuel line and removin g the ink cartrid g e from a pen leaves you wit h a h o ll ow p l astic tu b e. T h in k f or anot h er minute or two wit h t h is in f ormation and try to solve the problem before readin g on. 26 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 149DEFUSION: AN ADV ANCED MINDFULNESS SKILL FIGURE 7.1 Step h’ s Tra d e Entr y Source: T ra d eStation T ec h no l ogies, Inc. @JY - 60 min CME Longer-T erm Resistance Steph sees uptrend die out at resistance @JY - 5 min CME Steph enters short Steph sees selling enter market Steph sees rally fails to attract strong buying Y esterday High 1 .0300 1 .0250 1 .0200 1 .0150 1 .0100 30,000 25,000 20,000 15,000 10,000 10:00 8/27 20:00 16:00 17:00 20:00 21:0019:30 20:30 21:30 22:00 22:30 23:00 23:3016:3010:008/22 10:00 8/23 8/2510:00 5,000 3,055 1 .0330 1 .0320 1 .0325 1 .0315 1 .0310 1 .0305 1 .0300 1 .0295 1 .0290 1 .0285 1 .0280 1,100 900 700 500 300 100 243 I - - - --- - - - - --- --= - -- -.........::='- ---- --=-~ - j --- I -= --= = ...,;::: --=--===-- -= -= ~ --==::l --- -- \"J 27 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 150T RADE MINDF U LLY FIGURE 7.2 Ste p h Covers Her Short and the Market Falls Source: T radeStation T echnolo g ies, Inc. 400 @JY - 5 min CME 1 .0330 1 .0320 1 .0310 1 .0300 1 .0290 1 .0280 1 .0270 1 .0260 1 .0250 1 .0240",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology"
  ],
  "created_at": "2026-02-05T00:37:45.719854"
}