{
  "id": "a3424f493bea",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 68,
  "content": "further out-of-the-money its Volatility Spreads 151 Figure 8-13: The Effect of Time Passage on Time Spreads Time to Expiration Long-term option 6 months 5 months 4 months 3 months Short-term option 3 months 2 months + month none Option Value Long-term option Ti ™% 6% Short-term option 6 5 3 ) Spread Value 1% 2V, 3% 6 time value also begins to shrink. Here, however, neither option will have any intrinsic value, so that if the market moves down far enough both options will eventually be worthless. If that happens, the time spread will be worthless. If, as above, the long-term option retains even 1% point in value, the spread will still collapse to 1% point. Since a short-term at-the-money option always decays more quickly than a long- term at-the-money option, regardless of whether the options are calls or puts, both a long call time spread and a long put time spread want the underlying market to sit still. Ideally, both spreads would like the short-term option to expire right at-the-money so that the long-term option will retain as much time value as possible while the short-term option expires worthless. Ifa long time spread wants the market to sit still, logically a short time spread wants the market to move. It may therefore seem that, as with backspreads and ratio vertical spreads, the major consideration in deciding whether to initiate a long or short time spread is the likelihood of movement in the underlying market. Certainly time spreads are sensitive to movement in the price of the underlying, but time spreads are also sensitive to changes in implied volatility. A long time spread always benefits from an increase in implied volatility. Look again at Figure 6-18, the relationship between an option’s vega (sensitivity to a change in volatility) and the time remaining to expiration. As time to expiration increases, the vega of an option increases. This means that a long-term option is always more sensitive in total points to a change in volatility than a short-term option with the same exercise price. For example, assume again that a 100 call time spread is worth 114 (long- and short-term options with values of 714 and 6, respectively}. Assume also that the value of the spread is based on a volatility of 20%. What will happen to the value of the spread if we raise volatility to 25%? Both options will increase in value since an increase in volatility increases the value of all options. But the long-term option, with more time remaining to expiration and therefore a higher vega, will gain more value as a result of the increase in volatility. If the short-term option gains 4, the long-term option may gain a full point. Now the options will be worth 814 and 614, and the spread will have widened from 1'% to 2 (Figure 8-14). 152 Chapter 8 Figure 8-14: The Effect of Volatility on Time Spreads Voiatiiity 15% 20% 25% Option Value Long term option 6% 7% 8% Short term option 5Y 6 6% Spread Value 1 1% 2 Conversely, if we lower our volatility estimate to 15%, both options will lose value. But the long-term option, with more time remaining to expiration, will be more sensitive to the change in volatility and will lose a greater amount. The new option values might be 64 and 514, causing the spread to narrow to 1 point. The effects of volatility on a time spread become especially evident when there is a change in implied volatility in the option market. When implied volatility rises, time spreads tend to widen; when implied volatility falls, time spreads tend to narrow. This effect can often be great enough to offset either a favorable or unfavorable move in the underlying market. A trader who is long a time spread expects to lose money if the underlying market makes a swift move in either direction. He knows that time spreads begin to collapse as the options move into- or out-of-the-money. But if this movement is accompanied by a sufficient increase in implied volatility, the increase in the spread’s price due to the increase in implied volatility may actually be greater than the loss due to market movement. In that case the trader may find that the spread has actually widened. Conversely, if the market sits still, the trader expects the spread to widen because of the short-term option’s greater time decay. But if, at the same time, there is a collapse in implied volatility, the decline in the spread’s price due to the decline in implied volatility may more than offset any gain from the passage of time. If this happens, the trader may find that the spread has narrowed. These two opposing forces, the decay in an option’s value due to the passage of time and the change in an option’s value due to changes in volatility, give time spreads their unique characteristics. When a trader buys or sells a time spread, he is not only attempting to forecast movement in the underlying market. He is also trying to forecast changes in implied volatility. The trader would like to forecast both inputs accurately, but often an error in one input can be offset by an accurate forecast for the other input. Ideally, the trader who is long a time spread wants two apparently contradictory conditions in the marketplace. First, he wants the underlying market to sit still so that time decay will have a beneficial effect on the spread. Second, he wants everyone to think the market is going to move so that implied volatility will rise. This may seem an impossible scenario, the market remaining unchanged but everyone thinking it will move. In fact, this happens quite often because events which don’t have an immediate effect on the underlying market could be perceived to have a future effect on the market. Suppose an announcement is made that the finance ministers of the major indus- trialized countries plan to meet to discuss exchange rates. If",
  "word_count": 1000,
  "topics": [
    "options",
    "market_structure",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.432825"
}