{
  "id": "e983cdb43831",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 48,
  "content": "time it was not just one trader or one firm, but losses at multiple funds over a short period of time. And yet, ever since I began my career in the institutional quan- titative trading business, I have spoken to many small, independ- ent traders, working in shabby offices or their spare bedrooms, who gain small but steady and growing profits year-in and year-out, quite unlike the stereotypical reckless day traders of the popular imagi- nation. In fact, many independent traders that I know of have not only survived the periods when big funds lost billions, but actually thrived in those times. This has been the central mystery of trading to me for many years: how does an independent trader with insig- nificant equity and minimal infrastructure trade with a high Sharpe ratio while firms with all-star teams fail spectacularly? Conclusion Can Independent Traders Succeed? Chan800064_c08.indd 193 5/20/2021 10:57:45 AM 198 QUANTITATIVE TRADING Alternatively, you might want to take your strategy (and, more impor- tantly, your track record) to one of the larger hedge funds or propri- etary trading firms and ask for a profit-sharing contract. In the last couple of years, our own fund at QTS has taken on an increasing number of subadvisors, and overall it has greatly improved the con- sistency of our returns. After the major losses at quantitative hedge funds in 2007 and again in 2020 Q1, many people have started to wonder if quantita- tive trading is viable in the long term. Though the talk of the demise of quantitative strategies appears to be premature at this point, it is still an important question from the perspective of an independ- ent trader. Once you have automated everything and your equity is growing exponentially, can you just sit back, relax, and enjoy your wealth? Unfortunately, experience tells us that strategies do lose their potency over time as more traders catch on to them. It takes ongoing research to supply you with new strategies to overcome this dreaded alpha decay. Upheavals and major regime changes may occur once every dec- ade or so, and these might cause sudden deaths to certain strate- gies. As with any commercial endeavor, a period of rapid growth will inevitably be followed by the steady if unspectacular returns of a mature business. As long as financial markets demand instant liquidity, however, there will always be a profitable niche for quan- titative trading. REFERENCES Clark, Nicola. 2008. “French Bank Says Its Controls Failed for 2 Years.” New York Times, February 21. http://www.nytimes.com/2008/02/21/business /worldbusiness/21bank.html?ex=1361336400&en=cf84f3776a877eac&ei=512 4&partner=permalink&exprod=permalink. Chan800064_c08.indd 198 5/20/2021 10:57:45 AM 104 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. APPENDIX 199 A Quick Survey of MATLAB M ATLAB is a general-purpose software package developed by Mathworks, Inc., which is used by many institutional quantitative researchers and traders as their platform for backtesting, particularly those who work in statistical arbitrage. In Chapter 3, I introduced this platform and compared its pros and cons with some other alternatives. Most of the strategy examples in this book are written in MATLAB. Many of those strategies are portfolio-trading strategies involving hundreds of stocks that are very difficult to backtest in Excel. Here, I will provide a quick survey of MATLAB for those traders who are unfamiliar with the language, so they can see if it is worthwhile for them to invest in acquiring and learning to use this platform for their own backtesting. MATLAB is not only a programming language; it is also an inte- grated development platform that includes a very user-friendly program editor and debugger. It is an interpreted language, mean- ing that it’s similar to Visual Basic, but unlike a conventional pro- gramming language like C, it does not need to be compiled before it can be run. Yet it is much more flexible and powerful for back- testing than using Excel or Visual Basic because of the large num- ber of built-in functions useful for mathematical computations, and because it is an array-processing language that is specially designed to make computations on arrays (i.e., vectors or matrices) simply Chan800064_bapp01.indd 199Chan800064_bapp01.indd 199 20-05-2021 21:01:5720-05-2021 21:01:57 105 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 200 APPENDIX and quickly. In particular, many loops that are necessary in C or Vis- ual Basic can be replaced by just one line of code in MATLAB. It also includes extensive text-processing facilities such that it is useful as a powerful tool for parsing and analyzing texts (such as web pages). Furthermore, it has a comprehensive graphics library that enables easy plotting of many types of graphs, even animations. (Many of the figures and charts in this book are created using MATLAB.) Finally, MATLAB codes can be compiled into C or C++ executables that can run on computers without the MATLAB platform installed. In fact, there is third-party software that can convert MATLAB code into C source codes, too. The basic syntax of MATLAB is very similar to Visual Basic or C. For example, we can initialize the elements of an array x like this: x(1)=0.1; x(2)=0.3; % 3 elements of an array initialized. % This is by default a row-vector x(3)=0.2; Note that we don’t need to first “declare” this array, nor do we need to tell MATLAB its expected size beforehand. If you leave out the “;” sign, MATLAB will print out the result of the content of the variable being assigned a value. Any comments can be written after the “%” sign. If you",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "market_structure",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.611562"
}