{
  "id": "f0b9be7dd9b3",
  "source": "Volume_Price_Analysis.pdf",
  "source_type": "pdf",
  "title": "Volume Price Analysis",
  "chunk_index": 3,
  "content": "'\\ Gap up ::: Big operators sel'ling here ~ •t, open ,!,68.00 I 156700 i 'f +jl~ ,+if•• llf ,ft,, • ;;~°:! :~ 17'AO 18.20 19Jl0 19:-40 4/1 16XI 1610 1'6_60 1:i\"'_JO 1310 1,9 -50 19-30 20:10 20:60 41.2 1~30 161'0 16_00 m More weakness No selling pressure l .. i Weak response - falling volume - Weakness 1st signal 1 11 1 1111 l11llll i11 l i1 1I 11 11lli111 1 ll11 11, l11ll1 l,1111i1l1 14:Sl 15:52 1~01 ltJ6 1&.-31 Apr 13:11 l ◄ - 1 Z 1, 16 14.20 4:38 1~0S 1516 1~26 15:51 16:51.1 11,51 Fig 10.22 DJ30 - Weekly Chart Buying climax here Dow Jo nes - Weeki Ch Y art I 1..111 11 1111 llilll ll 1111 11 11 11 Ill I .. ~ 11 I I !I Ii 11 , I I I . ii I I I I .,, Chapter Eleven Fig 11.10 GBP/USD – 15m Chart Fig 11.11 GBP/USD – 1 Hour Chart GBPl.ll!I t,!15 Congestion phase - GBP/USD 15m bSll!ill Initial pivot low defines floor Pivot high Congestion phase here L577L5, Pivot low ll-iia:_il<L!>t!_1_1l1 ------------------------'1\"~~ Fig 11.12 GBP/USD – Multiple Time Frames Fig 11.13 Falling triangle – 5 Minute Chart ~ ti 1.s,ms One candle on 30 minute chart .•• i++++••··•t•+•t ~~-, ..... -. -E-.----------------------------------------; :~ ,++.t'h'=l·•===iii.l++ . ......... :;.::: : -~~11t·--;,~• •t~h1••+''' :: I 't•' Six candles here Two candles here ~ 1~- 1 J.Sto1l5 1 The falling triangle ,,sms Li~ l7S 1.SW5 l.5 UJ,'5 I I I L ~ Wh2 1IOO 31Mw2l tl 9 :N!Pd:i1'1W'O 21lM'.Wi!ltlO 1D~ i2 11',0 liCIMai!·l}ISO i\"OMkl200 Wlobr:i!!IHI 10)\"..M:!2:20 20 M.1t l21JO 20 M.WU§J 20MM2Zi5:il Xlt.-.W.2.lt.00 i!(I Mat.lD! O lD MklNCI '.2DlilM23!10 !OMM ;i!J:,10 ~M•lldll 21 M.lr«b0 Fig 11.14 Rising triangle – Daily Chart Fig 11.15 Pennant pattern – Monthly Chart Rising triangle --- -- ----- ;\"' MSIT {MoMlllr) 'lt2Q)I - 5120B .JILOO 3000 . 1111 1•1lt1 j j I i11 .♦, l ' 11,1,j ~ ;+ • • u I t• • ' • ~ I ' t tt' :: llj jl f :m 1, Higher lows ,. 00 dlllillliM 05 J~ 06 Jul 07 Jul 02I Jut 0CJ J ul IO J lll 'I J ul t2 Jul 1'3 \"' 3000M lliOOl,I 2'DIM Fig 11.16 Triple Top – Daily Chart AUD/USD Fig 11.17 Triple Bottom – EUR/CHF Hour Chart • AUDIJSD.Oa,iy • AllOUSO,Olilv L.1&4411 ~ UMm l.11!0ll. EIJ~CHF.~ • = F.Hl :.ll\"I l,l li95 J,llSl1 1,l l9' Triple top· AUD/USD daily chart Triple bottom· EUR/CHF hour chart IJl llO IJU JO U IW Chapter Twelve Fig 12.10 Equivolume Boxes Fig 12.11 Candle V olume Chart Equivo\\uw,e \\Jo~es • pr,ce t \\ow vo\\uwae Diffe.revat wiat\\,\\ cavaa\\es ref\\ect \\I0\\0W1e t • pr,ce Wicks are. \\,ack~ Fig 12.12 Delta V olume [ Oe\\ta '10\\UW1e ] . . - • ~··· a\\-Jo'1e • • V1et -'1e . .. .. . -- = --- \\-Je\\ow My Education Programs & Other Books Anna Coulling Creator of volume price analysis … also known as… VPA Since publishing this book, I have written several others which you may also enjoy, and you can find the details on these below. In addition, I have developed two major education programs which build on the foundation methodology of volume price analysis for specific markets. The first of these is The Complete Stock Trading And Investing Program, and the second is The Complete Forex Trading Program. Both are extremely comprehensive with a vast library of videos, podcasts, and online PDFs, along with a full package of trading indicators, many of which are volume based. You can find all the details for both programs at https://quantumtradingeducation.com and I hope to see you in the VPA traders room hosted by myself and my husband David, which is exclusively for students on either program. My Other Books Stock Trading & Investing Using Volume Price Analysis If you enjoyed reading A Complete Guide To Volume Price Analysis, then you'll love this one too, which is the perfect companion book, and one I wrote following hundreds of emails asking for a follow up to the first. Stock Trading & Investing Using V olume Price Analysis, takes the VPA principles and builds into a comprehensive workbook of over 200 examples. The examples presented are drawn primarily from US stock markets, but also include others from the futures markets such as indices, commodities, currency futures and bonds. Each chart is fully annotated to illustrate and highlight key points in the associated text, and together provide a detailed and comprehensive study of the volume price relationship, giving clear signals as to where the stock is going next. Find it on my site at https://annacoulling.com Forex For Beginners As a trader and investor with over twenty five years of experience, I wrote Forex For Beginners with one clear objective in mind. To provide a clear, detailed and unequivocal guide to this market and how to trade it. The marketing hype that embraces the forex world has two very simple messages. First, it's easy to get started and second, it's easy to make money with little effort. The first of these statements is certainly true. The second is not. Forex is a complex market that sits at the heart of all the financial markets, and to succeed requires a deeper understanding than would first appear. This is why so many struggle and ultimately fail. From the many five star reviews on Amazon, it seems I have achieved my goal in providing new and novice forex traders with a foundation course for trading forex and on which to build. Find it on my site at https://annacoulling.com ANNA COULLING STOCK TRADING & INVESTING USING VOLUME PRICE ANALYSIS OVER 200 WORKED EXAMPLES ANNA COULLING Forex Trading Using Volume Price Analysis And if you are trading forex, either in the spot market or in futures, then this is the companion book for you. Once again it's packed with worked examples in all timeframes from the slowest to the fastest. so whether you are an intraday speculative trader on the",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "market_structure",
    "crypto",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:54.747812"
}