{
  "id": "c3031fc8e961",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 22,
  "content": "One of the most important of these is three pushes , which appears on a price chart as three drives to a new high or low after a somewhat extended trend. The pushes are usually symmetrical in time (meaning that they are more or less evenly spaced horizontally on the chart) and in price. In the best examples, the third push breaks a trend line drawn across pushes one and two, indicating a short-term climax on a lower time frame. The three pushes that make up this pattern are also usually spaced more closely than most of the other highs in the trend, indicating that the pace of trading activity (not necessarily volume) has accelerated. For instance, if a market has been making new highs on the trend every 15 bars, the three pushes pattern might occur with highs spaced ﬁve bars apart. This is only a guideline, but the more frequent drives to new highs suggest a certain franticness on the part of buyers. Figure 3.13 shows a classic example of this pattern, which ended a trend in Wheat futures in early 2011. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 64 MARKET STRUCTURE FIGURE 3.13 Daily Wheat Futures, Showing Three Drives to End a Trend If you have not seen this pattern before, you are probably thinking that it sounds very strange. What is magical about three pushes? Why not four or ﬁve? To be sure, nothing works all the time, but this pattern is reliable enough that it demands attention when it occurs. As with all other potential trend termination patterns, it may not justify a countertrend position, but it should at least be a warning to tighten stops and perhaps to reduce exposure in the direction of the prevailing trend. At the very least, do not greatly increase risk into the next pullback, because that pullback now has a higher probability of failure. As with all patterns, you should be asking, “Why should this pattern exist? What makes it work?” In this case, it is most likely an outgrowth of the fundamental impulse/ retracement/impulse pattern that drives all trends. Figure 3.14 shows a schematic of the pattern, which also breaks out the three-legged structure that might not be obvious at ﬁrst glance. This is an important pattern to commit to memory; it occurs in all markets and on all time frames, and is subtle enough that many market participants miss it when it happens. @W - Daily Wheat C 1 · on nuous Contract [Jul11) 736 Oct '11 26 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 65 Note the small, but complete, impulse/retracement/impulse creating crests #2 and #3. Three symmetrical pushes FIGURE 3.14 Schematic of the Three Pushes Pattern Showing Underlying Structure A DEEPER LOOK AT PULLBACKS: THE QUINTESSENTIAL TREND TRADING PATTERN Imagine that you wanted to trade a trend in the most efﬁcient manner possible. If you knew the future—when and where the trend would begin and end—it would be simple: buy at the beginning of the uptrend and sell at the end; short at the beginning of a down- trend and cover at the end. Since working time machines are hard to come by, we have to ﬁnd another plan. The next best solution might be to use the pullbacks to position for the next trend leg. In other words, buy into the pullbacks in uptrends and short into the pullbacks (bounces) in downtrends. Even if we are buying in an uptrend, we would still prefer to buy at relatively low prices; using the pullbacks allows us to do this. Further- more, it is possible to monitor some of the characteristics of the developing pullbacks to get some clues as to where the trend might end. Chapter 6 demonstrates several speciﬁc patterns and plans for trading pullbacks, but let’s begin here by considering some of the important points that all pullbacks, and trades around them, have in common. Characteristics of Winning Pullbacks Pullbacks are contratrend movements, meaning that, in an uptrend, the pullbacks are actually lower time frame downtrends and, in the case of pullbacks in downtrends, the lower time frame will be in an uptrend. One important principle of market behavior is that trends that run counter to the higher time frame trend tend to be weaker and tend to abort suddenly as the higher time frame trend reasserts itself. This is useful from two per- spectives: First, trading pullbacks makes sense because they offer excellent trade loca- tions (i.e., buying relatively cheap in an uptrend or selling relatively high in a downtrend) with a good probability of success. Second, understanding this principle is important be- cause it can ﬁlter out low-probability trades—if you enter a pullback on your trading time P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 66 MARKET STRUCTURE FIGURE 3.15 Conﬂicting Information from the Daily and Weekly Chart of the U.S. Dollar Index Futures frame that is actually contratrend to the higher time frame market structure, this trade will have a much lower probability of success. An example will help to clarify this. Figure 3.15 shows what appears to be a pullback in a good uptrend on the daily U.S. Dollar Index futures chart in the left pane. This is the second pullback off a potential trend change in early November; the market has rallied to the upper Keltner channel, and has pulled back approximately to the moving average. All other things being equal, this would normally be a good potential long trade. However, a look at the weekly chart (right pane) shows that this time frame is actually in",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "risk_management",
    "fundamentals",
    "market_structure"
  ],
  "created_at": "2026-02-05T00:37:53.698545"
}