{
  "id": "13a2d2c67f39",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 193,
  "content": "P (an upward move) or eavvt . P (a downward move) where P is the current price of the contract. Example: With an underlying contract at 84.00 and an annual volatility of 16%, a one and two standard deviation price change over a three-month period (t = .25) is: e-16V.25 . 84.00 = e165. 84.00 = 28. 84.00 = 1.0833 - 84.00 = 91.00 (up 1 standard deviation) The Mathematics of Option Pricing 449 e2 16.25 . 84.00 = e2-16-5. 84.00 = e!6- 84.00 = 1.1735 - 84.00 = 98.57 (up 2 standard deviations) e~ 16V-25 84.00 = e~!6-5. 84.00 = e-8. 84.00 = .9231- 84.00 = 77.54 (down 1 standard deviation) eZ 16V.25 . 84.00 = e2-165. 84.00 = e-!6. 84.00 = ,8521 - 84.00 = 71.58 (down 2 standard deviations) Given a volatility and time period we can always calculate the number of standard deviations required to reach an outcome. If we have a table of standard deviations and their associated probabilities, we can then find the probability associated with that outcome. In the case of options, we might often be interested in the probability of an option with a certain exercise price being in-themoney at expiration. The movement, in standard deviations, required for an underlying contract with price, P, to go through an exercise price, E, at expiration is given by: number of standard deviations = In(E/P) wt Example: If conditions are the same as in the last example (v=.16, P=84.00), the movement, in standard deviations, required for a 95 call to finish in-the-money three months from now is: In(95/84)/(.16-V¥.25) = In(1.1310)/.08 = .1231/.08 = +1.5383 st. devs. Checking a table of standard deviations, we find that there is approximately a 6.2% chance, or about one chance in 16, of an upward move of 1.5383 standard deviations. In the case of a stock, a slight modification is necessary because the volatility represents price movement away from the forward price. If P is the current stock price, t is the time period, r is the risk-free interest rate, and D is the amount of dividends expected over the period, the forward price of the stock, P, is: Example: Suppose interest rates are at 8%. If a certain non-dividend paying stock is trading at 38 and has an annual volatility of 27%, the movement, in standard deviations, needed fora 35 put to finish in-the-money six months (t=.5) from now is: In[35/(38-e°8 5)/(.27-V.5) = 1n(35/39.55)/.191 = ~122/.191 = —.64 standard deviations Checking a table of standard deviations, we find that there is approximately a 26% chance, or about one chance in four, of a downward move of .64 standard deviations. ¢- Appendix C + Characteristics of Volatility Spreads Appendix C 452 0 0 Buo|} yoys Buoy yoys Buoy] 0 yous 0 uopysod yoe]U09 0 Suny (sdjey) suny sdjey - - + O (od 4:1) peaids ow yous fe} sdjoy (suny) sdjoy suny + + - fe) (ones 4: ,) peaids owy Buo7 0 syuny (syny) sdjoy sdjey + - + 0 Ayyoyng Wous ) sdjay (sdje@y) syny suny - + - 0 Ayoyng Buc] poys sdjey (sdjey) syuny suny - + - 0 ejuens Yous Buo} spuny (sunu) sdjey sdjey + - + fe) a|Guens 6u07 yoys sdjoy (sdjey) syny suny - + - 0 @|PPRS WOUS Buo| suny (suny) sdjey sdjey + - + fe) appeays uo fe) sdjoyu (sdjay) suny suny - + - fe) peaids |eomea ole Ind yous sdjoy (sdjoy) suny suny - + - fe) peaids jeonJed one |eD fe) suny (suny) sdjoy sdjey + - + fe) peaidsyoeq jnd Huo} syny (suny) sdjoy sdjey + - + 0 peaidsyord ||PD uopyjsod Ajjessuei Ayyesousb Ajjessueii ehep ePyUL PEWWeDy ey9G adh, peaids yoe1jU05 SuUf} JO ANNeIOA poyjdw) uy = HuyAWepun ayy uy Fen! LEAL, len len episumMog == apisdf) oaBessed oy, (eseolsep)sseoiou; uy sAow ofuely (jeyneu eByap Ajayeu|Xoidde oq 0} pownsse ase speeds |e) speaids Apjnejoa jo sonjsiejoeieyy 31-9 einbig “* Appendix D + What’s the Right Strategy? The following chart is designed to help the reader choose the types of strategies which are most likely to be profitable given a trader’s opinion on market direction and volatility. Even though several strategies may be appropriate under the same market conditions, each strategy will have its own unique riskK/reward characteristics. The reader should refer to the text for a more detailed analysis of each strategy. The implied volatility component, whether fow, moderate, or high, is in compari- son to a trader’s own volatility forecast. If the trader believes that 15% is a reasonable forecast, but implied volatility is 13%, then implied volatility is low. If the trader believes that 20% is a reasonable forecast, but implied volatility is 24%, then implied volatility is high. If the trader’s volatility forecast is approximately the same as the implied volatility, then implied volatility is moderate. Any of the listed strategies can be done synthetically. Instead of buying (selling) a call, a trader can buy (sell) a put with the same exercise price and buy (sell) an underlying contract (synthetic long (short) call). Instead of buying (selling) a put, a trader can buy (sell) a call with the same exercise price and sell (buy) an underlying contract (synthetic long (short) put). The only scenario for which there is no appropriate strategy is one in which a trader has no opinion on either implied volatility or market direction. In such a case a disciplined trader will choose to sit on the sidelines until trading conditions become more opportune. In-the-money call butterflies and time spreads, and out-of-the-money put butterflies and time spreads, are those in which all exercise prices are lower than the current price of the underlying contract. Out-of-the-money call butterflies and time spreads, and in-the-money put butterflies and time spreads, are those in which all exercise prices are higher than the current price of the underlying contract. 453 Appendix D speaids own (1nd) [feo (WO) WLI les sarjpenng (and) eo (WL) WLO Anq ind WLY Hlesand WLo Anq eo WLY Hlesjes",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.452065"
}