{
  "id": "90ed27a06055",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 115,
  "content": "misnomer, because MPT comes from work Harry Markowitz did in the 1950s. modiﬁed MACD indicator The moving average convergence/divergence (MACD) is a standard technical indicator. This book advocates the use of a simpliﬁed, modiﬁed MACD based on 3/10/16-period moving averages. momentum divergence There are several variations of this technical tool, but most of them look for a new high or low in price (relative to its recent history) that is not ac- companied by a new high or low on a momentum indicator, such as the MACD. The assumption is that there was less conviction behind the move, so it is more likely to fail to continue. momentum move See impulse move. Monte Carlo modeling or simulation A mathematical technique, particularly useful in situations with many uncertain inputs that have many degrees of freedom or that are highly path-dependent. Monte Carlo methods essentially run multiple simulations and evaluate the results. A working understanding of these tools can help traders to bridge the gap to thinking in probabilities. motive force A term used to describe the tendency of price to move from one level to another. This appears to be offset by the resistive force. Though there are no easy appli- cations of these forces, they provide the theoretical backdrop for all technical analysis and technically motivated trading. In some sense, these two forces are the purest expres- sion of buyers’ and sellers’ intentions in the market. moving averages Tools used in technical analysis and signal processing that average values over a look-back window, called moving averages because the window moves forward with each new data point. There are many variations of moving averages used in technical analysis. 184 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing Glossary 435 multiplicative rule of probability The probability of two independent events occurring is the product of their individual probabilities. This can also be adapted for dependent events, but in this case the relevant math is: Prob(A ∩ B) = Prob(A) × Prob(B|A). next trend leg The trend leg following a consolidation. noise traders Traders who have no reason or motivation for trading, and whose in- teractions with the market are irrational and erratic, known informally as the “idiot traders.” In reality, the actions of many small traders essentially resolve into noise on most time frames, and cause slight deviations between price and value, even in efﬁcient markets. normal distribution A probability distribution that describes many events and condi- tions in the natural world. Unfortunately, it is also frequently applied to market situa- tions, with potentially disastrous results. Normal distributions rarely hold in asset prices or returns. null hypothesis In statistical hypothesis testing, the null hypothesis is the default as- sumption, usually that there is no effect or relationship in the data being examined. Note that this hypothesis can never be proven. Rather, the technique is to look for information that would contradict this hypothesis and cause it to be rejected in favor of the alterna- tive hypothesis. O%Rng A measure of where the open lies within the trading session’s range, expressed as a percentage of that range. For instance, O%Rng of 100 percent means the open is at the high of the day’s range, while 0 percent indicates the open is the low tick of that session. offer See ask. open In intraday data, the ﬁrst tick of the bar. In daily data, opens are usually set by an auction process and may not be the ﬁrst trade of the day. Also, most markets have electronic sessions that precede their ofﬁcial opens, so the instrument may have traded for many hours before the opening print. opening range A term used to describe the range price trades within a speciﬁc time following the open. Traders may use opening ranges from a few minutes to an hour. opening skew The tendency of the opening print to cluster near the high or low of the session, rather than to be somewhere in the middle. This is commonly assumed by traders to be evidence of a market inefﬁciency when in fact, it is completely explainable by the properties of random walks. optimal f An alternative to the Kelly criterion. Optimal f is another answer to the position-sizing problem. Developed by Ralph Vince, it may be more robust in some trad- ing applications than the Kelly criterion. out-of-sample testing In system development or backtesting, part of the data set is usu- ally held back for an out-of-sample test once development is complete. For instance, if you have 10 years of price data, perhaps you would do development on eight of those years and hold the last two for an out-of-sample test. Note that out-of-sample testing can be done only once; after that, the data set is contaminated and should be considered part of the sample. outliers Events that fall far outside the range of normal events. 185 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-bgloss JWBT634-Grimes May 10, 2012 11:22 Printer: Hamilton Printing 436 GLOSSARY overbought/oversold indicators A class of technical indicators that try to identify mar- kets that have moved too far in one direction and are poised for reversal. These indica- tors could provide entries for mean-reversion trades, but careful testing is needed. pairs strategies A term usually reserved for spread trades between different stocks. See spread trading. paper trading A tool sometimes used",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.713430"
}