{
  "id": "58b89a09a5eb",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 10,
  "content": "is nearly insigniﬁcant. It is also interesting to consider that most pivots on one time frame mark signiﬁcant market structures on lower time frames, but this is a complication that we will save for later. As a stand-alone concept, ﬁrst-order pivot highs and lows have limited utility; their power comes from their relationship to other pivots and their ability to deﬁne market structure. They are like a single brick in a building—not that interesting or useful by itself. Second-order pivot highs (also called intermediate-term pivots) are ﬁrst-order pivot highs that are preceded and followed by lower ﬁrst-order pivot highs; again, this structure is inverted for second-order pivot lows. In Figure 1.4, notice that these second-order pivots begin to deﬁne some more signiﬁcant structural points. It is much more likely that second-order pivots will come at important turning points, but remember that there is no predictive power because this is a pattern that is deﬁned post hoc. They always look far @S(D) • Daily Soybeans Continuous Contract [Jul11) Ocl '11 4 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing The Trader’s Edge 17 FIGURE 1.4 Second-Order Pivots (Marked with Arrows) Deﬁne More Important Market Structure more signiﬁcant in the middle of a chart than they do on the right edge. It is also worth noting that there is no law that says second-order pivot highs and lows have to alternate; it is possible to have three second-order pivot highs or lows in a row. If you are going to use this concept systematically, make sure your rules plan for this situation. Predictably, this concept can be extended on many levels, but in actual practice, most of our focus is on third-order pivots, which usually mark major inﬂections (see Figure 1.5). Almost without exception, a trader who could identify these third-order pivots in advance would have nearly perfect entries on both sides of the market. This cannot be done, but it does point out that these third-order pivots delineate the mar- ket structure very clearly. It is worth your time to train your eye to see these pivots quickly; the value in this structure is in providing context for the market’s movements. Once you understand the basic ideas behind this concept, it is probably a good idea to not be too rigid with these structures and deﬁnitions. If you see something on a chart that is fulﬁlling the basic role of one of these structures but for one reason or another does not exactly ﬁt the criteria, it often makes sense to bend the rules for that case. The goal is to deﬁne meaningful market structure, not to blindly follow a set of rules. @S(D) - Daily Soybeans Continuous Contract [Jul11] t 1,152 1,088 Oct '11 5 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing 18 THE FOUNDATION OF TECHNICAL ANALYSIS FIGURE 1.5 Third-Order Pivots Usually Deﬁne the Most Important Market Structure on Any Time Frame It also should be obvious that this is a backward-looking analytical method. This is a problem with all swing or wave methods: they offer fantastic explanations of past mar- ket action, but have little or no predictive power at the right edge. This pivot structure is not intended to be a trading methodology; it is context. For instance, a sharp down move might be interpreted differently if it comes at a point where the market had been mak- ing consistently higher second-order pivot highs and lows compared to an environment where they were more randomly distributed. As another example, a movement that pen- etrates a signiﬁcant third-order pivot high or low can sometimes signiﬁcantly change the market environment. The purpose of this tool is to provide that structure and context, not actual trade entries. Length of Swing Once we have deﬁned the second- or third-order pivot structure of the market, we can connect the pivot highs and lows with lines to outline the swing structure of the market. (In the spots where highs and lows do not alternate, take the lowest low of the series @S(D) - Daily Soybeans Continuous Contract [Jul11] 1,472 1,088 Oct ·11 6 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing The Trader’s Edge 19 or the highest high of the series as the anchor point.) If this type of analysis is new to you, it is probably a good idea to draw the structure on a few hundred charts until it becomes somewhat intuitive; eventually you want to be able to glance at a chart and see this structure immediately. Like everything else, it gets easier only with continued practice and familiarity. It is impossible to overstate the importance of this skill. Once the individual swings are delineated, we can start to consider what the market structure actually tells us about the balance of buying and selling pressure in the market. The core concepts are simple: r When buyers are stronger than sellers, upswings will be longer, both in price and",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.696493"
}