{
  "id": "6130a27612e1",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 36,
  "content": "2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 242T RADE MINDFULLY Exercise 10.1 Factors That Affect My Focus My Personal Examples Factors Example 1 Example 2 Example 3 Example 4 Market and performance situations Dull, narrow range days. It is hard to sit and do nothing. I check e‐mail or surf the web and wind up missing trades. Often, I look at markets I don’t trade to see if one is moving. I am anxious to get in. I usuall y don’t trade that well. Location of my thoughts in past or future I am looking for the big win. I see trades running much farther than they usually do. I can a lmost see it in my mind, so it seems real, but it’s a future projection, not reality. People, places, and things In chat rooms I want to show others that I’m a good trader. This can keep me from closing a trade when I should. I don’t want to have a losing trade in front of my friends. what we need to be focused on. There are a lot of trading situations that can trigger distractions. Even positive tradin g situations can challen g e our focus. Some traders, for example, fi nd maintainin g focus diffi cult when in a profi table trade as their at - te n t i o n ca n b e dr a wn in to a n in te rn a l d e b ate a b out wh et h e r o r n ot to c l ose t h e t r a d e rather than keepin g their concentration on how price is movin g . Market conditions can also aff ect our focus. Narrow ran g e tradin g often sees traders surfi n g the net ou t of boredom and missing the moment when the market breaks out of its range‐bound activity into a trendin g move. Hi g h volatility can also aff ect focus. W e see over and over that news and scheduled reports trigger high volatility , excessive movement, and hi g h tradin g activity . Many traders lose focus in these situations. T h e l ocation o f our t h oug h ts an d f ee l ings is anot h er aspect o f d istraction. It is a l- ways h ow we perceive a situation t h at wi ll d etermine h ow we respon d . W e measure our perception b y w h at we te ll ourse l ves a b out it an d h ow we f ee l . A straig h t f orwar d way to trac k our t h oug h ts an d f ee l ings is b y recognizing w h et h er t h ey are in t h e past, in t h e f uture, or f ocuse d on t h e present. I f we are stuc k in t h e past—per h aps a l oss or even t h e l ast mar k et movement, we are missing w h at is h appening now . T h oug h ts an d t h eir associate d f ee l ings a b out t h e past are a d istraction to soun d tra d ing per f or - mance d uring tra d ing. T h e same is true f or projections a b out t h e f uture. A tra d er may 245THE TRADING PSYCHOLOGY PROCESS: EFFECTIVE EXECUTION Sometimes distractions, and especially our mental chatter, make it diffi cult to refocus. W e need to do more. This brings us to poise . ■Poise W e use t h e d e fi nition o f poise f rom sport an d h uman per f ormance psyc h o l ogists Fran k Gar d ner an d Ze ll a Moore: t h e tra d er ’s a b i l ity to act in accor d ance wit h t h eir g oals and values, despite unpleasant feelin g s, thou g hts, and sensations. In other wor d s, to d o w h at matters most f or t h e tra d e an d f or yourse lf as a tra d er, even t h oug h emotions an d b o d i l y sensations may b e uncom f orta bl e an d your min d is te ll- ing you to d o ot h erwise. T h e i ll ustration t h at comes easiest to min d is t h e experi- ence of loss aversion while in a winnin g trade. The trade is in profi t and you know i t h as more to run, b ut your min d an d b o d y are f ear f u l o f a l oss an d are urging you to exit t h e tra d e wit h a sma ll pro fi t. Ex h i b iting poise, t h e tra d er in t h is situation wou ld acknowled g e the uncomfortable thou g hts and feelin g s and act in the service of the trade (and himself as a trader) by remembering that his internal state is fl eeting and not a refl ection of reality , and what matters is to be consistent in his execution and hold the trade to the planned exit. Another way to think about poise is composure. W e want to remain composed when in the heat of tradin g and not allow the mental and emotional chatter that natu- rally emer",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:45.721898"
}