{
  "id": "270d9f19e94a",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 173,
  "content": "Andrew, “Bond Pricing and the Term Structure of Interest Rates: A New Methodology,” Econometrica, Vol. 60, 1992, pages 77-105. 394 Chapter 18 TRADING IS CONTINUOUS A theoretician trying to develop a realistic price distribution for use in a theoretical pricing model might first ask how the prices of an underlying contract change over time. Perhaps not all contracts change prices in the same way. Price changes might, for example, follow a diffusion process (see Figure 18-3). In a diffusion process there are smooth and continuous changes from one price to the next, with no gaps between consecutive prices. Moreover, the longer the period of time between price readings, the greater the dispersion in prices. An example of a typical diffusion process might be the temperature readings in a specific location. While the temperature can change very quickly, there will never be any gaps. If the temperature at one moment is 15° but at a later time is 18°, then at some intermediate time, even if only very briefly, the temperature must have also been 16° and 17°. And there is likely to be a greater temperature change over six weeks than over six days. Prices might also follow a jump process. In a strict jump process, the price of a contract remains constant for a period of time, then instantaneously jumps to a new price, where it again remains constant for some period of time. The way in which central banks set interest rates is typical of a jump process. In the United States, when the Federal Reserve sets the discount rate, it remains there until it is fixed at a new rate. It remains at this new rate until the Federal Reserve again announces a change in the discount rate. A jump process is a combination of fixed prices and instantaneous jumps. Most theoretical pricing models assume that trading in the underlying contract follows a diffusion process. Trading is assumed to be continuous, proceeding 24 hours per day, seven days per week, without interruption. There can be no gaps in the price of the underlying contract. If a contract trades at 46.05, and at some later time trades at 46.08, then at some intermediate time it must have also traded, even if only briefly, at 46.06 and 46.07. If one were to draw a graph of price changes under a diffusion process, one would never lift the pencil from the paper. A diffusion process is a convenient, but clearly inexact, approximation of how prices change in the real world. Exchange-traded contracts cannot follow a pure diffusion process because exchanges are not open 24 hours per day. At the end of the trading day a contract often closes at one price, and then opens the next day ata different price. This causes a price gap, something which a diffusion process does not permit. Even during normal trading hours prices may not follow a diffusion process. If major news hits the market, the impact can be almost instantaneous, causing prices to gap up or down. If a theoretical pricing model makes the assumption that prices follow a diffusion process, when in fact they don’t, how is this likely to affect values generated by the model? Consider a situation where an underlying futures contract is trading at 100 and a trader feels that implied volatility in the option market is much too high. Because all options are overpriced, the trader decides to sell the 100 straddle. Unfortunately, immediately after he sells the straddle the market gaps up to 105. How will the gap affect the trader’s position? 395 Models and the Real World ssa00i/g uorsnyig-duinr | i sseo0ldg dune sseo0Jq UoIsnyId €-81 einbi4 396 Chapter 18 A trader who is short straddles does not want to see a gap in the market. The fact that a gap has occurred will hurt the trader, but will it cause him only minor pain, or will it destroy him? If the options are relatively long-term, say nine months, the gap in the underlying price is unlikely to be the end of the world. After all, with nine months remaining to expiration the underlying market could easily fall back to 100. And while the gap has clearly hurt the trader, it is probably not disastrous.® But if the gap occurs with only a very short time remaining to expiration, say one day, the trader is now ina situation where he might very well be ruined. With only one day to expiration, there is simply not enough time for the market to retrace its movement. The 100 calls which the trader sold as part of his short straddle will act like short futures contracts. While the spread began approximately delta neutral, after the gap the trader will find himself naked short deeply in-the-money calls, each with a delta of 100, in a market which has just made a giant leap upward. Figure 18-4 shows how prices might change with nine months versus one day remaining to expiration. With nine months remaining to expiration the 100 straddle increased in value by approximately 7% (14.04/13.18 = 1.07). But with one day remaining to expiration the 100 straddle increased in value by 495% (5.00/.84 = 5.95). The gap was painful with nine months to expiration, but it was devastating with one day to expiration. The reason that the gap caused such a dramatic change in the one-day straddle was that the delta of the 100 straddle was much more sensitive to a change in the price of the underlying contract. With nine months to expiration the 100 call and put have a gamma of only 2.2. But with one day to expiration they have a gamma of 38.1. In the latter situation, with such a high negative gamma, any movement will undoubtedly be very painful. The trader could reduce some of the damage if he were able to adjust the position by purchasing futures as the market moved upward. But a gap is an instanta- neous move; there is no",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.448867"
}