{
  "id": "8cf7f06255c0",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 10,
  "content": "that the trade wasn’t working anymore, and I haven’t bought Bitcoin since then. Were there any other trading themes that were important in recent years? Yes, trading on CPI release days. For context, two years ago, on a day when the CPI price index was released, the one-day S&P straddle would trade at 20 to 25 points. The CPI simply didn’t move the market. During the second half of 2022, the same straddle would trade around 70–75 points on days when the CPI was released. If the one-day straddle in a market is three times the price it was two years ago, and you have an automated way to get into that market, you can probably do pretty well because the market is going to be very responsive to that CPI number. 35 Are you anticipating what the CPI will be, or are you responding to the number after it is released? I create both bullish and bearish scenarios around what the CPI could be. Which markets were you trading on that CPI release? All of them: currencies, fixed income, equity indexes, and precious metals. How are you determining what CPI levels translate to what market levels? I’m aware of what the general market expectations are. You need to understand what the narrative is: which result hurts the market, and which result helps the market; what number will give you a protracted rally, and what number will give you a big selloff. So, you create scenarios for each possible level of the CPI reported, and then your software automatically executes the trade when the number is released. Yes, exactly. 36 stock traders part 37 Jeffrey Neumann Penny Wise, Dollar Wise Three years later So, you’ve had quite a ride in the last few years. It was wild. The last time we spoke, I believe you had quintupled your career winnings from what they were at the time of our original interview. Actually, it was more than that. That’s incredible. What were some of the trades behind these phenomenal gains? I watch the news for a living. It all began when I saw the initial reports of a coronavirus outbreak in China. I went to a CVS to buy some masks and couldn’t find any. When I asked for them, the clerk laughed at me and said, “We don’t have any, and we’re not going to get any.” Then I went to a Walgreens, and they said, “We might have them in a few months, but you can keep checking every day.” I had traded through swine flu and bird flu and was familiar with the type of market plays these situations provided. I went home and bought a large stake in Alpha Pro Tech (symbol: APT), a small-cap mask maker. I smashed it. The stock went ballistic, shooting up from $4 to $40 in 10 days. That trade started it all. The next big play came when my son wanted to deliver a package to the neighbors using a drone. There was only one pure-play, publicly traded drone company, a small cap trading at around 50 cents. I bought it, and in about 10 days, it went to $5. 38 I never traded the dot-com bubble, but I felt like this was my dot-com moment. Robin Hood and free trading, everyone being home, stimulus checks, and WallStreetBets building its swagger all coincided, and it was game on. I couldn’t have made more trades in a day. I was working 10- hour days, building on a 20-year skill set in a once-in-a-generation moment. Every day, it felt like I was a step ahead of everyone else, and I was. I monitored my volume scanner to focus on the right sectors. Is looking for volume surges one of the main elements in your trading approach? It is. I have a customized scanner at the bottom of my screen where I can select my tickers and my volume size requirements. There has to be a large enough volume increase in a stock on my scanner to trigger a signal. I sit there all day and watch the order flow to see which sector is getting lit up and then join in. Were you then getting some of your trade ideas from WallStreetBets? [WallStreetBets is a forum on Reddit (a “subreddit”) whose participants focus on trading-related posts. It became famous when its members piled into stocks cited as heavily shorted, such as GameStop, sparking soaring prices and historic short squeezes.] I used this neat Reddit crawling tool, which indicated the frequency of specific stock posts on WallStreetBets. Of course, Tesla was frequently number one, and GameStop was number one for a while. I focused on stocks that went on the top-25 list. If a stock went from 25 to the top 10, the price would go parabolic. So, I was watching the trends of the stocks on this list, checking it every minute. The power that group of people had on the market was ridiculous; they could move any stock they wanted for any reason. Although I did very well on these trades, I missed the biggest one. I had a ton of GameStop at $10 but sold it at $11. And then, it went to $500. I never traded it again. I don’t know why I sold it so early, but I reacted by unleashing on every other stock that was moving on WallStreetBets. Of course, none of them had the success of GameStop, but many had 5× to 10× moves. 39 How did you know when to bail out of these trades, as they were stocks that were being pushed far beyond any fundamentally justified price levels by speculative buying? Getting out is by far the worst aspect of my trading. I consider myself a poor seller of stocks. I take large positions, and when a stock has doubled or tripled, and the risk/reward has changed, I start scaling out of my position. Once I start selling a position, I just can’t",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "crypto"
  ],
  "created_at": "2026-02-05T00:37:44.179735"
}