{
  "id": "35bec0eb6920",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 31,
  "content": "this magnitude even once. What conclusions can be drawn from this?4 One thing is certain: these five price changes are not consistent with 30% volatility. The trader might explain the discrepancy in one of two ways. On the one hand, perhaps this was expected to be an abnormally quiet week (perhaps it was a holiday week); and next week when trading returns to normal the market will go right back to making moves which are more consistent with a 30% volatility. If the trader comes to this conclusion, perhaps he ought to continue to use a 30% volatility for his calculations. On the other hand, perhaps there is no apparent reason for the market being less volatile than predicted by a 30% volatility. He may simply be using the wrong volatility. If the trader comes to this conclusion, perhaps he Ought to consider using a new volatility input which is more consistent with the observed price changes. If he continues to use a 30% volatility in the face of price changes which are significantly less than predicted by that number, he will be assigning the wrong probabilities to the possible price outcomes for the underlying contract. Consequently, he will generate incorrect theoretical values, defeating the purpose of using a theoretical pricing model in the first place. Exactly what volatility is associated with the five price changes in the foregoing example? Without some rather involved calculations it is difficult to say. (The answer is actually 18.8%.) However, if a trader has some idea beforehand of what price changes he expects, he can easily see that the changes over the five-day period are not consistent With a 30% volatility. 4. Five days is admittedly a very small sample from which to draw a meaningful conclusion about volatility. The method and reasoning, however, are still valld. 68 Chapter 4 Let’s look at another example. Now the underlying contract is trading at 33214 and a trader notes the following five daily price changes: -5, +242, +1, -7%4, -4% Are these price changes consistent with an 18% volatility? At 18% a one standard deviation price change is approximately 18%/16 x 332!4 = 334. Over five days we expect to see a price change of more than 35/4 between one and two times. Yet here we have a price change of more than 394 three days out of five. And once the price change was 7°94 (more than two standard deviations) which we expect to see only one day in twenty. Again, unless the trader believes that the five price changes occurred during an extraordinary week, then perhaps he ought to consider changing his volatility figure so that it is more consistent with the observed price changes. A NOTE ON INTEREST RATE PRODUCTS Suppose Eurodollars are at 93.00 and we assume a volatility of 16 percent. We can apply the method previously described to calculate an approximate one standard deviation daily price change: 16%/16 x 93.00 = .93. As any trader familiar with the Eurodollar market will attest, a daily price change of .93 is wildly unlikely. How can we account for this seemingly illogical answer? One might conclude that we simply have the wrong volatility, and some lower number is more accurate. In fact, the 16% volatility is not at all unusual for Eurodollars, so the explanation must lie elsewhere. Eurodollars, like many other interest rate contracts (U.S. Treasury Bills, Short Sterling, Euromarks, Euroyen) are indexed from 100. This means that the interest rate associated with a Eurodollar contract is 100 less the value of the contract. It also means that, barring the unlikely advent of negative interest rates, the contract cannot take on a value greater than 100. In this respect, 100 acts as a limiting value for Eurodollars in the same way that zero acts as a limiting value for traditional underlying contracts such as stocks and commodities. We can integrate this characteristic into our calculations by assuming that the value of a Eurodollar contract is actually 100 less its listed price. If the listed price is 93.00, for theoretical evaluation purposes we must use a value of 100 — 93.00, or 7.00, in our pricing model. If we define the value of the contract as 7.00, a one standard deviation price change is 16%/16 x 7.00 = .07. This is certainly a more realistic result than .93. To be consistent, if we index Eurodollar prices from 100 we must also index exercise prices from 100. Therefore, a 93.50 exercise price in our pricing model is really a 6.50 (100 ~ 93.50) exercise price. This also requires us to reverse the type of option, changing calls to puts and puts to calls. To see why, consider a 93.50 call. For this call to go into-the-money, the underlying contract must rise above 93.50. But this requires that interest rates fall below 6.50 percent. Therefore, a 93.50 call in listed terms is the same as a 6.50 put in interest rate terms. A model which is correctly set up to evaluate options on Eurodollar or other types of indexed interest rate contracts automatically makes this transformation. The price of the underlying contract and the exercise price Volatility 69 are subtracted from 100, while listed calls are treated as puts and listed puts are treated as calls. Note that this type of transformation is not required for most bonds and notes. Depending on the coupon rate, the prices of these products may range freely without upper limit, often exceeding 100. They are therefore most often evaluated using a traditional pricing model, although interest rate products present other problems that may require specialized pricing models. It is possible to take an instrument such as a bond and calculate the current yield based on its price in the marketplace. If we were to take a series of prices and from these calculate a series of yields, we could also calculate the yield volatility, i.e., the volatility based on the change in yield. We might then use this number",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.427083"
}