{
  "id": "4e7ef519b287",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 32,
  "content": "that high-value mental skill. Less consis - tency su gg ests you have some work to do in that area. The idea is to measure where y ou are in each of these mental domains. For each of the next three chapters, y ou are provided with a set of questions you can use to assess yourself in each of these important areas. These self‐assessment tools come at the end of each chapter. Keep in mind we are evaluatin g ourselves in terms of mental and psycholo g ical skills spe - cifi cally relevant to the mental side of trading and the trading process. The credit for this framework belon g s to Charles Maher, sport psycholo g ist for the Cleveland Indians Major Lea g ue Baseball team and professor emeritus at Rut g ers TABLE 9.1 High-Value Mental Skills of the Performance Psychology Time Frames VV Before During After Psyc h o l ogica l Time Fram e Hig h ‐Qua l ity P reparatio n Effect iv e Ex ecut i o n C onstructive Se lf ‐ Assess m e n t High‐Value Mental Domai n P ers p ectiv e Pe r so n a l Aw a r e n ess S elf‐Motivation M ental Disci p lin e Self‐Confidenc e E motional Intensit y Focus Po i se S elf‐Estee m P erformance Accountabilit y Pe r se v e r a n ce C ontinuous Im p rovemen t - - - - ~---------- 37 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 213THE TRADING PSYCHOLOGY PROCESS: HIGH-QUALITY PREPARATION in tra d in g , we can eva l uate our actions b y h ow we ll t h ey h o ld up to an d h armonize wit h our va l ues an d mission. T h ose actions t h at are not in sync wit h our va l ues can b e d roppe d or c h an g e d . T r a d in g is not t h e on l y important commitment in our l ives. Attention nee d s to be paid to other important roles, too. Bein g clear on those roles, what you wan t from them and how they brin g meanin g to your life will help you do this effi ciently and e ff ectively . It also helps avoid one role having a distracting or otherwise nega - tive in fl uence on ot h er areas o f our l i f e. It is a part o f overa ll b a l ance a ll tra d ers need. True clarity on why you do certain thin g s, why it is important to you, and h ow it fi ts wit h t h e rest o f your l i f e is one o f t h e ingre d ients f or h ig h ac h ievement. T h is perspective is an important Before activity f or t h ose w h o want to exce l : see Exercise 9 .1. Exercise 9.1 will help you to clarify your roles and sharpen your perspective. This f orm provi d es a f ormat f or you to i d enti f y important ro l es in your l i f e, w h at matters to you in that role, and HV As associated with that role which you want to devote attention and eff ort to in order to maximize your experience in that role and to g e t what matters to you from that role. T wo examples are provided. Begin by identifying all the important roles you have in your life. Under the column What’s Important to M e list two to four thin g s that you value or that matter to you in that role. Under HVAs , Exercise 9.1 Important Roles in My Life Role What’s Important to Me High-Value ActionsVV Example 1: Father Being a good role model and creating a loving family environment for my daughter and son Actively showing interest in their lives (e.g., attending school plays and sporting events they are in); be a good listener and provide appropriate guidance Example 2: Friend Connecting with others in a meaningful way; have a strong social network Be available for friends when needed; pitch in and help organize and participate in social activities 217THE TRADING PSYCHOLOGY PROCESS: HIGH-QUALITY PREPARATION h is limitation, and traded only during the morning sessions. Even though h e traded less, Emil’s overall profi tabilit y increased substantiall y . Assessing one’s strengths and limitations can often reveal insightful information as in Emil’s case. Another trader who conducted this self‐assessment immediatel y rec - o g nized that he is easily enticed by other tradin g methods even thou g h he had a g ood knowledge of what works in the markets for him. Viewing this as a shortcoming to avoid, he applied the mindfulness skill of mental parkin g to remain focused on wha t was productive and to sta y awa y from other new indicators and methods as the y were essentially a distraction. Use Exercise 9.2 to assess your personal stren g ths and limitations. When assessin g your strengths and limitations, write down trading related mental and technical skills and abilities that you do well and thin g s that need work. Under mental skills and abili - ties, consider your mindfulness skills and abilities at mental parkin g . Also consider how well you can hold a trade to its logical conclusion. Can you stick",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology"
  ],
  "created_at": "2026-02-05T00:37:45.721351"
}