{
  "id": "f869891e8472",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 51,
  "content": "the losses goes, but there are two other points to consider: First, trades should be sized so that every loss is equivalent; there is no such thing as a “low risk” trade. (Some types of CAT D ·1y - a, Caterp'lla ' r Inc 50.00- 48.00- 46.00- A 44.00- Oct 71 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing 158 TRADING STRATEGIES trades may be traded with different levels of risk, but, even then, risk levels should be consistent for all trades of that type.) Second, and more importantly, very close stops have a higher probability of being hit. When the probability of the loss is considered, a very tight stop often is a much larger loss in terms of expected value than a farther stop. My preference is to put stops farther away from the pattern, and to introduce a small random “jitter” element to stop placement. One common mistake is to put your stop where everyone else puts theirs, because markets tend to seek out those stop levels. If you put yours a few ticks or cents beyond the obvious levels, you may still be swept out if there is extra volatility beyond the level, but this is an unavoidable risk of trading. The best we can do is to minimize it with intelligent stop placement. Figures 6.5 and 6.6 show several pullback trades with both near and far stop levels marked; realize that these are well-chosen examples of perfect entries, and perfect entries will rarely occur in actual trading. Again, these are only guidelines, and active management is important. Stops may be tightened dramatically a few bars into the trade, and the trade may also be managed with a time stop. FIGURE 6.5 Three Idealized Pullback Entries in the EURGBP (One Long and Two Short) with Near and Far Stop Levels 72 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing Practical Trading Templates 159 FIGURE 6.6 Three Pullback Entries in Sugar Futures with Near and Far Stop Levels Proﬁt Target The most conservative proﬁt target is at the previous pivot high of the setup leg for long traders, or at the low of the setup leg for shorts. (See Figure 6.7.) Many traders who focus on pullbacks will bid or offer (for short or long trades) part of their positions at the level, and are prepared to exit more of the position if the market runs into trouble there. These levels are often cleared easily, but there can be considerable volatility as some traders exit positions and others look to enter on breakouts beyond the level. The difference of opinion and two-sided trading in these spots can lead to unusual activity, but the strongest trends will continue past this level, extending into another leg. A good exit plan will allow for the possibility of taking partial proﬁts while holding on to part of the position for a possible extension into further trend legs. Another common target is the measured move objective (MMO) , which is calculated by taking the length of the setup leg (AB in Figure 6.8), adding that number to the pivot point marked C, and expecting the CD leg to be approximately the same length as the AB leg. There is no magic to this method. There is no mystical force at work here; the operative concept is that markets tend to trade with a fairly consistent level of volatility, and the MMO simply targets the approximate level at which we could expect the next @SB- Daily Sugar No. 11 Continuous Contract [Jul11] 20.00, 18.00- 16.00, 14.00, 12.00, 10.00, 8.00 ~ 1.40 0 r'-- . . ~ -~ ----.. r:::::::)., ... , .... ,·•••· •••• ' •, 0.60 ~ ... ,,?Q ~ 9 ~ - 0.20 Jun Jul Aug Sep Oct 73 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c06 JWBT634-Grimes May 10, 2012 7:38 Printer: Hamilton Printing 160 TRADING STRATEGIES FIGURE 6.7 Three Idealized Entries in U.S. Steel Corporation (NYSE: X) with Conservative Proﬁt Targets Marked swing to terminate based on the prevailing volatility levels and the average swing sizes of the market. Rather than treating this as an exact level, consider it a zone and give some consideration to what the correct course of action would be if the market stalls some- where near this area. In general, the correct plan would be to take partial or complete proﬁts even though the trade had not quite reached the target. Last, it is also possible to manage pullback trades using risk multiples as proﬁt tar- gets, for instance, taking partial proﬁts at one or two times (1 × or 2×) the initial risk on the trade. This is a solid plan, but it probably also makes sense to incorporate infor- mation from the conservative and MMO proﬁt targets, as they are based on the reality of market structure and volatility-driven relationships. For instance, if the ﬁrst 1 × risk proﬁt target is a little beyond the conservative previous swing target, it",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:53.703347"
}