{
  "id": "63d07aa8c0d9",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 62,
  "content": "a scanning tool or as a cue for the developing discretionary trader. The concept is that the moving average’s slope can give conﬁrmation of trend direction, with the time frame of the trend roughly corresponding to the time frame of the moving average. Longer-term (100-period or more) moving averages will address longer-term trends, while very short-term (less than 10-period) moving averages will give indications for the shortest intervals on the chart. An important point is that an attentive trader will almost always be able to identify inﬂection points based on price structure long before P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 195 FIGURE 7.5 Though the Slope of the Moving Average Does Capture the Trend, the Trend Change Is Visible in Price Structure First the moving average changes slope, as in Figure 7.5. It is probably a bad idea to ﬁlter trades based on this criterion—for instance, taking long trades only when the average slopes up—because the lag effect will cause you to miss many good trades at the beginning, but you will be green-lighted to take all the losers at the end of a trend. Focus on learning to read the price structure, but the slope of a moving average can be a useful aid, especially when scanning many charts rapidly. CHANNELS: EMOTIONAL EXTREMES A moving average may give some idea of consensus, value, and relative rest. Properly drawn channels deﬁne excursions from that area of consensus and may give some insight into where the crowd’s emotional extremes lie. In most applications, this is the one and only purpose of channels: to deﬁne meaningful extensions. In order to do this well and consistently, the channels must be able to ﬂex and to adapt to the changing volatility conditions of the underlying market. It should be obvious, but channels do not provide any kind of actual barrier to prices. The idea of buying at a band or selling at a band, with a few exceptions in highly mean-reverting instruments, is conceptually ﬂawed. A better way for discretionary traders to use bands is to look for touches of or excursions outside @KC-Daly Coffee C Conmuous Contract [Jul11) Jul Oct '11 '10 Apr Jul ~ Moving Average Tums 180.00 170.00 160.00 22.00 14.00 12.00 10.00 8.00 89 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing Tools for Conﬁrmation 197 FIGURE 7.6 Bollinger Bands on Weekly Wheat: Notice How Bands Expand and Contract Very Quickly FIGURE 7.7 By Comparison, Keltner Channels on Wheat Futures Are Much More Stable @W.C- weekly Wheat Conmuous Conlraci (JuN 1) Co\"1)0ske 1,664 1,536 1 , ◄08 1,280 1,152 l 1 , 02◄ '08 '09 '10 '11 @W.C. Weekly Wheat Conmuous Conlraci (Jul11J Co\"1)0ske 1,664 '08 '09 '10 '11 90 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c07 JWBT634-Grimes May 10, 2012 7:44 Printer: Hamilton Printing 198 TRADING STRATEGIES TABLE 7.1 Excursion Stats for 2.25 ATR Modiﬁed Keltner Channels Mean Min Max Large-Cap Stocks (496 stocks) Inside 87.7% 67.0% 100.0% Free bars 3.4% 0.0% 11.7% Small-Cap Stocks (500 stocks) Inside 85.4% 36.0% 96.2% Free bars 4.3% 0.2% 21.2% Futures (16 contracts) Inside 85.9% 77.8% 92.5% Free bars 3.8% 0.7% 6.4% Forex (9 pairs) Inside 89.8% 87.8% 92.0% Free bars 2.3% 1.5% 3.7% Randomly Generated Data (7 series) Inside 86.8% 85.8% 87.7% Free bars 3.8% 3.3% 4.4% “Inside” records the percentage of the total trading range that is inside the bands. “Free bars” are the percentage of all bars that are completely outside the bands. Min and Max show the lowest and highest stat for individual instruments (i.e., individual stocks, futures markets, etc.) in the sample classes. Ideas for Using Channels As with most technical tools, traders have developed many nuances and techniques for using bands or channels. Some traders use points where price engages the bands as deci- sion points, either in a quasi or a purely systematic form with other supporting factors. In some markets and time frames, some bands do show a strong enough statistical tendency to support such a plan, but other traders use them as inputs into a broad, discretionary process. Regardless, it is always helpful to know that you have a head start and are plac- ing trades aligned with an underlying tendency in the market. Fade Move Outside the Channels Some traders love to fade markets, specializing in buying weakness or shorting into strength. Bands or channels can be a vital crite- rion in such a plan. In many markets, there actually is a slight statistical edge to fading moves to the upper or lower Keltner channel, and it is possible to replicate this ten- dency with Bollinger bands if some adjustments are made. Fading makes sense only if the market is truly extended, if the rubber band is stretched and could be ready to snap back. Traders who fade markets that are in relative equilibrium will accumulate a steady stream of losses. A good rule of thumb is to not consider any fade trade unless the market is extended beyond the bands on whichever time frame you are trading. Remember, risk management is essential in this kind of trade, as the band does not present any kind of actual barrier. There is always the psychological tendency to attach too much meaning to any line on a chart; this is why traders focus on",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.705088"
}