{
  "id": "df26b062fa36",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 38,
  "content": "important factor in distinguishing between different types of ranges is what is happening with the edges of the range. Is the range contained by parallel lines, are the edges con- verging, or are they expanding? Each of these may have some subtle differences, with some effect on the expected resolution of the patterns. Parallel Ranges: The Box The simplest range is one that trades between parallel prices in a box formation; volatility is relatively constant for the duration of the range. On the lower time frame, we will see trends (it is a little-known fact that many of the best SINX _ Daily S&P 500 Index 1,220.00 1,200.00 !'! Jjj ' 1,180.00 ,200.00 1,160.00 11' ii ,' • 1,140.00 1,180.00 , 1,120.00 1,160.00 1,100.00 ' , ' ,' 1,140.00 1,080.00 111 . -- j(-... __ li,(/ 1111 1,060.00 1,120.00 1,040.00 / ' 1,020.00 1,100.00 1,000.00 980.00 1,080.00 960.00 1,060.00 940.00 Feb Mar Apr '10 Apr 58 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing On Trading Ranges 117 Drop below range just expands the range. Support is now lower. FIGURE 4.16 A Simple Parallel Range trends occur within higher time frame consolidations) that terminate in the trading time frame support and resistance. The conﬁnes of the range may be violated, but violations will usually be short-lived. It is also possible to see prices probe to a level and hold slightly beyond the range, and for the range to now trade between these expanded price levels. Do not naively assume that every break of a range will lead to an actual breakout. Many times, the range is simply expanded, as in Figure 4.16. A common variation of this box pattern is the diagonal trading range, which is a box with sloping sides. This is a very common structure as a retracement in the higher time frame trend, and, in fact, the diagonal range sloping against the higher time frame trend (see Figure 4.17) could be considered the most common pullback pattern. Again, there may be lower time frame trends within this trading time frame trading range, and there may be temporary violations of the edges of the range—do not expect perfect, clean tests. This pattern is especially important because it often deﬁnes a complex pullback. Be on guard for springs near support in larger-scale uptrends, and for upthrusts near the highs of these patterns in downtrends. These offer exceptional entries into higher time frame trends. FIGURE 4.17 A Sloping Parallel Range Is a Very Common Continuation Pattern P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing On Trading Ranges 117 Drop below range just expands the range. Support is now lower. FIGURE 4.16 A Simple Parallel Range trends occur within higher time frame consolidations) that terminate in the trading time frame support and resistance. The conﬁnes of the range may be violated, but violations will usually be short-lived. It is also possible to see prices probe to a level and hold slightly beyond the range, and for the range to now trade between these expanded price levels. Do not naively assume that every break of a range will lead to an actual breakout. Many times, the range is simply expanded, as in Figure 4.16. A common variation of this box pattern is the diagonal trading range, which is a box with sloping sides. This is a very common structure as a retracement in the higher time frame trend, and, in fact, the diagonal range sloping against the higher time frame trend (see Figure 4.17) could be considered the most common pullback pattern. Again, there may be lower time frame trends within this trading time frame trading range, and there may be temporary violations of the edges of the range—do not expect perfect, clean tests. This pattern is especially important because it often deﬁnes a complex pullback. Be on guard for springs near support in larger-scale uptrends, and for upthrusts near the highs of these patterns in downtrends. These offer exceptional entries into higher time frame trends. FIGURE 4.17 A Sloping Parallel Range Is a Very Common Continuation Pattern P1: OTA JWBT634-c04 JWBT634-Grimes May 10, 2012 7:30 Printer: Hamilton Printing 118 MARKET STRUCTURE FIGURE 4.18 A Tighter Consolidation Against Resistance Often Leads to a Break of That Resistance One ﬁnal structure to be aware of is a tight consolidation near the edge of one side of the range, as in Figure 4.18. Remember, if the edges of the range are going to hold as support or resistance, the pattern we expect to see is price rejection near the level. If, instead, prices are able to consolidate and hold near one side of the range, this is more indicative of pressure building against that side of the range. This is a classic precursor of breakout, and many chartists would read this as a smaller range inside a bigger range, a not incorrect deﬁnition. Furthermore, this pattern is also the basis for the classic cup and handle chart pattern, but reading the simple dynamics of emerging market structure will usually give a better read on the market than any chart pattern. Converging Ranges Trading ranges are periods of relative consensus, where the market tends to trade around a price level in equilibrium. One common variation of the trading range idea sees the market making successively smaller swings, as if zeroing in on a target price level. The edges of this range appear to converge at some point in the future, and this pattern often appears to be a triangle on price charts, as in Figure 4.19. Traditionally, the assumption is that these triangles set up good breakout trades, and there are many",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options"
  ],
  "created_at": "2026-02-05T00:37:53.701310"
}