{
  "id": "11e1f39224dc",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 38,
  "content": "# # Residuals: # Min 1Q Median 3Q Max # -4.7552 -0.0694 -0.0059 0.0576 4.5976 # # Coefficients: # Estimate Std. Error t value Pr(>|t|) # (Intercept) 0.0060546 0.0071439 0.848 0.397 # L(y, 1) -0.0011457 0.0005148 -2.226 0.161 # L(d(y), 1) 0.0518074 0.0102210 5.069 4.1e-07 *** Chan800064_c07.indd 158 6/7/2021 7:16:57 AM 81 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 159 Stationarity is not limited to the spread between stocks: it can also be found in certain currency rates. For example, the Canadian dollar/Australian dollar (CAD/AUD) cross-currency rate is quite stationary, both being commodities currencies. Numerous pairs of futures as well as fixed-income instruments can be found to be coin- tegrating as well. (The simplest examples of cointegrating futures pairs are calendar spreads: long and short futures contracts of the same underlying commodity but different expiration months. Simi- larly for fixed-income instruments, one can long and short bonds by the same issuer but of different maturities.) # L(X, 0) 0.5359345 0.0127566 42.012 < 2e-16 *** # L(X, 1) -0.5348523 0.0127698 -41.884 < 2e-16 *** # --- # Signif. codes: 0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1 # # Residual standard error: 0.436 on 7828 degrees of freedom # Multiple R-squared: 0.1852, Adjusted R-squared: 0.1848 # F-statistic: 593 on 3 and 7828 DF, p-value: < 2.2e-16 # determines the hedge ratio lmresult <- lm(KO ~ 0 + PEP, mydata ) hedgeRatio <- coef(lmresult) # 1.011409 z <- residuals(lmresult) # The residuals should be stationary (mean-reverting) plot(z) # This should produce a chart similar to Figure 7.3. # A test for correlation dailyReturns <- calculateReturns(cbind(adjcls1, adjcls2), 1) result <- cor.test(dailyReturns[,1], dailyReturns[,2]) result # correlation coefficient is 0.4849239, with p-value < 2.2e-16, definitely correlated! # Pearson's product-moment correlation # data: dailyReturns[, 1] and dailyReturns[, 2] # t = 49.0707, df = 7832, p-value < 2.2e-16 # alternative hypothesis: true correlation is not equal to 0 # 95 percent confidence interval: # 0.4678028 0.5016813 # sample estimates: # cor # 0.4849239 Chan800064_c07.indd 159 6/7/2021 7:16:57 AM 82 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 160 QUANTITATIVE TRADING FACTOR MODELS Financial commentators often say something like this: “The current market favors value stocks,” “The market is focusing on earnings growth,” or, “Investors are paying attention to inflation numbers.” How do we quantify these and other common drivers of returns? There is a well-known framework in quantitative finance called factor models (also known as arbitrage pricing theory [APT]) that attempts to capture the different drivers of returns such as earn- ings growth rates, interest rate, or the market capitalization of a company. These drivers are called factors. Mathematically, we can write the excess returns (returns minus risk-free rate) R of N stocks as R Xb u (7.1) where X is an N × F matrix of factor exposures (also known as fac- tor loadings), b is an F vector of factor returns, and u an N vector of specific returns. (Every one of these quantities is time dependent, but I suppress this explicit dependence for simplicity.) The terms factor exposure, factor return, and specific return are commonly used in quantitative finance, and it is well worth our effort to understand their meanings. Let’s focus on a specific category of factors called time-series factors—they are returns on specially constructed long-short port- folios called hedge portfolios, explained as follows. These factor returns are the common drivers of stock returns, and are therefore independent of a particular stock, but they do vary over time (hence, they are call time-series factors). Factor exposures are the sensitivities of a stock to each of these common drivers. Any part of a stock’s return that cannot be explained by these common factor returns is deemed a specific return (i.e., specific to a stock and essentially regarded as just ran- dom noise within the APT framework). Each stock’s specific return is assumed to be uncorrelated to another stock’s. Let’s illustrate these using a simple time-series factor model called the Fama-French Three-Factor model (Fama and French, 1992). Chan800064_c07.indd 160 6/7/2021 7:16:58 AM Special Topics in Quantitative Trading 163 also predict the excess returns, as long as the factor exposures are well chosen and therefore the time-varying specific returns are not significant. Let me clarify one point of potential confusion. Even though I stated that factor models can be useful as a predictive model (and therefore for trading) only if we assume the factor returns have momentum, it does not mean that factor models cannot capture mean reversion of stock returns. You can, in fact, construct a factor exposure that captures mean reversion, such as the negative of the previous period return. If stock returns are indeed mean reverting, then the corresponding factor return will be positive. If you are interested in building a trading model based on funda- mental factors, there are a number of vendors from whom you can obtain historical factor data: • S&P Capital IQ: spgglobal.com/marketintelligence • Compustat: www.compustat.com • MSCI: www.msci.com • Sharadar: sharadar.com (This is the most affordable source.) A very comprehensive and technical introduction to factor models can be found in Ruppert (2015). Example 7.4: Principal Component Analysis as an Example of the Factor Model The examples of factor exposures I described above are typically economic (e.g., outperformance of value stocks), fundamental (e.g., book-to-price ratio), or technical (e.g., previous period’s return). However, there is one kind of factor model that relies on nothing more than historical",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "crypto",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:43.609849"
}