{
  "id": "627ed9311b59",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 22,
  "content": "is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 150T RADE MINDF U LLY FIGURE 7.2 Ste p h Covers Her Short and the Market Falls Source: T radeStation T echnolo g ies, Inc. 400 @JY - 5 min CME 1 .0330 1 .0320 1 .0310 1 .0300 1 .0290 1 .0280 1 .0270 1 .0260 1 .0250 1 .0240 1 .0230 1 .0220 2,200 1,800 1,400 1,000 14:00 15:00 16:00 17:00 20:00 21:00 22:00 23:00 8/23 01:00 02:00 03:00 04:00 05:00 06:00 07:00 08:00 09:00 10:00 600 169 Y esterday High Steph enters short Steph covers short Market continues to sell off Steph sees selling enter market Steph sees buying is weak on rally II -== =, ---:' -= - ~ :=- -= ~ - ---=¥ ---=- 28 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 159DEFUSION: AN ADV ANCED MINDFULNESS SKILL Exercise 7.1 Tracking My Thoughts and Feelings Use this form to track your feelings and thoughts over the course of a week or two. We want to begin to develop better awareness of our thoughts and feelings, and especially how they show up and change. Three times a day, simply note your mood, sensations, any prevalent thoughts, anything specifi c that might have stimulated your feelings and your thoughts, and whether you chose to have these thoughts or if they just showed up on their own. Time What I Was Feeling/ Mood Body Sensations I Noticed What My Mind Was Telling Me Situation/ Event Did I Choose to Have These Thou ghts and Feelings or Did They Just Show Up? Sample: 8:00 A.M. Upbeat and excited. I was also feeling confi dent. Warmth; tingling in arms and hands “Today is going to be a good day. I can’t wait to trade” Pre‐open reviewing my game plan for the day. Even though these were positive, the y showed up on their own. In truth, I didn’t choose them. 3:00 P.M . Tired and bored. Shoulders tense. Body felt heavy. “Markets are dull.” I noticed my mind encouraged me to surf the ’net and call friends. Narrow trading range. Nothing happening in the markets. Arose on own. I believe they were stimulated by the dullness of the market. I certainly didn’t want to feel bored. 7:30 P.M . Feeling positive an d energized. Body felt light. Ready to get going. “A breakout tomorrow will lead to a big move. I can make good money tomorrow.” Reviewing markets and making game plan for tomorrow. Again, they show up on their own. Funny how I’m not really in control of what I think or feel! 29 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 170TRADE MINDF U LLY Anot h er meanin g , somew h at re l ate d to t h e fi rst, is t h at t h e d i gg in g represents b ein g f use d wit h w h at our min d is te ll in g us. W e can b e so cau gh t up in t h e d i gg in g t h a t we miss the opportunities and richness of the present moment, such as the off er o f h e l p f rom some b o dy at t h e top o f t h e h o l e. Fuse d , we l ive in t h at a l ternate universe constructed by our mind. Who in their ri g ht mind would di g themselves deeper into a hole unless they were fused with their thou g hts? Crazy , isn’t it? Y et that’s what we d o. T h e im pl ication h ere is to d ro p t h e s h ove l an d wa k e u p to t h e p resent momen t b y d e f using f rom w h at our min d te ll s us. T h at is w h en we b egin to part t h e vei l s our mind drapes over us and see reality more clearly . When we are able to see more c l ear l y our actions wi ll b e more consistent wit h w h at is o f rea l va l ue to us. W h en d e f use d , t h e d igging man wi ll natura ll y as k f or a rope to b e t h rown d own f rom t h e top o f t h e h o l e. W e can use this story e ff ectively by askin g ourselves, am I di gg in g ? Am I still strugg l ing wit h my interna l state, trying to contro l it an d escape w h at I d on ’t par - ticularly like, which I know doesn’t work and which I know hurts my trading? Am I di gg in g ? Am I so cau g ht up and fused with what my mind is tellin g me that I am",
  "word_count": 1000,
  "topics": [
    "options"
  ],
  "created_at": "2026-02-05T00:37:45.720005"
}