{
  "id": "61268d96822c",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 13,
  "content": "Elementary Strategies 27 First, what happens at the three exercise prices involved? At 90 we have: 90 call +935 100 calls —2 x 2.70 95 puts ~4 x 3.45 100 puts +2 x 6.30 Total +2.75 At 95 we have: 90 call 44,35 100 calls -2 x 2.70 95 puts +4x 1.55 100 puts +2 x1.30 Total +7.75 And at 100 we have: 90 call -.65 100 calls -2 x 2.70 95 puts +4x 1.55 100 puts -2 x 3.70 Total -7.25 We can plot and connect these profit and loss points at each of the exercise prices (Figure 2-13a). Next, below 90 all calls will be worthless and all puts will act like short underlying contracts. Since the position is net short two puts, the graph will act like a position which is long two underlying contracts. For each point that the underlying contract falls below 90, the position will lose two points (Figure 2-13b). Finally, above 100 al! puts will be worthless and all calls will act like long underlying contracts. Since the position is net long one call, above 100 it will act like a Position which is long one underlying contract. For each point rise in the underlying contract, the position will gain one point in value (Figure 2-13c). Using this method we can draw the expiration profit and loss graph of any position, no Matter how complex. The position may consist of underlying contracts, and calls and puts at various exercise prices. But as long as all options expire at the same time, the value of the position at expiration will be fully determined by the price of the underlying contract. Using options and underlying contracts it is also possible to create positions which Mimic other option and underlying positions. For example, what are the characteristics Of the following position? long one 100 call at 2.70 short one 100 put at 3.70 28 Chapter 2 Figure 2-13a 10 short 1 March 90 call at 9.35 85 long 2 March 100 calls at 2.70 short 4 March 95 puts at 1.55 64 long 2 March 100 puts at 3.70 +775 € 4 2 oa 2 | +275< 90 95 100 4 | a 0 t | -2- ob 7.28 B . 4 -44 -64 -8- -10 T T T T T 85 90 95 100 105 110 115 Figure 2-13b 10 Profit short 1 March 90 call at 9.35 long 2 March 100 calls at 2.70 short 4 March 95 puts at 1.55 long 2 March 100 puts at 3.70 Loss 85 90 95 100 105 110 115 Elementary Strategies 29 Figure 2-13c 107 short 1 March 90 call at 9.35 8 long 2 March 100 calls at 2.70 short 4 March 95 puts at 1.55 67 long 2 March 100 puts at 3.70 =e 4 js oa 2- \\ 100 0 - - _ -2-+ ie] 8 4-44 -67 -87 -10-+ T T T T T : 85 90 95 100 105 110 115 With the underlying contract above 100 at expiration, the 100 put will be worthless and the 100 call will act like a long underlying contract. With the underlying contract below 100 at expiration, the 100 call will be worthless and the 100 put will act like a short underlying contract. However, since the position is short the 100 put, when the 100 put is in the money it will act like a long underlying contract. In other words, this position will mimic a long underlying position regardiess of where the underlying contract is at expiration (Figure 2-14). The only real difference between the option position and a long position in the underlying contract is that the option position will create a credit of one point. Or consider the following position: long one 90 put at .45 short one 100 call at 2.70 long one underlying contract at 99.00 The value of this position at expiration is given in Figure 2-15. Note the similarity between this position and the one in Figure 2-10. The only difference appears to be that We replaced the long 90 call with the combination of a long 90 put and a long underlying Contract. Therefore, a long 90 put and a long underlying contract together must mimic a long 90 call. As proof, the reader should draw the expiration profit and loss graph of the following two positions: 30 Chapter 2 Figure 2-14 10 Profit long a 100 call at 2.70 short a 100 put at3.70 ~~~ ~- combined position Loss 100 105 110 115 Figure 2-15 10 Profit long a 90 put at .45 short a 100 cail at 2.70 long an underlying contract at 99.00 +3. 90 3.25 -+/-Y Loss N— 6.75 95 100 105 110 115 Elementary Strategies 31 1. longa 90 call at 9.35 2. longa 90 put at .45 and long an underlying contract at 99.00 Although there will be a small difference in the profit and loss to each position, both positions will have graphs with the same general shape. The reader who is new to options may find it useful to sit down with the business section of a newspaper and create and graph a variety of option and underlying positions. This will enable him to become comfortable with many of the concepts introduced in the first two chapters, and will make the subsequent material that much easier to understand. Typical newspaper listings for futures options and stock options are shown in Figure 2-16. While elementary strategies such as the ones discussed in this chapter are a convenient method of introducing the new trader to basic option characteristics, in actual practice it is very unlikely that a trader will put on a position and let it go to expiration. Even if he were to initiate a position with such an intent, he would be foolish indeed to simply walk away from the position and come back at expiration to find out whether he had made or lost money. As market",
  "word_count": 1000,
  "topics": [
    "options",
    "forex"
  ],
  "created_at": "2026-02-05T08:09:54.424219"
}