{
  "id": "e5a1ad3be187",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 73,
  "content": "110 puts (-75) short 50 March 95 puts (-21) long 50 March 100 puts (—48) long 50 March 105 puts (~75) short 50 March 110 puts (-91) short 5 June 90 calls (81) long 5 June 95 calls (67) long 5 June 100 calls (51) short 5 June 105 calls (36) 160 Chapter 8 strangles, long butterflies, and long time spreads. A trader who has a positive gamma is sometimes said to be /ong premiumand is hoping for a volatile market with large moves in the underlying contract. A trader who has a negative gamma is sometimes said to be short premium and is hoping for a quiet market with only small moves in the underlying market. Since the effect of market movement and the effect of time decay always work in opposite directions, any spread with a positive gamma will necessarily have a negative theta. Any spread with a negative gamma will necessarily have a positive theta. If market movement helps, the passage of time hurts. If market movement hurts, the passage of time helps. An option trader can’t have it both ways. Spreads which are helped by a rise in volatility have a positive vega. These include backspreads, long straddles, long strangles, short butterflies, and long time spreads. Spreads which are helped by a decline in volatility have a negative vega. These include ratio vertical spreads, short straddles, short strangles, long butterflies, and short time spreads. In theory, the vega refers to the sensitivity of a theoretical value to a change in the volatility of the underlying contract over the life of the option. In practice, however, traders tend to associate the vega with the sensitivity of an option’s price to a change in implied volatility. Spreads with a positive vega will be helped (hurt) by any increase (decrease) in implied volatility. Spreads with a negative vega will be helped (hurt) by any decrease (increase) in implied volatility. The delta, gamma, theta, and vega associated with the primary types of volatility spreads are summarized in Figure 8-19. Since the delta of a volatility spread is assumed to be approximately zero, and since the theta is always of opposite sign to the gamma but of similar magnitude, we can place every volatility spread into one of four categories based on the sign of the gamma and vega associated with the spread: Category Gamma Vega Backspread Positive Positive Ratio Vertical Spread Negative Negative Long Time Spread Negative Positive Short Time Spread Positive Negative If a trader is approximately delta neutral—no matter how complex the position, even if it includes options of different types, at many different exercise prices, and with several different expiration dates—he can always place the position in one of these four general categories based on the gamma and vega of the position. The extent to which he is pursuing one of these strategies will depend on the magnitude of the gamma and vega. A trader with a gamma of -100 and vega of +200 would describe his position as a long time spread, but not nearly to the degree of a trader who has a gamma of -1500 and a vega of +3000, Figure 8-20 is an evaluation table with the theoretical value, delta, gamma, theta, and vega of several different options. Following this table are examples of volatility spreads of the types discussed in this chapter, along with their total delta, gamma, theta, and vega. (Although the examples in Figure 8-20 are based on futures options, the Volatility Spreads 161 Figure 8-19: Characteristics of Volatility Spreads Spread Type Delta Gamma Theta Vega Position Position Position Position Backspread 0 + - + Long Straddle 0 + ~ + Long Strangle 0 + _ + Short Butterfly 0 + - + Ratio Vertical Spread 0 ~ + ~ Short Straddle ) - + ~ Short Strangle 0 - + ~ Long Butterfly fe] - + ~ Long Time Spread 0 - + + Short Time Spread (0) + - ~ spread characteristics are equally valid for stock options.) The reader will see that each spread does indeed have the positive or negative sensitivities summarized in Figure 8-19. Note also that a volatility spread need not be exactly delta neutral. (Indeed, as we saw in Chapter 6, no trader can say with any certainty whether he is delta neutral.) A practical guide is for the delta to be close enough to zero so that the volatility considerations are more important than the directional considerations. Note that no price is given for any of the option contracts in Figure 8-20, and therefore no theoretical edge can be calculated for any of the spreads. The prices at which a spread is executed may be good or bad, resulting in a positive or negative theoretical edge. But once the spread has been established, the market conditions which will help or hurt the spread are determined by its type, not by the initial prices. Like all traders, option traders must not let their previous trading activity affect their current judgement. A trader’s primary concern ought never be what happened yesterday, but what he can do today to make the most of the current situation, whether that means maximizing his potential profit or minimizing his potential loss. CHOOSING AN APPROPRIATE STRATEGY With so many spreads available, how do we know which type of spread is best? First and foremost we will want to choose spreads which have a positive theoretical edge to ensure that if we are right about market conditions we can be confident of showing a profit. Ideally, we would like to construct a spread by purchasing options which are underpriced and selling options which are overpriced. If we can do this the resulting spread, whatever its type, will always have a positive theoretical edge. More often, however, our opinion about volatility will result in all options appear- ing either underpriced or overpriced. When this happens, it will be impossible to both Chapter 8 162 ‘aoud owes ayy ye Bulpely aie syoeuce",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.433602"
}