{
  "id": "22cd2a1433ba",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 30,
  "content": "simple pullbacks on the higher time frame. These examples have dealt exclusively with uptrends, but they are simply reﬂected and reversed for downtrends. These patterns can form a foundation for a robust under- standing of trend analysis. Do not be put off by the simplicity of this analysis. In the right context, simple tools work very well. Using Trend Lines to Deﬁne Rate of Trend Trend lines are one of the most used and abused tools in modern technical analysis. One good working deﬁnition of a trend line is a line drawn between two points on a chart, but then there are the internal trend lines, which can be drawn anywhere through the middle of price bars. There are many possible variations of these lines, but the one rule is that however the trader chooses to deﬁne trend lines, they should be used and applied consistently. 38 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing On Trends 85 The Standard Trend Line Standard uptrend lines are drawn between higher lows in an uptrend; the standard downtrend line is a line drawn between lower highs in a downtrend. The uptrend line shows where buyers have stepped in on the declines with additional demand and have bid the market higher, which is why Wyckoff called this line the demand line . In a downtrend, the downtrend line, or the supply line, shows where additional sellers have come into the market to arrest the bounces. If you are drawing standard trend lines, be certain of these points: r They slope with the trend. Uptrend lines are upward sloping, and downtrend lines slope downward. r Uptrend lines are underneath prices, marking areas of potential support. Downtrend lines are possible resistance areas, and must be drawn above prices. Figure 3.34 shows examples of correctly drawn standard trend lines in the XLF. FIGURE 3.34 Standard Trend Lines in the SPDR Select Sector Fund for the Financial Sector (NYSE: XLF) XLF - Daily S&P Sel Filancial Spdr Fund Oct '09 Apr Jul 39 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 86 MARKET STRUCTURE FIGURE 3.35 Nonstandard Trend Lines in XLF Figure 3.35 shows examples of nonstandard trend lines: r A is drawn between lows in a downtrend instead of between highs in a downtrend. r B is also drawn between lows in a downtrend. Furthermore, it ignores a large price spike in an effort to ﬁt the line to later data. r C is more of a best-ﬁt line drawn through the center of a price area. These may be drawn freehand or via a procedure like linear regression. r D is drawn between highs in an uptrend. r E raises a critical point about trend lines: They are lines drawn between successive swings in the market. If there are no swings, there should be no trend line. It would be hard to argue that the market was showing any swings at E, at least on this time frame. This trend line may be valid on a lower time frame, but it is nonstandard on this time frame. In general, trend lines are tools to deﬁne the relationship between swings, and are a complement to the simple length of swing analysis. As such, one of the requirements for drawing trend lines is that there must actually be swings in the market. We see many 40 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c03 JWBT634-Grimes May 10, 2012 7:26 Printer: Hamilton Printing 88 MARKET STRUCTURE FIGURE 3.36 A Parallel Trend Line on the Weekly S&P 500 Cash Index downtrends) and often leads to a new trend that proceeds at a faster rate. Figure 3.37 shows an example of this phenomenon in silver futures. This is a good example of what people mean when they say “reading the market tape,” which is, in part, judging how the market acts around critical levels. A key com- ponent of this is price action on lower time frames, which can only partially be inferred from the trading time frame. A complete understanding requires inspection of several lower time frame charts, and, ideally, monitoring in real time as the action develops. If you found yourself short after point A in Figure 3.37, it would have been relatively easy to see that you were on the wrong side of the market. What should have happened, if your short was correct, was a fairly immediate meltdown. Being responsive to informa- tion often allows a trader to reduce losses on losing trades, and, ideally, to position on the correct side of the trade. One- to Three-Bar Trend Lines In general, the signiﬁcance of a trend line depends on the signiﬁcance of the points used to deﬁne the line. However, there are some special cases where very short-term trend lines may give good trading signals. Charles Drum- mond (1980) has used these short-term trend lines as the foundation for his Drummond SNX _ Weekly S&P 500 Index 1,200.00 1,150.00 1,100.00 1,050.00 1,000.00 950.00 900.00",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options"
  ],
  "created_at": "2026-02-05T00:37:53.699908"
}