{
  "id": "1dfe01e68858",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 36,
  "content": "152 6/7/2021 7:16:57 AM 76 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 153 In case you think that any two stocks in the same industry group would be cointegrating, here is a counterexample: KO (Coca-Cola) versus PEP (Pepsi). The same cointegration test as used in Exam- ple 7.1 tells us that there is a less than 90 percent probability that they are cointegrated. (You should try it yourself and then compare with my program epchan.com/book/example7_3.m.) If you use lin- ear regression to find the best fit between KO and PEP , the plot of the time series will resemble Figure 7.3. If a price series (of a stock, a pair of stocks, or, in general, a port- folio of stocks) is stationary, then a mean-reverting strategy is guar- anteed to be profitable, as long as the stationarity persists into the future (which is by no means guaranteed). However, the converse is not true. You don’t necessarily need a stationary price series in order to have a successful mean-reverting strategy. Even a nonstationary price series can have many short-term reversal opportunities that one can exploit, as many traders have discovered. # Coefficients: # Estimate Std. Error t value Pr(>|t|) # (Intercept) -0.07570 0.29814 -0.254 0.79970 # L(y, 1) -0.03817 0.01178 -3.241 0.00498 ** # L(d(y), 1) 0.08542 0.03077 2.776 0.00578 ** # L(X, 0) 0.75428 0.02802 26.919 < 2e-16 *** # L(X, 1) -0.68942 0.03161 -21.812 < 2e-16 *** # --- # Signif. codes: 0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1 # # Residual standard error: 0.474 on 378 degrees of freedom # Multiple R-squared: 0.6577, Adjusted R-squared: 0.6541 # F-statistic: 241.8 on 3 and 378 DF, p-value: < 2.2e-16 # determines the hedge ratio lmresult <- lm(GLD ~ 0 + GDX, mydata, subset=trainset ) hedgeRatio <- coef(lmresult) # 1.631009 z <- residuals(lmresult) # The residuals should be stationary (mean-reverting) plot(z) # This should produce a chart similar to Figure 7.2. The R code’s Engle-Granger test generates a t-statistic of –3.2, which rejects the null hypothesis that the pair is not cointegrating. This corrobo- rates the MATLAB cadf test, while repudiating the Python’s result. Moral of the story: Do not trust Python’s statistics and econometrics packages. Chan800064_c07.indd 153 6/7/2021 7:16:57 AM 154 QUANTITATIVE TRADING Many pair traders are unfamiliar with the concepts of stationar- ity and cointegration. But most of them are familiar with correlation, which superficially seems to mean the same thing as cointegration. Actually, they are quite different. Correlation between two price series actually refers to the correlations of their returns over some time horizon (for concreteness, let’s say a day). If two stocks are pos- itively correlated, there is a good chance that their prices will move in the same direction most days. However, having a positive correla- tion does not say anything about the long-term behavior of the two stocks. In particular, it doesn’t guarantee that the stock prices will not grow farther and farther apart in the long run, even if they do move in the same direction most days. However, if two stocks were cointegrated and remain so in the future, their prices (weighted appropriately) will be unlikely to diverge. Yet their daily (or weekly, or any other time horizon) returns may be quite uncorrelated. As an artificial example of two stocks, A and B, that are coin- tegrated but not correlated, see Figure 7.4. Stock B clearly doesn’t move in any correlated fashion with stock A: Some days they move in the same direction, other days the opposite. Most days, stock B doesn’t move at all. But notice that the spread in stock prices between A and B always returns to about $1 after a while. 50 40 30 20 10 0 –10 –20 –30 Long 1 share of KO Short 1.01 share of PEP Spread (in $) Date 19770103 19841128 19921027 20000927 FIGURE 7.3 A nonstationary time series formed by the spread between KO and PEP . Chan800064_c07.indd 154 6/7/2021 7:16:57 AM 77 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 155 Can we find a real-life example of this phenomenon? Well, KO versus PEP is one. In the program example7_3.m, I have shown that they do not cointegrate. If, however, you test their daily returns for correlation, you will find that their correlation of 0.4849 is indeed statistically significant. The correlation test is presented at the end of the example7_3.m program and shown here in Example 7.3. Stock A Stock B 73 72 71 70 69 68 Daily Prices67 66 65 64 6305 10 15 20 Days 25 30 35 40 45 FIGURE 7.4 Cointegration is not correlation. Stocks A and B are cointegrated but not correlated. Example 7.3: Testing the Cointegration versus Correlation Properties between KO and PEP The cointegration test for KO and PEP is the same as that for GDX and GLD in Example 7.2, so it won’t be repeated here. (It is available from epchan.com/book/example7_3.m.) The cointegration result shows that the t-statistic for the augmented Dicky-Fuller test is –2.14, larger than the 10 percent critical value of –3.038, meaning that there is a less than 90 percent probability that these two time series are cointegrated. Chan800064_c07.indd 155 6/7/2021 7:16:57 AM Special Topics in Quantitative Trading 155 Can we find a real-life example of this phenomenon? Well, KO versus PEP is one. In the program example7_3.m, I have shown that they",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "market_structure",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.609523"
}