{
  "id": "3ea2ad187e21",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 16,
  "content": "d o not h ave to d ictate actions. T h e tra d er can follow his or her tradin g plan and fully utilize tradin g skills and abilities tha t l ea d to improve d per f ormance, consistency in tra d ing, an d growt h as a tra d er. In contrast to the Vicious Cycle of Ineff ective Trading illustrated in Figure 5.1 with the trader cuttin g a winnin g trade short, Fi g ure 5.2 illustrates the Cycle of Mindfully E ff ective Trading. Through mindfulness practice, we no longer have to act as limited automatons, slavishly respondin g to the va g aries of our inner states. Mindfulness helps us approach the “zone” or fl ow state. W e will learn several di ff erent ways to do and practice mindfulness in Chapter 6 . Before we do that, it is important for traders to understand a bit about the science behind mindfulness. Because mindfulness re q uires p ractice and is an investment o f your time and e ff ort, you should understand what it can do for you. FIGURE 5.2 Mindful Cycle of E ff ective Trading T rade Entered T rading Skills Developed and Reinforced T rade Managed Attention Maintained on the Demands of the T rade Urge to Control and Escape Distress Mindfully Noticed and Accepted Stress Response Activated T rade in Profit; Market Ticks Against T rade Mindful Cycle of Effective T rading: Holding a Winning T rade 119THE TRADERS’ PSYCHOLOGICAL EDGE In t h e next c h apter, we intro d uce t h e mec h anics o f min df u l ness an d s h ow you h ow to d o it. W e d etai l severa l a l ternative min df u l ness proce d ures. T o b ecome a min df u l tra d er, start practicin g min df u l ness an d b ui ld in g your min df u l ness musc l es b y f o ll owin g t h ese proce d ures. ■ Note 1. Jon Ka b at‐Zinn. Wherever You Go, There You Are: Mindfulness Meditation in Everyday Life (New Y or k : Hyperion, 1994), 92. \\ J .... .... I \\ \\ J ... 21 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 121 A s y ou have learned in Chapter 5 , mindfulness off ers substantial benefi ts to trad- ers. W e discussed what mindfulness can do for y ou and some of the mental and psychological di ffi culties traders confront along with the robust research pertinent to tradin g . W e next talk about what mindfulness is and how to do it. W e explain dif- ferent ways to practice mindfulness and introduce several guided mindfulness scripts for you to use to develop your personal practice. T o help you with your practice, audio downloads of man y of these scripts are available at the author’s website, www .tradingpsychologyedge.com . W e also discuss how traders can apply the critical mental skill of mindfulness in tradin g . Mindfulness is s y non y mous with present moment awareness. When we are mind- ful, our attention is placed on the present moment. Most people can be mindful for a short duration, but we rarely stay focused on the present moment for lon g . Our min d o f ten trave l s f rom somet h in g we remem b er f rom t h e past to some projecte d desire or worry about the future. Once we slide into thinkin g about the past or the future, we have taken ourselves out of the present moment. W e are no lon g er mind- f u l . W e are no l on g er f u ll y aware o f w h at is h appenin g h ere an d now; instea d , our mind is preoccupied with a past remembrance or a future projection. In tradin g , when our mind has shifted awa y from the here and now , in other words, the market and our trade, our performance suff ers. Practice Min df u l ness , Tra d e Min df u lly CHAPTER 6 123PRACTICE MINDFULNESS, TRADE MINDFULLY Sunil was unable to assess the market in the p resent moment because h is mind was in the future. Part of this was caused by his focusin g on only one small aspect of market action (his perception of the down move a t C). It was salient to his intuitive mind. Seizing the perception that the market has lost its downward push, Sunil be g an thinkin g about the future and a loss. Because his mind went to future p rojections about how the t rade would now turn into a loss, his present focus was lost. His mind was lost to worry and he was unable to access his deliberative mind. Because his future p rojections made him feel uncomfortable, he moved his stop lower. Sunil didn’t even realize that he was making a si g nifi cant tradin g error because his projections seemed correct, and to h im the y were, but onl y in the future his mind had constructed, not in th e present rea l ity o f t h e mar k e t . W e typica ll y d on ’ t rea l ize it w h en we h ave d eparte d t h e present b ecause we",
  "word_count": 1000,
  "topics": [
    "psychology"
  ],
  "created_at": "2026-02-05T00:37:45.719255"
}