{
  "id": "f6b2b3d99a84",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 33,
  "content": "LET'S LOAD UP THE FILE TO PANDAS IN THE LOCAL ENVIRONMENT from pandas import read_csv # If you have the Excel file, replace read_csv with read_excel from pandas import read_excel df = read_excel(file_path, engine=\"openpyxl\") # Same here df.name = \"testdataframe\" # Optional, but recommended response = client.train( model_name=\"test1\", input_df=df, Chan800064_c07.indd 143 6/7/2021 7:16:54 AM 68 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 144 QUANTITATIVE TRADING label=labelname, username=username, email=email, return_output=False, ) print(\"FANTASTIC! YOUR FIRST-EVER MODEL TRAINING AT PRE- DICTNOW.AI HAS BEEN COMPLETED!\") print(response) # User can now examine the train/test sets results from the model by calling the getresult function (and providing the name of the model that resides on Predictnow.ai server status = client.getstatus(username=username, train_ id=response[\"train_id\"]) if status[\"state\"] == \"COMPLETED\": response = client.getresult( model_name=\"test1\", username=username, ) import pandas as pd predicted_targets_cv = pd.read_json(response. predicted_targets_cv) print(\"predicted_targets_cv\") print(predicted_targets_cv) predicted_targets_test = pd.read_json(response. predicted_targets_test) print(\"predicted_targets_test\") print(predicted_targets_test) performance_metrics = pd.read_json(response. performance_metrics) print(\"performance_metrics\") print(performance_metrics) # # Now we can make LIVE predictions for many combinations of the parameters by populating many rows in the example_input_live.csv file with these parameter combinations if status[\"state\"] == \"COMPLETED\": df = read_csv(\"example_input_live.csv\") # Input data for live prediction df.name = \"myfirstpredictname\" # optional, but recommended # Making live predictions response = client.predict( model_name=\"test1\", input_df=df, username=username, Chan800064_c07.indd 144 6/7/2021 7:16:54 AM 69 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 145 eda=\"yes\", prob_calib=params[\"prob_calib\"], ) # FOR LIVE PREDICTION: (remember labels and probabilities each can have many rows corresponding to many combinations of parameters y_pred = pd.read_json(response.labels) print(\"THE LABELS\") print(labels) An example output labels file from this step looks like this: Date pred_target 2020-12-24 2.5_30_0.2 20218132334 0.011875 2020-12-24 2.5_60_0.2 20218132344 0.012139 2020-12-24 2.5_90_0.2 20218132354 0.012139 2020-12-24 2.5_120_0.2 20218132364 0.012975 2020-12-24 2.5_180_0.2 20218132374 0.012975 2020-12-24 2.5_240_0.2 20218132384 0.012975 2020-12-24 2.5_360_0.2 20218132394 0.012975 2020-12-24 2.5_720_0.2 20218132404 0.012975 where 2.5_30_0.2 is one parameter combination, and 2.5_60_0.2 is another. input_features= df['Date'].values for i in range(len(input_features)): #/ split y_pred[‘Date'] into actual date and parameters string date_params =input_features[i].split(' ') params = date_params[1] if i==0: #initializing max_index and its parameters value #E.g. (2.5, 60, 0.2) params_cond_optimized = params y_pred_max = y_pred[i].values else: if y_pred[i].values >= y_pred_max: #updating max_index and its parameters value params_cond_optimized = params y_pred_max = y_pred[i].values # params_cond_optimized is “conditionally optimal” parameters for the # next day Chan800064_c07.indd 145 6/7/2021 7:16:54 AM 70 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 146 QUANTITATIVE TRADING It is important to understand that unlike a naïve application of machine learning to predict GLD’s one-day return using technical indicators, we are using machine learning to predict the return of a trading strategy applied to GLD given a set of trading parameters, and using those predictions to opti- mize these parameters on a daily basis. The naïve approach is less likely to succeed because everybody is trying to predict GLD’s (i.e., gold’s) returns and inviting arbitrage activities, but nobody (until they read this book!) is predict- ing the returns of this particular GLD trading strategy. Furthermore, many traders do not like using machine learning as a black box to predict returns. In CPO, the trader’s own strategy is making the actual predictions. Machine learning is merely used to optimize the parameters of this trading strategy. This provides for a much greater degree of transparency and interpretability. Performance Comparisons We compare out-of-sample test set performance of Unconditional vs. Con- ditional Parameter Optimization on the last three years of data ending on December 31, 2020, and find the cumulative three-year return to be 73% and 83%, respectively. All other metrics are improved using CPO. The com- parable equity curves can be found in Figure 7.1. Unconditional Optimization Conditional Optimization Annual Return 17.29% 19.77% Sharpe Ratio 1.947 2.325 Calmar Ratio 0.984 1.454 0.8 2018 2019 2020 2021 Date 0.6 0.4Cumulative Return Equity Curves Unconditional Conditional 0.2 0.0 FIGURE 7.1 Cumulative returns of strategies based on Conditional vs. Unconditional Parameter Optimization. Chan800064_c07.indd 146 6/7/2021 7:16:54 AM I= 71 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Special Topics in Quantitative Trading 147 STATIONARITY AND COINTEGRATION A time series is stationary if it never drifts farther and farther away from its initial value. In technical terms, stationary time series are “integrated of order zero,” or I(0) (Alexander, 2001). It is obvious that if the price series of a security is stationary, it would be a great candidate for a mean-reversion strategy. Unfortunately, most stock price series are not stationary—they exhibit a geometric random walk that gets them farther and farther away from their starting (i.e., initial public offering) values. However, you can often find a pair of stocks such that if you long one and short the other, the market value of the pair is stationary. If this is the case, then the two indi- vidual time series are said to be cointegrated. They are so described because a linear combination of them is integrated of order zero. Typically, two stocks that form a cointegrating pair are from",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:43.609031"
}