{
  "id": "1a50cbdcb866",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 130,
  "content": "position at all, preferring to wait for clearer indications. Suppose, in addition to six-week options, we also have available 19-week options (approximately 95 trading days). Volatility data for this contract is shown in Figure 14-6B. While a trader may be hesitant to take a position in six-week options alone, when combined with 19-week options, he may be able to construct a strategy with much more acceptable risk characteristics. Here the 95-day historical volatility of 12.6% is above the 11.2% mean volatility. Moreover the current implied volatility of 19-week options, at 14.5%, is well above both the 95-day historical volatility and the long-term mean volatility. There is a much better chance that the volatility will revert to its mean over a 19-week period than over a six-week period, so there are much stronger reasons for taking a short volatility position in 19-week options than in six-week options, Still, the upward trend in both the historical and implied volatilities will cause some worry if we do take a short volatility position. However, if we were to simultaneously take a long volatility position in six-week options, we would at least be protected against a continuing increase in the volatility of the underlying contract over the next six weeks. By creating a short time spread (buy six-week options/sell 19-week options} we can take a position which should be profitable based on our knowledge of volatility charac- teristics, but which also has acceptable risk characteristics if we are wrong. A short time spread will not eliminate every risk. The market might suddenly become very quiet, with historical volatility quickly dropping to, or even below, its 285 Volatility Revisited 09 <__— einyny \\Sseq — 0S Ov oe 02 OL 0 Ol- O¢- o€- Ov- os- 09- OZ- o8- 06- it 1 4 | i l i i it i gL Ayytyejon ea W8} Buc; im uolyesidxe AN -0¢ Ay WEIOA eoUO}sIY Aep os Ayyyyejoa peljduu! Hz § = = Lee 3s Lez pg Sz qS-r1 aanbig ~a aunyn4 ised > os =r ce 02 ot f°) OF A SG 1 it gL 6h uonesdxe mid 7 ~ N (%) AUIREIOA Ayyye[OA jeooysiy Aep 0S ee AQyyejoa mid paljdu 286 S¢ oS-rL eunBig 287 Volatility Revisited 09 <<. euning 1s@qd ae aed Os Ov 0€ 0c OL 0 OL- Oc- 0€- 0v- Qs- 09- Q2- 08- 06- LL. L _t. L. _j 1 i i \\ al L S- Ayigejon UBaW We} Huo} uoyjesdxa < o a 5 Lzz 38 Ayye|on payduy Lez AW TEIOA peauoysty Kep os wi Sc ps-ri eunbi4 Chapter 14 288 ~~_q—_aining seq _ 0c OL 0 0 I - 02 - O€- Ov- Os 09- OL 08- 06, 6 LOL EEL ee ee Oe < io} 2 let = < & KE b —_ (suoydo yaem g) ApejoA paljduut mAs ~=~ Pst AUPeJOA jeouoysiy Aep o¢ OL e9-p1 eunbi4 289 Volatility Revisited 02a ~«_gj— ainyng OF 0 \\seq OL- O¢- Oe- Ov- 05\" 0g o2Z- o8- 0 6- L Ayyejoa peouoysiy Aep cE (suondo yaem 61) Aye] Pat|duut ALE ma Feb 9b (%) AUIFEIOA q9-r1L eunbig 290 Chapter 14 long-term mean. At the same time, implied volatility may remain relatively high. Such conditions will do the most damage to a short time spread. Still, if we believe that the implied volatility tends to follow the historical volatility, we may conclude that it is unlikely that the implied volatility will stay high if the historical volatility drops. A trader will always attempt to pick the strategy which best fits his opinion of market conditions, whether a directional opinion or a volatility opinion. Given the fact that there is such a wide variety of market conditions, a trader who is familiar with the greatest number of strategies will have the best chance of surviving and prospering, He will be in a position to pick strategies with the best risk/reward characteristics, strategies which will be profitable when things go right, but which won’t give back all the profits when things go wrong. This skill comes not only from a technical knowledge of option evaluation and theory, but also from a practical knowledge of what really happens in the marketplace. SOME THOUGHTS ON IMPLIED VOLATILITY Since many option strategies are sensitive to changes in implied volatility, and since implied volatility will often play a role in forecasting the volatility of the underlying contract, it may be worthwhile to consider some of the characteristics of implied volatility. Implied versus Historical Volatility Implied volatility can be thought of as a consensus volatility among all market partici- pants with respect to the expected amount of underlying price fluctuation over the remaining life of an option. In the same way that an individual trader is likely to change his volatility forecast in response to changing historical volatility, it is logical to assume that the marketplace as a whole will also change its consensus volatility in response to changing historical volatility. As the market becomes more volatile, implied volatility can be expected to rise; as the market becomes less volatile, implied volatility can be expected to fall. Market participants are making the logical assumption that what has happened in the past is a good indicator of what will happen in the future. The influence of historical volatility on implied volatility can be seen in Figure 14-7, the historical and implied volatility of U.S. Treasury Bond futures traded on the Chicago Board of Trade from 1989 to 1991. In late 1989, and again in mid-1991, there were declines in the volatility of Treasury Bond futures, and these were accompanied by corresponding declines in implied volatility. From August 1990 through January 1991 {the period of the Iraqi invasion of Kuwait), there were several sharp increases in the volatility of the futures, and these were accompanied by similar increases in implied volatility. Clearly, the marketplace, in the form of changing implied volatility, was responding to the changing historical volatility of the underlying contract. Notice, however, that the fluctuations in implied volatility were usually less",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies"
  ],
  "created_at": "2026-02-05T08:09:54.442250"
}