{
  "id": "3d47ed9f0462",
  "source": "The_Art_And_Science_of_Technical_Analysis.pdf",
  "source_type": "pdf",
  "title": "The Art And Science Of Technical Analysis",
  "chunk_index": 15,
  "content": "to the trader to track down prices for each of the markets and update the charts by drawing a new price bar. At the beginning of the next week, a new book would arrive with the past week’s prices ﬁlled in, and the process would repeat. Actually, in my very early trading days I did not even have the chart book, but I bought a pad of graph paper, went to the library, and started building charts from histories I found in back issues of newspapers. I did not realize the value of what I was doing at the time, but this process immersed me in patterns as they were emerging. There is something about physically drawing lines that engages a different part of the brain than looking at a screen does. Because of this work, I assimilated patterns quickly and developed a sense of the forces at work behind the patterns early in my development. When you are drawing open, high, P1: OTA JWBT634-c01 JWBT634-Grimes May 10, 2012 7:17 Printer: Hamilton Printing The Trader’s Edge 29 low, and close on each price bar, you will spend time during the day wondering what new conﬁgurations could appear at the end of the day, and thinking about how the day’s trading might unfold to create those patterns. Most readers are probably shaking their heads and laughing at this point, thinking that this is a quaint and hopelessly anachronistic practice, but I beg to differ. Modern computer charting has the advantage of breadth. It would simply not be possible to re- view a large number of charts every day without the aid of a computer to generate those charts; however, there is still great value in pencil and paper. This is not a practice that will reward you with immediate results and proﬁts; it works on a much deeper and more profound level of perception, and it takes time. I would suggest that interested traders commit to doing this for a period of not less than two months, consistently, and then evaluate the impact of the exercise on your ability to read the market. I know of no bet- ter exercise to help a developing trader assimilate the patterns of the market and to begin building intuition. You will be amazed at the transformation in your vision. There are two speciﬁc ways to do this exercise. One is to simply plot standard bar or candle charts, by hand, for whatever time period is under consideration. Every trader can at least do daily charts, but intraday traders might be able to do 15- to 30-minute time frames. Lower time frames will give much more exposure to patterns, but the time for contemplation is reduced. Above all, you want to pick a time frame that will allow you to make an unfailing commitment to this exercise. Doing it for a few days and then giving up will result in nothing but wasted time. The other way is to construct a swing chart, which is also known as a kagi chart. In this type of chart, vertical lines indicate price movement (along the y-axis of the chart), while short horizontal lines illustrate the breaks between upswings and downswings. These breaks are deﬁned according to some rule set, the speciﬁc choice of which is not that important. Traditionally, you may look for a speciﬁc dollar or point amount of a reversal off a high, and then ﬂip direction, as in a standard point and ﬁgure chart. For instance, suppose a trader is working with a $1.00 reversal; if the stock trades up to FIGURE 1.18 Example of Swing Charting (Kagi) by Hand ,~ 1,384 1,384 ' ' -1- ' ' ' . ' 1,380 ' 1,380 ~ 1,376 1,376 1,372 1,372 1,368 1,368 1,364 1,364 1,360 1,360 1,356 11 :00 12:00 13:00 14:00 13 This PDF file is part of the audiobook THE ART AND SCIENCE OF TECHNICAL ANALYSIS and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Adam Grimes, 2012. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. P1: OTA JWBT634-c02 JWBT634-Grimes May 10, 2012 7:22 Printer: Hamilton Printing CHAPTER 2 The Market Cycle and the Four Trades To every thing there is a season, and a time to every purpose under the heaven. —Ecclesiastes 3:1, KJV T he early twentieth century was a time of great progress in markets and in thinking about markets. There were giants on the earth in those days—legends like Jesse Livermore, old man J. P. Morgan, Bernard Baruch, and Charles Dow. In this fertile environment, Richard Wyckoff developed his understanding of markets and the trading process through conversations and interviews with these master traders. After amassing a sizable personal fortune in the markets, he laid out his system in a set of correspon- dence courses, as was the practice of the day, to educate the public and to help them avoid the scams and frauds that were so prevalent at the time. Referring to the Wyck- off method is a bit of a misnomer, for he offered no simple system or one way to trade. Rather, Wyckoff created a method for understanding the buying and selling convictions of very large traders and institutions through the patterns their activity left on prices. If the smaller trader could recognize the signs they left in the market, he could align his po- sitions with their activity and interests; in the end, it is the buying and selling pressure of these large pools of money that actually moves the markets. This method is as powerful and as relevant today as it was a hundred years ago. Wyckoff proposed a four-stage market cycle. His idea was that the cycle resulted from the actions of these large players who planned their operations in the market to take advantage of the uneducated public’s inappropriate reactions to price movement, but we also see evidence of",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:53.697358"
}