{
  "id": "39bbff8b2793",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 28,
  "content": "curve is symmetrical. Under a normal distribution assumption, for every possible upward move in the price of an underlying instrument there must be the possibility of a downward Move of equal magnitude. If we allow for the possibility of a $50 instrument rising $75 to $125, we must also allow for the possibility of the instrument dropping $75 to a price of -$25. Since it is impossible for traditional stocks and commodities to take on negative prices, the normal distribution assumption is clearly flawed. What can we do about this? Up to now we have defined volatility in terms of the percent changes in the price of an underlying instrument. In this sense an interest rate and volatility are similar in that they both represent a rate of return. The primary difference between interest and Volatility is that interest generally accrues at a positive rate, while volatility represents a combination of positive and negative rates of return. If one invests money at a fixed interest rate, the value of the principal will always grow. But if one invests in an underlying instrument with a volatility other than zero, the instrument may go either up or down in price. Volatility, which is a standard deviation, says nothing about the direction of movement. Since volatility represents a rate of return, an important consideration is the manner in which the rate of return is calculated. For example, suppose we were to invest $1,000 62 Chapter 4 for one year at an annual interest rate of 12%. How much would we have at the end of one year? The answer depends on how the 12% interest on our investment is paid out, Value after Rate of Payment One Year Total Yield 12% once a year $1,120.00 12% 6% twice a year $1,123.60 12.36% 3% every three months $1,125.51 12.55% 1% every month $1,126.83 12.68% 12%/52 every week $1,127.34 12.73% 12%/365 every day $1,127.47 12.75% 12% compounded continuously $1,127.50 12.75% AS interest is paid more often, even though it is paid at the same rate of 12% per year, the total yield on the investment increases. The yield is greatest when interest is paid continuously. In this case it is just as if interest were paid at every possible moment in time. Although less common, we can do the same type of calculation using a negative interest rate. For example, suppose we were to lose 12 percent annually on our $1,000 investment (interest rate = ~12%). How much would we have at the end of a year? The answer depends on the frequency at which our losses accrue. Value after Rate of Loss One Year Total Yield -12% once a year $880.00 -12% —6% twice a year $883.60 -11.64% -3% every three months $885.29 -11.47% —1% every month $886.38 -11.36% -12%/52 every week $886.80 -11.32% -12%/365 every day $886.90 -11.31% ~12% compounded continuously $886.92 -11.31% In the case of a negative interest rate, as losses are compounded more frequently, even though at the same rate of -12% per year, the loss becomes smaller, and so does the negative yield. In the same way that interest can be compounded at different intervals, volatility can also be compounded at different intervals. For purposes of theoretical pricing of options, volatility is assumed to compound continuously, just as if the price changes in the underlying instrument, either up or down, were taking place continuously but at an annual rate corresponding to the volatility number associated with the underlying instrument. What would happen if at every moment in time the price of an underlying could go up or down a given percent, and that these up and down movements were normally distributed? When price changes are assumed to be normally distributed, the continu- Volatility 63 ous compounding of these price changes will cause the prices at maturity to be lognormally distributed. Such a distribution is skewed toward the upside because upside prices resulting from a positive rate of return will be greater, in absolute terms, than downside prices resulting from a negative rate of return (Figure 4-7). In our interest rate example, a continuously compounded rate of return of +12% yields a profit of $127.50 after one year, while a continuously compounded rate of return of -12% yields a loss of only $113.08. If the 12% were a volatility, then a one standard deviation upward price change at the end of one year would be +$127.50, while a one standard deviation downward price change would be -$113.08. Even though the rate of return was a constant 12%, the continuous compounding of the 12% yielded different upward and downward moves. The Black-Scholes Model is a continuous time model. It assumes that the volatility of an underlying instrument is constant over the life of the option, but that this volatility is continuously compounded. These two assumptions mean that the possible prices of the underlying instrument at expiration of the option are lognormally distributed. It also explains why options with higher exercise prices carry more value than options with lower exercise prices, where both exercise prices appear to be an identical amount away from the price of the underlying instrument. For example, suppose a certain underlying contract is trading at exactly 100. If there are no interest considerations and we assume Figure 4-7: Lognormal Distribution lognormal fo DN distribution \\ J , o 12°83 4 5 67 69 10111213 1415 5 ° |) 64 Chapter 4 a normal distribution of possible prices, then the 110 call and the 90 put, both being 10% out-of-the-money, ought to have identical theoretical values. But under the lognormal assumption in the Black-Scholes Model, the 110 call will always have a greater value than the 90 put. In absolute terms, the lognormal distribution assumption allows for greater upside price movement than downside price movement. Conse- quently, the 110 call will have a greater possibility of price appreciation than the 90 put. Finally, the lognormal assumption built into the Black-Scholes Model overcomes the logical problem we initially posed. If",
  "word_count": 1000,
  "topics": [
    "options",
    "crypto",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.426573"
}