{
  "id": "91beeb089ec2",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 30,
  "content": "fall short : What I can do next time: Actual Event: What I did well: Where I fell short: What caused me to fall short : What I can do next time: Actual Event: What I did well: Where I fell short: What caused me to fall short : What I can do next time: 35 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 201ACCEPTANCE AND COMMITTED TRADING in g w h at you d i d we ll , w h ere you f e ll s h ort, an d ma k in g corrective a d justments. It is important to i d enti f y w h ere you per f orme d competent l y , not just w h ere you f e ll s h ort. Notin g w h at we d i d we ll h i ghl i gh ts parts o f t h e process wit h w h ic h you are at l east per f ormin g satis f actori l y an d wit h w h ic h you can re l y on. As you pro g ress, you will fi nd that the thin g s you are doin g well g row or expand. This is an indication that you are improvin g and movin g toward your g oal. W h ere you f e ll s h ort are actions in your p l an f rom Exercise 8.4 t h at you d i d n ’t d o or you did ine ff ectively . In the example provided in this Exercise 8.5, the trader was working on overcomin g loss aversion and cuttin g trades short. He noted that he fell short by mov - ing h is stop too quic kl y , causing a goo d tra d e to b e stoppe d out premature l y. T h e next question as k e d in t h is monitoring f orm is a critica l one: W h at cause d me to f a ll s h ort? It is h ere t h at you wi ll norma ll y fi n d t h at you were eit h er f use d to uncom - fortable thou g hts and feelin g s or your intuitive mind jumped into your tradin g and g ave poor a d vice. In t h e examp l e, t h e tra d er was f use d wit h t h e notion o f starting t h e wee k with profi t. This, of course, had nothing to do with what was best for the trade at hand. Finally , you can determine if an adjustment to your plan is needed by addressin g what can be done next time to address the shortcoming. Think carefully about wha t would be helpful and be sure to apply what you have learned from this book. Overcomin g diffi cult tradin g challen g es takes time and eff ort. Developin g a plan that incorporates our values along with mindfulness, defusion, and other techniques is an e ff ective way to achieve our tradin g g oals. Monitorin g your pro g ress helps ensure your eff orts at transformin g your challen g es are well‐directed at the specifi c actions you take. W e expand on all of this in Part III. ■ Notes 1. Fear o f pu bl ic spea k ing is very common in t h e U.S. popu l ation. In f act, it is reporte d as t h e mos t c ommon socia l f ear over t h e l i f etime, accor d ing to nationa l survey researc h con d ucte d b y Uni- versity o f Pennsy l vania psyc h o l ogist Aye l et Meron Ruscio an d h er co ll eagues. 2 . P u bl ic spea k ing anxiety is a f orm o f socia l p h o b ia (o f ten re f erre d to as socia l anxiety d isor d er). Individuals affl icted by social phobia would be fearful of most social situations that involve people t h ey are un f ami l iar wit h an d can experience acute anxiety w h en in t h e company o f ot h ers. Peop l e who experience public speaking anxiety would generally not be fearful in other social situations (e.g., going to a party , playing a team sport, meeting a friend for dinner, attending a lecture or a c oncert, and other common activities that involve other people) but would experience clinicall y si g nifi cant anxiety when speakin g in front of others. The majority of persons with social anxiety disorder would also be fearful of public speakin g . 3 . K e l l y G. Wilson and Am y R. Murrell, “Values W ork in Acceptance and Commitment Therap y : Settin g a Course for Behavioral Treatment.” In Mindfulness and Acceptance: Expanding the Behavioral Tradition, ed. Steven C. Ha y es et al. (New Y ork: Guilford Press, 2004), 139. 4. Georg H. Eifert and John P . Forsyth, Acceptance and Commitment Therap y for Anxiet y Disorders: A Practioner’s Guide to Using Mindfulness, Acceptance and V alues‐Based Behavior Change Strategies ( Oakland, CA: New Harbin g er, 2005), 161–166. PART III Maximizing Y our Trading Performance 36 This PDF file is part of the audiobook TRADE MINDFULLY and",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology"
  ],
  "created_at": "2026-02-05T00:37:45.721073"
}