{
  "id": "84d84cb8954e",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 79,
  "content": "‘seunjny Aew b-6 e1nbi4 Risk Considerations 175 Figure 9-2 Delta Position Theoretical Edge Spread 1: Short 10 May 50 calls @ 1.07 ~10x +44 10x +.15 Short 8 May 50 puts @ 1.59 -8 x -55 8x+.17 0 42.86 Spread 2: Long 10 May §1 calls @ .77 +10x +44 10x 4.18 Short 15 May 52 calls @ .53 -15x +21 15x .20 -§ +1.00 Spread 3: Long 10 May 49 puts @ 1.05 +10 x—42 10x-14 Short 20 May 50 puts @ 1.59 -20 x -65 20 x +.17 Long 10 May 51 puts @ 2.22 +10 x-68 10 x-.16 0 +.40 increase the theoretical edge fivefold to 5.00, and ostensibly makes spread 2 a better strategy than spreads 1 and 3. Clearly, theoretical edge can’t be the only consideration. Theoretical edge is only an indication of what we expect to earn if we are right about market conditions. Since there is no guarantee that we will be right, we must give at least as much consideration to the question of risk. If we are wrong about market conditions, how badly might we be hurt? In order to focus on the risk considerations, let’s change the size of spreads 2 and 3 so that their theoretical edge is approximately equal to that of spread 1. We can achieve this by tripling the size of spread 2 to 30 x 45, and increasing the size of spread 3 sevenfold to 70 x 140 x 70. The spreads in their new sizes with their total theoretical edge and risk sensitivities are shown in Figure 9-3. With all three spreads having approximately the same theoretical edge, we can now focus on the risks associated with each spread. As with all volatility spreads, one of the risk considerations is the possibility of an incorrect volatility estimate. Since each spread has a negative vega, there will be no problem if volatility turns out to be lower than 15%. In that case, the value of each spread will increase and we will show a greater profit than originally expected. On the other hand, if volatility turns out to be greater than 15%, this could present a problem. What will happen if volatility turns out to be 17%, or 20%, or some higher number? Each spread will be hurt due to the negative vega, but each spread may not be hurt to the same degree. One way to analyze the volatility risk associated with each spread is to use a theoretical pricing model to simulate the value of each spread at increasingly greater volatilities. From these values we can construct graphs reflecting each spread’s theoreti- cal edge versus volatility. Such a graph is shown in Figure 9-4. With our size adjustments each spread now has approximately the same initial theoretical edge, enabling us to focus on the volatility risk associated with each spread. Looking at Figure 9-4 we can see that each spread, 1, 2, and 3, loses its theoretical edge Chapter 9 176 osg- 0Z20'+ o'e6- ) o8'z+ 890 X OZF Z800 — x OZ+ Per x OZt 89- XOL+ 9b XOZ sind g Aew oZ+ 910° X OPI- 8600— x OP I- PEL X ObI- So- Xx OI- ZU+X Ovb sind o¢ AeW OvlL—- S20\" X OL+ 8600'— x OZ+ eel x OL+ Zp- x OL+ PL-XOL sind gy ABW OZ+ :¢ peaids Ser — Seso'+ o'eZ- SI- o0'e+ SSO X Sp— €Z00— SP— 86 X SP bot x Sp— Oot xX Sp seo 2g Aew Sp— 890° x O&+ o600'- x o€+ L'Zb x 0e+ Le+ x Of+ o2’- x oe sire 1g Aew os+ :% peaids 89e' I- pLLV+ a bkbpe- 0 9e'2+ 910 X 8- 8600 x e— PEL XS— og-xe- ZV+X8 sind og Ae; @- 910° X Ol- 6600 x OI- PEL XOl- prt XOl- Si'+ x Ol seo OS ABW O1- 2, peaads UOISOd UOIHSOd UOlYSOd uoTNSOd a6pa eBoa eISUL Bpuwery e790 JBSs10984L €-6 o1nBi4 Risk Considerations 177 as volatility increases. But the slope of spread 1 is most severe. It loses its value very quickly as volatility increases, much more quickly than spreads 2 and 3. For each of our spreads we might logically ask how high volatility can rise before we begin to lose money. That is, we might want to determine the break-even volatility, or implied volatility, for each spread. This is simply an extension of the general definition of implied volatility: the volatility which would have to occur over the life of an option, or options, such that a position would show neither a profit nor a loss. It is common among traders to determine the implied volatility of a spread position, just as they determine the implied volatility of individual options. We can see from Figure 9-3 that the implied (break-even) volatilities of spreads 1,2, and 3 are approximately 17%, 20%, and 22%, respectively. From a volatility perspective, spread 3 shows the best risk/reward characteristics. With each spread we are, in a sense, selling volatility, and we would like to do so at the highest possible price. Would we rather sell something that’s worth 15% (our volatility estimate) at 17% (the implied volatility of spread 1), at 20% (the implied volatility of spread 2), or at 22% (the implied volatility of spread 3)? The higher the implied volatility of the spread, the greater the margin for error in our volatility estimate and, conse- quently, the greater the likelihood of showing a profit. Spread { has only a 2-percent- age-point margin for error, while spread 3 has a margin for error more than three times greater, at 7 percentage points. Spread 2 falls somewhere in between. Why are we so concerned about our volatility estimate being too low? A trader might take the view that he is just as likely to overestimate as underestimate volatility. If this happens, how will it affect the potential outcome of each spread? Suppose we decide to do spread 1 and volatility turns out to be 18%, three percentage points",
  "word_count": 1000,
  "topics": [
    "options",
    "risk_management",
    "market_structure",
    "strategies",
    "crypto"
  ],
  "created_at": "2026-02-05T08:09:54.434535"
}