{
  "id": "98b602832cd5",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 23,
  "content": "cases the same rate is applicable and we need only input one interest rate into the model. If, however, different rates are applicable, such as would be the case with foreign currency options (the foreign currency interest rate plays one role, the domestic currency interest rate plays a different role) the model will require the input of two interest rates. This is the case with the Garman-Kohlhagen version of the Black-Scholes Model. The fact that interest rates play a dual role also means that the relative importance of interest rates will vary, depending on the type of underlying instrument and the settlement procedure. For example, interest rates have a much greater impact on the value of stock options than on futures options. As we raise interest rates, we increase the forward price of stock, but leave the forward price of a futures contract unchanged. At the same time, assuming stock-type settlement, as we raise interest rates we decrease the value of options. The option price, however, is usually very small in relation to the price of the underlying contract. What interest rate should a trader use when evaluating options? Most traders cannot borrow and lend at the same rate, so the correct interest rate will, in theory, depend on whether the trade will create a debit ora credit. In the former case the trader will be interested in the borrowing rate, while in the latter case he will be interested in the lending rate. In practice, however, the most common solution is to use the risk-free interest rate, i.e., the most secure rate. In the United States, the government is usually considered the most secure borrower of funds, so that the yield on a government security with a term equivalent to the life of the option is the general benchmark. Fora 60-day option, use the yield on a 60-day treasury bill; for a 180-day option, use the yield on a 180-day treasury bill. DIVIDENDS We did not list dividends as an input in Figure 3-4 since they are only a factor in the theoretical evaluation of stock options, and then only if the stock is expected to pay a dividend over the life of the option. In order to accurately evaluate a stock option, a trader must know both the amount of the dividend which the stock will pay and the ex-dividend date, the date on which a trader must own the stock in order to receive the dividend. The emphasis here is on ownership of the stock. A deeply in-the-money option may have many of the same characteristics as stock, but only ownership of the stock carries with it the right to collect the dividend. In the absence of other information, most traders tend to assume that a company will continue the same dividend policy it has had in the past. If the company has been paying a 75¢ dividend each quarter, it will probably continue to do so. However, this is not always a certainty. Companies sometimes increase or decrease dividends, and Introduction to Theoretical Pricing Modets 49 occasionally omit them completely. If there is the possibility of a change in a company’s dividend policy, a trader has to consider its impact on option values. Additionally, if the ex-dividend date is expected just prior to expiration, there is the danger that a delay of several days will cause the ex-dividend date to fall after expiration. For purposes of option evaluation, this is the same as eliminating the dividend completely. In such a situation a trader ought to make a special effort to ascertain the exact ex-dividend date. VOLATILITY Of all the inputs required for option evaluation, volatility is the most difficult for traders to understand. At the same time, volatility often plays the most important role in actual trading situations. Changes in our assumptions about volatility can have a dramatic effect on an option’s value, and the manner in which the marketplace assesses volatility can have an equally dramatic effect on an option’s price. For these reasons, we will devote the next chapter to a detailed discussion of volatility. ge 4 & Volatility What is volatility and why is it so important to an option trader? The option trader, like q trader in the underlying instrument, is interested in the direction of the market. But unlike the trader in the underlying, an option trader is also extremely sensitive to the speed of the market. If the market for an underlying contract fails to move at a sufficient speed, options on that contract will have less value because of the reduced likelihood of the market going through an option’s exercise price. In a sense, volatility is a measure of the speed of the market. Markets which move slowly are low-volatility markets; markets which move quickly are high-volatility markets. One might guess intuitively that some markets are more volatile than others. Between 1980 and 1982, the price of gold moved from $300 per ounce to $800 per ounce, more than doubling its price. Yet few traders would predict that the S&P 500 Index might more than double in a similar period. A commodity trader knows that precious metals are generally more volatile than interest rate instruments. In the same way, a stock trader knows that high-technology stocks tend to be more volatile than utility stocks. If we knew whether a market was likely to be relatively volatile, or relatively quiet, and could convey this information to a theoretical pricing model, any evaluation of options on that market would be more accurate than if we simply ignored volatility. Since option models are based on mathematical formulae, we will need some method of quantifying this volatility component so that we can feed it into the model in numerical form. RANDOM WALKS AND NORMAL DISTRIBUTIONS Consider for a moment the pinball maze pictured in Figure 4-1. When a ball is dropped into the maze at the top it moves downward, pulled by gravity, through a series of nails. When the ball encounters each",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.425721"
}