{
  "id": "19b40562392c",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 184,
  "content": "calls (puts) are sold at each of the higher (lower) exercise prices. All options must expire at the same time, be of the same type, and have the same underlying contract. Class—All options of the same type with the same expiration date and same underlying instrument. A Glossary of Option and Related Terminology 421 Clearing House—The organization which guarantees the integrity of all trades made on an exchange. Clearing Member—A member firm of an exchange which is authorized by the clearing house to process trades for its customers, and which guarantees, through the collection of margin and variation monies, the integrity of its customers’ trades. Collar—A contract between a borrower and a lender of floating rate funds, whereby the borrower is assured of paying no more than some maximum interest rate for porrowed funds, and whereby the lender is assured of receiving no less than some minimum interest rate on loaned funds. This is analogous to an option fence where the underlying instrument is an interest rate on borrowed funds. Combination—A two-sided option spread which does not fall into any well defined category of spreads. Most commonly it is used to refer to a long call and short put, or short call and long put, which together make up a synthetic position in the underlying contract. Compound Option—An option to purchase an option. Condor—The sale (purchase) of two options with different exercise prices, together with the purchase (sale) of one option with a lower exercise price and one option with a higher exercise price. All options must be of the same type, have the same underlying contract, and expire at the same time, and there must be an equal increment between exercise prices. Contango—A futures market where the more distant delivery months trade at a premium to the nearterm delivery months. Contingency Order—An order which becomes effective only upon the fulfillment of some predetermined condition(s) in the marketplace. Conversion—A long underlying position together with a short call and long put, where both options have the same exercise price and expire at the same time. Covered Write—The sale of a call (put) option against an existing long (short) position in the underlying contract. Cylinder—A fence or collar. Deferred Start Option—A forward start option. Delta (A)—The sensitivity of an option’s theoretical value to a change in the price of the underlying contract. Delta Neutral—aA position where the sum total of all the positive and negative deltas adds up to approximately zero. 422 Appendix A Diagonal Spread—A long call (put) at one exercise price and expiration date, together with a short call (put) at a different exercise price and expiration date. All options must have the same underlying stock or commodity. This is simply a time spread using different exercise prices. Elasticity-—-The percent change in an option’s value for a given percent change in the value of the underlying instrument. Sometimes referred to as the leverage value. Exchange Option—An option to exchange one asset for another asset. Ex-dividend—The day on which a dividend paying stock is trading without the right to receive the dividend. Exercise—The process by which the holder of an option notifies the seller of his intention to take delivery of the underlying contract, in the case of a call, or to make delivery of the underlying contract, in the case of a put, at the specified exercise price. Exercise Price—The price at which the underlying contract will be delivered in the event an option is exercised. Expiration (Expiry)—The date and time after which an option may no longer be exercised. European Option~—An option which may only be exercised at expiration. Extrinsic Value—Time value. Fair Value—Theoretical value. Fence—A long (short) underlying position, together with a long (short) out-of-the- money put and a short (long) out-of-the-money call. All options must expire at the same time. Fill or Kill (FOK)—An order which will automatically be cancelled unless it can be executed immediately and in its entirety. Flex Option—An exchange-traded option where the buyer and seller are permitted to negotiate the exact terms of the option contract. Typically, this includes the exercise price, the expiration date, and the terms of exercise (either European or American). Floor—A contract between a borrower and a lender of floating rate funds, whereby the lender is assured of receiving no less than some minimum interest rate for loaned funds. This is analogous to a put option where the underlying instrument is an interest rate on loaned funds. Forward Contract——A contract between a buyer and a seller whereby the buyer is obligated to take delivery and the seller is obligated to make delivery of a fixed amount A Glossary of Option and Related Terminology 423 of a commodity at a predetermined price on a specified future date. Payment in full is due at the time of delivery. Forward Price—Taking into consideration all carrying costs on a contract, the price at which a contract would have to be trading on some future date such that a trade made at today’s price would just break even. Forward Start Option—An option whose exercise price will be equal to the price of the underlying instrument on some predetermined date. Front Spread—A ratio vertical spread. Fugit—The expected amount of time remaining to optimum early exercise of an American option. Futures Contract—A contract, usually exchange-traded, between a buyer and a seller whereby the buyer is obligated to take delivery and the seller is obligated to make delivery of a fixed amount of a commodity at a predetermined price on some future date. All profits and losses are realized immediately, and result ina cash credit or debit based on daily changes in the settlement price of the contract. Futures-Type Settlement—A settlement procedure used by commodity exchanges whereby an initial margin deposit is made, but under which no immediate cash payment is made by the buyer to the seller. Cash settlement takes place at the end of each trading day based on the difference between the current day’s settlement price and the previous day’s settlement price or the",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "market_structure",
    "crypto",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.450664"
}