{
  "id": "971f2e0c181f",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 178,
  "content": "evaluating options. Still, a trader who wants to make the best possible decisions cannot afford to ignore the problems associated with a theoretical pricing model. Consequently, a trader who uses a pricing model might look for a way to reduce the potential errors resulting from these weaknesses. Initially, one might simply look for a better theoretical pricing model. If such a model exists, then it will certainly be worth replacing the old model with the new one. But “better” is a relative term. A model might be better in the sense that it gives slightly more accurate theoretical values. But if the model is extremely complex and difficult to use, or if it requires additional inputs of which a trader cannot always be certain, then the model may merely substitute one set of problems for another. Given the fact that most traders are not theoreticians, a more realistic solution might be to use a less complex model and somehow fine-tune it so that it is consistent with the realities of the marketplace. A trader trying to offset weaknesses in a pricing model might make the assumption that the marketplace is using the same model as the trader, and then ask how the marketplace is dealing with the weaknesses in the model. This is somewhat analogous to calculating implied volatility where we assumed that everyone was using the same model, that the price of the option was known, and that everyone agreed on all the inputs except volatility. From these assumptions we were able to determine the Volatility that the marketplace was implying to the underlying contract. Now we want to take the same general approach, but ask what weaknesses the marketplace is implying to the model. This is a more difficult question to answer. Figure 18-7 shows the settlement prices and implied volatilities for December options on German Government Bond (Bund) futures traded on the London Interna- tional Financial Futures and Options Exchange (LIFFE) on July 17, 1992. Since options on LIFFE are settled like futures contracts, the effective interest rate for theoretical calculations is zero. As a result, there is no economic value to early exercise, and one can calculate all implied volatilities using the Black-Scholes model. By most standards German Government Bonds are a very low-volatility contract. Even so, the numbers do reflect many of the characteristics of option markets with which traders have become familiar. Note that the implied volatilities for calls and puts at the same exercise price are always the same. If this were not true, the prices would reflect an arbitrage opportunity. A trader could profitably execute a conversion if the Calls were overpriced with respect to the puts; a trader could profitably execute a reverse conversion if the puts were overpriced with respect to the calls. The fact that call and 406 Chapter 18 Figure 18-7 July 27, 1992; German Government Bond (Bund) Futures December Futures Contract = 87.86; Days to Expiration = 119; Interest Rate = 0% Exercise Cail Call implied Put Put Price Price Volatility Price impiliedVoiatility 84.50 3.40 3.98 04 3.98 85.00 2.92 3.82 .06 3.82 85.50 ; 2.46 3.76 .10 3.76 86.00 2.02 3.68 16 3.68 86.50 1.61 3.62 25 3.62 87.00 1.25 3.62 39 3.62 87.50 93 3.58 57 3.58 88.00 .67 3.58 81 3.58 88.50 46 3.56 110 3.56 89.00 31 3.60 1.45 3.60 89.50 .20 3.62 1.84 3.62 90.00 A3 3.69 2.27 3.69 90.50 .08 3.73 2.72 3.73 91.00 05 3.81 3.19 3.81 91.50 .03 3.87 , 3.67 3.87 put implied volatilities all line up indicates an efficient market with respect to arbitrage relationships. !2 Unfortunately, the implied volatilities at different exercise prices do not line up, and this presents a problem to someone who believes that the Black-Scholes model is one hundred percent efficient. Can those traders trading the 89 call or put really believe that the December futures contract will have a volatility of 3.60, while those trading the 85 call or put believe the December contract will have a volatility of 3.82? If we assume that the exercise price, time to expiration, underlying price, and interest rate are known, the theoretical value of an option in a Black-Scholes world will depend solely on the volatility of the underlying contract over the life of the option. There can be only one volatility over this period. It’s true we won’t know what that volatility is until expiration arrives, at which point we can look back in time to see what the volatility was. But the December Bund future can have only one volatility over its life. Since all the December Bund options have the same underlying contract, it doesn’t make sense for every exercise price to have a different implied volatility. A true adherent of the Black-Scholes model would plug in his best guess about volatility and begin selling those options which appeared to be overpriced and buying those options which appeared to be underpriced. We might think of the marketplace as one big trader. If the activity in the marketplace were a result of everyone believing in the efficiency of the 12. Settiement prices, such as those in Figure 18-7, are intended to reflect an efficient market with respect to arbitrage relationships. During the trading day, because there is a bid/ask spread for each option, and because all trades do not take place simultaneously, markets may appear less efficient. Models and the Real World 407 Black-Scholes model, the selling of overpriced options and the buying of underpriced options would eventually cause the implied volatility of every option to line up exactly. Yet this almost never happens in any market. The marketplace, like every individual trader, is trying to evaluate options as efficiently as possible, given all the information available. Whether one believes that markets are efficient or not, one can certainly argue that the marketplace is at least trying to be efficient. From the wide range of implied volatilities found in almost every option +t think the Rlack-Scholac mdr. ket, we can reasonably infer",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "market_structure",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.449725"
}