{
  "id": "08eb8d76b834",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 21,
  "content": "a pleasant walk than a business meeting. His humility, quietness, and inquisitive nature mask his success. His immediate circle would never guess he is the best-selling author of one of Wall Street’s most-read books. My dad visited my house earlier this week. I recognized him as the same dad I’ve known all my life. A colorful plaid shirt, REI hiking pants, and comfortable Merrell slip-ons. We were walking to the Boca Raton Synagogue to hear Yossi Cohen, the former head of Mossad, give a talk. It was my duty to lend my dad a yarmulke and explain that this congregation was Orthodox. While my dad could tell you the best places to purchase a bagel, he would have difficulty finding a yarmulke if you gave him an entire afternoon. After a nice and short walk to the synagogue, my dad shared something that had recently interested him. In particular, he had just watched a Netflix documentary about chimpanzees that he found enthralling. I tell this story because Yossi answered many questions during the talk with responses that were long and complicated and addressed multiple high- 67 stakes variables, but one question he answered with a single word. The host asked Yossi, when he was recruited into Mossad at the very young age of 22, did he ever think in his wildest dreams that someday he would run Mossad. His single word response was, “Yes.” As I reflect, I believe this was my dad’s level of conviction when writing Market Wizards. No arrogance was present—just a simple gut feeling that it is absolutely something he should, can, and must do. I think most of us feel a sense of imposter syndrome or false bravado as we face new challenges, but a select few, such as Yossi and my dad, choose their destiny and then follow it. I will close with one more story, since it is the #1 question I get from my dad’s readers: Have you ever met any of the Wizards? Interestingly, I am the only child out of three who can answer yes, and it is probably the most interesting story of my life. During my senior year of high school, I knocked on my dad’s office door. This was rare, because my dad was always head down, working, and we were careful not to disturb him. He worked in our house on Martha’s Vineyard, on the very bottom floor. We were one of the few families who lived on the island year-round. Having a place of natural beauty near his work allowed my dad to combine his two passions – work and exercising. I explained that I was just thinking, “I am about to head to college, and we have never really taken a trip together before. Would you like to join me?” “Yes, of course,” was his answer. Several weeks later, he told me he had a standing invitation from one of the people he interviewed, John Bender, who had retired from trading and had purchased 5000 acres of Costa Rican rainforest to conserve. Our flight landed in San Jose, Costa Rica. It was late at night, and we were eating dinner. It was my first time having hearts of palm, and it was one of those dishes that was so good you wish you could have just one more bite. We drove into the rainforest the next day. For over four hours, the drive was almost entirely on dirt roads. The road was only wide enough for one car, and there were no guardrails. There were no other vehicles along 68 the way, perhaps because your chances of reaching your destination were limited. In addition to being worn, the roads were extremely bumpy. From my passenger side window, I could only see a steep drop of a thousand feet or more, but I couldn’t see any of the road because it was so narrow. Two men armed with automatic rifles ushered our car into a gate at the end of our drive to nowhere. After that, we reached a clearing. This property is unlike anything you have ever seen; it is literally out of a fairy tale, and it is essentially beyond description. There were two small single-floor homes, and then perched at the very peak was a massive cement, open-walled, multi-level home. It looked more like the Guggenheim Museum than a residence. During the construction of the main home, John and his wife Ann were residing in one of the temporary small homes. We were graciously welcomed by John with an ear-to-ear smile. He was a big man, wearing a partially open button down that was dripping with sweat. He had on green cargo pants, big brown boots, and a long machete to complete the ensemble. I am not sure what I was expecting on this trip, or from meeting my first Wizard, but this certainly was not it. At the same time, I was surrounded by such a magical environment that the whole thing felt like a dream. We put our stuff down and went on a hike with John. Looking back, I’m not sure what any of us were thinking. As we marched confidently into the preserved and untouched Costa Rican rainforest, we were over four hours away from any possible help. The two of us enthusiastically followed John as if he were an expert in the wilderness and not a brilliant biophysicist and options trader. Since there was no trail, we just walked forward eagerly, equal parts explorers and prey. John was excited to have our company and to share his passion for his nature preserve with us. He was so proud of how he had invested his earnings in caring for these 5000 acres. Double-backing the way we came had worked. We were rewarded when John took us to the main house, which at the time was still in the final stages of construction. There were several identical enormous circular granite floors, each with wraparound decks. There were no walls",
  "word_count": 1000,
  "topics": [
    "options",
    "fundamentals"
  ],
  "created_at": "2026-02-05T00:37:44.181321"
}