{
  "id": "9be8eb9e643d",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 24,
  "content": "not graduate school. What did you do? National Guard and reserve units were not being sent overseas at that time. My plan was to immediately enlist in one of those. I started calling various units in Brooklyn, looking for one that had openings. The one I found was a national guard unit in Bedford–Stuyvesant. The next morning, I enlisted and was sworn in. Five months later, in May 1970, I was sent to Fort Polk, Louisiana for basic and advanced training. It was the most miserable weather I had ever experienced. It was over 90 degrees and humid when I arrived, and it only got worse from there. When we went on long marches with full packs, and they halted the unit, you could see the uniforms in front of you turn from light green to dark green from perspiration. It was May of your senior year. Didn’t your army training conflict with your starting graduate school? It did. That’s why I said before that I was almost prevented from attending graduate school. My scheduled army training extended well beyond the start date for graduate school. I communicated with Brown about my situation, trying to get some special exemption to allow me to start midterm, but that was impossible. If I couldn’t be there for the start of the school year, I would miss that year. I also believe I would have lost my scholarship and possibly any guarantee of being accepted for the following year. What did you do? 74 There was a national guard Inspector General on the base. I went to see him to explain my predicament and plead to get a dispensation for early release so that I could make the start date for graduate school. I figured it was a long shot, but I had no other option and nothing to lose. Amazingly, he agreed and gave me the official papers I needed for an early release from active duty. And this event led to one of those memories that absolutely stays with you forever. After I met with the Inspector General, I hitched a ride in a jeep back to my unit. They had the radio playing, and one of the songs that came on was Bob Dylan’s, “I Shall be Released.” It was exhilarating. Every time I hear that song, I think of that experience. Did you have a particular career in mind when you went to Brown? I intended to go for a Ph.D. initially, which would have allowed for the possibility of being a professor, but I didn’t have any specific job in mind. I did have an area of particular interest, though. In my senior year at Brooklyn College, I took a course in econometrics. As a project for the course, I built a simple econometric model of the U.S. economy. I liked the challenge of creating a model that tried to predict key variables in the U.S. economy and the anticipation of waiting for the computer results to see how well the model forecasts performed. Back then, you had to type your program on IBM punch cards and then submit the program—a stack of cards—to the computer department to be run overnight on the school’s IBM 360—a huge mainframe computer that was the size of a small room. If there was any error, like one missing comma, the program wouldn’t run, and you would have to find the error and resubmit the program. It took many tries before a program ran successfully, but it was a great feeling when it did. So, by the time I graduated college, I wanted to focus on macroeconomics and econometrics. I had taken very few macroeconomic courses in college, and I thought I could get a broad grounding in macroeconomics in graduate school. My macroeconomics professor at Brown was this genius who had earned an undergraduate degree in physics and then decided to switch to economics and earned a Ph.D. in economics. He went on to become a famous economist. In the yearlong course at Brown, he basically taught his Ph.D. thesis. So, instead of getting this broad background in macroeconomics, I got this intense, in-depth focus on one small area. If I 75 already had a sound grounding in macroeconomics, perhaps I could have appreciated what he was teaching, but as it was, it was disappointing. The year I was admitted to Brown, the incoming graduate class in economics was larger than normal. Schools calculate the number of acceptances they issue based on an estimate of the percentage of those students that will decline and go elsewhere. Apparently, the year I entered Brown, the number of students that accepted their invitation was higher than anticipated. There were rumors that scholarships would be cut at the end of the year. Those rumors ended up being true. The number of scholarships was cut sharply, and my grades were not good enough to retain mine. I could have continued without a scholarship, but I decided to stop at the M.A. level, get a job, and presumably return to school to get a Ph.D. after several years of work. As it turned out, I fell into a successful career and never pursued any further education. What happened after you graduated with an M.A. from Brown? I sent my resume to several employment agencies and waited for interview calls. Almost nothing happened. The only job interview I recall getting was for a labor economist position at a shockingly low salary. So, I placed a short position-wanted ad in the New York Times, which read: M.A. Economics, Brown University, seeking analytical position. I got about 15 responses to that ad, but only one turned out to be a legitimate job interview. What were the others? Well, I followed up on one. The caller said he saw my ad and thought I might be a good fit for their company. “What exactly is the position?” I asked. He gave me some vague response. “Is this a sales position?” I",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.181778"
}