{
  "id": "cf847dfdc0c3",
  "source": "Option_Volatility_And_Pricing_Natenberg.pdf",
  "source_type": "pdf",
  "title": "Option Volatility And Pricing Natenberg",
  "chunk_index": 99,
  "content": "He might, for example, buy gold in New York for $389 per ounce, and sell it in London for $392 per ounce. The profit margin of $3, while small, is secure since the risk of a trade in one market is almost immediately offset by an identical but opposing trade in another market. Unlike a speculator, who usually hopes to make a large profit on a small number of trades, an arbitrageur hopes to make a small profit on a large number of trades. An arbitrageur is willing to do much greater size than the speculator because the risk is much smaller. Like traditional arbitrages, conversions and reversals involve buying and selling the same thing in different markets. A conversion involves buying the underlying instru- Option Arbitrage 219 Figure 11-3 3 4 SN short an underlying we . contract at 102.00 ao ON a 174 combined position . _ (reversal) NL a § ~- ean _ BQ nn — ae ~ SS S ~ a SS ™N NN -14 NS - N “ ae long a 100 call at 4.90 N “ short a 100 put at 3.05 ‘ \\ 4 a synthetic lon 2 ue (sy 9) NN » ~~ -3 T T T T T 99 100 101 102 103 104 105 Underlying Price ment, whether a stock or commodity, in the underlying market, and selling the underlying instrument, synthetically, in the option market. A reversal involves selling the underlying instrument in the underlying market, and buying the underlying instru- ment, synthetically, in the option market. The profitability of these strategies is deter- mined by the relationship between the synthetic price and the actual underlying price. Synthetic positions are often used to execute conversions and reversals, so traders sometimes refer to the synthetic market (the difference between the call price and put price) as the conversion/reversal market. All experienced traders are familiar with the price relationship between a synthetic position and its underlying contract, so that any imbalance in the conversion/reversal market is likely to be short-lived. If the synthetic is overpriced, all traders will want to execute a conversion (buy the underlying, sell the call, buy the put). If the synthetic is underpriced, all traders will want to execute a reversal (sell the underlying, buy the call, sell the put). Such activity, where everyone is attempting to do the same thing, will quickly force the synthetic market back to equilibrium. Indeed, imbalances in the conversion/reversal market are usually small and rarely last for more than a few seconds. When imbalances do exist, an option trader is usually willing to execute conversions and reversals in very large size because of the low risk associated with such Strategies. 220 Chapter 11 We initially broke down a synthetic position into its component cash flows, enabling us to identify the basic relationship between a synthetic and its underlying instrument: call price — put price = underlying price — exercise price However, when and how the component cash flows occur can alter this relationship. Since there can be different settlement procedures associated with different underlying instruments as well as with options, in order to calculate the exact value of a synthetic position we need to consider how these settlement procedures affect the basic synthetic relationship. Futures Option Markets If the cash flow resulting from an option trade and a trade in the underlying instrument is identical, the synthetic relationship is simply: call price — put price = underlying price — exercise price This will be true if interest rates are zero, or in futures markets where both the underlying contract and options on that contract are subject to futures-type settlement. In the latter case there is no interest component because no cash changes hands when either the futures contract or the options on that contract are traded. This is currently the procedure on many non-U.S. exchanges. In futures markets, where options are subject to stock-type (cash) settlement, while no cash will change hands when the futures contract is traded, there will be an exchange of cash when options are traded. The interest considerations on the credit or debit will therefore have to be taken into consideration when calculating the value of a synthetic position. Using our earlier example, with the June futures contract at 102.00, the June 100 call at 5.00, and the June 100 put at 3.00, we have: call price — put price = underlying price — exercise price 5.00 - 3.00 = 102.00 - 100.00 2.00 = 2.00 At these prices there does not appear to be any profit opportunity from either a conversion or reversal. If we do either of these strategies, the credit and debits from the two sides of the equation exactly offset each other. Suppose, however, that we decide to do a reversal by selling the underlying futures contract for two points (underlying price minus exercise price) and buying the synthetic for two points (call price minus put price). Suppose also that the options are subject to stock-type (cash) settlement, as is generally true in U.S. futures markets. We will lay out 2.00 on the option trades, and we will not get this money back until expiration when we will buy the underlying futures contract, which we originally sold at 102, for 100. If interest rates are currently 8% per annum, and there are three months remaining to expiration, there will be a 2% carrying cost on the two-point debit resulting from the option trades. Based on the simple synthetic relationship, we expected to break even on Option Arbitrage 221 the conversion. In fact we will end up losing 2% x 2.00, or .04, because of the cost of carrying the debit to expiration. If we really want to break even, we will have to find some way to offset this interest cost of .04. We might, for example, purchase the call for .04 less (4.96), or sell the put for .04 more (3.04), or sell the futures contract for .04 more {102.04}. Or we",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "risk_management",
    "fundamentals",
    "macro"
  ],
  "created_at": "2026-02-05T08:09:54.437501"
}