{
  "id": "12b46ccb2c4b",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 23,
  "content": "capture the latest data and generate wave after wave of orders. In this case, one must build a fully automated trading system. But there is one reason why you may want a semi-automated instead of a fully automated system: the ability to sanity-check your orders before they went on their merry way to the broker. (Just do a search for Knight Capital Group, now part of the HFT firm Virtu Financial, about their $440 million software error on August 1, 2012.) Building a Fully Automated Trading System A fully automated trading system (see Figure 5.2) can run the trading algorithm in a loop again and again, constantly scanning the latest prices and generating new waves of orders throughout the trading day. The submission of orders through an API to your brokerage Real-time data feed Your proprietary desktop C++ program Desktop API from your brokerage Your brokerage account FIGURE 5.2 Fully automated trading system. Chan800064_c05.indd 98Chan800064_c05.indd 98 20-05-2021 21:00:3520-05-2021 21:00:35 47 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Execution Systems 107 about, but are no less disruptive to the profitability of your strategy’s performance. I will discuss how one might come up with a model that detects regime shifts automatically as one of the special topics of Chapter 7. SUMMARY An automated trading system is a piece of software that automati- cally generates and transmits orders to your brokerage account based on your trading strategy. There are three advantages to hav- ing this software: • It ensures the faithful adherence to your backtested strategy. • It eliminates manual operation so that you can simultaneously run multiple strategies. • Most importantly, it allows speedy transmissions of orders, which is essential to high-frequency trading strategies. Regarding the difference between a semiautomated trading sys- tem and a fully automated trading system: • In a semiautomated trading system, the trader still needs to manually upload a text file containing order details to a basket trader or spread trader, and manually press a button to transmit the orders at the appropriate time. However, the order text file can be automatically generated by a program such as MATLAB, Python, or R. • In a fully automated trading system, the program will be able to automatically upload data and transmit orders throughout the trading day or even over many days. After the creation of an ATS, you can then focus on the various issues that are important in execution: minimizing transaction costs Chan800064_c05.indd 107Chan800064_c05.indd 107 20-05-2021 21:00:3620-05-2021 21:00:36 48 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 108 QUANTITATIVE TRADING and paper trading. Minimizing transaction costs is mainly a matter of not allowing your order size to be too big relative to its average trading volume and relative to its market capitalization. Paper trad- ing allows you to: • Discover software bugs in your trading strategy and execu- tion programs. • Discover look-ahead or even data-snooping bias. • Discover operating difficulties and plan for operating schedules. • Estimate transaction costs more realistically. • Gain important intuition about P&L volatility, capital usage, portfolio size, and trade frequency. Finally, what do you do in the situation where your live trad- ing underperforms your backtest? You can start by addressing the usual problems: Eliminate bugs in the strategy or execution soft- ware; reduce transaction costs; and simplify the strategy by elimi- nating parameters. But, fundamentally, your strategy still may have suffered from data-snooping bias or regime shift. If you believe (and you can only believe, as you can never prove this) that your poor live-trading performance is due to bad luck and not to data-snooping bias in your backtest nor to a regime shift, how should you proceed when the competing demands of perseverance and capital preservation seem to suggest opposite actions? This critical issue will be addressed in the next chapter, which discusses systematic ways to preserve capital in the face of losses and yet still be in a position to recover once the tide turns. Chan800064_c05.indd 108Chan800064_c05.indd 108 20-05-2021 21:00:3620-05-2021 21:00:36 49 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 109 CHAPTER 6 A ll trading strategies suffer occasional losses, technically known as drawdowns . The drawdowns may last a few min- utes or a few years. To profit from a quantitative trading busi- ness, it is essential to manage your risks in a way that limits your drawdowns to a tolerable level and yet be positioned to use optimal leverage of your equity to achieve maximum possible growth of your wealth. Furthermore, if you have more than one strategy, you will also need to find a way to optimally allocate capital among them so as to maximize overall risk-adjusted return. The optimal allocation of capital and the optimal leverage to use so as to strike the right balance between risk management and maxi- mum growth is the focus of this chapter, and the central tool we use is called the Kelly formula. OPTIMAL CAPITAL ALLOCATION AND LEVERAGE Suppose you plan to trade several strategies, each with their own expected returns and standard deviations. How should you allocate capital among them in an optimal way? Furthermore, what should Money and Risk Management Chan800064_c06.indd 109 6/7/2021 2:06:02 PM 50 This PDF",
  "word_count": 1000,
  "topics": [
    "options",
    "psychology",
    "risk_management",
    "fundamentals",
    "market_structure",
    "strategies",
    "forex"
  ],
  "created_at": "2026-02-05T00:37:43.607425"
}