{
  "id": "26f4c869347e",
  "source": "Updated_Text_For_Market_Wizards.pdf",
  "source_type": "pdf",
  "title": "Updated Text For Market Wizards",
  "chunk_index": 6,
  "content": "would create havoc. Then, the central banks would have to pull back easing and overdo it the other way, which would probably crash the economy or trigger a credit event, forcing a potential policy pivot. My support team and I developed proprietary leading indicators and pricing models for certain asset classes. It’s all coming together now so that I can hold positions for more extended time frames based on the most probable outcome indicated by my models. I use events to get short-term leverage on my positions if those events validate my long- term view. If the event trade runs counter to my longer-term position, I will use the event trade to hedge or overhedge my exposure. Does that imply that you keep your longer-term position even in the face of an adverse event? It would depend on the event catalyst. If I think it was just a short-term catalyst, then I’ll trade the event and keep the longer-term trade on. But if the catalyst was a fundamental shift, then I’d liquidate, and possibly even reverse, the position. Was there a specific trade opportunity that enticed you back into the market when you were taking a break following the birth of your son? It was a simple information arbitrage trade in June 2020. Covid news was moving the markets then, so you could trade headlines. Florida reported their Covid cases daily, and their announcements were moving the market. We figured out that you could get that information before it was reported by the newswire services by retrieving data directly from the Florida website. It was market-moving information in the public domain, and I got it two or three minutes before Bloomberg reported it. That information edge allowed me to put on a leveraged position and sit with it for a few minutes until it hit the screens. That type of opportunity doesn’t happen very often. But, because the whole situation was new, you could do this type of trade then. What would be an example of another similar trade? 25 Ray had set up screen scrapes and alerts on the SEC website because there were rumors that Elon Musk would buy Bitcoin with Tesla money. One day, when I was out of the office, I got a call from Ray. He said, “Tesla bought Bitcoin. It’s in their filing, and it’s not on the wires yet.” Although I already had a long-term Bitcoin position based on my macro analysis, I could have greatly increased my leverage on Bitcoin on this news, but I didn’t place the trade because I was not at my desk. Why couldn’t you place the trade on your cell phone? I need to be at my desk to trade. I’m not comfortable placing trades on the phone. The news hit the market only a few minutes later, and Bitcoin repriced miles higher within a few minutes. How long did it take to get back to your desk? About 40 minutes. By then, the primary opportunity was gone. It could have been a big trade. I reconsidered the situation. I felt like the market still had further to go but in a move that would play out over days, not minutes. We had done a lot of work on all markets on price distributions after events. So, I had some idea of what type of price response to expect from different event triggers. It was a time of peak FOMO bullishness in the crypto markets because of all the unprecedented monetary easing. The news that Tesla bought Bitcoin seemed like an event that would set the trend for a while. So, I put on the trade in smaller size and made 10%–15% over the next week. Is there any trade that is particularly noteworthy since our original interview? One trade that comes to mind was a short in the BTP [the Italian government bond futures contract]. BTP yields had moved up above 4% for the first time since 2014. The ECB announced an emergency meeting, which doesn’t happen very often. The market was expecting the ECB would take actions to cap yields, and the BTP quickly shot up from 114 to 117.5. This move up was an easy trade, but I missed it because I was on my way into the office. I thought that unless the ECB announced actual policy measures at the meeting, the move was overdone. When the meeting outcome was reported, it seemed apparent that the ECB hadn’t agreed to any concrete policy 26 action and instead just issued a wishy-washy statement to calm the markets. I immediately went short. The second I did, the market took off again. I asked Ray, “Have I missed something?” Ray had read the transcript and confirmed they hadn’t taken any action. I was heavily short with a position that was a mile offside. But I was still sure I was right on the trade. Because I was in a calm state, I was able to stay rational, and I didn’t get out. Then, at the point of maximum pain, the market cracked and kept moving lower and lower. I had a really good day. But the line between success and failure on that trade was so thin that if I weren’t in a calm state of mind, I definitely would have stopped myself out at the top and had a big down day. This trade was a perfect illustration of the importance of mindset in trading. Event trading is different from other trading strategies; it’s almost like playing a professional sport. You have to be so present in that moment. There is so much information coming at you, so many variables you don’t control, and yet you have to be in this state of equanimity where time slows down. You’re as calm as you can be. If you’re in a fight-or-flight state, you won’t be able to make the best rational decision. How large was your open loss on that trade at its worst point? It",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "fundamentals",
    "crypto",
    "forex",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:44.179170"
}