{
  "id": "f5d227aa85b4",
  "source": "Trade_Mindfully.pdf",
  "source_type": "pdf",
  "title": "Trade Mindfully",
  "chunk_index": 28,
  "content": "emotiona l unease t h at t h ese b ring. I wi ll app l y min df u l ness an d recognize t h a t th ese are on l y t h oug h ts an d f ee l ings t h at wi ll soon l eave me. T a k ing a f ew d eep b reat h s, I wi ll ma k e room f or my unwante d t h oug h ts an d f ee l ings, remin d myse lf t h at stea d iness is more important t h an m a k ing up f or l osses wit h unsoun d tra d es, an d p l ace my attention o n t h e next tra d e, proper l y setting my position size . steady trader and explicitly affi rms that oversizin g his position runs counter to what matters to him in his tradin g . The critical thin g to note is that the form in Exercise 8.4 is encouraging you to develop a process of high-value actions for changing your unconstructive tra d in g b e h avior. Y ou are not just tou gh in g it out. T h at ’s un l i k e l y to work. By taking what you have learned from this book and creating two or three specifi c, constructive steps you can do to counter your tendency to commit erratic tradin g behavior, you are establishin g an explicit and unambi g uous process for your own self‐development as a trader. This is how eff ective chan g e can occur. Part of your plan for chan g e is to know what will pose the g reatest di ffi culty for you in carrying out your p l an. For Ammar, it is t h e tension f e l t an d t h e toxic menta l com - mentary he has when he experiences a loss. Here, mindfulness can play a hu g e role by helpin g you see that uncomfortable feelin g s and critical thou g hts are merely feel - ings an d t h oug h ts, not h ing more. T h ey d on ’t h ave to d ictate w h at you d o, an d t h ey wi ll quickly pass only to be replaced by more thou g hts and feelin g s. Ammar has an “in‐fl i g ht ” routine of takin g a few deep breaths, rememberin g to not fi g ht but defuse and accept his thou g hts and feelin g s as they are (not what they tell him they are), and makin g the e ff or t - ~---------- 33 This PDF file is part of the audiobook TRADE MINDFULLY and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Gary Dayton, 2015. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 198T RADE MINDFULLY TABLE 8.3 Priyanka’s Challenging Trading Situation What I stand for in my trading: P ersistence an d giving maximum e ff ort My challenging situation: C uttin g winnin g tra d ers s h or t My Goals: My initial goal: T o re d uce t h is unconstructive b e h avior b y h o ld ing onto tra d es f or at l east two a dd itiona l points a b ove my avera g e on at l east 60 percent o f m y trades over the next two months of tradin g My longer‐term goal: El iminate cutting winners s h ort comp l ete l y wit h in f ive mont h s an d gra d ua ll y increase my winning points per tra d e average Plan for my initial goal: P ractice min df u l ness prior to tra d ing. State my intention, mission, a n d commitment f or to d ay are to h o ld my tra d es f or at l east two add itiona l points. A f ter entering a tra d e, set my stop. Move it up t o b rea k even w h en appropriate. Exit on l y a f ter I h ave ac h ieve d two points a b ove my average or t h e tra d e gets stoppe d out. What will present the greatest challenge for me: M y f ears t h at I wi ll give b ac k pro f it earne d or su ff er a l oss. T ension in m y stomac h , strong emotion, an d negative t h oug h ts . How I will meet that challenge: I wi ll d o my b est to b e min df u l an d not f ee d t h e tiger. T h is wi ll b e h ar d , b ut not f ee d ing t h e tiger means I am b eing persistent an d a pplying maximum effort, and I will feel good about this. I will r emind myself that the stress I feel is helping me meet the challenge o f interacting with the market and even though it feels bad, it’s w orse when the market continues to go in my direction and I’ve cut t he trade. I will strive to see my thoughts and feelings as temporary a nd only an indication of my fears, not what is actually happening in t he market. I will also strive to p ut more attention on the market and m y trade and less",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "psychology",
    "risk_management",
    "strategies"
  ],
  "created_at": "2026-02-05T00:37:45.720787"
}