{
  "id": "4849cc4019e3",
  "source": "Quantitative_Trading.pdf",
  "source_type": "pdf",
  "title": "Quantitative Trading",
  "chunk_index": 5,
  "content": "Smarter Computer to Pick Stock.” New York Times, November 24. Sharpe, William. 1994. “The Sharpe Ratio.” The Journal of Portfolio Management, Fall. Available at: www.stanford.edu/~wfsharpe/art/ sr/sr.htm. Chan800064_c02.indd 31 6/7/2021 7:17:57 AM 5 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. Fishing for Ideas 31 • How much capital do you have? • Is your goal to earn steady monthly income or to strive for a large, long-term capital gain? Even before doing an in-depth backtest of the strategy, you can quickly filter out some unsuitable strategies if they fail one or more of these tests: • Does it outperform a benchmark? • Does it have a high enough Sharpe ratio? • Does it have a small enough drawdown and short enough draw- down duration? • Does the backtest suffer from survivorship bias? • Does the strategy lose steam in recent years compared to its ear- lier years? • Does the strategy have its own “niche” that protects it from intense competition from large institutional money managers? After making all these quick judgments, you are now ready to proceed to the next chapter, which is to rigorously backtest the strategy yourself to make sure that it does what it is advertised to do. REFERENCES Duhigg, Charles. 2006. “Street Scene; A Smarter Computer to Pick Stock.” New York Times, November 24. Sharpe, William. 1994. “The Sharpe Ratio.” The Journal of Portfolio Management, Fall. Available at: www.stanford.edu/~wfsharpe/art/ sr/sr.htm. Chan800064_c02.indd 31 6/7/2021 7:17:57 AM 6 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 33 CHAPTER 3 A key difference between a traditional investment manage- ment process and a quantitative investment process is the possibility of backtesting a quantitative investment strategy to see how it would have performed in the past. Even if you found a strategy described in complete detail with all the historical perfor- mance data available, you would still need to backtest it yourself. This exercise serves several purposes. If nothing else, this replica- tion of the research will ensure that you have understood the strat- egy completely and have reproduced it exactly for implementation as a trading system. Just as in any medical or scientific research, replicating others ’ results also ensures that the original research did not commit any of the common errors plaguing this process. But more than just performing due diligence, doing the backtest yourself allows you to experiment with variations of the original strategy, thereby refining and improving the strategy. In this chapter, I will describe the common platforms that can be used for backtesting, various sources of historical data useful for backtesting, a minimal set of standard performance measures that a backtest should provide, common pitfalls to avoid, and simple refinements and improvements to strategies. A few fully developed backtesting examples will also be presented to illustrate the princi- ples and techniques described. Backtesting Chan800064_c03.indd 33 6/7/2021 2:04:48 PM 7 This PDF file is part of the audiobook QUANTITATIVE TRADING and cannot be sold separately. It may not be reproduced, copied, circulated, or posted online. All rights reserved. Copyright © Ernest P . Chan, 2021. Published by Echo Point Books & Media, LLC by arrangement with John Wiley & Sons, Inc. All Rights Reserved. 34 QUANTITATIVE TRADING COMMON BACKTESTING PLATFORMS Numerous commercial platforms are designed for backtesting, some of them costing tens of thousands of dollars. In keeping with the focus on startups in this book, I start with those with which I am familiar and that are free or can be purchased economically and are widely used. Excel This is the most basic and most common tool for traders, whether retail or institutional. You can enhance its power further if you can write Visual Basic macros. The beauty of Excel is “What you see is what you get”—or WYSIWYG (wi-zē-wig) in computing parlance. Data and program are all in one place so that nothing is hidden. Also, a common backtesting pitfall called look-ahead bias, which will be explained later, is unlikely to occur in Excel (unless you use macros, which renders it no longer WYSIWYG) because you can easily align the dates with the various data columns and signals on a spread- sheet. Another advantage of Excel is that backtesting and live trade generation can often be done from the same spreadsheet, eliminat- ing any duplication of programming efforts. The major disadvantage of Excel is that it can be used to backtest only fairly simple mod- els. But, as I explained in the previous chapter, simple models are often the best! MATLAB MATLAB (www.mathworks.com) used to be one of the most common backtesting platforms used by quantitative analysts and traders in large institutions. It has been taken over by Python (which I will describe as follows), but I still find it to be the most productive language for quants (as opposed to professional soft- ware developers). It is easier to use than Python, it is faster, and it has full customer support from the vendor. It is ideal for test- ing strategies that involve a large portfolio of stocks. (Imagine backtesting a strategy involving 1,500 symbols on Excel—it is Chan800064_c03.indd 34 6/7/2021 2:04:48 PM Backtesting 35 possible, but quite painful.) It has numerous advanced statistical and mathematical modules built in, so traders do not have to rein- vent the wheel if their trading algorithms involve some sophis- ticated but common mathematical concepts. (A good example is principal component analysis—often used in factor models in statistical arbitrage trading, and a hassle to implement in",
  "word_count": 1000,
  "topics": [
    "technical_analysis",
    "options",
    "psychology",
    "risk_management",
    "market_structure",
    "strategies",
    "macro"
  ],
  "created_at": "2026-02-05T00:37:43.604049"
}